local 剑会天下 = 多开数据[多开数据.当前].__UI界面.窗口层:创建我的窗口("剑会天下",0,0,630,320)
local 当前 = 多开数据.当前
function 剑会天下:初始化()
    __置窗口坐标(self,'右')
    local nsf = require('SDL.图像')(630,320)
    if nsf:渲染开始() then
        __res:取图像(__res:取地址("shape/ui/jh/", 0x00000002)):显示(0,0)
        字体16:置颜色(__取颜色("白色"))
        字体16:取图像("关闭"):显示(590,5)
        nsf:渲染结束()
    end
    self:置精灵(nsf:到精灵())
end

function 剑会天下:打开(data)
    self:置可见(true)
    self.数据 = data
    self.首页控件:置可见(true)
    self.首页控件:重置()
    self.模式控件:置可见(false)
    self.排行控件:置可见(false)
end


local 首页控件 = 剑会天下:创建控件("首页控件",0,0,630,320)

function 首页控件:重置()
    self:置可见(true)
    剑会天下.图像 = nil
    local nsf = require('SDL.图像')(630,320)
    if nsf:渲染开始() then
        __res:取图像(__res:取地址("shape/ui/jh/", 0x00000002)):显示(0,0)
        字体16:置颜色(__取颜色("白色"))
        字体16:取图像("关闭"):显示(590,5)
        字体16:取图像("主页"):显示(20,5)
        nsf:渲染结束()
    end
    剑会天下.图像 = nsf:到精灵()
end

local 玩法控件 = 剑会天下:创建控件("玩法控件",0,0,630,320)

function 玩法控件:重置()
    剑会天下.图像 = nil
    local nsf = require('SDL.图像')(630,320)
    if nsf:渲染开始() then
        __res:取图像(__res:取地址("shape/ui/jh/", 0x00000001)):显示(0,0)
        字体16:置颜色(__取颜色("白色"))
        字体16:取图像("关闭"):显示(590,5)
        字体16:取图像("主页"):显示(20,5)
        字体16:置颜色(__取颜色("黑色"))
        字体16:取图像("剑会天下匹配模式分为：1V1、3V3、5V5"):显示(45,55)
        字体16:取图像("剑会天下段位积分分为："):显示(45,85)
        字体16:取图像("剑会天下·新秀：1200-1300分"):显示(100,110)
        字体16:取图像("剑会天下·百胜：1300-1400分"):显示(100,135)
        字体16:取图像("剑会天下·千胜：1400-1500分"):显示(100,160)
        字体16:取图像("剑会天下·万军：1500-1900分"):显示(100,185)
        字体16:取图像("剑会天下·神话：1900+"):显示(100,210)
        字体16:取图像("剑会天下每日8点30分开启，10点自动结束"):显示(45,235)
        nsf:渲染结束()
    end
    剑会天下.图像 = nsf:到精灵()
end

local 排行控件 = 剑会天下:创建控件("排行控件",0,0,630,320)

function 排行控件:重置()
    剑会天下.图像 = nil
    local nsf = require('SDL.图像')(630,320)
    if nsf:渲染开始() then
        __res:取图像(__res:取地址("shape/ui/jh/", 0x00000001)):显示(0,0)
        字体16:置颜色(__取颜色("白色"))
        字体16:取图像("关闭"):显示(590,5)
        字体16:取图像("主页"):显示(20,5)
        字体16:置颜色(__取颜色("蓝色"))
        字体16:取图像("名称(id)"):显示(160,50)
        字体16:取图像("等级"):显示(320,50)
        字体16:取图像("门派"):显示(375,50)
        字体16:取图像("积分"):显示(455,50)
        nsf:渲染结束()
    end
    剑会天下.图像 = nsf:到精灵()
    self.排行列表:重置()
end

local 排行列表 = 排行控件:创建列表("排行列表",80,80,440,210)

function 排行列表:初始化()
    self:置文字(字体16)
    self.行高度 = 30
    self.行间距 = 0
end

function 排行列表:重置()
    self:清空()
    for _, v in ipairs(剑会天下.排行数据.剑会) do
        local nsf = require('SDL.图像')(440,30)
        if nsf:渲染开始() then
            -- if _%2 == 1 then
            --     nsf:填充颜色(167,164,199,255)
            -- end
            字体16:置颜色(__取颜色('浅黑'))
			字体16:取图像("第".._.."名"):显示(0,0)
            字体16:取图像(v.名称.."("..v.id..")"):显示(60,0)
            字体16:取图像(v.等级):显示(245,0)
            字体16:取图像(v.门派):显示(295,0)
            字体16:取图像(v.积分):显示(380,0)
            nsf:渲染结束()
        end
        local r = self:添加()
        r:置精灵(nsf:到精灵())
    end
end


local 模式选择 = 首页控件:创建我的按钮(__res:取图像(__res:取地址("shape/ui/jh/", 0x00000004)),"模式选择",35,50)
function 模式选择:左键弹起(x,y,msg)
    剑会天下.模式控件:置可见(true)
    剑会天下.模式控件:重置()
    剑会天下.首页控件:置可见(false)
end

local 排行榜 = 首页控件:创建我的按钮(__res:取图像(__res:取地址("shape/ui/jh/", 0x00000005)),"排行榜",380,48)
function 排行榜:左键弹起(x,y,msg)
    发送数据(当前 or self and self.当前,168)
end

local 玩法介绍 = 首页控件:创建我的按钮(__res:取图像(__res:取地址("shape/ui/jh/", 0x00000008)),"玩法介绍",380,133)
function 玩法介绍:左键弹起(x,y,msg)
    剑会天下.玩法控件:置可见(true)
    剑会天下.玩法控件:重置()
    剑会天下.首页控件:置可见(false)
end

local 模式控件 = 剑会天下:创建控件("模式控件",0,0,630,320)
function 模式控件:初始化()
end

function 模式控件:重置(data)
    剑会天下.图像 = nil
    local nsf = require('SDL.图像')(630,320)
    if nsf:渲染开始() then
        local tx = __res:取图像(__res:取地址("shape/ui/jh/", 0x00000009))
        __res:取图像(__res:取地址("shape/ui/jh/", 0x00000001)):显示(0,0)
        __res:取图像(__res:取地址("shape/ui/jh/", 0x00000010)):显示(35,105)
        tx:显示(40,40)
        for n=1,5 do
            tx:显示(270+(n-1)*65,40)
        end
        字体16:置颜色(__取颜色("白色"))
        字体16:取图像("关闭"):显示(590,5)
        字体16:取图像("主页"):显示(20,5)
        字体16:置颜色(__取颜色("蓝色"))
        字体16:取图像(多开数据[当前 or self and self.当前].角色信息.名称):显示(100,45)
        字体16:取图像("等级:"..多开数据[当前 or self and self.当前].角色信息.等级):显示(100,75)
        字体16:取图像("门派:"..多开数据[当前 or self and self.当前].角色信息.门派):显示(170,75)
        local 升级积分,当前段位,剑会称谓,当前积分 = self:取段位()
        字体16:取图像("当前段位:"..剑会称谓):显示(65,115)
        if 当前积分>=1900 then
            字体16:取图像(当前积分):显示(130,260)
	    else
            字体16:取图像(当前积分.."/"..升级积分):显示(130,260)
	    end
        __res:取图像(__res:取地址("shape/ui/jh/",当前段位)):显示(90,133)
        local lssj = 取头像(多开数据[当前 or self and self.当前].角色信息.模型)
        if lssj[2] == 0 then lssj[2] = lssj[1] end
        __res:取图像(__res:取地址('shape/mx/',lssj[2])):显示(44,44)

        nsf:渲染结束()
    end
    剑会天下.图像 = nsf:到精灵()
    self.队员网格:置头像()
end

function 模式控件:取段位()
    local 当前积分 = 剑会天下.数据.当前积分 or 1200   
    local 升级积分 = 1300
    local 剑会称谓 = "剑会天下·新秀"
    local 当前段位 = 0xFFFFFF11
    if 当前积分<1300 then
        升级积分=1300
        当前段位=0xFFFFFF11
        剑会称谓="剑会天下·新秀"
    elseif 当前积分<1400 then
        升级积分=1400
        当前段位=0xFFFFFF12
        剑会称谓="剑会天下·百胜"
    elseif 当前积分<1500 then
        升级积分=1500
        当前段位=0xFFFFFF13
        剑会称谓="剑会天下·千胜"
    elseif 当前积分<1900 then
        升级积分=1900
        当前段位=0xFFFFFF14
        剑会称谓="剑会天下·万军"
    else
        升级积分=9999
        当前段位=0x00000018
        剑会称谓="剑会天下·神话"
    end
    return 升级积分,当前段位,剑会称谓,当前积分
end

local 单人 = 模式控件:创建我的按钮(__res:取图像(__res:取地址("shape/ui/jh/", 0x00000003)),"单人",260,106)
function 单人:左键弹起(x,y,msg)
    发送数据(当前 or self and self.当前,166,{人数=1,模式="单人匹配"})
    剑会天下:置可见(false)
end

local 三人 = 模式控件:创建我的按钮(__res:取图像(__res:取地址("shape/ui/jh/", 0x00000006)),"三人",370,106)
function 三人:左键弹起(x,y,msg)
    发送数据(当前 or self and self.当前,166,{人数=3,模式="三人匹配"})
    剑会天下:置可见(false)
end

local 五人 = 模式控件:创建我的按钮(__res:取图像(__res:取地址("shape/ui/jh/", 0x00000007)),"五人",480,106)
function 五人:左键弹起(x,y,msg)
    发送数据(当前 or self and self.当前,166,{人数=5,模式="五人匹配"})
    剑会天下:置可见(false)
end

local 关闭 = 剑会天下:创建我的按钮(__res:getPNGCC(1,401,0,46,46),"关闭",580,0)

function 关闭:左键弹起(x,y,msg)
    剑会天下:置可见(false)
end

-- function 剑会天下:左键弹起(x,y,msg)
--     if x > 755 and x < 785 and y > 110 and y < 130 and self.禁止关闭 == nil then
--         self:置可见(false)
--     elseif x > 185 and x < 215 and y > 110 and y < 130 then
--         self.首页控件:置可见(true)
--         self.首页控件:重置()
--         self.模式控件:置可见(false)
--         self.排行控件:置可见(false)
--         self.玩法控件:置可见(false)
--     end
-- end

local 队员网格 = 模式控件:创建网格("队员网格",268,40,300,60)

function 队员网格:初始化()
    self:创建格子(60,60,0,6,1,5)
end





function 队员网格:左键弹起(x, y, a, b, msg)
    if 队员网格.子控件[a] and 队员网格.子控件[a].数据 and 队员网格.子控件[a].数据.id ~= 多开数据[当前 or self and self.当前].角色信息.数字id then
       多开数据[当前 or self and self.当前].__UI弹出.玩家信息弹出:打开(队员网格.子控件[a].数据)
    end
end

function 队员网格:置头像(数据)
    for i = 1,#队员网格.子控件 do
        if 多开数据[当前].__主显.主角.是否组队 and  多开数据[当前].__UI界面.窗口层.队伍列表.队伍数据[i] then
            local nsf = require('SDL.图像')(60,60)
            if nsf:渲染开始() then
                local lssj = 取头像(多开数据[当前].__UI界面.窗口层.队伍列表.队伍数据[i].模型)
                if lssj[2] == 0 then lssj[2] = lssj[1] end
                __res:取图像(__res:取地址('shape/mx/',lssj[2])):显示(5,5)

                nsf:渲染结束()
            end
            队员网格.子控件[i]:置精灵(nsf:到精灵())
            队员网格.子控件[i].数据 = 多开数据[当前].__UI界面.窗口层.队伍列表.队伍数据[i]
        else
            队员网格.子控件[i]:置精灵(nil)
        end
    end
end