local 合成灵犀玉 = 多开数据[多开数据.当前].__UI界面.窗口层:创建我的窗口("合成灵犀玉",0,0,660,560)
local 当前 = 多开数据.当前
local 坐标 = {{190,311},{188,247},{228,195},{284,150},{351,150},{403,193},{447,247},{447,313},{351,405},{284,405}}
local 十二时辰 = {"申","酉","戌","亥","子","丑","寅","卯","辰","巳","午","未"}
local 时辰显示与坐标 = {
		子 = {0xEB658CF1,344,47},丑 = {0xA59A5675,442,102},寅 = {0xF56CEDD2,497,199},卯 = {0x259869FB,494,311},辰 = {0xCF7FE283,445,404},巳 = {0xC0EC5E5F,350,460},
		午 = {0x87B01ACC,238,460},未 = {0xCBB1F1C2,133,403},申 = {0xA72202ED,82,316},酉 = {0x3164459D,79,206},戌 = {0x775AB575,134,104},亥 = {0xAE8DDDA1,233,46},
	}
	--暗
local 时辰显示光效与坐标1 = {
		子 = {0x8A91409E,344,47},丑 = {0x1A041CE2,442,102},寅 = {0x41874650,497,199},卯 = {0x28B8C5F3,494,311},辰 = {0x82107E7B,445,404},巳 = {0x012EC80A,350,460},
		午 = {0x4B8A3264,238,460},未 = {0x5BE3867E,133,403},申 = {0x2AE05825,82,316},酉 = {0xD143DB61,79,206},戌 = {0xF79DF796,134,104},亥 = {0x00DA20F0,233,46},
	}
	--
local 时辰显示光效与坐标2 = {
		子 = {0x1F9A4A9A,344,47},丑 = {0xCC1BEF97,442,102},寅 = {0x2F2889A6,497,199},卯 = {0xE778A2FA,494,311},辰 = {0x19888E8E,445,404},巳 = {0x5CA04E2E,350,460},
		午 = {0x8AB16B84,238,460},未 = {0x90E84362,133,403},申 = {0x83534900,82,316},酉 = {0x97AE47C3,79,206},戌 = {0x3419BF6E,134,104},亥 = {0x26120EBB,233,46},
	}
	--亮
local 物品坐标 = {{177,297},{173,232},{211,176},{269,135},{335,135},{388,180},{431,231},{431,296},{334,391},{270,392}}
function 合成灵犀玉:初始化()
    __置窗口坐标(self)
	local nsf = require('SDL.图像')(660,560)
    if nsf:渲染开始() then
		__res:取图像(__res:取地址("shape/ui/xz/", 0xA00000B1)):拉伸(480,460):显示(88,60)
        -- __res:取图像(__res:取地址("shape/ui/xz/", 0xA00000B2)):显示(175,55)


        __res:取图像(__res:取地址("shape/ui/xz/", 0x4E6476BE)):显示(245,30)  --12

        __res:取图像(__res:取地址("shape/ui/xz/", 0xC4D34CA9)):显示(101,64)  --8
        __res:取图像(__res:取地址("shape/ui/xz/", 0x060482C3)):显示(125,90) --7
        __res:取图像(__res:取地址("shape/ui/xz/", 0x36758F6F)):显示(163,123) --6
        __res:取图像(__res:取地址("shape/ui/xz/", 0x5429517B)):显示(385,343) --10
        __res:取图像(__res:取地址("shape/ui/xz/", 0xF5BCEA0B)):显示(194,343)  --11
        __res:取图像(__res:取地址("shape/ui/xz/", 0x4902C991)):显示(175,150) --21
        __res:取图像(__res:取地址("shape/ui/xz/", 0xDD1D0997)):显示(262,226) --9



        __res:取图像(__res:取地址("shape/ui/xz/", 0x01AC0007)):显示(312,192) --15
        __res:取图像(__res:取地址("shape/ui/xz/", 0x01AC0007)):显示(312,113) --15
        __res:取图像(__res:取地址("shape/ui/xz/", 0x01AC0007)):显示(312,435) --15
        __res:取图像(__res:取地址("shape/ui/xz/", 0x01AC0007)):显示(152,277) --15
        __res:取图像(__res:取地址("shape/ui/xz/", 0x01AC0007)):显示(474,277) --15


        __res:取图像(__res:取地址("shape/ui/xz/", 0x01AC0010)):显示(160,284) --16
        __res:取图像(__res:取地址("shape/ui/xz/", 0x01AC0011)):显示(482,284) --17
        __res:取图像(__res:取地址("shape/ui/xz/", 0x01AC0012)):显示(319,120) --18
        __res:取图像(__res:取地址("shape/ui/xz/", 0x01AC0013)):显示(320,442) --19
        __res:取图像(__res:取地址("shape/ui/xz/", 0x01AC0014)):显示(320,198) --20
        for n=1,12 do
            __res:取图像(__res:取地址("shape/ui/xz/",时辰显示与坐标[十二时辰[n]][1])):显示(时辰显示与坐标[十二时辰[n]][2],时辰显示与坐标[十二时辰[n]][3])
        end
        nsf:渲染结束()
    end
    self:置精灵(nsf:到精灵())
	self.时辰光效组2 = {}    
	for n=1,12 do
		self.时辰光效组2[n] = __res:取图像(__res:取地址("shape/ui/xz/",时辰显示光效与坐标2[十二时辰[n]][1])):到精灵()
	end
    
end

function 合成灵犀玉:显示(x,y)
    for n=1,12 do
        if self.已点亮[n] then
            if n>=9 then
			    n=n+1
			end
            self.时辰光效组2[n]:显示(x+时辰显示光效与坐标2[十二时辰[n]][2],y+时辰显示光效与坐标2[十二时辰[n]][3]) --最亮
		    if self.扣除数量>=10 then
		        self.时辰光效组2[9]:显示(x+时辰显示光效与坐标2[十二时辰[9]][2],y+时辰显示光效与坐标2[十二时辰[9]][3]) --最亮
		        self.时辰光效组2[12]:显示(x+时辰显示光效与坐标2[十二时辰[12]][2],y+时辰显示光效与坐标2[十二时辰[12]][3]) --最亮
		    end
        end
    end
    字体20:显示(x+305,y+275,self.可用数量)
end

function 合成灵犀玉:打开(数据)
    self:置可见(true)
    self.可用数量=数据
    self.扣除数量=0
    self.已点亮 = {}
    self.加入物品组 = {0,0,0,0,0,0,0,0,0,0}
    self.材料网格:置物品()
end

function 合成灵犀玉:合成开始(数据)
    self.可用数量=数据.剩余灵犀玉
    if 数据.是否成功 then
        多开数据[当前 or self and self.当前].__UI弹出.提示框:打开("#G/恭喜你，合成成功了！")
    else
        多开数据[当前 or self and self.当前].__UI弹出.提示框:打开("#R/很遗憾,合成失败了！")
    end
    self.扣除数量=0
    self.已点亮 = {}
    self.加入物品组 = {0,0,0,0,0,0,0,0,0,0}
    self.材料网格:置物品()
end

local 关闭 = 合成灵犀玉:创建我的按钮(__res:取图像(__res:取地址("shape/ui/xz/", 0x20FD5715)),"关闭",510,60)

function 关闭:左键弹起(x,y,msg)
    合成灵犀玉:置可见(false)
end


local 开始 = 合成灵犀玉:创建我的按钮(__res:取图像(__res:取地址("shape/ui/xz/", 0x2E78E809)),"",270,307)
function 开始:左键弹起(x,y,msg)
    if 合成灵犀玉.扣除数量>0 then
        发送数据(当前,3811,{数量=合成灵犀玉.扣除数量})
        合成灵犀玉.扣除数量=0
        合成灵犀玉.加入物品组 = {0,0,0,0,0,0,0,0,0,0}
    else
        多开数据[当前 or self and self.当前].__UI弹出.提示框:打开("#请放入灵犀之屑！")
    end
end


local 材料网格 = 合成灵犀玉:创建网格("材料网格",0,0,660,560)

function 材料网格:初始化()
    self:创建格子(55,55,0,0,1,10)
end

function 材料网格:左键弹起(x, y, a, b, msg)
    if self.子控件[a]._spr == nil or self.子控件[a]._spr.物品 == nil then
        self:置物品({名称="灵犀之屑"},a)
        合成灵犀玉.已点亮[a]=true
        合成灵犀玉.加入物品组[a] = 1
        合成灵犀玉.扣除数量 = 合成灵犀玉.扣除数量 + 1
        合成灵犀玉.可用数量 = 合成灵犀玉.可用数量 - 1
    else
        self:置物品(nil,a)
        合成灵犀玉.扣除数量 = 合成灵犀玉.扣除数量 - 1
        合成灵犀玉.可用数量 = 合成灵犀玉.可用数量 + 1
        合成灵犀玉.已点亮[a]=nil
        合成灵犀玉.加入物品组[a] = 0
    end
end

function 材料网格:置物品(data,bh)
    if bh == nil then
        for i = 1,#self.子控件 do
            local lssj = __灵犀格子.创建(当前)
            lssj:置物品(data) --{名称="灵犀之屑"}
            self.子控件[i]:置精灵(lssj)
            self.子控件[i]:置坐标(坐标[i][1],坐标[i][2])
        end
    else
        local lssj = __灵犀格子.创建(当前)
        lssj:置物品(data) --{名称="灵犀之屑"}
        self.子控件[bh]:置精灵(lssj)
        self.子控件[bh]:置坐标(坐标[bh][1],坐标[bh][2])
    end
end