--[[
    @Author       : GGELUA
    @Date         : 2022-06-15 16:24:52
Last Modified by: GGELUA
Last Modified time: 2023-11-08 14:08:38
--]]
local 好友属性 = 多开数据[多开数据.当前].__UI界面.窗口层:创建我的窗口("好友属性",0,0,512,519)
local 当前 = 多开数据.当前
function 好友属性:初始化()
    __置窗口坐标(self)
    local nsf = require('SDL.图像')(512,519)
    if nsf:渲染开始() then
        置窗口背景("好友属性",0,14,505,506,true):显示(0,0)
        字体18:置颜色(__取颜色('白色'))
        local lssj = 取输入背景(0,0,162,23)
        字体18:取图像('名称'):显示(253,67)
        lssj:显示(325,65)
        字体18:取图像('数字ID'):显示(253,67+38*1)
        lssj:显示(325,65+38*1)
        字体18:取图像('等级'):显示(253,67+38*2)
        lssj:显示(325,65+38*2)
        字体18:取图像('门派'):显示(253,67+38*3)
        lssj:显示(325,65+38*3)
        字体18:取图像('曾用名'):显示(253,67+38*4)
        lssj:显示(325,65+38*4)
        字体18:取图像('帮派'):显示(253,67+38*5)
        lssj:显示(325,65+38*5)
        字体18:取图像('称谓'):显示(253,67+38*6)
        lssj:显示(325,65+38*6)
        字体18:取图像('关系'):显示(253,67+38*7)
        lssj:显示(325,65+38*7)
        字体18:取图像('友好度'):显示(253,67+38*8)
        lssj:显示(325,65+38*8)
        字体18:取图像('好友备注'):显示(22,208)
        __res:getPNGCC(3,736,1155,199,37,true):拉伸(228,36):显示(19,238)
        字体18:取图像('好友评价'):显示(22,287)
        取白色背景(0,0,229,74,true):显示(19,317)
    end
    self:置精灵(nsf:到精灵())
end

function 好友属性:打开(data)
    self:置可见(true)
    self:重置(data)
end

function 好友属性:重置(data)
    local nsf = require('SDL.图像')(512,519)
    if nsf:渲染开始() then
        __res:getPNGCC(3,683,284,73,73,true):拉伸(128,114):显示(36,70)
        local lssj = 取头像(data.模型)
        if lssj[3] == 0 then lssj[3] = lssj[1] end
        __res:取图像(__res:取地址('shape/mx/',lssj[3])):拉伸(123,108):显示(37,71)
        字体18:置颜色(__取颜色('浅黑'))
        字体18:取图像(data.名称):显示(332,67)
        字体18:取图像(data.id):显示(332,67+38*1)
        字体18:取图像(data.等级):显示(332,67+38*2)
        字体18:取图像((data.门派 or '无门派')):显示(332,67+38*3)
        字体18:取图像((data.曾用名 or '无')):显示(332,67+38*4)
        字体18:取图像((data.帮派 or '无帮派')):显示(332,67+38*5)
        字体18:取图像((data.称谓 or '无')):显示(332,67+38*6)
        字体18:取图像(data.关系):显示(332,67+38*7)
        字体18:取图像((data.好友度 or 0)):显示(332,67+38*8)
    end
    self.图像 = nsf:到精灵()
    self.数据 = data
end

local 关闭 = 好友属性:创建我的按钮(__res:getPNGCC(1,401,0,46,46),"关闭",462,0)

function 关闭:左键弹起(x,y,msg)
    好友属性:置可见(false)
end

for i, v in ipairs {
    {name = '断交', x = 20 ,y = 409 , tcp = __res:getPNGCC(3,511,11,117,43,true):拉伸(114,41) , font = '断交'},
    {name = '私聊', x = 195 ,y = 409 , tcp = __res:getPNGCC(3,511,11,117,43,true):拉伸(114,41),  font = '私聊'},
    {name = '组队', x = 367 ,y = 409 , tcp = __res:getPNGCC(3,511,11,117,43,true):拉伸(114,41),  font = '组队'},
    {name = '成就', x = 20 ,y = 460 , tcp = __res:getPNGCC(3,511,11,117,43,true):拉伸(114,41),  font = '成就'},
    {name = '交易', x = 195 ,y = 460 , tcp = __res:getPNGCC(3,511,11,117,43,true):拉伸(114,41),  font = '交易'},
    {name = '给予', x = 367 ,y = 460 , tcp = __res:getPNGCC(3,511,11,117,43,true):拉伸(114,41),  font = '给予'},
    
} do
    local 临时函数 = 好友属性:创建我的按钮(v.tcp,v.name,v.x,v.y,v.font)
    function 临时函数:左键弹起(x, y)
        if v.name == '断交' then

        elseif v.name == '私聊' then

        elseif v.name == '组队' then

        elseif v.name == '成就' then

        end
    end
end