--[[
    @Author       : GGELUA
    @Date         : 2022-06-24 13:53:17
Last Modified by: GGELUA
Last Modified time: 2023-08-06 15:34:37
--]]
local 子女养育 = 多开数据[多开数据.当前].__UI界面.窗口层:创建我的窗口("子女养育",0,0,768,521)

function 子女养育:初始化()
    __置窗口坐标(self)
    local nsf = require('SDL.图像')(768,521)
    if nsf:渲染开始() then
        置窗口背景("子女养育",0,12,701,509,true):显示(60,0)
        取白色背景(0,0,672,449,true):显示(75,52)
        取灰色背景(0,0,360,210,true):置透明(100):显示(366,258)
        取灰色背景(0,0,255,405,true):置透明(100):显示(96,76)
        local lssj = 取输入背景(0,0,70,23)
        字体18:置颜色(__取颜色('浅黑'))
        字体18:取图像('养育金'):显示(366,70)
        lssj:显示(426,68)
        字体18:取图像('疲劳'):显示(506,70)
        lssj:显示(546,68)
        字体18:取图像('叛逆'):显示(626,70)
        lssj:显示(666,68)
        nsf:渲染结束()
    end
    self:置精灵(nsf:到精灵())
end

function 子女养育:打开()
    self:置可见(true)
    self.头像网格:置头像(多开数据[当前 or self and self.当前].角色信息.子女列表)
    self.养育属性:置选中(true)
    self.养育属性:左键弹起()
end

function 子女养育:刷新(lx)
    if not lx then
        lx = self.属性类型
    else
        self.属性类型 = lx
    end
    local lsb = 多开数据[当前 or self and self.当前].角色信息.子女列表[子女养育.选中子女]
    if lx == '养育属性' then
        local nsf = require('SDL.图像')(768,521)
        if nsf:渲染开始() then
            local lssj = 取输入背景(0,0,70,23)
            字体18:置颜色(__取颜色('浅黑'))
            字体18:取图像(lsb.养育.养育金):显示(436,70)
            字体18:取图像(lsb.养育.疲劳):显示(556,70)
            字体18:取图像(lsb.养育.叛逆值):显示(676,70)
            字体18:取图像('名称：'..lsb.名称):显示(390,270)
            字体18:取图像('年龄：'..lsb.年龄..'岁'):显示(390,270+(1*29))
            字体18:取图像('根骨：'..lsb.根骨):显示(390,270+(2*29))
            字体18:取图像('智力：'..lsb.智力):显示(390,270+(3*29))
            字体18:取图像('定力：'..lsb.定力):显示(390,270+(4*29))
            字体18:取图像('结局：'..lsb.结局):显示(390,270+(5*29))
            字体18:取图像('师门：'..lsb.门派):显示(535,270)
            字体18:取图像('念力：'..lsb.念力):显示(535,270+(1*29))
            字体18:取图像('武力：'..lsb.武力):显示(535,270+(2*29))
            字体18:取图像('灵敏：'..lsb.灵敏):显示(535,270+(3*29))
            字体18:取图像('亲密：'..lsb.亲密):显示(535,270+(4*29))
            if lsb.养育.行动信息.时间 then
                字体18:取图像(lsb.养育.行动信息.类型.."中"..os.date("%H:%M:%S",lsb.养育.行动信息.时间)..'完成'):显示(390,270+(7*29))
            end
        end
        self.图像 = nsf:到精灵()
    elseif lx == '战斗属性' then
        local nsf = require('SDL.图像')(768,521)
        if nsf:渲染开始() then
            local lssj = 取输入背景(0,0,70,23)
            字体18:置颜色(__取颜色('浅黑'))
            字体18:取图像(lsb.养育.养育金):显示(436,70)
            字体18:取图像(lsb.养育.疲劳):显示(556,70)
            字体18:取图像(lsb.养育.叛逆值):显示(676,70)
            字体18:取图像('名称：'..lsb.名称):显示(390,270)
            字体18:取图像('等级：'..lsb.等级):显示(390,270+(1*29))
            字体18:取图像('气血：'..lsb.最大气血):显示(390,270+(2*29))
            字体18:取图像('攻击：'..lsb.伤害):显示(390,270+(3*29))
            字体18:取图像('法伤：'..lsb.法伤):显示(390,270+(4*29))
            字体18:取图像('速度：'..lsb.速度):显示(390,270+(5*29))
            字体18:取图像('师门：'..lsb.门派):显示(535,270)
            字体18:取图像('魔法：'..lsb.最大魔法):显示(535,270+(1*29))
            字体18:取图像('防御：'..lsb.防御):显示(535,270+(2*29))
            字体18:取图像('法防：'..lsb.法防):显示(535,270+(3*29))
            if lsb.养育.行动信息.时间 then
                字体18:取图像(lsb.养育.行动信息.类型.."中"..os.date("%H:%M:%S",lsb.养育.行动信息.时间)..'完成'):显示(390,270+(7*29))
            end
        end
        self.图像 = nsf:到精灵()
    end
    self.拜师:置禁止(lsb.门派 ~= "无门派" or lsb.年龄 < 1)
end

local 关闭 = 子女养育:创建我的按钮(__res:getPNGCC(1,401,0,46,46),"关闭",718,0)

function 关闭:左键弹起(x,y,msg)
    子女养育:置可见(false)
end

for i, v in ipairs {
    {name = '工作', x = 366 ,y = 116 , tcp = __res:getPNGCC(3,511,11,117,43,true):拉伸(103,41) , font = '工作'},
    {name = '学习', x = 483 ,y = 116 , tcp = __res:getPNGCC(3,511,11,117,43,true):拉伸(103,41),  font = '学习'},
    {name = '生活', x = 600 ,y = 116 , tcp = __res:getPNGCC(3,511,11,117,43,true):拉伸(103,41),  font = '生活'},
    {name = '拜师', x = 366 ,y = 166 , tcp = __res:getPNGCC(3,511,11,117,43,true):拉伸(103,41),  font = '拜师'},
    {name = '六艺', x = 483 ,y = 166 , tcp = __res:getPNGCC(3,511,11,117,43,true):拉伸(103,41),  font = '六艺'},
} do
    local 临时函数 = 子女养育:创建我的按钮(v.tcp,v.name,v.x,v.y,v.font)
    function 临时函数:左键弹起(x, y)
        if v.name == '工作' or v.name == '学习' or v.name == '生活' then
           多开数据[当前 or self and self.当前].__UI弹出.子女弹出:打开({选中=子女养育.选中子女,项目=v.name})
        elseif v.name == '拜师' and 多开数据[当前 or self and self.当前].角色信息.子女列表[子女养育.选中子女].门派 == "无门派" and 多开数据[当前 or self and self.当前].角色信息.子女列表[子女养育.选中子女].年龄 >= 1 then
            发送数据(当前 or self and self.当前,6703,{选中 = 子女养育.选中子女})
        elseif v.name == '六艺' then
            发送数据(当前 or self and self.当前,6704,{选中 = 子女养育.选中子女})
        end
    end
end

for i, v in ipairs {
    {name = '养育属性', x = 366 ,y = 217 , tcp = __res:getPNGCC(3,1040,201,149,37,true):拉伸(120,41), tcp2 = __res:getPNGCC(3,1039,160,148,36,true):拉伸(120,41) , font = '养育属性'},
    {name = '战斗属性', x = 523 ,y = 217 , tcp = __res:getPNGCC(3,1040,201,149,37,true):拉伸(120,41), tcp2 = __res:getPNGCC(3,1039,160,148,36,true):拉伸(120,41),  font = '战斗属性'},
} do
    local 临时函数 = 子女养育:创建我的单选按钮(v.tcp,v.tcp2,v.name,v.x,v.y,v.font)
    function 临时函数:左键弹起(x, y)
        子女养育:刷新(v.name)
    end
end

local 头像网格 = 子女养育:创建网格("头像网格",0,66,70,150)

function 头像网格:初始化()
    self:创建格子(70,70,10,0,2,1)
end

function 头像网格:左键弹起(x, y, a, b, msg)
    if self.子控件[a] and  self.子控件[a]._spr and self.子控件[a]._spr.数据 then
        if 子女养育.选中子女 then
            self.子控件[子女养育.选中子女]._spr.确定 = nil
        end
        子女养育.选中子女 = a
        self.子控件[a]._spr.确定 = true
        子女养育.养育属性:左键弹起()
    end
end

function 头像网格:置头像(数据)
    for i = 1,#头像网格.子控件 do
        local lssj = __头像格子.创建(当前)
        lssj:置头像(数据[i],"大")
        头像网格.子控件[i]:置精灵(lssj)
    end
    子女养育.选中子女 = 1
    self.子控件[1]._spr.确定 = true

end