--[[
    @Author       : GGELUA
    @Date         : 2022-06-24 13:53:36
Last Modified by: GGELUA
Last Modified time: 2023-05-27 00:19:34
--]]
local 子女查看 = 多开数据[多开数据.当前].__UI界面.窗口层:创建我的窗口("子女查看",0,0,550,424)
local 当前 = 多开数据.当前
function 子女查看:初始化()
    __置窗口坐标(self)
    local nsf = require('SDL.图像')(550,424)
    if nsf:渲染开始() then
        置窗口背景("我的孩子",0,12,540,412,true):显示(0,0)
        取白色背景(0,0,270,159,true):显示(17,56)
        local lssj = 取输入背景(0,0,78,23)
        字体18:置颜色(__取颜色('白色'))
        字体18:取图像('气血'):显示(20,225)
        lssj:显示(66,223)
        字体18:取图像('魔法'):显示(20,225+27*1)
        lssj:显示(66,223+27*1)
        字体18:取图像('攻击'):显示(20,225+27*2)
        lssj:显示(66,223+27*2)
        字体18:取图像('防御'):显示(20,225+27*3)
        lssj:显示(66,223+27*3)
        字体18:取图像('速度'):显示(20,225+27*4)
        lssj:显示(66,223+27*4)
        字体18:取图像('法伤'):显示(20,225+27*5)
        lssj:显示(66,223+27*5)
        字体18:取图像('法防'):显示(20,225+27*6)
        lssj:显示(66,223+27*6)
        字体18:取图像('根骨'):显示(163,225)
        lssj:显示(208,223)
        字体18:取图像('智力'):显示(163,225+27*1)
        lssj:显示(208,223+27*1)
        字体18:取图像('武力'):显示(163,225+27*2)
        lssj:显示(208,223+27*2)
        字体18:取图像('定力'):显示(163,225+27*3)
        lssj:显示(208,223+27*3)
        字体18:取图像('念力'):显示(163,225+27*4)
        lssj:显示(208,223+27*4)
        字体18:取图像('灵敏'):显示(163,225+27*5)
        lssj:显示(208,223+27*5)
        字体18:取图像('亲密'):显示(163,225+27*6)
        lssj:显示(208,223+27*6)
        lssj = 取输入背景(0,0,130,23)
        字体18:取图像('名称'):显示(301,64)
        lssj:显示(350,62)
        字体18:取图像('等级'):显示(301,64+27*1)
        lssj:显示(350,62+27*1)
        字体18:取图像('悟性'):显示(301,64+27*2)
        lssj:显示(350,62+27*2)
        字体18:取图像('门派'):显示(301,64+27*3)
        lssj:显示(350,62+27*3)
        字体18:取图像('五行'):显示(301,64+27*4)
        lssj:显示(350,62+27*4)
        字体16:取描边图像('结局：', 157, 160, 169):显示(301,199)
    end
    self:置精灵(nsf:到精灵())
    self.模型格子 = __UI模型格子.创建(当前)
end

function 子女查看:打开(data)
    self:置可见(true)
    self:刷新(data)
end

function 子女查看:刷新(data)
    local nsf = require('SDL.图像')(550,424)
    if nsf:渲染开始() then
        字体18:置颜色(__取颜色('黑色'))
        字体18:取图像(data.气血):显示(75,225)
        字体18:取图像(data.魔法):显示(75,225+27*1)
        字体18:取图像(data.伤害):显示(75,225+27*2)
        字体18:取图像(data.防御):显示(75,225+27*3)
        字体18:取图像(data.速度):显示(75,225+27*4)
        字体18:取图像(data.法伤):显示(75,225+27*5)
        字体18:取图像(data.法防):显示(75,225+27*6)
        字体18:取图像(data.培养.根骨):显示(217,225)
        字体18:取图像(data.培养.智力):显示(217,225+27*1)
        字体18:取图像(data.培养.武力):显示(217,225+27*2)
        字体18:取图像(data.培养.定力):显示(217,225+27*3)
        字体18:取图像(data.念力 or "无"):显示(217,225+27*4)
        字体18:取图像(data.灵敏 or "无"):显示(217,225+27*5)
        字体18:取图像(data.忠诚):显示(217,225+27*6)
        字体18:取图像(data.名称):显示(358,64)
        字体18:取图像(data.等级):显示(358,64+27*1)
        字体18:取图像(data.悟性 or "无"):显示(358,64+27*2)
        字体18:取图像(data.门派 or "无"):显示(358,64+27*3)
        字体18:取图像(data.五行):显示(358,64+27*4)
        字体16:置颜色(__取颜色('白色'))
        if data.结果 and data.结果 ~= '' then
            字体16:取描边图像(data.结果, 98, 183, 222):显示(353,199)
        end
    end
    self.图像 = nsf:到精灵()
    self.模型格子:置数据(data,"子女",147,169)
    self.技能网格:置数据(data.技能)
end

local 关闭 = 子女查看:创建我的按钮(__res:getPNGCC(1,401,0,46,46),"关闭",500,0)

function 关闭:左键弹起(x,y,msg)
    子女查看:置可见(false)
end


local 技能网格 = 子女查看:创建网格("技能网格",297,223,245,185)

function 技能网格:初始化()
    self:创建格子(55,55,3,3,3,4,true)
end


function 技能网格:左键弹起(x, y, a, b, msg)
    if self.子控件[a] and self.子控件[a]._spr and self.子控件[a]._spr.数据 then
        self.子控件[a]._spr:详情打开(x,y)
    end
end

function 技能网格:置数据(数据)
    for i = 1,#技能网格.子控件 do
        local lssj = __召唤兽技能格子.创建(当前)
        lssj:置数据(数据[i],55,55,'子女')
        技能网格.子控件[i]:置精灵(lssj)
    end
end