--[[
    @Author       : GGELUA
    @Date         : 2022-03-28 10:46:04
Last Modified by: GGELUA
Last Modified time: 2023-05-25 16:57:25
--]]
local 宝宝进化 = 多开数据[多开数据.当前].__UI界面.窗口层:创建窗口("宝宝进化", 0, 0, 380, 500)
local 当前 = 多开数据.当前
local lsb = { "气血", "魔法"}
local lsb2 = { "气血", "魔法"}
function 宝宝进化:初始化()
    __置窗口坐标(self)
    local nsf = require('SDL.图像')(360, 500)
    if nsf:渲染开始() then
        置窗口背景("进化宝宝", 0, 12, 360, 485, true):显示(0, 0)
        __res:getPNGCC(3, 375, 388, 145, 149):显示(15, 118)

        nsf:渲染结束()
    end
    self:置精灵(nsf:到精灵())
    self.选中召唤兽 = nil
    self.模型格子 = __UI模型格子.创建(当前)
end

function 宝宝进化:更新(dt)
    self.模型格子:更新(dt)
end

function 宝宝进化:显示(x, y)
    if self.数据 then
        self.数据:显示(x, y)
    end
    self.模型格子:显示(x, y)
end

function 宝宝进化:打开()
    self:置可见(true)
    self.选中召唤兽 = nil
    宝宝进化.头像网格:置头像(多开数据[当前].角色信息.宝宝列表)
    宝宝进化.属性:重置()
    self.模型格子:置数据()
end

function 宝宝进化:重置目标()
    self:重置()
    self.属性:重置()
end

function 宝宝进化:重置()
    if not 宝宝进化.选中召唤兽 then
        self.数据 = nil
    else
        local nsf = require('SDL.图像')(250, 300)
        if nsf:渲染开始() then
            if 多开数据[当前].角色信息.宝宝列表[宝宝进化.选中召唤兽].化境 then
                字体18:置颜色(246, 42, 210)
                字体18:取描边图像("化圣" ..
                    多开数据[当前].__主控:数字转境(多开数据[当前].角色信息.宝宝列表[宝宝进化.选中召唤兽].化境.境界) ..
                    多开数据[当前].__主控:数字转天(多开数据[当前].角色信息.宝宝列表[宝宝进化.选中召唤兽].化境.天)):置混合(0):显示(100, 270)
            else
                字体18:置颜色(255, 255, 255)
                字体18:取图像("等级 " .. 多开数据[当前].角色信息.宝宝列表[宝宝进化.选中召唤兽].等级):置混合(0):显示(50, 270)
            end
            nsf:渲染结束()
        end
        self.数据 = nsf:到精灵()
    end
end

function 宝宝进化:重置模型()
    if not 多开数据[当前].角色信息.宝宝列表[宝宝进化.选中召唤兽] then return end
    self.模型格子:置数据(多开数据[当前].角色信息.宝宝列表[宝宝进化.选中召唤兽], "召唤兽", 150, 225)
end

local 关闭 = 宝宝进化:创建我的按钮(__res:getPNGCC(1, 401, 0, 46, 46), "关闭", 320, 0)

function 关闭:左键弹起(x, y, msg)
    多开数据[当前].__UI界面.窗口层.宝宝进化:置可见(false)
end

local 进化 = 宝宝进化:创建我的按钮(__res:getPNGCC(1, 626, 28, 58, 34, true):拉伸(69, 34), "进化", 227, 245, "进化")
function 进化:左键弹起(x, y, msg)
     if 多开数据[当前].__UI界面.窗口层.宝宝进化.选中召唤兽 and 多开数据[当前].角色信息.宝宝列表[多开数据[当前].__UI界面.窗口层.宝宝进化.选中召唤兽] then
        发送数据(当前, 3801.4, { 序列 = 多开数据[当前].__UI界面.窗口层.宝宝进化.选中召唤兽, 操作 = "进化宝宝" })
      end

end


local 头像网格 = 宝宝进化:创建网格("头像网格", 15, 307, 300, 140)

function 头像网格:初始化()
    self:创建格子(70, 70, 5, 5, 3, 4, true)
end

function 头像网格:左键弹起(x, y, a, b, msg)
    if self.子控件[a] and self.子控件[a]._spr and self.子控件[a]._spr.数据 then
        if 宝宝进化.选中召唤兽 then
            self.子控件[宝宝进化.选中召唤兽]._spr.确定 = nil
        end
        宝宝进化.选中召唤兽 = a
        self.子控件[a]._spr.确定 = true
        宝宝进化.属性:重置()
        宝宝进化:重置()
        if 多开数据[当前].__UI界面.窗口层.消息管理.是否可见 then
            多开数据[当前].__UI界面.窗口层.消息管理.附加数据[1] = {
                类型 = "召唤兽",
                点击类型 = "召唤兽",
                名称= 多开数据[当前].角色信息.宝宝列表[宝宝进化.选中召唤兽].名称,
                编号= 多开数据[当前].角色信息.宝宝列表[宝宝进化.选中召唤兽].认证码
            }
            多开数据[当前].__UI界面.窗口层.消息管理.消息输入:添加文本("["..多开数据[当前].角色信息.宝宝列表[宝宝进化.选中召唤兽].名称.."]",频道) 
        end

        宝宝进化.模型格子:置数据(多开数据[当前].角色信息.宝宝列表[宝宝进化.选中召唤兽], "召唤兽", 90, 225)
    end
end

function 头像网格:置头像(数据)
    for i = 1, #头像网格.子控件 do
        local lssj = __头像格子.创建(当前)
        lssj:置头像(数据[i], "大")
        头像网格.子控件[i]:置精灵(lssj)
    end
end
local 属性 = 宝宝进化:创建控件("属性", 150, 110, 430, 380)
function 属性:初始化()
    local nsf = require('SDL.图像')(410, 315)
    if nsf:渲染开始() then
        字体18:置颜色(255, 255, 255)
        local lssj = 取输入背景(0, 0, 140, 23)
        local lssj2 = __res:getPNGCC(1, 400, 109, 185, 17):拉伸(140, 17)
        local pyx = 0
        local pyy = 0
        for i = 1, #lsb do
            if i > 8 then
                pyx = 197
                pyy = -320
            end
            if lsb[i] ~= "气血" and lsb[i] ~= "魔法" then
                -- lssj:显示(59 + pyx, 14 + pyy + ((i - 1) * 40))
            else
                lssj2:显示(59 + pyx, 17 + pyy + ((i - 1) * 40))
            end
            字体18:取图像(lsb[i]):置混合(0):显示(15 + pyx, 15 + pyy + ((i - 1) * 40))
        end
        nsf:渲染结束()
    end
    self:置精灵(nsf:到精灵())
end

function 属性:显示(x, y)
    if self.数据 then
        self.数据:显示(x, y)
    end
end

function 属性:重置()
    self:置可见(true)
    if not 宝宝进化.选中召唤兽 then
        self.数据 = nil
    else
        local nsf = require('SDL.图像')(410, 315)
        if nsf:渲染开始() then
            字体18:置颜色(255, 255, 255)
            字体16:置颜色(39, 53, 81)
            字体18:取图像("当前进化："..多开数据[当前].角色信息.宝宝列表[宝宝进化.选中召唤兽].元宵.进化次数):显示(60, 80)
            字体18:取图像("还可进化："..5-多开数据[当前].角色信息.宝宝列表[宝宝进化.选中召唤兽].元宵.进化次数):显示(60, 100)

            local pyx = 0
            local pyy = 0
            for i = 1, #lsb2 do
                if i > 8 then
                    pyx = 197
                    pyy = -320
                end
                -- if lsb2[i] ~= "气血" and lsb2[i] ~= "魔法" and lsb2[i] ~= "经验" then
                --     字体18:取图像(多开数据[当前].角色信息.宝宝列表[宝宝进化.选中召唤兽][lsb2[i]]):置混合(0):显示(68 + pyx, 15 + pyy + ((i - 1) * 40))
                if lsb2[i] == "气血" then
                    local lssj2 = 多开数据[当前].角色信息.宝宝列表[宝宝进化.选中召唤兽].气血 / 多开数据[当前].角色信息.宝宝列表[宝宝进化.选中召唤兽].最大气血
                    if lssj2 > 1 then lssj2 = 1 end
                    __res:getPNGCC(1, 400, 163, 305, 16):拉伸(math.floor(138 * lssj2), 16):显示(60, 18)
                    字体16:取图像(string.format("%s/%s", 多开数据[当前].角色信息.宝宝列表[宝宝进化.选中召唤兽].气血,
                        多开数据[当前].角色信息.宝宝列表[宝宝进化.选中召唤兽].最大气血)):显示(90, 18)
                elseif lsb2[i] == "魔法" then
                    local lssj2 = 多开数据[当前].角色信息.宝宝列表[宝宝进化.选中召唤兽].魔法 / 多开数据[当前].角色信息.宝宝列表[宝宝进化.选中召唤兽].最大魔法
                    if lssj2 > 1 then lssj2 = 1 end
                    __res:getPNGCC(1, 401, 145, 305, 16):拉伸(math.floor(138 * lssj2), 16):显示(60, 58)
                    字体16:取图像(string.format("%s/%s", 多开数据[当前].角色信息.宝宝列表[宝宝进化.选中召唤兽].魔法,
                        多开数据[当前].角色信息.宝宝列表[宝宝进化.选中召唤兽].最大魔法)):显示(90, 58)
                end
            end
            nsf:渲染结束()
        end
        self.数据 = nsf:到精灵()
    end
end