--[[
Author: GGELUA
Date: 2023-11-05 21:30:11
Last Modified by: GGELUA
Last Modified time: 2023-11-07 15:33:49
--]]
local 宠物说明 = {
    {"生肖鼠","十二生肖里最精明能干的动物，知识丰富充满智慧，既有魅力又充满侵略性。","★鼠可以让召唤兽的灵力成长有轻微的加成"},
    {"生肖牛","稳重.辛勤.诚恳.沉默寡言，是最嘉的完成者和执行者，强大而持久的耐力是牛的优点，但也不可掩饰牛也略微显得缓慢和极端固执。","★牛可以让召唤兽的体质有轻微的加成"},
    {"生肖虎","威猛而充满创造力，特立独行不拘于常规，特别拥有自我意识，老虎似乎天生就有赚钱的运气和本能。","★虎可以让召唤兽的忠诚度有轻微的加成"},
    {"生肖兔","优雅而高贵.对艺术.音乐.历史和文学都有强烈的兴趣。他们喜欢和平安静。但这并不意味兔子是一种软弱可欺的动物。","★兔可以让召唤兽的敏捷有轻微的加成"},
    {"生肖龙","具有权威性.对任何事物都充满热情.而且似乎永不之疲倦，他们的身上有散发着健康的气息和无穷的精力。","★龙可以让召唤兽捕捉成功率提升"},
    {"生肖蛇","美丽的生物，他们都比较孤芳自赏。当然,蛇也确实漂亮和聪明。它们多半控制欲比较强。 ","★蛇可以让召唤兽的法力成长有轻微的加成"},
    {"生肖马","追求自由的动物，可能会有点独断专行。马的学习能力也非常强。不过这也导致马有时候可能三心二意。","★马练妖时对于技能的继承能力很强,经常可以练出继承极品技能的召唤兽来",6},
    {"生肖羊","最具有创造力。不过他们通常都需要有人催逼才能成功。在天赋之下羊又可以承担巨大的工作量，即使是枯燥而漫长的工作也能完成。","★羊可以让炼妖成功的召唤兽成长提高",7},
    {"生肖猴","稳定而且正直，又有点女子气。总是受人喜爱。而最令人欣赏的是猴解决问题的能力。他们多半对什么都很有兴趣。","★猴可以让召唤兽的各方面都有轻微加成",6},
    {"生肖鸡","比较夸张.喜欢追随时尚和流行。热爱修饰。虽然看起来比较另类，其实鸡是很保守的。它们喜欢尝试各种东西。","★鸡可以让召唤兽的寿命大大增加",6},
    {"生肖狗","是正义的代名词，他们考虑周详。聪明有信心.诚实.忠心.勇于献身。对于主人有着最忠诚的个性。狗最擅长契而不舍的完成一件事","★狗可以让召唤兽的耐力有轻微的加成",7},
    {"生肖猪","强壮而温和.吸引人而诚实。不善言辞，但很喜欢舒适的生活。但猪总是相当精明。而且它们也确实有令人羡慕的好运气。","★猪可以让玩家的运气轻微加成",6}
}
local 宠物领养栏 = 多开数据[多开数据.当前].__UI界面.窗口层:创建我的窗口("宠物领养栏",0,0,560,360)
local 当前 = 多开数据.当前
function 宠物领养栏:初始化()
    __置窗口坐标(self,'右')
    local nsf = require('SDL.图像')(560,360)
    if nsf:渲染开始() then
        __res:取图像(__res:取地址("shape/ui/xz/", 0x00000017)):显示(0,0)
        nsf:渲染结束()
    end
    self:置精灵(nsf:到精灵())
end

function 宠物领养栏:打开(data)
    self:置可见(true)
    self.介绍文本:清空()
    self.宠物网格:置宠物()
    self.宠物网格.选择 = nil
end

function 宠物领养栏:左键弹起(x,y)
    if x>737 and y > 94 and x <752 and y < 105 then
        self:置可见(false)
    end
end

local 购买 = 宠物领养栏:创建我的按钮(__res:getPNGCC(3,2,507,124,41,true):拉伸(90,30),"确定",450,315,"确定")
function 购买:左键弹起(x,y,msg)
    if 宠物领养栏.宠物网格.选择 then
        local function 事件()
            发送数据(当前 or self and self.当前,6,{cw=宠物领养栏.宠物网格.选择},1)
        end
        local wb = "宠物一旦更换无法再次更换,你确定要更换为该宠物吗？"
        多开数据[当前].__UI界面.窗口层.文本栏:打开(wb,285,155,390,200,事件)
    end
end

local 关闭 = 宠物领养栏:创建我的按钮(__res:getPNGCC(1,401,0,46,46),"关闭",520,0)

function 关闭:左键弹起(x,y,msg)
    宠物领养栏:置可见(false)
end



local 介绍文本 = 宠物领养栏:创建文本("介绍文本",445,82,105,235)
function 介绍文本:初始化()

end

local 宠物网格 = 宠物领养栏:创建网格("宠物网格",10,30,630,320)

function 宠物网格:初始化()
    self:创建格子(103,103,0,0,3,4)
    self.宠物组 = {}
end

function 宠物网格:左键弹起(x, y, a, b, msg)
    宠物领养栏.介绍文本:清空()
    宠物领养栏.介绍文本:置文本(宠物网格.子控件[a].数据[2])
    self.选择 = 宠物网格.子控件[a].数据[1]
end

function 宠物网格:置宠物()
    for i = 1,#宠物网格.子控件 do
        宠物网格.子控件[i].数据 = 宠物说明[i]
        local lssj = 取模型(宠物说明[i][1])
        self.宠物组[i] = __res:取动画2(__res:取地址("shape/mx/", lssj[1])):置方向(0):置循环(true)
    end
end

function 宠物网格:更新(dt)
    for i=1,#self.宠物组 do
        self.宠物组[i]:更新(dt)
    end
end

function 宠物网格:显示(x,y)
    for i=1,#self.宠物组 do
        self.宠物组[i]:显示(x+宠物网格.子控件[i].x+60,y+宠物网格.子控件[i].y+80)
    end
    if self.选择 then
        字体16:显示(x+465,y+16,self.选择)
    end
end
