--[[
Author: GGELUA
Date: 2023-11-05 21:30:11
Last Modified by: GGELUA
Last Modified time: 2023-11-07 13:05:42
--]]

local 帮派加入 = 多开数据[多开数据.当前].__UI界面.窗口层:创建我的窗口("帮派加入",0,0,773,487)
local 当前 = 多开数据.当前
function 帮派加入:初始化()
    __置窗口坐标(self)
    local nsf = require('SDL.图像')(773,487)
    if nsf:渲染开始() then
        置窗口背景("加入帮派",0,12,766,472,true):显示(0,0)
        取白色背景(0,0,346,365,true):显示(16,61)
        取白色背景(0,0,380,169,true):显示(371,61)
        取白色背景(0,0,380,187,true):显示(371,239)
        字体18:置颜色(__取颜色('浅黑'))
        字体18:取图像('帮派'):显示(68,67)
        字体18:取图像('编号'):显示(192,67)
        字体18:取图像('战力'):显示(291,67)
        字体18:取图像('名称'):显示(425,67)
        字体18:取图像('职务'):显示(614,67)
        nsf:渲染结束()
    end
    self:置精灵(nsf:到精灵())
end

function 帮派加入:打开(data)
    self:置可见(true)
    self.帮派列表:重置(data)
    self.数据 = data
end

function 帮派加入:重置(data)
    local nsf = require('SDL.图像')(376,356)
    if nsf:渲染开始() then
        字体16:取图像('帮主'):显示(230,50)
        字体16:取图像('帮派规模：'):显示(19,190)
        字体16:取图像('成员数量：'):显示(204,190)

        字体16:取图像(data.现任帮主.名称):显示(20,50)

        字体16:取图像(data.实力):显示(112,190)
        字体16:取图像(data.成员数量.当前 .. "/"..data.成员数量.上限):显示(295,190)
        nsf:渲染结束()
    end
    self.图像 = nsf:到精灵()
    self.图像:置中心(-373,-62)
end

local 关闭 = 帮派加入:创建我的按钮(__res:getPNGCC(1,401,0,46,46),"关闭",723,0)

function 关闭:左键弹起(x,y,msg)
    帮派加入:置可见(false)
    帮派加入.帮派列表:重置({})
    self.图像 = nil
    self.数据 = nil
    self.选中 = nil
end

local 帮派列表 = 帮派加入:创建列表("帮派列表",17,97,343,322)

function 帮派列表:初始化()
    self:置文字(字体20)
    self.行高度 = 50
    self.行间距 = 0
end

function 帮派列表:重置(data)
    self:清空()
    for _, v in ipairs(data) do
        if v.名称 ~= '' then
            local nsf = require('SDL.图像')(343,50)
            if nsf:渲染开始() then
                if _%2 == 1 then
                    --nsf:填充颜色(167,164,199,255)
                end
                字体16:置颜色(__取颜色('浅黑'))
                字体16:取图像(v.名称):显示(44,15)
                字体16:取图像(v.编号):显示(188,15)
                字体16:取图像(v.实力):显示(283,15)
                nsf:渲染结束()
            end
            local r = self:添加()
            r:置精灵(nsf:到精灵())
        end
    end
end

function 帮派列表:左键弹起(x, y, i, item, msg)
    帮派加入:重置(帮派加入.数据[i])
    帮派加入.帮派宗旨:清空()
    帮派加入.帮派宗旨:置文本('#K'..帮派加入.数据[i].宗旨)
    帮派加入.选中 = i
end

local 帮派宗旨 = 帮派加入:创建我的文本("帮派宗旨",392,286,335,120)

local 加入 = 帮派加入:创建我的按钮(__res:getPNGCC(3,2,507,124,41,true):拉伸(123,41),"加入",625,435,"加入")
function 加入:左键弹起(x,y,msg)
    if 帮派加入.数据[帮派加入.选中] then
        发送数据(当前 or self and self.当前,38,{编号=帮派加入.数据[帮派加入.选中].编号})
    end
end

local 取消 = 帮派加入:创建我的按钮(__res:getPNGCC(3,2,507,124,41,true):拉伸(123,41),"取消",500,435,"取消")
function 取消:左键弹起(x,y,msg)
    if 帮派加入.数据[帮派加入.选中] then
        发送数据(当前 or self and self.当前,38.1,{编号=帮派加入.数据[帮派加入.选中].编号})
    end
end