--[[
    @Author       : GGELUA
    @Date         : 2022-04-21 13:45:23
Last Modified by: GGELUA
Last Modified time: 2023-11-07 13:05:19
--]]
local 帮派创建 = 多开数据[多开数据.当前].__UI界面.窗口层:创建窗口("帮派创建",0,0,453,404)
local 当前 = 多开数据.当前
function 帮派创建:初始化()
    __置窗口坐标(self)
    local nsf = require('SDL.图像')(445,390)
    if nsf:渲染开始() then
        置窗口背景("创建帮派",0,12,445,390,true):显示(0,0)
        __res:getPNGCC(2,795,885,373,115):拉伸(266,35):显示(72,60)
        取白色背景(0,0,410,172,true):显示(18,141)
        字体18:置颜色(__取颜色('白色'))
        字体18:取图像('名称'):显示(18,66)
        字体18:取图像('帮派宗旨'):显示(183,109)
        nsf:渲染结束()
    end
    self:置精灵(nsf:到精灵())
end

function 帮派创建:打开()
    self:置可见(true)
end

local 关闭 = 帮派创建:创建我的按钮(__res:getPNGCC(1,401,0,46,46),"关闭",403,0)

function 关闭:左键弹起(x,y,msg)
    帮派创建:置可见(false)
    帮派创建.名称输入:清空()
    帮派创建.宗旨输入:清空()
end

local 名称输入 = 帮派创建:创建我的输入("名称输入",81,67,254,24,nil,8,'黑色',字体20)


local 宗旨输入 = 帮派创建:创建我的编辑("宗旨输入",25,165,392,162,nil,100,'黑色')

local 创建 = 帮派创建:创建我的按钮(__res:getPNGCC(3,2,507,124,41,true):拉伸(123,41),"创建",153,337,"创建")
function 创建:左键弹起(x,y,msg)
    if 取特殊字符(名称输入:取文本()) and 取特殊字符(宗旨输入:取文本()) then
        if #名称输入:取文本() < 6 and #名称输入:取文本() > 14 then
           多开数据[当前 or self and self.当前].__UI弹出.提示框:打开("#Y帮派名称至少需要3个文字或者6个字符，最多7个文字14个字符")   
        elseif #宗旨输入:取文本() < 20 then
           多开数据[当前 or self and self.当前].__UI弹出.提示框:打开("#Y帮派宗旨至少需要10个文字或者20个字符，最多20个文字40个字符") 
        else
            发送数据(当前 or self and self.当前,35,{名称=名称输入:取文本(),公告=宗旨输入:取文本()})
            帮派创建:置可见(false)
        end
    else
       多开数据[当前 or self and self.当前].__UI弹出.提示框:打开("#Y请输入名字和宗旨")
    end
end