-- @Author              : GGELUA
-- @Last Modified by    : baidwwy
-- @Date                : 2023-09-27 18:27:45
-- @Last Modified time  : 2023-09-27 19:03:22

local 新副本界面 = 多开数据[多开数据.当前].__UI界面.窗口层:创建我的窗口("新副本界面",0,0,700,500)
local 当前 =  多开数据.当前
local 基类 = require("界面/控件层/基类/物品基类")
local SDL = require 'SDL'
local GUI控件 = require('GUI.控件')
function 新副本界面:初始化()
    __置窗口坐标(self)
    local nsf = require('SDL.图像')(700,500)
    if nsf:渲染开始() then
        置窗口背景("快速开启副本",0,12,650,450,true):显示(0,0)
        取白色背景(0,0,630,330,true):显示(10,88)
        字体18:置颜色(__取颜色('黄色'))
        字体18:取图像("通过快速副本开启任务，≥5人可以直接传送进入场景"):显示(105,427)
        nsf:渲染结束()
    end
    self:置精灵(nsf:到精灵())
end

function 新副本界面:打开(data)
    self:置可见(true)
    self.普通副本:置选中(true)
    self.友情赞助系统:重置()
    self.数据 = data
    self.类型 = 1
end

function 新副本界面:刷新(data)
    self.数据 = data
    self.类型 = self.类型
end

local 友情赞助系统 = 新副本界面:创建控件('友情赞助系统',0,0,700, 450)

function 友情赞助系统:重置()
    新副本界面.普通副本控件:置可见(true)
    新副本界面.侠士副本控件:置可见(false)
    新副本界面.天命副本控件:置可见(false)
    local nsf = require('SDL.图像')(700,450)
    if nsf:渲染开始() then
        __res:getPNGCC(3, 132, 506, 55, 55):显示(23, 100)
        __res:getPNGCC(3, 132, 506, 55, 55):显示(23+300, 100)
        __res:getPNGCC(3, 132, 506, 55, 55):显示(23, 100+80)
        __res:getPNGCC(3, 132, 506, 55, 55):显示(23+300, 100+80)
        __res:getPNGCC(3, 132, 506, 55, 55):显示(23, 100+80*2)
        __res:getPNGCC(3, 132, 506, 55, 55):显示(23+300, 100+80*2)
        __res:getPNGCC(3, 132, 506, 55, 55):显示(23, 100+80*3)
        __res:getPNGCC(3, 132, 506, 55, 55):显示(23+300, 100+80*3)

         __res:取图像(__res:取地址('shape/dj/',0x8c3fa3a7)):显示(23,100)
         __res:取图像(__res:取地址('shape/dj/',0x4a068542)):显示(23+300,100)
         __res:取图像(__res:取地址('shape/dj/',0x4714f3c1)):显示(23,100+80)
         __res:取图像(__res:取地址('shape/dj/',0x9acaccad)):显示(23+300,100+80)
         __res:取图像(__res:取地址('shape/dj/',0x249d07a5)):显示(23,100+80*2)
         __res:取图像(__res:取地址('shape/dj/',0x50c7cb87)):显示(23+300,100+80*2)
         __res:取图像(__res:取地址('shape/dj/',0x8513c977)):显示(23,100+80*3)
         __res:取图像(__res:取地址('shape/dj/',0x10095AF2)):显示(23+300,100+80*3)

        字体18:置颜色(__取颜色('浅黑'))
        字体18:取图像("乌鸡国"):显示(90,100)
        字体18:取图像("水陆大会"):显示(90+300,100)
        字体18:取图像("车迟斗法"):显示(90,100+80)
        字体18:取图像("通天河"):显示(90+300,100+80)
        字体18:取图像("泾河龙王"):显示(90,100+80*2)
        字体18:取图像("天火之殇上"):显示(90+300,100+80*2)
        字体18:取图像("齐天大圣"):显示(90,100+80*3)
        字体18:取图像("初出茅庐"):显示(90+300,100+80*3)



        nsf:渲染结束()
    end
    新副本界面.图像 = nsf:到精灵()
end

local 关闭 = 新副本界面:创建我的按钮(__res:getPNGCC(1,401,0,46,46),"关闭",625,0)
function 关闭:左键弹起(x,y,msg)
    新副本界面:置可见(false)
end

local 普通副本控件 = 新副本界面:创建控件('普通副本控件',100,0,700, 450)
local 普通副本 = 新副本界面:创建我的单选按钮(__res:getPNGCC(1,401,65,175,43,true):置拉伸(140,40),__res:getPNGCC(1,963,495,175,43,true):置拉伸(140,40),"普通副本",20,45,"普通副本")
function 普通副本:左键按下(消息,x,y)
    新副本界面.类型 = 1
    新副本界面.普通副本:置选中(true)
    新副本界面.侠士副本:置选中(false)
    新副本界面.天命副本:置选中(false)

    新副本界面.普通副本控件:置可见(true)
    新副本界面.侠士副本控件:置可见(false)
    新副本界面.天命副本控件:置可见(false)

    local nsf = require('SDL.图像')(700,450)
    if nsf:渲染开始() then
        __res:getPNGCC(3, 132, 506, 55, 55):显示(23, 100)
        __res:getPNGCC(3, 132, 506, 55, 55):显示(23+300, 100)
        __res:getPNGCC(3, 132, 506, 55, 55):显示(23, 100+80)
        __res:getPNGCC(3, 132, 506, 55, 55):显示(23+300, 100+80)
        __res:getPNGCC(3, 132, 506, 55, 55):显示(23, 100+80*2)
        __res:getPNGCC(3, 132, 506, 55, 55):显示(23+300, 100+80*2)
        __res:getPNGCC(3, 132, 506, 55, 55):显示(23, 100+80*3)
        __res:getPNGCC(3, 132, 506, 55, 55):显示(23+300, 100+80*3)


         __res:取图像(__res:取地址('shape/dj/',0x8c3fa3a7)):显示(23,100)
         __res:取图像(__res:取地址('shape/dj/',0x4a068542)):显示(23+300,100)
         __res:取图像(__res:取地址('shape/dj/',0x4714f3c1)):显示(23,100+80)
         __res:取图像(__res:取地址('shape/dj/',0x9acaccad)):显示(23+300,100+80)
         __res:取图像(__res:取地址('shape/dj/',0x249d07a5)):显示(23,100+80*2)
         __res:取图像(__res:取地址('shape/dj/',0x50c7cb87)):显示(23+300,100+80*2)
         __res:取图像(__res:取地址('shape/dj/',0x8513c977)):显示(23,100+80*3)
         
        字体18:置颜色(__取颜色('浅黑'))
        字体18:取图像("乌鸡国"):显示(90,100)
        字体18:取图像("水陆大会"):显示(90+300,100)
        字体18:取图像("车迟斗法"):显示(90,100+80)
        字体18:取图像("通天河"):显示(90+300,100+80)
        字体18:取图像("泾河龙王"):显示(90,100+80*2)
        字体18:取图像("天火之殇上"):显示(90+300,100+80*2)
        字体18:取图像("齐天大圣"):显示(90,100+80*3)
        字体18:取图像("初出茅庐"):显示(90+300,100+80*3)


        nsf:渲染结束()
    end
    新副本界面.图像 = nsf:到精灵()
end

for i, v in ipairs {
    {name = "乌鸡国", x = 110-23 ,y = 100 , tcp = __res:getPNGCC(1,449,28,174,35,true):拉伸(98,35) , font = '开启副本'},
    {name = "水陆大会", x = 440-23 ,y = 100 , tcp = __res:getPNGCC(1,449,28,174,35,true):拉伸(98,35) , font = '开启副本'},


    {name = "车迟斗法", x = 110-23 ,y = 100+80 , tcp = __res:getPNGCC(1,449,28,174,35,true):拉伸(98,35) , font = '开启副本'},
    {name = "通天河", x = 440-23 ,y = 100+80 , tcp = __res:getPNGCC(1,449,28,174,35,true):拉伸(98,35) , font = '开启副本'},


    {name = "泾河龙王2", x = 110-23 ,y = 100+80*2 , tcp = __res:getPNGCC(1,449,28,174,35,true):拉伸(98,35) , font = '开启副本'},
    {name = "天火之殇上部", x = 440-23 ,y = 100+80*2 , tcp = __res:getPNGCC(1,449,28,174,35,true):拉伸(98,35) , font = '开启副本'},


    {name = "齐天大圣", x = 110-23 ,y = 100+80*3 , tcp = __res:getPNGCC(1,449,28,174,35,true):拉伸(98,35) , font = '开启副本'},
    {name = "初出茅庐", x = 440-23 ,y = 100+80*3 , tcp = __res:getPNGCC(1,449,28,174,35,true):拉伸(98,35) , font = '开启副本'},

} do
    local 临时函数 = 普通副本控件:创建我的按钮(v.tcp,v.name,v.x,v.y,v.font)
    function 临时函数:左键弹起(x, y)
        if v.name=="乌鸡国" then
        发送数据(当前 or self and self.当前,34.2,{9})
        elseif v.name=="水陆大会" then
        发送数据(当前 or self and self.当前,34.2,{10})
        elseif v.name=="车迟斗法" then
        发送数据(当前 or self and self.当前,34.2,{11})
        elseif v.name=="通天河" then
        发送数据(当前 or self and self.当前,34.2,{12})
        elseif v.name=="泾河龙王2" then
        发送数据(当前 or self and self.当前,34.2,{13})
        elseif v.name=="天火之殇上部" then
        发送数据(当前 or self and self.当前,34.2,{14})
        elseif v.name=="齐天大圣" then
        发送数据(当前 or self and self.当前,34.2,{15})
        elseif v.name=="初出茅庐" then
        发送数据(当前 or self and self.当前,34.2,{22})
        -- 新副本界面:置可见(false)
        end
    end
end

local 侠士副本控件 = 新副本界面:创建控件('侠士副本控件',100,0,700, 450)

local 侠士副本 = 新副本界面:创建我的单选按钮(__res:getPNGCC(1,401,65,175,43,true):置拉伸(140,40),__res:getPNGCC(1,963,495,175,43,true):置拉伸(140,40),"侠士副本",20+150,45,"侠士副本")

function 侠士副本:左键按下(消息,x,y)
    新副本界面.类型 = 2
    新副本界面.侠士副本:置选中(true)
    新副本界面.普通副本:置选中(false)
    新副本界面.天命副本:置选中(false)
    新副本界面.普通副本控件:置可见(false)
    新副本界面.天命副本控件:置可见(false)
    新副本界面.侠士副本控件:置可见(true)

    local nsf = require('SDL.图像')(700,450)
    if nsf:渲染开始() then
        __res:getPNGCC(3, 132, 506, 55, 55):显示(23, 100)
        __res:getPNGCC(3, 132, 506, 55, 55):显示(23+300, 100)
        __res:getPNGCC(3, 132, 506, 55, 55):显示(23, 100+80)
        __res:getPNGCC(3, 132, 506, 55, 55):显示(23+300, 100+80)
        __res:getPNGCC(3, 132, 506, 55, 55):显示(23, 100+80*2)
        __res:getPNGCC(3, 132, 506, 55, 55):显示(23+300, 100+80*2)
        __res:getPNGCC(3, 132, 506, 55, 55):显示(23, 100+80*3)

         __res:取图像(__res:取地址('shape/dj/',0xecb79ef2)):显示(23+4,100)
         __res:取图像(__res:取地址('shape/dj/',0xf46818b1)):显示(23+300,100)
         __res:取图像(__res:取地址('shape/dj/',0x7e9a874a)):显示(23+4,100+80+2)
         __res:取图像(__res:取地址('shape/dj/',0x7e1991cb)):显示(23+300,100+80)
         __res:取图像(__res:取地址('shape/dj/',0x5bd31714)):显示(23,100+80*2)
         __res:取图像(__res:取地址('shape/dj/',0x8513c977)):显示(23+300,100+80*2)
         __res:取图像(__res:取地址('shape/dj/',0xB14AAD46)):显示(23,100+80*3)

        字体18:置颜色(__取颜色('浅黑'))
        字体18:取图像("七绝山"):显示(90,100)
        字体18:取图像("红孩儿"):显示(90+300,100)

        字体18:取图像("秘境降妖"):显示(90,100+80)
        字体18:取图像("黑风山"):显示(90+300,100+80)

        字体18:取图像("无底洞"):显示(90,100+80*2)
        字体18:取图像("大闹天宫"):显示(90+300,100+80*2)

        字体18:取图像("青丘迷雾"):显示(90,100+80*3)

        nsf:渲染结束()
    end
    新副本界面.图像 = nsf:到精灵()
end

for i, v in ipairs {
    {name = "七绝山", x = 110-23 ,y = 100 , tcp = __res:getPNGCC(1,449,28,174,35,true):拉伸(98,35) , font = '开启副本'},
    {name = "红孩儿", x = 440-23 ,y = 100 , tcp = __res:getPNGCC(1,449,28,174,35,true):拉伸(98,35) , font = '开启副本'},


    {name = "秘境降妖", x = 110-23 ,y = 100+80 , tcp = __res:getPNGCC(1,449,28,174,35,true):拉伸(98,35) , font = '开启副本'},
    {name = "黑风山", x = 440-23 ,y = 100+80 , tcp = __res:getPNGCC(1,449,28,174,35,true):拉伸(98,35) , font = '开启副本'},


    {name = "无底洞", x = 110-23 ,y = 100+80*2 , tcp = __res:getPNGCC(1,449,28,174,35,true):拉伸(98,35) , font = '开启副本'},
    {name = "大闹天宫", x = 440-23 ,y = 100+80*2 , tcp = __res:getPNGCC(1,449,28,174,35,true):拉伸(98,35) , font = '开启副本'},

    {name = "青丘迷雾", x = 110-23 ,y = 100+80*3 , tcp = __res:getPNGCC(1,449,28,174,35,true):拉伸(98,35) , font = '开启副本'},


} do
    local 临时函数 = 侠士副本控件:创建我的按钮(v.tcp,v.name,v.x,v.y,v.font)
    function 临时函数:左键弹起(x, y)
        if v.name=="七绝山" then
        发送数据(当前 or self and self.当前,34.2,{16})
        elseif v.name=="红孩儿" then
        发送数据(当前 or self and self.当前,34.2,{17})
        elseif v.name=="秘境降妖" then
        发送数据(当前 or self and self.当前,34.2,{18})
        elseif v.name=="黑风山" then
        发送数据(当前 or self and self.当前,34.2,{19})
        elseif v.name=="无底洞" then
        发送数据(当前 or self and self.当前,34.2,{20})
        elseif v.name=="大闹天宫" then
        发送数据(当前 or self and self.当前,34.2,{21})
        elseif v.name=="青丘迷雾" then
        发送数据(当前 or self and self.当前,34.2,{23})
        -- 新副本界面:置可见(false)
        end
    end
end



local 天命副本控件 = 新副本界面:创建控件('天命副本控件',100,0,700, 450)

local 天命副本 = 新副本界面:创建我的单选按钮(__res:getPNGCC(1,401,65,175,43,true):置拉伸(140,40),__res:getPNGCC(1,963,495,175,43,true):置拉伸(140,40),"天命副本",20+150*2,45,"天命副本")

function 天命副本:左键按下(消息,x,y)
    新副本界面.类型 = 3
    新副本界面.侠士副本:置选中(false)
    新副本界面.普通副本:置选中(false)
    新副本界面.天命副本:置选中(true)
    新副本界面.普通副本控件:置可见(false)
    新副本界面.侠士副本控件:置可见(false)
    新副本界面.天命副本控件:置可见(true)
    local nsf = require('SDL.图像')(700,450)
    if nsf:渲染开始() then
        __res:getPNGCC(3, 132, 506, 55, 55):显示(23, 100)
        __res:getPNGCC(3, 132, 506, 55, 55):显示(23+300, 100)
        __res:getPNGCC(3, 132, 506, 55, 55):显示(23, 100+80)
        __res:getPNGCC(3, 132, 506, 55, 55):显示(23+300, 100+80)
        __res:getPNGCC(3, 132, 506, 55, 55):显示(23, 100+80*2)
        __res:getPNGCC(3, 132, 506, 55, 55):显示(23+300, 100+80*2)
        __res:getPNGCC(3, 132, 506, 55, 55):显示(23, 100+80*3)
        __res:getPNGCC(3, 132, 506, 55, 55):显示(23+300, 100+80*3)


         __res:取图像(__res:取地址('shape/dj/',0xE0F5CABF)):显示(23,100)
         __res:取图像(__res:取地址('shape/dj/',0x9acaccad)):显示(23+300,100)
         __res:取图像(__res:取地址('shape/dj/',0x3DD12EF3)):显示(23,100+80+3)
         __res:取图像(__res:取地址('shape/dj/',0x8513c977)):显示(23+300,100+80)
         __res:取图像(__res:取地址('shape/dj/',0x4a068542)):显示(23,100+80*2)
         __res:取图像(__res:取地址('shape/dj/',0x50c7cb87)):显示(23+300,100+80*2)
         __res:取图像(__res:取地址('shape/dj/',0x8c3fa3a7)):显示(23,100+80*3)
         __res:取图像(__res:取地址('shape/dj/',0xF8776FC8)):显示(23+300,100+4+80*3)

        字体18:置颜色(__取颜色('浅黑'))
        字体18:取图像("天命石猴"):显示(90,100)
        字体18:取图像("天命通天"):显示(90+300,100)
        字体18:取图像("天命金兜洞"):显示(90,100+80)
        字体18:取图像("天命大闹"):显示(90+300,100+80)
        字体18:取图像("天命水陆"):显示(90,100+80*2)
        字体18:取图像("天命红孩儿"):显示(90+300,100+80*2)
        字体18:取图像("天命乌鸡"):显示(90,100+80*3)
        字体18:取图像("天命秘境"):显示(90+300,100+80*3)

        nsf:渲染结束()
    end
    新副本界面.图像 = nsf:到精灵()
end

for i, v in ipairs {
    {name = "天命石猴", x = 110-23 ,y = 100 , tcp = __res:getPNGCC(1,449,28,174,35,true):拉伸(98,35) , font = '开启副本'},
    {name = "天命通天", x = 440-23 ,y = 100 , tcp = __res:getPNGCC(1,449,28,174,35,true):拉伸(98,35) , font = '开启副本'},


    {name = "天命金兜洞", x = 110-23 ,y = 100+80 , tcp = __res:getPNGCC(1,449,28,174,35,true):拉伸(98,35) , font = '开启副本'},
    {name = "天命大闹", x = 440-23 ,y = 100+80 , tcp = __res:getPNGCC(1,449,28,174,35,true):拉伸(98,35) , font = '开启副本'},


    {name = "天命水陆", x = 110-23 ,y = 100+80*2 , tcp = __res:getPNGCC(1,449,28,174,35,true):拉伸(98,35) , font = '开启副本'},
    {name = "天命红孩儿", x = 440-23 ,y = 100+80*2 , tcp = __res:getPNGCC(1,449,28,174,35,true):拉伸(98,35) , font = '开启副本'},

    {name = "天命乌鸡", x = 110-23 ,y = 100+80*3 , tcp = __res:getPNGCC(1,449,28,174,35,true):拉伸(98,35) , font = '开启副本'},
    {name = "天命秘境", x = 440-23 ,y = 100+80*3 , tcp = __res:getPNGCC(1,449,28,174,35,true):拉伸(98,35) , font = '开启副本'},

} do
    local 临时函数 = 天命副本控件:创建我的按钮(v.tcp,v.name,v.x,v.y,v.font)
    function 临时函数:左键弹起(x, y)
        if v.name=="天命石猴" then
        发送数据(当前 or self and self.当前,451)
        elseif v.name=="天命通天" then
        发送数据(当前 or self and self.当前,452)
        elseif v.name=="天命金兜洞" then
        发送数据(当前 or self and self.当前,453)
        elseif v.name=="天命大闹" then
        发送数据(当前 or self and self.当前,454)
        elseif v.name=="天命水陆" then
        发送数据(当前 or self and self.当前,455)
        elseif v.name=="天命红孩儿" then
        发送数据(当前 or self and self.当前,456)
        elseif v.name=="天命乌鸡" then
        发送数据(当前 or self and self.当前,457)
        elseif v.name=="天命秘境" then
        发送数据(当前 or self and self.当前,458)
        -- 新副本界面:置可见(false)
        end

    end
end