local 神器大图与坐标 = {
    大唐官府 = {0x01AC0090,320,100,0x01AC0046},化生寺 = {0x01AC0092,330,120,0x01AC0052},方寸山 = {0x01AC0091,320,100,0x01AC0057},女儿村 = {0x01AC0093,300,70,0x01AC0055},
    天宫 = {0x01AC0099,310,90,0x01AC0059},普陀山 = {0x01AC0104,305,85,0x01AC0058},龙宫 = {0x01AC0102,310,90,0x01AC0051},五庄观 = {0x01AC0100,320,100,0x01AC0047},
    魔王寨 = {0x01AC0096,310,100,0x01AC0053},狮驼岭 = {0x01AC0097,325,105,0x01AC0050},盘丝洞 = {0x01AC0098,310,95,0x01AC0056},阴曹地府 = {0x01AC0095,310,90,0x01AC0049},
    神木林 = {0x01AC0094,300,75,0x01AC0045},凌波城 = {0x01AC0101,300,95,0x01AC0048},无底洞 = {0x01AC0103,320,100,0x01AC0054},花果山 = {0x0C000015,320,100,0x01AC0054},
    九黎城 = {0xDD000081,320,100,0xDD000082},

}

local 神器属性 = {
    大唐官府 = {"伤　　害","物理暴击"},化生寺 = {"防　　御","治疗能力"},方寸山 = {"封印命中","法术伤害"},女儿村 = {"封印命中","固定伤害"},天宫 = {"法术伤害","封印命中"},
    普陀山 = {"固定伤害","治疗能力"},龙宫 = {"法术伤害","法术暴击"},五庄观 = {"伤　　害","封印命中"},魔王寨 = {"法术伤害","法术暴击"},狮驼岭 = {"伤　　害","物理暴击"},
    盘丝洞 = {"封印命中","法术防御"},阴曹地府 = {"伤　　害","法术防御"},神木林 = {"法术伤害","法术暴击"},凌波城 = {"伤　　害","物理暴击"},无底洞 = {"封印命中","治疗能力"},
    花果山 = {"伤害","物理暴击"},九黎城 = {"伤害","物理暴击"}
}
local miaoshu={}
miaoshu["速度"]={"速　　度",177}
miaoshu["气血"]={"气　　血",202}
miaoshu["伤害"]={"伤　　害",227}
miaoshu["防御"]={"防    御",227}
miaoshu["封印命中"]={"封印命中",227}
miaoshu["法术伤害"]={"法术伤害",227}
miaoshu["固定伤害"]={"固定伤害",227}
miaoshu["物理暴击"]={"物理暴击",252}
miaoshu["治疗能力"]={"治疗能力",252}
miaoshu["法术暴击"]={"法术暴击",252}
miaoshu["法术防御"]={"法术防御",252}
miaoshu["抵抗封印"]={"抵抗封印",277}

local 神器技能 = {
    藏锋敛锐 = {[1]= "横扫千军消耗的气血有50%的几率转化为等量护盾。",[2]="横扫千军消耗的气血有100%的几率转化为等量护盾。"},
    惊锋     = {[1]= "每次攻击提升自身10点伤害，最多叠加12层，死亡后清零。",[2]="每次攻击提升自身20点伤害，最多叠加12层，死亡后清零。"},
    披坚执锐 = {[1]= "遭受攻击时，有4%的几率免受90%的伤害。",[2]="遭受攻击时，有8%的几率免受90%的伤害。"},
    金汤之固 = {[1]= "气血小于30%时，提升240点抗封等级。",[2]="气血小于30%时，提升480点抗封等级。"},
    风起云墨 = {[1]= "受到你治疗的首目标本回合内受到的所有伤害降低4%。",[2]="受到你治疗的首目标本回合内受到的所有伤害降低8%。"},
    挥毫     = {[1]= "受到你的治疗时，目标每带有一个增益状态，额外恢复25点气血。",[2]="受到你的治疗时，目标每带有一个增益状态，额外恢复50点气血。"},
    盏中晴雪 = {[1]= "若你的速度高于施法者，提升速度差×0.5的抗封等级。",[2]="若你的速度高于施法者，提升速度差×1的抗封等级。"},
    泪光盈盈 = {[1]= "笑里藏刀额外减少目标6点愤怒。",[2]="笑里藏刀额外减少目标12点愤怒。"},
    凭虚御风 = {[1]= "每点被消耗的风灵增加40点法术伤害结果，最多叠加三层，死亡后清零。",[2]="每点被消耗的风灵增加80点法术伤害结果，最多叠加三层，死亡后清零。"},
    钟灵     = {[1]= "被使用3级药是有一定几率获得1层风灵。",[2]="被使用3级药是有较大几率获得1层风灵。"},
    亡灵泣语 = {[1]= "你的锢魂术会使得目标额外受到8%的物法伤害。",[2]="你的锢魂术会使得目标额外受到10%的物法伤害。"},
    魂魇     = {[1]= "被你的物理伤害攻击的单位在当回合内的法术伤害结果减少100点。",[2]="被你的物理伤害攻击的单位在当回合内的法术伤害结果减少200点。"},
    业焰明光 = {[1]= "你的单体法术有50%的几率造成额外25%的伤害。",[2]="你的单体法术有50%的几率造成额外50%的伤害。"},
    流火     = {[1]= "攻击气血百分比小于你的单位时，增加8%的伤害。",[2]="攻击气血百分比小于你的单位时，增加16%的伤害。"},
    蛮血     = {[1]= "增加（1-自身气血/气血上限）×8%的狂暴几率。",[2]="增加（1-自身气血/气血上限）×16%的狂暴几率。"},
    狂战     = {[1]= "每有一个己方召唤兽被击飞，增加30点伤害力，可叠加4层，死亡后消失。",[2]="每有一个己方召唤兽被击飞，增加60点伤害力，可叠加4层，死亡后消失。"},
    镜花水月 = {[1]= "受到治疗时，有8%的几率获得一个等额度的护盾。",[2]="受到治疗时，有16%的几率获得一个等额度的护盾。"},
    澄明     = {[1]= "每回合结束时，增加3点抵抗封印等级。",[2]="每回合结束时，增加6点抵抗封印等级。"},
    情思悠悠 = {[1]= "地涌金莲的目标获得治疗量10%的护盾。",[2]="地涌金莲的目标获得治疗量20%的护盾。"},
    相思     = {[1]= "偶数回合结束时，增加3点速度。",[2]="每个回合结束时，增加3点速度。"},
    弦外之音 = {[1]= "回合结束时，每个主动法宝效果会增加你3点愤怒。",[2]="回合结束时，每个主动法宝效果会增加你6点愤怒。"},
    裂帛     = {[1]= "伤害性法术首目标伤害增加8%。",[2]="伤害性法术首目标伤害增加16%。"},
    定风波   = {[1]= "受到的法术暴击伤害降低30%。",[2]="受到的法术暴击伤害降低60%。"},
    沧浪赋   = {[1]= "攻击气血小于30%的目标时，额外提升120点的法术伤害。",[2]="攻击气血小于30%的目标时，额外提升240点的法术伤害。"},
    斗转参横 = {[1]= "带有状态生命之泉时，日月乾坤命中率增加3%。",[2]="带有状态生命之泉时，日月乾坤命中率增加8%。"},
    静笃     = {[1]= "每次击杀敌方单位，增加60点伤害。",[2]= "每次击杀敌方单位，增加120点伤害。"},
    玉魄     = {[1]= "消耗愤怒的100%转化为下一次释放恢复性技能时的治疗能力。",[2]="消耗愤怒的200%转化为下一次释放恢复性技能时的治疗能力。"},
    璇华     = {[1]= "五行法术克制目标五行时，增加10%的伤害。",[2]="五行法术克制目标五行时，增加20%的伤害。"},
    威服天下 = {[1]= "暴击伤害增加12%。",[2]="暴击伤害增加24%。"},
    酣战     = {[1]= "每点消耗的战意，会提升20点物理暴击等级，可叠加6次，死亡后清零。",[2]="每点消耗的战意，会提升40点物理暴击等级，可叠加6次，死亡后清零。"},
    万物滋长 = {[1]= "使用特技时将会获得（消耗愤怒值×等级×5%）的护盾和气血回复。",[2]="使用特技时将会获得（消耗愤怒值×等级×10%）的护盾和气血回复。"},
    开辟     = {[1]= "每次使用如意神通，提升20点自身伤害，最多叠加6层，死亡后清零。",[2]="每次使用如意神通，提升40点自身伤害，最多叠加6层，死亡后清零。"},
    骇神     = {[1]= "受到物理伤害时，若攻击者物\n理伤害低于你，伤害结果降低\n10%",[2]="受到物理伤害时，若攻击者物\n理伤害低于你，伤害结果降低\n20%"},
    鸣空     = {[1]= "每当令目标浮空时，你获得12\n点狂暴等级并且造成的物理伤\n害结果提高2%，最多叠加6层，\n阵亡后清零",[2]="每当令目标浮空时，你获得24\n点狂暴等级并且造成的物理伤\n害结果提高2%，最多叠加6层，\n阵亡后清零"},


}
local 门派神器名称 = {
    大唐官府 = "轩辕剑",化生寺 = "墨魂笔",方寸山 = "黄金甲",女儿村 = "泪痕碗",天宫 = "独弦琴",
    普陀山 = "华光玉",龙宫 = "清泽谱",五庄观 = "星斗盘",魔王寨 = "明火珠",狮驼岭 = "噬魂齿",
    盘丝洞 = "昆仑镜",阴曹地府 = "四神鼎",神木林 = "月光草",凌波城 = "天罡印",无底洞 = "玲珑结",
    花果山 = "鸿蒙石",九黎城 = "魔息角"
}
local 法宝 = 多开数据[多开数据.当前].__UI界面.窗口层:创建我的窗口("法宝",0,0,726,454)
local 当前 = 多开数据.当前
function 法宝:初始化()
    __置窗口坐标(self)
    local nsf = require('SDL.图像')(726,454)
    if nsf:渲染开始() then
        置窗口背景("法宝",0,12,719,442,true):显示(0,0)
        字体18:置颜色(__取颜色('白色'))
        字体18:取图像('已装备法宝'):显示(28,53)
        字体18:取图像('已装备灵宝'):显示(28,150)
        --__res:getPNGCC(3,694,4,338,273):显示(363,124)
        nsf:渲染结束()
    end
    self:置精灵(nsf:到精灵())
end

function 法宝:打开()
    self:置可见(true)
    self.法灵控件:重置()
    self.法宝按钮:置选中(true)
    self.移动 = false
end

for i, v in ipairs {
    {name = '法宝按钮', x = 370 ,y = 65 , tcp = __res:getPNGCC(3,880,331,86,37,true), tcp2 = __res:getPNGCC(3,876,289,85,36,true) , font = '法宝'},
    {name = '灵宝按钮', x = 490 ,y = 65 , tcp = __res:getPNGCC(3,880,331,86,37,true), tcp2 = __res:getPNGCC(3,876,289,85,36,true) , font = '灵宝'},
    {name = '神器按钮', x = 610 ,y = 65 , tcp = __res:getPNGCC(3,880,331,86,37,true), tcp2 = __res:getPNGCC(3,876,289,85,36,true) , font = '神器'},
} do
    local  临时函数 = 法宝:创建我的单选按钮(v.tcp,v.tcp2,v.name,v.x,v.y,v.font)
    function 临时函数:左键弹起(x, y)
        if v.name == '法宝按钮' then
            法宝.法宝按钮:置选中(true)
            法宝:重置刷新()
        elseif v.name == '灵宝按钮' then
            法宝.灵宝按钮:置选中(true)
            法宝:重置刷新()
        elseif v.name == '神器按钮' then
            法宝.神器按钮:置选中(true)
            发送数据(当前,6203)
            法宝:重置刷新()
        end
    end
end


function 法宝:刷新(神器是否有,神器是否佩戴,位置)
    self.是否有神器 = 神器是否有
    self.是否佩戴神器 = 神器是否佩戴
    self.神器格子 = 位置
    self:重置刷新()
end

function 法宝:重置刷新()
    self.选中道具 = nil
    self.选中法宝 = nil
    self.选中灵宝 = nil
    self.移动 = false
    if self.神器按钮.是否选中 then
        self.法灵控件:置可见(false)
        self.神器控件:置可见(true)
    else
        self.法灵控件:置可见(true)
        self.神器控件:置可见(false)
        if self.法宝按钮.是否选中 then
            self.法灵控件.道具网格:置物品(多开数据[当前].__主控.法宝列表)
        elseif self.灵宝按钮.是否选中 then
            self.法灵控件.道具网格:置物品(多开数据[当前].__主控.灵宝列表)
        end
    end
    self.装备法宝:置物品(多开数据[当前].__主控.法宝佩戴)
    if self.是否佩戴神器 then
        self.装备法宝:置物品({名称=门派神器名称[多开数据[当前].角色信息.门派]},self.神器格子)
        self.神器控件.佩戴:我的按钮置文字(self.神器控件.佩戴,__res:getPNGCC(3,536,560,102,35,true),"卸下")
    else
        self.神器控件.佩戴:我的按钮置文字(self.神器控件.佩戴,__res:getPNGCC(3,536,560,102,35,true),"佩戴")
    end
    self.装备灵宝:置物品(多开数据[当前].__主控.灵宝佩戴)
end


local 装备法宝 = 法宝:创建网格("装备法宝",28,83,300,55)

function 装备法宝:初始化()
    self:创建格子(55,55,0,27,1,4)
end

function 装备法宝:左键弹起(x, y, a, b, msg)
    if self.子控件[a] and self.子控件[a]._spr and self.子控件[a]._spr.物品  then
        local x,y = self.子控件[a]:取坐标()
        local w,h = self.子控件[a]:取宽高()
        if 法宝.选中法宝 and self.子控件[法宝.选中法宝]._spr.物品  then
            if 法宝.选中法宝 == a then
                if self.子控件[a]._spr.格子类型 == "神器道具" then
                  
                else
                    发送数据(当前 or self and self.当前,3734,{序列=a})
                end
            else
                self.子控件[法宝.选中法宝]._spr.确定 = nil
            end
        end
        法宝.选中法宝 = a
        self.子控件[a]._spr.确定 = true
        if self.子控件[a]._spr.格子类型 == "神器道具" then
           
        else
            self.子控件[a]._spr:详情打开(520,86,w,h,'装备法宝',a)
        end
    end
end
function 装备法宝:置物品(数据,bh)
    if bh == nil then
        for i = 1,#self.子控件 do
            local lssj = __物品格子.创建(当前)
            lssj:置物品(数据[i],"白格子","战斗道具")
            self.子控件[i]:置精灵(lssj)
        end
    else
        local lssj = __物品格子.创建(当前)
        lssj:置物品(数据,"白格子","神器道具")
        self.子控件[bh]:置精灵(lssj)
    end
end

local 装备灵宝 = 法宝:创建网格("装备灵宝",28,180,150,55)

function 装备灵宝:初始化()
    self:创建格子(55,55,0,27,1,2)
end

function 装备灵宝:左键弹起(x, y, a, b, msg)
    if self.子控件[a] and self.子控件[a]._spr and self.子控件[a]._spr.物品 then
        local x,y = self.子控件[a]:取坐标()
        local w,h = self.子控件[a]:取宽高()
        if 法宝.选中灵宝 and self.子控件[法宝.选中灵宝]._spr.物品  then
            if 法宝.选中灵宝 == a then
                发送数据(当前 or self and self.当前,3753,{序列=a})
            else
                self.子控件[法宝.选中灵宝]._spr.确定 = nil
            end
        end
        法宝.选中灵宝 = a
        self.子控件[a]._spr.确定 = true
        self.子控件[a]._spr:详情打开(520,86,w,h,'装备灵宝',a)
    end
end

function 装备灵宝:置物品(数据)
    if 数据 then
        for i = 1,#self.子控件 do
            local lssj = __物品格子.创建(当前)
            lssj:置物品(数据[i],"白格子","战斗道具")
            self.子控件[i]:置精灵(lssj)
        end
    end
end

function 法宝:神器刷新(数据)
    self.神器属性 = 数据
    if self.是否有神器 then
        self.神器控件:重置()
    end
    if self.是否佩戴神器 then
        self.装备法宝:置物品({名称=门派神器名称[多开数据[当前].角色信息.门派]},self.神器格子)
        self.神器控件.佩戴:我的按钮置文字(self.神器控件.佩戴,__res:getPNGCC(3,536,560,102,35,true),"卸下")
    else
        self.神器控件.佩戴:我的按钮置文字(self.神器控件.佩戴,__res:getPNGCC(3,536,560,102,35,true),"佩戴")
    end
end

function 法宝:更新神器属性(数据)
    self.神器属性 = 数据
    if self.是否有神器 then
        self.神器控件:重置()
    end
    if self.是否佩戴神器 then
        self.装备法宝:置物品({名称=门派神器名称[多开数据[当前].角色信息.门派]},self.神器格子)
        self.神器控件.佩戴:我的按钮置文字(self.神器控件.佩戴,__res:getPNGCC(3,536,560,102,35,true),"卸下")
    else
        self.神器控件.佩戴:我的按钮置文字(self.神器控件.佩戴,__res:getPNGCC(3,536,560,102,35,true),"佩戴")
    end
end


local 神器控件 = 法宝:创建控件('神器控件',0,0,726, 454)
function 神器控件:重置()
    self.属性数值 = {速度=0,气血=0,抵抗封印=0}
	for n=1,2 do
	    if 神器属性[多开数据[当前].角色信息.门派][n] == "伤　　害" then
	    	self.属性数值.伤害 = 0
	    elseif 神器属性[多开数据[当前].角色信息.门派][n] == "防　　御" then
	    	self.属性数值.防御 = 0
	    else
	        self.属性数值[神器属性[多开数据[当前].角色信息.门派][n]] = 0
	    end
	end
	for k,v in pairs(法宝.神器属性.神器解锁) do
	    for n=1,#v.神器五行属性 do
	    	if self.属性数值[v.神器五行属性[n]] then
	    	    self.属性数值[v.神器五行属性[n]] = self.属性数值[v.神器五行属性[n]] + v.神器五行数值[n]
	    	end
	    end
	end
    self.介绍:清空()
    self.介绍:置文本(神器技能[法宝.神器属性.神器技能.name][法宝.神器属性.神器技能.lv])
    local nsf = require('SDL.图像')(726,454)
    if nsf:渲染开始() then
        取白色背景(0,0,300,240,true):显示(370,120)
        __res:取图像(__res:取地址("shape/ui/xz/", 神器大图与坐标[多开数据[当前].角色信息.门派][1])):显示(神器大图与坐标[多开数据[当前].角色信息.门派][2]+110,神器大图与坐标[多开数据[当前].角色信息.门派][3]+60)
        __res:取图像(__res:取地址("shape/ui/xz/", 神器大图与坐标[多开数据[当前].角色信息.门派][4])):显示(390,150)
        字体18:置颜色(__取颜色('白色'))
        字体18:取图像("剩余灵气："..法宝.神器属性.灵气):显示(540,330)
        字体18:取图像('加成'):显示(60,250)
        for k,v in pairs(self.属性数值) do
			if v>0 then
				字体18:取图像(miaoshu[k][1].." +"..v):显示(30,miaoshu[k][2]+110)
			else
			    字体18:取图像(miaoshu[k][1].." +0"):显示(30,miaoshu[k][2]+110)
			end
		end
        字体18:取图像(法宝.神器属性.神器技能.name):显示(220,250)
        nsf:渲染结束()
    end
    self:置精灵(nsf:到精灵())    
end

local 介绍 = 神器控件:创建我的文本("介绍",210,290,150,120)

for i, v in ipairs {
    {name = '切换技能', x = 28 ,y = 410 , tcp = __res:getPNGCC(3,536,560,102,35,true) , font = '切换技能'},
    {name = '佩戴', x = 345 ,y = 410 , tcp = __res:getPNGCC(3,536,560,102,35,true) , font = '佩戴'},
    {name = '修复', x = 465 ,y = 410 , tcp = __res:getPNGCC(3,536,560,102,35,true) , font = '修复'},
    {name = '补充灵气', x = 585 ,y = 410 , tcp = __res:getPNGCC(3,536,560,102,35,true) , font = '补充灵气'},
} do
    local  临时函数 = 神器控件:创建我的按钮(v.tcp,v.name,v.x,v.y,v.font)
    function 临时函数:左键弹起(x, y)
        if v.name == '切换技能' then
            发送数据(当前,3817)
        elseif v.name == "修复" then
            发送数据(当前,6210)
        elseif v.name == "佩戴" then
            if 法宝.是否佩戴神器 and 法宝.神器格子 then
                发送数据(当前 or self and self.当前,3734,{序列=a,神器=true})
            else
                local h
                for i=1,4 do
                    if 法宝.装备法宝.子控件[i] and 法宝.装备法宝.子控件[i]._spr and not 法宝.装备法宝.子控件[i]._spr.物品 then
                        h = i
                        break
                    end
                end
                if h then
                    发送数据(当前 or self and self.当前,3735,{序列="神器",序列1=h}) --pd
                else
                    多开数据[当前 or self and self.当前].__UI弹出.提示框:打开('#Y请先卸下一件法宝')
                end
            end
        end
    end
end



function 法宝:佩戴神器(内容)
    self.是否佩戴神器 = 内容.是否
    self.神器格子=内容.格子
    self:刷新(true,self.是否佩戴神器,self.神器格子)
end

local 法灵控件 = 法宝:创建控件('法灵控件',0,0,726, 454)
function 法灵控件:重置()
    local nsf = require('SDL.图像')(726,454)
    if nsf:渲染开始() then
        local lssc = 取输入背景(0, 0, 216, 23)
        字体18:取图像('法宝名称'):显示(28,251)
        lssc:显示(109,249)
        字体18:取图像('升级经验'):显示(28,280)
        lssc:显示(109,278)
        字体18:取图像('修炼经验'):显示(28,309)
        lssc:显示(109,307)
        字体18:取图像('法宝移动至'):显示(355,415)
        字体16:置颜色(__取颜色('白色'))
        字体16:取图像('双击法宝进行装备'):显示(560,103)
        nsf:渲染结束()
    end
    self:置精灵(nsf:到精灵())    
end
local 道具网格 = 法灵控件:创建网格("道具网格",363,124,339,272)

function 道具网格:初始化()
    self:创建格子(67,67,0,0,10,5,true)
end

function 道具网格:左键弹起(x, y, a, b, msg)
    if self.子控件[a] and self.子控件[a]._spr and self.子控件[a]._spr.物品 then
        local x,y = self.子控件[a]:取坐标()
        local w,h = self.子控件[a]:取宽高()
        if 法宝.选中道具 and self.子控件[法宝.选中道具]._spr.物品  then
            if 法宝.选中道具 == a then
                if 法宝.法宝按钮.是否选中 then
                    local h
                    for i=1,4 do
                        if 法宝.装备法宝.子控件[i] and 法宝.装备法宝.子控件[i]._spr and not 法宝.装备法宝.子控件[i]._spr.物品 then
                            h = i
                            break
                        end
                    end
                    if h then
                        发送数据(当前 or self and self.当前,3735,{序列=法宝.选中道具,序列1=h})
                    else
                        多开数据[当前 or self and self.当前].__UI弹出.提示框:打开('#Y请先卸下法宝')
                    end
                elseif 法宝.灵宝按钮.是否选中 then
                    local h
                    for i, v in ipairs(法宝.装备灵宝.子控件) do
                        if not v._spr.物品 then
                            h = i
                        end
                    end
                    if h then
                        发送数据(当前 or self and self.当前,3754,{序列=法宝.选中道具,序列1=h})
                    else
                       多开数据[当前 or self and self.当前].__UI弹出.提示框:打开('#Y请先卸下灵宝')
                    end
                end
            else
                self.子控件[法宝.选中道具]._spr.确定 = nil
                if 法宝.移动 then
                    if 法宝.法宝按钮.是否选中 then
                        发送数据(当前 or self and self.当前,3701,{抓取id=法宝.选中道具,放置id=a,放置类型="法宝",抓取类型="法宝"})
                    elseif 法宝.灵宝按钮.是否选中 then
                        发送数据(当前 or self and self.当前,3701,{抓取id=法宝.选中道具,放置id=a,放置类型="灵宝",抓取类型="灵宝"})
                    end
                end
            end
        end
        法宝.选中道具 = a
        self.子控件[a]._spr.确定 = true
        self.子控件[a]._spr:详情打开(70,86,w,h,"法宝",a)
    else
        if 法宝.移动 and 法宝.选中道具 then
            if 法宝.法宝按钮.是否选中 then
                发送数据(当前 or self and self.当前,3701,{抓取id=法宝.选中道具,放置id=a,放置类型="法宝",抓取类型="法宝"})
            elseif 法宝.灵宝按钮.是否选中 then
                发送数据(当前 or self and self.当前,3701,{抓取id=法宝.选中道具,放置id=a,放置类型="灵宝",抓取类型="灵宝"})
            end
        end
    end
end

function 道具网格:置物品(data)
    for i = 1,#self.子控件 do
        local lssj = __物品格子.创建(当前)
        lssj:置物品(data[i],"白格子","战斗道具")
        self.子控件[i]:置精灵(lssj)
    end
end

for i, v in ipairs {
    {name = '使用', x = 10 ,y = 410 , tcp = __res:getPNGCC(3,536,560,102,35,true), font = '使用'},
    {name = '修炼', x = 115 ,y = 410 , tcp = __res:getPNGCC(3,536,560,102,35,true), font = '修炼'},
    {name = '本命法宝', x = 133+87 ,y = 410 , tcp = __res:getPNGCC(3,536,560,102,35,true), font = '本命法宝'},
    {name = '补充灵气', x = 133+87 ,y = 370 , tcp = __res:getPNGCC(3,536,560,102,35,true), font = '补充灵气'},

    -- {name = '上一页', x = 353 ,y = 407 , tcp = __res:getPNGCC(3,335,561,96,35) },
    -- {name = '下一页', x = 592 ,y = 407 , tcp = __res:getPNGCC(3,436,561,96,34) },
    {name = '道具', x = 466 ,y = 410 , tcp = __res:getPNGCC(3,536,560,102,35,true) , font = '道具'},
    {name = '行囊', x = 585 ,y = 410 , tcp = __res:getPNGCC(3,536,560,102,35,true) , font = '行囊'},
} do
    local  临时函数 = 法灵控件:创建我的按钮(v.tcp,v.name,v.x,v.y,v.font)
    function 临时函数:左键弹起(x, y)
        if v.name == '使用' then
            if 法宝.法宝按钮.是否选中 then
                if 法宝.选中道具 then
                    发送数据(当前 or self and self.当前,3736,{序列=法宝.选中道具})
                end
            else
               多开数据[当前 or self and self.当前].__UI弹出.提示框:打开('#Y请先选中要使用的法宝')
            end
        
        elseif v.name == "补充灵气" then
            if 法宝["法宝按钮"]["是否选中"] then
                if 法宝["选中道具"] then
                发送数据(当前 or self and self.当前,3742, {
                    ["序列"] = 法宝["选中道具"]
                })
                end
            else
               多开数据[当前 or self and self.当前].__UI弹出.提示框:打开('#Y请先选中要修炼的法宝')
            end

        elseif v.name == '修炼' then
            if 法宝.法宝按钮.是否选中 then
                if 法宝.选中道具 then
                    发送数据(当前 or self and self.当前,3733,{序列=法宝.选中道具})
                end
            elseif 法宝.灵宝按钮.是否选中 then
                if 法宝.选中道具 then
                    发送数据(当前 or self and self.当前,3752,{序列=法宝.选中道具})
                end
            else
               多开数据[当前 or self and self.当前].__UI弹出.提示框:打开('#Y请先选中要修炼的法宝')
            end
        elseif v.name == '本命法宝' then
                发送数据(当前 or self and self.当前,193,{序号1=1})
                法宝:置可见(false)
        elseif v.name == '上一页' then

        elseif v.name == '下一页' then

        elseif v.name == '道具' then
            if 法宝.法宝按钮.是否选中 then
                if 法宝.选中道具 then
                    发送数据(当前 or self and self.当前,3746,{序列=法宝.选中道具,放置类型="道具",抓取类型="法宝",})
                    法宝.关闭:左键弹起()
                end
            else
               多开数据[当前 or self and self.当前].__UI弹出.提示框:打开('#Y请先选中要移动的法宝')
            end
        elseif v.name == '行囊' then
            if 法宝.法宝按钮.是否选中 then
                if 法宝.选中道具 then
                    发送数据(当前 or self and self.当前,3746,{序列=法宝.选中道具,放置类型="行囊",抓取类型="法宝",})
                    法宝.关闭:左键弹起()
                end
            else
               多开数据[当前 or self and self.当前].__UI弹出.提示框:打开('#Y请先选中要移动的法宝')
            end
        end
    end
end


local 关闭 = 法宝:创建我的按钮(__res:getPNGCC(1,401,0,46,46),"关闭",676,0)

function 关闭:左键弹起(x,y,msg)
    法宝:置可见(false)
end 


