--[[
    @Author       : GGELUA
    @Date         : 2022-04-30 11:57:17
Last Modified by: GGELUA
Last Modified time: 2023-07-27 12:49:47
--]]
local 潜能果 = 多开数据[多开数据.当前].__UI界面.窗口层:创建我的窗口("潜能果",0,0,640,454)
local 当前 = 多开数据.当前
function 潜能果:初始化()
    __置窗口坐标(self)
    local nsf = require('SDL.图像')(640,454)
    if nsf:渲染开始() then
        置窗口背景("潜能果",0,12,600,440,true):显示(50,0)
        取白色背景(0, 0, 550, 135,true):显示(68,50)
        字体18:置颜色(__取颜色("黑色"))
        字体18:取图像("潜能果是一种能把经验转化为潜力的果子。\n90级＞人物等级≥60级，可食用50个；\n渡劫155级＞人物等级≥90级，可食用100个；\n渡劫170级＞人物等级≥155级，可食用150个；\n人物等级≥渡劫170级，可食用200个。"):显示(100,70)
        字体18:置颜色(__取颜色("白色"))
        字体18:取图像("当前已食用潜能果："):显示(100,210)
        字体18:取图像("还能再食用："):显示(400,210)
        字体18:取图像("当前可用经验点数："):显示(100,260)
        字体18:取图像("下一个果所需经验："):显示(100,310)
        nsf:渲染结束()
    end
    self:置精灵(nsf:到精灵())
end

function 潜能果:打开(data)
    self:置可见(true)
    self:重置(data)
end

function 潜能果:更新数据(data)
    self:重置(data)
end

function 潜能果:重置(data)
    self.数据 = data
    local nsf = require('SDL.图像')(640,454)
    if nsf:渲染开始() then
        字体18:置颜色(__取颜色("黄色"))
        字体18:取图像(self.数据.已食用潜能果):显示(260,210)
        字体18:取图像(self.数据.剩余潜能果):显示(510,210)
        字体18:取图像(self.数据.可用经验):显示(260,260)
        字体18:取图像(self.数据.下个经验):显示(260,310)
        nsf:渲染结束()
    end
    self.图像 = nsf:到精灵()
end

local 关闭 = 潜能果:创建我的按钮(__res:getPNGCC(1,401,0,46,46),"关闭",600,0)

function 关闭:左键弹起(x,y,msg)
    潜能果:置可见(false)
end

for i, v in ipairs {
    {name = '食用潜能果', x = 180 ,y = 394 , tcp = __res:getPNGCC(3,511,11,117,43,true):拉伸(152,43) , tcp2 = __res:getPNGCC(3,390,12,118,43,true):拉伸(152,43) , font = '食用潜能果'},
    {name = '取消', x = 350 ,y = 394 , tcp = __res:getPNGCC(3,511,11,117,43,true):拉伸(152,43) , tcp2 = __res:getPNGCC(3,390,12,118,43,true):拉伸(152,43) , font = '取消'},
} do
    local 临时函数 = 潜能果:创建我的按钮(v.tcp,v.name,v.x,v.y,v.font)
    function 临时函数:左键弹起(x, y)
        if v.name == '食用潜能果' then
            多开数据[当前].__UI界面.窗口层.对话栏:打开({
                                    模型 = "长眉灵猴",
                                    名称 = "老猕猴",
                                    对话 = "你当前已食用"..潜能果.数据.已食用潜能果.."个潜能果，需要消耗"..潜能果.数据.下个经验.."点经验才能食用下一个，你是否需要继续食用？",
                                    选项 = { "是", "否" },
                                    回调处理 = nil
                                })
        elseif v.name == '取消' then
            潜能果:置可见(false)
        end
    end
end