local 神器更换五行 = 多开数据[多开数据.当前].__UI界面.窗口层:创建我的窗口("神器更换五行",0,0,660,560)
local 当前 = 多开数据.当前
local 神器属性 = {
    大唐官府 = {"伤　　害","物理暴击"},化生寺 = {"防　　御","治疗能力"},方寸山 = {"封印命中","法术伤害"},女儿村 = {"封印命中","固定伤害"},天宫 = {"法术伤害","封印命中"},
    普陀山 = {"固定伤害","治疗能力"},龙宫 = {"法术伤害","法术暴击"},五庄观 = {"伤　　害","封印命中"},魔王寨 = {"法术伤害","法术暴击"},狮驼岭 = {"伤　　害","物理暴击"},
    盘丝洞 = {"封印命中","法术防御"},阴曹地府 = {"伤　　害","法术防御"},神木林 = {"法术伤害","法术暴击"},凌波城 = {"伤　　害","物理暴击"},无底洞 = {"封印命中","治疗能力"},
    花果山 = {"伤　　害","物理暴击"},九黎城 = {"伤　　害","物理暴击"}
}
local 神器图 = {
    大唐官府 = {{0x467F2FCB,0x732620A1,0xAF99EF70}},化生寺 = {{0xBCD2FD04,0x94748447,0x23906569}},方寸山 = {{0xF4468EB3,0x7ADF0AD5,0x6AD0DD5B}},女儿村 = {{0x2FE3D5CB,0xAE659408,0x478C415A}},
    天宫 = {{0x861333DE,0xD3F019A9,0xD90C5658}},普陀山 = {{0xACD7AC8C,0xA26045E7,0xAF7234E1}},龙宫 = {{0x64893E31,0xC5A94CBC,0xC163A3CB}},五庄观 = {{0x7C4D3F9D,0x0A7537A9,0xF9CE015C}},
    魔王寨 = {{0x01AC0038,0x01AC0039,0x01AC0040},{"Resource.ft"}},狮驼岭 = {{0x898E3905,0xC621DCE5,0x768B550B}},盘丝洞 = {{0x767F7971,0x72527A8B,0x9F45CA15}},阴曹地府 = {{0xE4E601D2,0x04847348,0x8F90B0F7}},
    神木林 = {{0x01AC0037,0x96D9A247,0x1934A199},{"Resource.ft"}},凌波城 = {{0xC068EA63,0x8794D94E,0xC0AA056C}},无底洞 = {{0x2034FC4A,0x0CBEA6CD,0xFFC9DADB}},花果山 = {{0x861333DE,0xD3F019A9,0xD90C5658}},
    九黎城 = {{0x467F2FCB,0x732620A1,0xAF99EF70}},
}
local 五行图 = {
    金 = 0x01AC0010,木 = 0x01AC0011,水 = 0x01AC0012,火 = 0x01AC0013,土 = 0x01AC0014
}
local 神器图坐标 = {{292,32},{430,32}}
local 五行坐标 = {{405,153},{473,219},{407,286},{338,221}}
local 新五行坐标 = {{403,152},{471,218},{405,285},{336,220}}

function 神器更换五行:初始化()
    __置窗口坐标(self)
end



function 神器更换五行:打开(数据)
    self:置可见(true)
    self.神器属性=数据
    self:五行重置()
    self:重置()
end

function 神器更换五行:重置数据(数据)
    self.神器属性=数据
    self:五行重置()
    self:重置()
end
function 神器更换五行:新五行(数据)
    self.新五行属性 = 数据
    self:五行重置()
end

function 神器更换五行:重置()
    local nsf = require('SDL.图像')(660,560)
    if nsf:渲染开始() then
		__res:取图像(__res:取地址("shape/ui/xz/", 0xA00000B1)):拉伸(660,460):显示(0,60)
        __res:取图像(__res:取地址("shape/ui/xz/", 0xC057E026)):显示(0,30)  --5
        __res:取图像(__res:取地址("shape/ui/xz/", 0xA00000B4)):显示(215,35)  --7
        __res:取图像(__res:取地址("shape/ui/xz/", 0x258AF3A3)):显示(290,30)  --4
        __res:取图像(__res:取地址("shape/ui/xz/", 0xA00000B3)):显示(20,130)  --6
        __res:取图像(__res:取地址("shape/ui/xz/", 0x42DE086A)):显示(45,205)  --8
        __res:取图像(__res:取地址("shape/ui/xz/", 0xC840D36F)):显示(73,240)  --9
        __res:取图像(__res:取地址("shape/ui/xz/", 0x01AC0008)):显示(123,300)  --10
        __res:取图像(__res:取地址("shape/ui/xz/", 0x01AC0008)):显示(123,330)  --10
        字体14:置颜色(__取颜色("白色"))
        字体14:取图像("体力消耗     10"):显示(45,302)
        字体14:取图像("金钱消耗     100000"):显示(45,332)
        字体14:取图像("金：速　　度"):显示(65,140)
        字体14:取图像("木：气　　血"):显示(65,160)
        字体14:取图像("水："..神器属性[多开数据[当前].角色信息.门派][1]):显示(65,180)
        字体14:取图像("火："..神器属性[多开数据[当前].角色信息.门派][1]):显示(65,200)
        字体14:取图像("土：抵抗封印"):显示(65,220)
        nsf:渲染结束()
    end
    self:置精灵(nsf:到精灵())
    for n=1,3 do
        local dz = __res:取地址('shape/ui/xz/',神器图[多开数据[当前].角色信息.门派][1][n])
        神器更换五行["神器"..n]:重置was(dz)
        if self.神器属性.神器解锁[n]==nil then
            神器更换五行["神器"..n]:置禁止(true)
        elseif self.选中 == n then
            神器更换五行["神器"..n]:置选中(true)
        end
    end
end

function 神器更换五行:五行重置()
    if self.新五行属性 == nil then
        神器更换五行.五行控件:置可见(true)
        神器更换五行.新五行控件:置可见(false)
        神器更换五行.放弃:置可见(false)
        神器更换五行.保存:置可见(false)
        神器更换五行.开始:置可见(true)
        for n=1,3 do
            if self.神器属性.神器解锁[n]==nil then
                神器更换五行["神器"..n]:置禁止(true)
            elseif self.选中 == n then
                神器更换五行["神器"..n]:置禁止(false)
                神器更换五行["神器"..n]:置选中(true)
            else
                神器更换五行["神器"..n]:置禁止(false)
            end
        end
        for n=1,3 do
            if self.神器属性.神器解锁[n]~=nil then
                if self.选中 == nil then 
                    self.选中 = n 
                    break 
                end
            end
        end
        self.五行控件:重置(n)
    else
        神器更换五行.五行控件:置可见(false)
        神器更换五行.新五行控件:置可见(true)
        神器更换五行.新五行控件:重置()
        神器更换五行.放弃:置可见(true)
        神器更换五行.保存:置可见(true)
        神器更换五行.开始:置可见(false)
        for n=1,3 do
            if n ~= self.选中 then
                神器更换五行["神器"..n]:置禁止(true)
            else
                神器更换五行["神器"..n]:置禁止(false)
                神器更换五行["神器"..n]:置选中(true)
            end
        end
    end
end

local 五行控件 = 神器更换五行:创建控件('五行控件',0,0,660, 460)
function 五行控件:重置()
    local nsf = require('SDL.图像')(660,460)
    if nsf:渲染开始() then
        __res:取图像(__res:取地址("shape/ui/xz/", 0xE4C15C10)):显示(313,120+70)  --当前源泉
        __res:取图像(__res:取地址("shape/ui/xz/", 0xACEB1F9B)):显示(311,119+70)  --更改圆圈
        __res:取图像(__res:取地址("shape/ui/xz/", 0xF3A1A9B3)):显示(394,217+70)  --当前
        for i=1,4 do
            local 地址 = 五行图[神器更换五行.神器属性.神器解锁[神器更换五行.选中].神器五行[i]]
            __res:取图像(__res:取地址("shape/ui/xz/", 0x01AC0007)):显示(五行坐标[i][1]-8,五行坐标[i][2]+62)
            __res:取图像(__res:取地址("shape/ui/xz/", 地址)):显示(五行坐标[i][1],五行坐标[i][2]+70)  --10
        end
        nsf:渲染结束()
    end
    self:置精灵(nsf:到精灵())
end

local 新五行控件 = 神器更换五行:创建控件('新五行控件',0,0,660, 460)
function 新五行控件:重置()
    local nsf = require('SDL.图像')(660,460)
    if nsf:渲染开始() then
        __res:取图像(__res:取地址("shape/ui/xz/", 0xE4C15C10)):显示(313+100,120+70)  --当前源泉
        __res:取图像(__res:取地址("shape/ui/xz/", 0xACEB1F9B)):显示(311+100,119+70)  --更改圆圈
        __res:取图像(__res:取地址("shape/ui/xz/", 0xA0FB07B8)):显示(390+100,217+70)  --当前
        for i=1,4 do
            local 地址 = 五行图[神器更换五行.新五行属性[i]]
            __res:取图像(__res:取地址("shape/ui/xz/", 0x01AC0007)):显示(五行坐标[i][1]+100-8,五行坐标[i][2]+62)
            __res:取图像(__res:取地址("shape/ui/xz/", 地址)):显示(五行坐标[i][1]+100,五行坐标[i][2]+70)  --10
        end
        __res:取图像(__res:取地址("shape/ui/xz/", 0xE4C15C10)):显示(313-70,120+70)  --当前源泉
        __res:取图像(__res:取地址("shape/ui/xz/", 0xACEB1F9B)):显示(311-70,119+70)  --更改圆圈
        __res:取图像(__res:取地址("shape/ui/xz/", 0xF3A1A9B3)):显示(394-70,217+70)  --当前
        for i=1,4 do
            local 地址 = 五行图[神器更换五行.神器属性.神器解锁[神器更换五行.选中].神器五行[i]]
            __res:取图像(__res:取地址("shape/ui/xz/", 0x01AC0007)):显示(五行坐标[i][1]-70-8,五行坐标[i][2]+62)
            __res:取图像(__res:取地址("shape/ui/xz/", 地址)):显示(五行坐标[i][1]-70,五行坐标[i][2]+70)  --10
        end
        nsf:渲染结束()
    end
    self:置精灵(nsf:到精灵())
end

local lsb = {"神器1","神器2","神器3"}
for i=1,#lsb do
    local dz = __res:取地址('shape/ui/xz/',神器图["大唐官府"][1][i])
    local 临时函数 = 神器更换五行:创建我的was单选按钮1(dz,lsb[i],170+i*100,110)
    function 临时函数:左键按下(消息,x,y)
        神器更换五行.选中=i
        神器更换五行:五行重置()
    end
end

local 开始 = 神器更换五行:创建我的按钮(__res:取图像(__res:取地址("shape/ui/xz/", 0x01AC0015)),"开始",340,417)
function 开始:左键弹起(x,y,msg)
    发送数据(当前,6225)
end

local 放弃 = 神器更换五行:创建我的按钮(__res:取图像(__res:取地址("shape/ui/xz/", 0x01AC0036)),"放弃",270,417)
function 放弃:左键弹起(x,y,msg)
    神器更换五行.新五行属性 = nil
    神器更换五行:五行重置()
end

-- local 保存 = 神器更换五行:创建我的按钮(__res:取图像(__res:取地址("shape/ui/xz/", 0x01AC0015)),"保存",440,417)
local 保存 = 神器更换五行:创建我的按钮(__res:getPNGCC(3, 511, 11, 117, 43, true):拉伸(150,31), "保存", 440, 417., "保存五行")

function 保存:左键弹起(x,y,msg)
    发送数据(当前,6226,{神器部件=神器更换五行.选中,五行=神器更换五行.新五行属性})
    神器更换五行.新五行属性 = nil
    神器更换五行:五行重置()
end


local 关闭 = 神器更换五行:创建我的按钮(__res:取图像(__res:取地址("shape/ui/xz/", 0x20FD5715)),"关闭",610,60)

function 关闭:左键弹起(x,y,msg)
    神器更换五行:置可见(false)
end
