local SDLF = require('SDL.函数')
local 神来攻略 = 多开数据[多开数据.当前].__UI界面.窗口层:创建我的窗口("神来攻略", 0, 0, 830, 544)
local 当前 = 多开数据.当前
local 发送内容 = {
    -- --------------------------------------
    方寸山 = { 1135, 72, 63 }, -- 方寸山"),
    盘丝洞 = { 1513, 174, 31 }, -- 盘丝洞"),
    天宫 = { 1111, 175, 122 }, -- 天宫"),
    天机城 = { 1250, 63, 92 }, -- 天机城"),
    女儿村 = { 1142, 37, 37 }, -- 女儿村"),
    阴曹地府 = { 1122, 101, 102 }, -- 阴曹地府"),
    普陀山 = { 1140, 20, 18 }, -- 普陀山"),
    女魃墓 = { 1249, 51, 44 }, -- 女魃墓"),
    神木林 = { 1138, 46, 121 }, -- 神木林"),
    无底洞 = { 1139, 61, 125 }, -- 无底洞"),
    凌波城 = { 1150, 33, 67 }, -- 凌波城"),
    花果山 = { 1251, 38, 76 }, -- 花果山"),
    化生寺 = { 1002, 7, 88 }, -- 化生寺"),
    魔王寨 = { 1512, 76, 29 }, -- 魔王寨"),
    五庄观 = { 1146, 26, 55 }, -- 五庄观"),
    大唐官府 = { 1198, 131, 82 }, -- 大唐官府"),
    狮驼岭 = { 1131, 109, 77 }, -- 狮驼岭"),
    龙宫 = { 1116, 71, 77 }, -- 龙宫"),
    九黎城 = { 1580,57,117 }, -- 九黎城"),
    乌鸡国 = {1026,29,25},--乌鸡国
    车迟斗法 = {1070,131,144},--车迟斗法
    黑风山 = {1110,70,275},--黑风山
    水陆大会 = {1002,35,76},--水陆大会
    通天河 = {1070,47,71},--通天河
    红孩儿 = {1210,168,23},--红孩儿
    泾河龙王 = {1044,68,52},--泾河龙王
    七绝山 = {1173,79,43},--七绝山
    齐天大圣 = {1092,196,17},--齐天大圣
    大闹天空 = {1070,50,192},--大闹天空
    无底洞 = {1040,85,33},--无底洞
    秘境降妖 = {1001,111,52},--秘境降妖
    一珠 = {1501,48,13},--一珠
    双城记 = {1501,48,13},--双城记
    五更寒 = {1501,48,13},--五更寒
    手动抓鬼 = {5958,119,30},--手动抓鬼
    杜少海 = {1001,407,211},--杜少海
    游泳比赛 = {1092,145,62},--游泳比赛
    雁塔地宫 = {1001,445,45},--雁塔地宫
    文韵墨香 = {1001,233,168},--文韵墨香
    降妖除魔 = {1040,137,104},--降妖除魔
    天降晨星 = {1001,128,97},--天降晨星
    彩虹争霸 = {1208,104,45},--彩虹争霸
    帮会迷宫 = {1001,393,19},--帮会迷宫
    帮战 = {1001,365,109},--帮战
    剑会PK = {1001,145,177},--剑会PK
    门派闯关 = {1001,128,90},--门派闯关
    保卫长安 = {1001,110,49},--保卫长安
    比武大会 = {1001,111,168},--比武大会
 
   
    -- ------------------------------

}





function 神来攻略:初始化()
    __置窗口坐标(self)
    local nsf = require('SDL.图像')(830, 534)
    if nsf:渲染开始() then
        __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000025)):显示(0, 0)
        nsf:渲染结束()
    end
    self:置精灵(nsf:到精灵())
end

function 神来攻略:打开()
    self:置可见(true)


    神来攻略.五开教程:置选中(true)
    神来攻略.五开教程控件:置可见(true)
    神来攻略.新手攻略:置选中(false)
    神来攻略.新手攻略控件:置可见(false)
    神来攻略.每日副本:置选中(false)
    神来攻略.每日副本控件:置可见(false)
    神来攻略.必做活动:置选中(false)
    神来攻略.必做活动控件:置可见(false)
    神来攻略.门派传送:置选中(false)
    神来攻略.门派传送控件:置可见(false)
    神来攻略.门派建议:置选中(false)
    神来攻略.门派建议控件:置可见(false)
    神来攻略.造号攻略:置选中(false)
    神来攻略.造号攻略控件:置可见(false)
    神来攻略.新手活动:置选中(false)
    神来攻略.新手活动控件:置可见(false)
    神来攻略.进阶增强:置选中(false)
    神来攻略.进阶增强控件:置可见(false)
    神来攻略.炼妖合宠:置选中(false)
    神来攻略.炼妖合宠控件:置可见(false)
end

function 神来攻略:刷新()
end

--创建显示区域
local 五开教程控件 = 神来攻略:创建控件('五开教程控件', 100, 0, 700, 370)

local 五开教程 = 神来攻略:创建我的单选按钮(__res:取图像(__res:取地址("shape/ui/xz/", 0x0D000028)),
    __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000028)), "五开教程", 20, 50, " ")

function 五开教程:左键按下(x, y, msg)
    神来攻略.五开教程:置选中(true)
    神来攻略.新手攻略:置选中(false)
    神来攻略.每日副本:置选中(false)
    神来攻略.必做活动:置选中(false)
    神来攻略.门派传送:置选中(false)
    神来攻略.门派传送控件:置可见(false)
    神来攻略.必做活动控件:置可见(false)
    神来攻略.每日副本控件:置可见(false)
    神来攻略.新手攻略控件:置可见(false)
    神来攻略.五开教程控件:置可见(true)
    神来攻略.门派建议:置选中(false)
    神来攻略.造号攻略:置选中(false)
    神来攻略.新手活动:置选中(false)
    神来攻略.进阶增强:置选中(false)
    神来攻略.炼妖合宠:置选中(false)

    神来攻略.炼妖合宠控件:置可见(false)
    神来攻略.进阶增强控件:置可见(false)
    神来攻略.新手活动控件:置可见(false)
    神来攻略.造号攻略控件:置可见(false)
    神来攻略.门派建议控件:置可见(false)
    local nsf = require('SDL.图像')(700, 360)
    if nsf:渲染开始() then
        -- 取白色背景(0,0,450,315,true):显示(195,30)
        nsf:渲染结束()
    end
    神来攻略.图像 = nsf:到精灵()
end

for i, v in ipairs {
    { name = '五开教程1', x = 49, y = 50 - 32 + 12 + 4, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000083)) }, --五开教程

} do
    local 临时函数 = 五开教程控件:创建我的按钮(v.tcp, v.name, v.x, v.y, v.font)
    function 临时函数:左键弹起(x, y)
        -- 发送数据(当前 or self and self.当前,100.5,发送内容[v.name])
    end
end
local 新手攻略控件 = 神来攻略:创建控件('新手攻略控件', 100, 0, 700, 370)

local 新手攻略 = 神来攻略:创建我的单选按钮(__res:取图像(__res:取地址("shape/ui/xz/", 0x0D000023)),
    __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000023)), "新手攻略", 20, 50 + 1 * 35, " ")

function 新手攻略:左键按下(x, y, msg)
    神来攻略.五开教程:置选中(false)
    神来攻略.新手攻略:置选中(true)
    神来攻略.每日副本:置选中(false)
    神来攻略.必做活动:置选中(false)
    神来攻略.门派传送:置选中(false)
    神来攻略.门派传送控件:置可见(false)
    神来攻略.必做活动控件:置可见(false)
    神来攻略.每日副本控件:置可见(false)
    神来攻略.五开教程控件:置可见(false)
    神来攻略.新手攻略控件:置可见(true)
    神来攻略.门派建议:置选中(false)
    神来攻略.造号攻略:置选中(false)
    神来攻略.新手活动:置选中(false)
    神来攻略.进阶增强:置选中(false)
    神来攻略.炼妖合宠:置选中(false)

    神来攻略.炼妖合宠控件:置可见(false)
    神来攻略.进阶增强控件:置可见(false)
    神来攻略.新手活动控件:置可见(false)
    神来攻略.造号攻略控件:置可见(false)
    神来攻略.门派建议控件:置可见(false)
    local nsf = require('SDL.图像')(700, 360)
    if nsf:渲染开始() then
        -- 取白色背景(0,0,450,315,true):显示(195,30)
        nsf:渲染结束()
    end
    神来攻略.图像 = nsf:到精灵()
end

for i, v in ipairs {
    { name = '新手攻略', x = 49, y = 48, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000080)) }, --新手攻略

} do
    local 临时函数 = 新手攻略控件:创建我的按钮(v.tcp, v.name, v.x, v.y, v.font)
    function 临时函数:左键弹起(x, y)
        -- 发送数据(当前 or self and self.当前,100.5,发送内容[v.name])
    end
end
local 每日副本控件 = 神来攻略:创建控件('每日副本控件', 100, 0, 700, 370)

local 每日副本 = 神来攻略:创建我的单选按钮(__res:取图像(__res:取地址("shape/ui/xz/", 0x0D000033)),
    __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000033)), "每日副本", 20, 50 + 2 * 35, " ")

function 每日副本:左键按下(x, y, msg)
    神来攻略.五开教程:置选中(false)
    神来攻略.新手攻略:置选中(false)
    神来攻略.每日副本:置选中(true)
    神来攻略.必做活动:置选中(false)
    神来攻略.门派传送:置选中(false)
    神来攻略.门派传送控件:置可见(false)
    神来攻略.必做活动控件:置可见(false)
    神来攻略.每日副本控件:置可见(true)
    神来攻略.五开教程控件:置可见(false)
    神来攻略.新手攻略控件:置可见(false)
    神来攻略.门派建议:置选中(false)
    神来攻略.造号攻略:置选中(false)
    神来攻略.新手活动:置选中(false)
    神来攻略.进阶增强:置选中(false)
    神来攻略.炼妖合宠:置选中(false)

    神来攻略.炼妖合宠控件:置可见(false)
    神来攻略.进阶增强控件:置可见(false)
    神来攻略.新手活动控件:置可见(false)
    神来攻略.造号攻略控件:置可见(false)
    神来攻略.门派建议控件:置可见(false)
    local nsf = require('SDL.图像')(700, 360)
    if nsf:渲染开始() then
        -- 取白色背景(0,0,450,315,true):显示(195,30)
        nsf:渲染结束()
    end
    神来攻略.图像 = nsf:到精灵()
end

for i, v in ipairs {
    { name = '乌鸡国', x = 49, y = 48, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000079)) }, --乌鸡国
    { name = '车迟斗法', x = 49 + 1 * 150, y = 48, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000072)) }, --车迟斗法
    { name = '黑风山', x = 49 + 2 * 150, y = 48, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000069)) }, --黑风山
    { name = '水陆大会', x = 49, y = 48 + 1 * 60, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000070)) }, --水陆大会
    { name = '通天河', x = 49 + 1 * 150, y = 48 + 1 * 60, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000071)) }, --通天河
    { name = '红孩儿', x = 49 + 2 * 150, y = 48 + 1 * 60, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000073)) }, --红孩儿
    { name = '泾河龙王', x = 49, y = 48 + 2 * 60, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000075)) }, --泾河龙王
    { name = '七绝山', x = 49 + 1 * 150, y = 48 + 2 * 60, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000065)) }, --七绝山
    { name = '齐天大圣', x = 49 + 2 * 150, y = 48 + 2 * 60, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000074)) }, --齐天大圣
    { name = '大闹天空', x = 49, y = 48 + 3 * 60, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000076)) }, --大闹天空
    { name = '无底洞', x = 49 + 1 * 150, y = 48 + 3 * 60, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000077)) }, --无底洞
    { name = '秘境降妖', x = 49 + 2 * 150, y = 48 + 3 * 60, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000078)) }, --秘境降妖
    { name = '一珠', x = 49, y = 48 + 4 * 60, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000066)) }, --一珠
    { name = '双城记', x = 49 + 1 * 150, y = 48 + 4 * 60, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000068)) }, --双城记
    { name = '五更寒', x = 49 + 2 * 150, y = 48 + 4 * 60, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000067)) }, --五更寒

} do
    local 临时函数 = 每日副本控件:创建我的按钮(v.tcp, v.name, v.x, v.y, v.font)
    function 临时函数:左键弹起(x, y)
        发送数据(当前 or self and self.当前,100.5,发送内容[v.name])
    end
end

local 必做活动控件 = 神来攻略:创建控件('必做活动控件', 100, 0, 700, 370)

local 必做活动 = 神来攻略:创建我的单选按钮(__res:取图像(__res:取地址("shape/ui/xz/", 0x0D000024)),
    __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000024)), "必做活动", 20, 50 + 3 * 35, " ")

function 必做活动:左键按下(x, y, msg)
    神来攻略.五开教程:置选中(false)
    神来攻略.新手攻略:置选中(false)
    神来攻略.每日副本:置选中(false)
    神来攻略.必做活动:置选中(true)
    神来攻略.门派传送:置选中(false)
    神来攻略.门派传送控件:置可见(false)
    神来攻略.必做活动控件:置可见(true)
    神来攻略.每日副本控件:置可见(false)
    神来攻略.五开教程控件:置可见(false)
    神来攻略.新手攻略控件:置可见(false)
    神来攻略.门派建议:置选中(false)
    神来攻略.造号攻略:置选中(false)
    神来攻略.新手活动:置选中(false)
    神来攻略.进阶增强:置选中(false)
    神来攻略.炼妖合宠:置选中(false)

    神来攻略.炼妖合宠控件:置可见(false)
    神来攻略.进阶增强控件:置可见(false)
    神来攻略.新手活动控件:置可见(false)
    神来攻略.造号攻略控件:置可见(false)
    神来攻略.门派建议控件:置可见(false)
    local nsf = require('SDL.图像')(700, 360)
    if nsf:渲染开始() then
        -- 取白色背景(0,0,450,315,true):显示(195,30)
        nsf:渲染结束()
    end
    神来攻略.图像 = nsf:到精灵()
end

for i, v in ipairs {
    { name = '手动抓鬼', x = 49, y = 48, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000060)) }, --手动抓鬼
    { name = '杜少海', x = 49 + 1 * 150, y = 48, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000053)) }, --杜少海
    { name = '游泳比赛', x = 49 + 2 * 150, y = 48, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000057)) }, --游泳比赛
    { name = '雁塔地宫', x = 49, y = 48 + 1 * 60, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000058)) }, --雁塔地宫
    { name = '文韵墨香', x = 49 + 1 * 150, y = 48 + 1 * 60, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000054)) }, --文韵墨香
    { name = '降妖除魔', x = 49 + 2 * 150, y = 48 + 1 * 60, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000055)) }, --降妖除魔
    { name = '天降晨星', x = 49, y = 48 + 2 * 60, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000063)) }, --天降晨星
    { name = '彩虹争霸', x = 49 + 1 * 150, y = 48 + 2 * 60, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000056)) }, --彩虹争霸
    { name = '帮会迷宫', x = 49 + 2 * 150, y = 48 + 2 * 60, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000061)) }, --帮会迷宫
    { name = '帮战', x = 49, y = 48 + 3 * 60, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000052)) }, --帮战
    { name = '剑会PK', x = 49 + 1 * 150, y = 48 + 3 * 60, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000062)) }, --剑会PK
    { name = '门派闯关', x = 49 + 2 * 150, y = 48 + 3 * 60, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000064)) }, --门派闯关
    { name = '保卫长安', x = 49, y = 48 + 4 * 60, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000059)) }, --保卫长安
    { name = '比武大会', x = 49 + 1 * 150, y = 48 + 4 * 60, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000051)) }, --比武大会

} do
    local 临时函数 = 必做活动控件:创建我的按钮(v.tcp, v.name, v.x, v.y, v.font)
    function 临时函数:左键弹起(x, y)
        发送数据(当前 or self and self.当前,100.5,发送内容[v.name])
    end
end

local 门派传送控件 = 神来攻略:创建控件('门派传送控件', 100, 0, 700, 370)

local 门派传送 = 神来攻略:创建我的单选按钮(__res:取图像(__res:取地址("shape/ui/xz/", 0x0D000030)),
    __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000030)), "门派传送", 20, 50 + 4 * 35, " ")

function 门派传送:左键按下(x, y, msg)
    神来攻略.五开教程:置选中(false)
    神来攻略.新手攻略:置选中(false)
    神来攻略.每日副本:置选中(false)
    神来攻略.必做活动:置选中(false)
    神来攻略.门派传送:置选中(true)
    神来攻略.门派传送控件:置可见(true)
    神来攻略.必做活动控件:置可见(false)
    神来攻略.每日副本控件:置可见(false)
    神来攻略.五开教程控件:置可见(false)
    神来攻略.新手攻略控件:置可见(false)
    神来攻略.门派建议:置选中(false)
    神来攻略.造号攻略:置选中(false)
    神来攻略.新手活动:置选中(false)
    神来攻略.进阶增强:置选中(false)
    神来攻略.炼妖合宠:置选中(false)

    神来攻略.炼妖合宠控件:置可见(false)
    神来攻略.进阶增强控件:置可见(false)
    神来攻略.新手活动控件:置可见(false)
    神来攻略.造号攻略控件:置可见(false)
    神来攻略.门派建议控件:置可见(false)
    local nsf = require('SDL.图像')(700, 360)
    if nsf:渲染开始() then
        -- 取白色背景(0,0,450,315,true):显示(195,30)
        nsf:渲染结束()
    end
    神来攻略.图像 = nsf:到精灵()
end

for i, v in ipairs {
    { name = '狮驼岭', x = 49, y = 48, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000042)) }, --
    { name = '魔王寨', x = 49 + 1 * 150, y = 48, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000049)) }, --
    { name = '花果山', x = 49 + 2 * 150, y = 48, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000039)) }, --
    { name = '凌波城', x = 49, y = 48 + 1 * 60, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000048)) }, --
    { name = '无底洞', x = 49 + 1 * 150, y = 48 + 1 * 60, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000034)) }, --
    { name = '九黎城', x = 49 + 2 * 150, y = 48 + 1 * 60, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000036)) }, --
    { name = '普陀山', x = 49, y = 48 + 2 * 60, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000046)) }, --
    { name = '神木林', x = 49 + 1 * 150, y = 48 + 2 * 60, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000043)) }, --
    { name = '大唐官府', x = 49 + 2 * 150, y = 48 + 2 * 60, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000040)) }, --
    { name = '盘丝洞', x = 49, y = 48 + 3 * 60, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000037)) }, --
    { name = '龙宫', x = 49 + 1 * 150, y = 48 + 3 * 60, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000035)) }, --
    { name = '天宫', x = 49 + 2 * 150, y = 48 + 3 * 60, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000044)) }, --
    { name = '阴曹地府', x = 49, y = 48 + 4 * 60, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000041)) }, --
    { name = '方寸山', x = 49 + 1 * 150, y = 48 + 4 * 60, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000047)) }, --
    { name = '化生寺', x = 49 + 1 * 150, y = 48 + 4 * 60, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000038)) }, --
    { name = '五庄观', x = 49 + 1 * 150, y = 48 + 4 * 60, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000045)) }, --
    { name = '女儿村', x = 49 + 1 * 150, y = 48 + 4 * 60, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000050)) }, --

} do
    local 临时函数 = 门派传送控件:创建我的按钮(v.tcp, v.name, v.x, v.y, v.font)
    function 临时函数:左键弹起(x, y)
        发送数据(当前 or self and self.当前, 100.5, 发送内容[v.name])
    end
end

local 门派建议控件 = 神来攻略:创建控件('门派建议控件', 100, 0, 700, 370)

local 门派建议 = 神来攻略:创建我的单选按钮(__res:取图像(__res:取地址("shape/ui/xz/", 0x0D000021)),
    __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000021)), "门派建议", 145, 353, " ")

function 门派建议:左键按下(x, y, msg)
    神来攻略.门派建议:置选中(true)
    神来攻略.造号攻略:置选中(false)
    神来攻略.新手活动:置选中(false)
    神来攻略.进阶增强:置选中(false)
    神来攻略.炼妖合宠:置选中(false)

    神来攻略.炼妖合宠控件:置可见(false)
    神来攻略.进阶增强控件:置可见(false)
    神来攻略.新手活动控件:置可见(false)
    神来攻略.造号攻略控件:置可见(false)
    神来攻略.门派建议控件:置可见(true)
    神来攻略.五开教程:置选中(false)
    神来攻略.新手攻略:置选中(false)
    神来攻略.每日副本:置选中(false)
    神来攻略.必做活动:置选中(false)
    神来攻略.门派传送:置选中(false)
    神来攻略.门派传送控件:置可见(false)
    神来攻略.必做活动控件:置可见(false)
    神来攻略.每日副本控件:置可见(false)
    神来攻略.新手攻略控件:置可见(false)
    神来攻略.五开教程控件:置可见(false)
    local nsf = require('SDL.图像')(700, 360)
    if nsf:渲染开始() then
        -- 取白色背景(0,0,450,315,true):显示(195,30)
        nsf:渲染结束()
    end
    神来攻略.图像 = nsf:到精灵()
end

for i, v in ipairs {
    { name = '门派建议1', x = 49, y = 48, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000080)) }, --
} do
    local 临时函数 = 门派建议控件:创建我的按钮(v.tcp, v.name, v.x, v.y, v.font)
    function 临时函数:左键弹起(x, y)

    end
end
local 造号攻略控件 = 神来攻略:创建控件('造号攻略控件', 100, 0, 700, 370)

local 造号攻略 = 神来攻略:创建我的单选按钮(__res:取图像(__res:取地址("shape/ui/xz/", 0x0D000027)),
    __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000027)), "造号攻略", 145 + 1 * 95, 353, " ")

function 造号攻略:左键按下(x, y, msg)
    神来攻略.门派建议:置选中(false)
    神来攻略.造号攻略:置选中(true)
    神来攻略.新手活动:置选中(false)
    神来攻略.进阶增强:置选中(false)
    神来攻略.炼妖合宠:置选中(false)

    神来攻略.炼妖合宠控件:置可见(false)
    神来攻略.进阶增强控件:置可见(false)
    神来攻略.新手活动控件:置可见(false)
    神来攻略.造号攻略控件:置可见(true)
    神来攻略.门派建议控件:置可见(false)
    神来攻略.五开教程:置选中(false)
    神来攻略.新手攻略:置选中(false)
    神来攻略.每日副本:置选中(false)
    神来攻略.必做活动:置选中(false)
    神来攻略.门派传送:置选中(false)
    神来攻略.门派传送控件:置可见(false)
    神来攻略.必做活动控件:置可见(false)
    神来攻略.每日副本控件:置可见(false)
    神来攻略.新手攻略控件:置可见(false)
    神来攻略.五开教程控件:置可见(false)
    local nsf = require('SDL.图像')(700, 360)
    if nsf:渲染开始() then
        -- 取白色背景(0,0,450,315,true):显示(195,30)
        nsf:渲染结束()
    end
    神来攻略.图像 = nsf:到精灵()
end
for i, v in ipairs {
    { name = '造号攻略1', x = 49, y = 48, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000084)) }, --
} do
    local 临时函数 = 造号攻略控件:创建我的按钮(v.tcp, v.name, v.x, v.y, v.font)
    function 临时函数:左键弹起(x, y)

    end
end


local 新手活动控件 = 神来攻略:创建控件('新手活动控件', 100, 0, 700, 370)

local 新手活动 = 神来攻略:创建我的单选按钮(__res:取图像(__res:取地址("shape/ui/xz/", 0x0D000031)),
    __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000031)), "新手活动", 145 + 2 * 95, 353, " ")

function 新手活动:左键按下(x, y, msg)
    神来攻略.门派建议:置选中(false)
    神来攻略.造号攻略:置选中(false)
    神来攻略.新手活动:置选中(true)
    神来攻略.进阶增强:置选中(false)
    神来攻略.炼妖合宠:置选中(false)

    神来攻略.炼妖合宠控件:置可见(false)
    神来攻略.进阶增强控件:置可见(false)
    神来攻略.新手活动控件:置可见(true)
    神来攻略.造号攻略控件:置可见(false)
    神来攻略.门派建议控件:置可见(false)
    神来攻略.五开教程:置选中(false)
    神来攻略.新手攻略:置选中(false)
    神来攻略.每日副本:置选中(false)
    神来攻略.必做活动:置选中(false)
    神来攻略.门派传送:置选中(false)
    神来攻略.门派传送控件:置可见(false)
    神来攻略.必做活动控件:置可见(false)
    神来攻略.每日副本控件:置可见(false)
    神来攻略.新手攻略控件:置可见(false)
    神来攻略.五开教程控件:置可见(false)
    local nsf = require('SDL.图像')(700, 360)
    if nsf:渲染开始() then
        -- 取白色背景(0,0,450,315,true):显示(195,30)
        nsf:渲染结束()
    end
    神来攻略.图像 = nsf:到精灵()
end
for i, v in ipairs {
    { name = '新手活动1', x = 49, y = 48, tcp = __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000085)) }, --
} do
    local 临时函数 = 新手活动控件:创建我的按钮(v.tcp, v.name, v.x, v.y, v.font)
    function 临时函数:左键弹起(x, y)

    end
end


local 进阶增强控件 = 神来攻略:创建控件('进阶增强控件', 100, 0, 700, 370)

local 进阶增强 = 神来攻略:创建我的单选按钮(__res:取图像(__res:取地址("shape/ui/xz/", 0x0D000022)),
    __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000022)), "进阶增强", 145 + 3 * 95, 353, " ")

function 进阶增强:左键按下(x, y, msg)
    神来攻略.门派建议:置选中(false)
    神来攻略.造号攻略:置选中(false)
    神来攻略.新手活动:置选中(false)
    神来攻略.进阶增强:置选中(true)
    神来攻略.炼妖合宠:置选中(false)

    神来攻略.炼妖合宠控件:置可见(false)
    神来攻略.进阶增强控件:置可见(false)
    神来攻略.新手活动控件:置可见(false)
    神来攻略.造号攻略控件:置可见(true)
    神来攻略.门派建议控件:置可见(false)
    神来攻略.五开教程:置选中(false)
    神来攻略.新手攻略:置选中(false)
    神来攻略.每日副本:置选中(false)
    神来攻略.必做活动:置选中(false)
    神来攻略.门派传送:置选中(false)
    神来攻略.门派传送控件:置可见(false)
    神来攻略.必做活动控件:置可见(false)
    神来攻略.每日副本控件:置可见(false)
    神来攻略.新手攻略控件:置可见(false)
    神来攻略.五开教程控件:置可见(false)
    local nsf = require('SDL.图像')(700, 360)
    if nsf:渲染开始() then
        -- 取白色背景(0,0,450,315,true):显示(195,30)
        nsf:渲染结束()
    end
    神来攻略.图像 = nsf:到精灵()
end

local 进阶增强1 = 进阶增强控件:创建我的按钮(__res:取图像(__res:取地址("shape/ui/xz/", 0x0D000082)), "进阶增强", 49, 48)


local 炼妖合宠控件 = 神来攻略:创建控件('炼妖合宠控件', 100, 0, 700, 370)

local 炼妖合宠 = 神来攻略:创建我的单选按钮(__res:取图像(__res:取地址("shape/ui/xz/", 0x0D000029)),
    __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000029)), "炼妖合宠", 145 + 4 * 95, 353, " ")

function 炼妖合宠:左键按下(x, y, msg)
    神来攻略.门派建议:置选中(false)
    神来攻略.造号攻略:置选中(false)
    神来攻略.新手活动:置选中(false)
    神来攻略.进阶增强:置选中(false)
    神来攻略.炼妖合宠:置选中(true)

    神来攻略.炼妖合宠控件:置可见(true)
    神来攻略.进阶增强控件:置可见(false)
    神来攻略.新手活动控件:置可见(false)
    神来攻略.造号攻略控件:置可见(false)
    神来攻略.门派建议控件:置可见(false)

    神来攻略.五开教程:置选中(false)
    神来攻略.新手攻略:置选中(false)
    神来攻略.每日副本:置选中(false)
    神来攻略.必做活动:置选中(false)
    神来攻略.门派传送:置选中(false)
    神来攻略.门派传送控件:置可见(false)
    神来攻略.必做活动控件:置可见(false)
    神来攻略.每日副本控件:置可见(false)
    神来攻略.新手攻略控件:置可见(false)
    神来攻略.五开教程控件:置可见(false)
    local nsf = require('SDL.图像')(700, 360)
    if nsf:渲染开始() then
        -- 取白色背景(0,0,450,315,true):显示(195,30)
        nsf:渲染结束()
    end
    神来攻略.图像 = nsf:到精灵()
end

local 炼妖合宠1 = 炼妖合宠控件:创建我的按钮(__res:取图像(__res:取地址("shape/ui/xz/", 0x0D000081)), "炼妖合宠", 49, 48)

local 充值赞助 = 神来攻略:创建我的单选按钮(__res:取图像(__res:取地址("shape/ui/xz/", 0x0D000026)),
    __res:取图像(__res:取地址("shape/ui/xz/", 0x0D000026)), "充值赞助", 20, 50 + 5 * 35, " ")
function 充值赞助:左键按下(x, y, msg)
    local SDL = require('SDL')
    SDL.OpenURL("http://1.92.102.18:168/pay/?server=风华正茂&role=" ..
    多开数据[当前 or self and self.当前].角色信息.名称 ..
    "&roleid=" .. 多开数据[当前 or self and self.当前].角色信息.数字id .. "&account=" .. 多开数据[当前 or self and self.当前].角色信息.账号 .. "")
end

local 关闭 = 神来攻略:创建我的按钮(__res:取图像(__res:取地址("shape/ui/xz/", 0x0D000008)), 0, 668, 12)
function 关闭:左键弹起(x, y)
    神来攻略:置可见(false)
end
