--[[
Author: GGELUA
Date: 2023-11-05 21:30:11
Last Modified by: GGELUA
Last Modified time: 2023-11-07 15:33:49
--]]
local 宠物说明 =     {
{1, "小毛头", "人族孩子★消耗20个地心印记可兑换,此模型为佩戴饰品造型，购买不会佩戴饰品。"},
{2, "小丫丫", "人族孩子★消耗20个地心印记可兑换,此模型为佩戴饰品造型，购买不会佩戴饰品。"},
{3, "小仙灵", "仙族孩子★消耗20个地心印记可兑换,此模型为佩戴饰品造型，购买不会佩戴饰品。"},
{4, "小仙女", "仙族孩子★消耗20个地心印记可兑换,此模型为佩戴饰品造型，购买不会佩戴饰品。"},
{5, "小精灵", "魔族孩子★消耗20个地心印记可兑换,此模型为佩戴饰品造型，购买不会佩戴饰品。"},
{6, "小魔头", "魔族孩子★消耗20个地心印记可兑换,此模型为佩戴饰品造型，购买不会佩戴饰品。"},
{7, "进阶小毛头", "人族孩子★消耗50个地心印记可兑换,此模型为佩戴进阶饰品造型，购买不会佩戴饰品。"},
{8, "进阶小丫丫", "人族孩子★消耗50个地心印记可兑换,此模型为佩戴进阶饰品造型，购买不会佩戴饰品。"},
{9, "进阶小仙灵", "仙族孩子★消耗50个地心印记可兑换,此模型为佩戴进阶饰品造型，购买不会佩戴饰品。"},
{10, "进阶小仙女", "仙族孩子★消耗50个地心印记可兑换,此模型为佩戴进阶饰品造型，购买不会佩戴饰品。"},
{11, "进阶小精灵", "魔族孩子★消耗50个地心印记可兑换,此模型为佩戴进阶饰品造型，购买不会佩戴饰品。"},
{12, "进阶小魔头", "魔族孩子★消耗50个地心印记可兑换,此模型为佩戴进阶饰品造型，购买不会佩戴饰品。"}
}
local 采矿兑换栏 = 多开数据[多开数据.当前].__UI界面.窗口层:创建我的窗口("采矿兑换栏",0,0,560,360)
local 当前 = 多开数据.当前



function 采矿兑换栏:初始化()
    __置窗口坐标(self,'右')
    local nsf = require('SDL.图像')(560,360)
    if nsf:渲染开始() then
        __res:取图像(__res:取地址("shape/ui/xz/", 0x00000017)):显示(0,0)
        nsf:渲染结束()
    end
    self:置精灵(nsf:到精灵())
end

function 采矿兑换栏:打开(data)
    self:置可见(true)
    self.介绍文本:清空()
    self.宠物网格:置宠物()
    self.宠物网格.选择 = nil
end

function 采矿兑换栏:左键弹起(x,y)
    if x>737 and y > 94 and x <752 and y < 105 then
        self:置可见(false)
    end
end

local 购买 = 采矿兑换栏:创建我的按钮(__res:getPNGCC(3,2,507,124,41,true):拉伸(90,30),"确定",450,315,"确定")
function 购买:左键弹起(x,y,msg)
    if 采矿兑换栏.宠物网格.选择 then
        -- 定义宠物对应的编号
        local 宠物编号 = {
            小毛头 = 1,
            小丫丫 = 2,
            小仙灵 = 3,
            小仙女 = 4,
            小精灵 = 5,
            小魔头 = 6,
            进阶小毛头 = 7,
            进阶小丫丫 = 8,
            进阶小仙灵 = 9,
            进阶小仙女 = 10,
            进阶小精灵 = 11,
            进阶小魔头 = 12
        }
        -- 如果选择的值是小毛头，将其赋值为1
        if 采矿兑换栏.宠物网格.选择 == "小毛头" then
            采矿兑换栏.宠物网格.选择 = 1
        end
        if 采矿兑换栏.宠物网格.选择 == "小丫丫" then
            采矿兑换栏.宠物网格.选择 = 2
        end
        if 采矿兑换栏.宠物网格.选择 == "小仙灵" then
            采矿兑换栏.宠物网格.选择 = 3
        end
        if 采矿兑换栏.宠物网格.选择 == "小精灵" then
            采矿兑换栏.宠物网格.选择 = 5
        end
        if 采矿兑换栏.宠物网格.选择 == "小魔头" then
            采矿兑换栏.宠物网格.选择 = 6
        end
        if 采矿兑换栏.宠物网格.选择 == "进阶小毛头" then
            采矿兑换栏.宠物网格.选择 = 7
        end
        if 采矿兑换栏.宠物网格.选择 == "进阶小丫丫" then
            采矿兑换栏.宠物网格.选择 = 8
        end
        if 采矿兑换栏.宠物网格.选择 == "进阶小仙灵" then
            采矿兑换栏.宠物网格.选择 = 9
        end
        if 采矿兑换栏.宠物网格.选择 == "进阶小仙女" then
            采矿兑换栏.宠物网格.选择 = 10
        end
        if 采矿兑换栏.宠物网格.选择 == "进阶小精灵" then
            采矿兑换栏.宠物网格.选择 = 11
        end
        if 采矿兑换栏.宠物网格.选择 == "进阶小魔头" then
            采矿兑换栏.宠物网格.选择 = 12
        end
        
        print("采矿兑换栏.宠物网格.选择的值:", 采矿兑换栏.宠物网格.选择)
        local function 事件()
            发送数据(当前 or self and self.当前,3801.5,{参数=采矿兑换栏.宠物网格.选择})
            print(555.)
            print("当前:", 当前)
            print("self.当前:", self and self.当前)
        end
        local wb = "你确定选择好了吗？"
        多开数据[当前].__UI界面.窗口层.文本栏:打开(wb,285,155,390,200,事件)
    end
end

local 关闭 = 采矿兑换栏:创建我的按钮(__res:getPNGCC(1,401,0,46,46),"关闭",520,0)

function 关闭:左键弹起(x,y,msg)
    采矿兑换栏:置可见(false)
end

local 介绍文本 = 采矿兑换栏:创建文本("介绍文本",445,82,105,235)
function 介绍文本:初始化()

end

local 宠物网格 = 采矿兑换栏:创建网格("宠物网格",10,30,630,320)

function 宠物网格:初始化()
    self:创建格子(103,103,0,0,3,4)
    self.宠物组 = {}
end

function 宠物网格:左键弹起(x, y, a, b, msg)
    采矿兑换栏.介绍文本:清空()
    采矿兑换栏.介绍文本:置文本(宠物网格.子控件[a].数据[3])
    self.选择 = 宠物网格.子控件[a].数据[2]
end

function 宠物网格:置宠物()
    for i = 1,#宠物网格.子控件 do
        宠物网格.子控件[i].数据 = 宠物说明[i]
        local lssj = 取模型(宠物说明[i][2])
        self.宠物组[i] = __res:取动画2(__res:取地址("shape/mx/", lssj[1])):置方向(0):置循环(true)
    end
end

function 宠物网格:更新(dt)
    for i=1,#self.宠物组 do
        self.宠物组[i]:更新(dt)
    end
end

function 宠物网格:显示(x,y)
    for i=1,#self.宠物组 do
        self.宠物组[i]:显示(x+宠物网格.子控件[i].x+60,y+宠物网格.子控件[i].y+80)
    end
    if self.选择 then
        字体16:显示(x+465,y+16,self.选择)
    end
end
    