--[[
    @Author       : GGELUA
    @Date         : 2022-04-08 10:57:22
Last Modified by: GGELUA
Last Modified time: 2023-07-30 21:33:33
--]]
local 附魔 = 多开数据[多开数据.当前].__UI界面.窗口层:创建我的窗口("附魔",0,0,374,408)
local 当前 = 多开数据.当前
function 附魔:初始化()
    __置窗口坐标(self)
    local nsf = require('SDL.图像')(374,408)
    if nsf:渲染开始() then
        置窗口背景("系统处理",0,12,362,395,true):显示(0,0)
        取灰色背景(0,0,340,280,true):显示(15,50)
        nsf:渲染结束()
    end
    self:置精灵(nsf:到精灵())
end

function 附魔:打开(数据,lx)
    self:置可见(true)
    self.数据=数据
    self:重置(数据,lx)
end

function 附魔:重置(数据,lx)
    local nsf = require('SDL.图像')(374,408)
    if nsf:渲染开始() then
        置窗口背景(lx,0,12,362,395,true):显示(0,0)
        取灰色背景(0,0,340,280,true):显示(15,50)
        nsf:渲染结束()
    end
    self.图像 = nsf:到精灵()
    self.道具网格:置物品(数据.道具.道具)
    self.选中类型 = lx
end

local 道具网格 = 附魔:创建网格("道具网格",20,60,326,260)

function 道具网格:初始化()
    self:创建格子(55,55,14,13,4,5)
end

function 道具网格:左键弹起(x, y, a, b, msg)
    if  附魔.选中 and  self.子控件[附魔.选中]._spr and  self.子控件[附魔.选中]._spr.物品 then
        self.子控件[附魔.选中]._spr.确定 = nil
    end
    if self.子控件[a] and self.子控件[a]._spr and self.子控件[a]._spr.物品  then
        local x,y = self.子控件[a]:取坐标()
        local w,h = self.子控件[a]:取宽高()
        self.子控件[a]._spr.确定 = true
        self.子控件[a]._spr:详情打开(520,86,w,h)
        附魔.选中 = a
    end

end

function 道具网格:置物品(数据,bh)
    if not bh then
        for i = 1,#道具网格.子控件 do
            local lssj = __商店格子.创建(当前)
            lssj:置物品(数据[i],"附魔")
            道具网格.子控件[i]:置精灵(lssj)
        end
    else
        local lssj = __商店格子.创建(当前)
        lssj:置物品(数据,"附魔")
        道具网格.子控件[bh]:置精灵(lssj)
    end
end

local 关闭 = 附魔:创建我的按钮(__res:getPNGCC(1,401,0,46,46),"关闭",320,0)

function 关闭:左键弹起(x,y,msg)
    附魔:置可见(false)
end


local 确定按钮 = 附魔:创建我的按钮(__res:getPNGCC(3,2,507,124,41):拉伸(123,41),"确定按钮",115,350,"确定")

function 确定按钮:左键弹起(x,y,msg)
    if 附魔.选中 == nil or 附魔.道具网格.子控件[附魔.选中] == nil or 附魔.道具网格.子控件[附魔.选中]._spr == nil or 附魔.道具网格.子控件[附魔.选中]._spr.物品 == nil then
        多开数据[当前 or self and self.当前].__UI弹出.提示框:打开('#Y请先选中需要操作的物品')
        return
    end
    if 附魔.道具网格.子控件[附魔.选中]._spr.物品.总类 ~= 2 then
        多开数据[当前 or self and self.当前].__UI弹出.提示框:打开('#Y只有装备才可以附魔')
        return
    end
    local 分类 = 附魔.道具网格.子控件[附魔.选中]._spr.物品.分类
    if 附魔.数据.编号 then
        if 附魔.道具网格.子控件[附魔.数据.编号] == nil or 附魔.道具网格.子控件[附魔.数据.编号]._spr == nil or 附魔.道具网格.子控件[附魔.数据.编号]._spr.物品 == nil then
            多开数据[当前 or self and self.当前].__UI弹出.提示框:打开('#Y你没有这样的道具')
            return
        else
            if 附魔.道具网格.子控件[附魔.数据.编号]._spr.物品.类型 == "嗜血" or 附魔.道具网格.子控件[附魔.数据.编号]._spr.物品.类型 == "莲华妙法" then
                if 分类 == 2 then
                    发送数据(当前,4512,{序列1=附魔.数据.编号,序列2=附魔.选中})
                else
                    多开数据[当前 or self and self.当前].__UI弹出.提示框:打开("#Y/该强化符只能给项链附魔")
                end
            elseif 附魔.道具网格.子控件[附魔.数据.编号]._spr.物品.类型 == "神兵护法" or 附魔.道具网格.子控件[附魔.数据.编号]._spr.物品.类型 == "尸气漫天" then
                if 分类 == 1 then
                    发送数据(当前,4512,{序列1=附魔.数据.编号,序列2=附魔.选中})
                else
                    多开数据[当前 or self and self.当前].__UI弹出.提示框:打开("#Y/该强化符只能给头盔附魔")
                end
            elseif 附魔.道具网格.子控件[附魔.数据.编号]._spr.物品.类型 == "拈花妙指" or 附魔.道具网格.子控件[附魔.数据.编号]._spr.物品.类型 == "神木呓语" then
                if 分类 == 6 then
                    发送数据(当前,4512,{序列1=附魔.数据.编号,序列2=附魔.选中})
                else
                    多开数据[当前 or self and self.当前].__UI弹出.提示框:打开("#Y/该强化符只能给鞋子附魔")
                end
            elseif 附魔.道具网格.子控件[附魔.数据.编号]._spr.物品.类型 == "轻如鸿毛" or 附魔.道具网格.子控件[附魔.数据.编号]._spr.物品.类型 == "龙附" or 附魔.道具网格.子控件[附魔.数据.编号]._spr.物品.类型 == "魔王护持" or 附魔.道具网格.子控件[附魔.数据.编号]._spr.物品.类型 == "盘丝舞" or 附魔.道具网格.子控件[附魔.数据.编号]._spr.物品.类型 == "元阳护体" then
                if 分类 == 3 then
                    发送数据(当前,4512,{序列1=附魔.数据.编号,序列2=附魔.选中})
                else
                    多开数据[当前 or self and self.当前].__UI弹出.提示框:打开("#Y/该强化符只能给武器附魔")
                end
            elseif 附魔.道具网格.子控件[附魔.数据.编号]._spr.物品.类型 == "浩然正气" or 附魔.道具网格.子控件[附魔.数据.编号]._spr.物品.类型 == "一气化三清" then
                if 分类 == 4 then
                    发送数据(当前,4512,{序列1=附魔.数据.编号,序列2=附魔.选中})
                else
                    多开数据[当前 or self and self.当前].__UI弹出.提示框:打开("#Y/该强化符只能给衣服附魔")
                end
            elseif 附魔.道具网格.子控件[附魔.数据.编号]._spr.物品.类型 == "神力无穷" or 附魔.道具网格.子控件[附魔.数据.编号]._spr.物品.类型 == "穿云破空" then
                if 分类 == 5 then
                    发送数据(当前,4512,{序列1=附魔.数据.编号,序列2=附魔.选中})
                else
                    多开数据[当前 or self and self.当前].__UI弹出.提示框:打开("#Y/该强化符只能给腰带附魔")
                end
            end
        end
    else
        if 附魔.数据.名称 == "嗜血" or 附魔.数据.名称 == "莲华妙法" then
            if 分类 == 2 then
                发送数据(当前,4513,{序列1=附魔.数据.编号,序列2=附魔.选中,数据=附魔.数据})
            else
                多开数据[当前 or self and self.当前].__UI弹出.提示框:打开("#Y/该强化符只能给项链附魔")
            end
        elseif 附魔.数据.名称 == "神兵护法" or 附魔.数据.名称 == "尸气漫天" then
            if 分类 == 1 then
                发送数据(当前,4513,{序列1=附魔.数据.编号,序列2=附魔.选中,数据=附魔.数据})
            else
                多开数据[当前 or self and self.当前].__UI弹出.提示框:打开("#Y/该强化符只能给头盔附魔")
            end
        elseif 附魔.数据.名称 == "拈花妙指" or 附魔.数据.名称 == "神木呓语" then
            if 分类 == 6 then
                发送数据(当前,4513,{序列1=附魔.数据.编号,序列2=附魔.选中,数据=附魔.数据})
            else
                多开数据[当前 or self and self.当前].__UI弹出.提示框:打开("#Y/该强化符只能给鞋子附魔")
            end
        elseif 附魔.数据.名称 == "轻如鸿毛" or 附魔.数据.名称 == "龙附" or 附魔.数据.名称 == "魔王护持" or 附魔.数据.名称 == "盘丝舞" or 附魔.数据.名称 == "元阳护体" then
            if 分类 == 3 then
                发送数据(当前,4513,{序列1=附魔.数据.编号,序列2=附魔.选中,数据=附魔.数据})
            else
                多开数据[当前 or self and self.当前].__UI弹出.提示框:打开("#Y/该强化符只能给武器附魔")
            end
        elseif 附魔.数据.名称 == "浩然正气" or 附魔.数据.名称 == "一气化三清" then
            if 分类 == 4 then
                发送数据(当前,4513,{序列1=附魔.数据.编号,序列2=附魔.选中,数据=附魔.数据})
            else
                多开数据[当前 or self and self.当前].__UI弹出.提示框:打开("#Y/该强化符只能给衣服附魔")
            end
        elseif 附魔.数据.名称 == "神力无穷" or 附魔.数据.名称 == "穿云破空" then
            if 分类 == 5 then
                发送数据(当前,4513,{序列1=附魔.数据.编号,序列2=附魔.选中,数据=附魔.数据})
            else
                多开数据[当前].__UI弹出.提示框:打开("#Y/该强化符只能给腰带附魔")
            end
        end
    end
    附魔:置可见(false)
end