local 藏宝阁召唤兽出售寄存 = 多开数据[多开数据.当前].__UI界面.窗口层:创建我的窗口("藏宝阁召唤兽出售寄存",0,0,377,488)
local 当前 = 多开数据.当前
function 藏宝阁召唤兽出售寄存:初始化()
    __置窗口坐标(self)
    local nsf = require('SDL.图像')(377,488)
    if nsf:渲染开始() then
        置窗口背景("藏宝阁出售",0,12,350,476,true):显示(0,0)
        字体18:置颜色(__取颜色('白色'))
        字体18:取图像('价格'):显示(13,430)
        local lssj = 取输入背景(0,0,180,23)
        lssj:显示(70,430)
        nsf:渲染结束()
    end
    self:置精灵(nsf:到精灵())
end

function 藏宝阁召唤兽出售寄存:打开(data)
    self:置可见(true)
    self.数据 = data.数据
    self.额外数据 = data.额外数据
    self.召唤兽控件:重置(self.数据)
    self.召唤兽控件:置可见(true)
end

function 藏宝阁召唤兽出售寄存:刷新(data)
    self.数据 = data.数据
    self.额外数据 = data.额外数据
    self.召唤兽控件:重置(self.数据)
    self.召唤兽控件:置可见(true)
end

local 关闭 = 藏宝阁召唤兽出售寄存:创建我的按钮(__res:getPNGCC(1,401,0,46,46),"关闭",300,0)

function 关闭:左键弹起(x,y,msg)
    藏宝阁召唤兽出售寄存:置可见(false)
end

-- function 藏宝阁召唤兽出售寄存:刷新(data)
--     self.数据 = data
--     self.召唤兽控件:重置(self.数据)
-- end

local 召唤兽控件 = 藏宝阁召唤兽出售寄存:创建控件("召唤兽控件",0,0,377,488)
function 召唤兽控件:重置(data)
    self:置可见(true)
    藏宝阁召唤兽出售寄存.图像 = nil
    local nsf = require('SDL.图像')(377,488):置像素(20, 20, 0, 0, 0, 255)
    if nsf:渲染开始() then
        local lssj = 取白色背景(0,0,306,330,true)
        lssj:显示(17,62)
        字体18:置颜色(__取颜色('浅黑'))
        字体18:取图像('名字'):显示(58,70)
        字体18:取图像('等级'):显示(225,70)
        nsf:渲染结束()
    end
    藏宝阁召唤兽出售寄存.图像 = nsf:到精灵()
    藏宝阁召唤兽出售寄存.仓库召唤兽数据 = data
    self.仓库召唤兽列表:重置(藏宝阁召唤兽出售寄存.仓库召唤兽数据)
end


for i, v in ipairs {
    {name = '取回', x = 265 ,y = 400 , tcp = __res:getPNGCC(3,511,11,124,43,true):置拉伸(80,30) , font = "取回"},
    {name = '上架', x = 265 ,y = 440 , tcp = __res:getPNGCC(3,511,11,124,43,true):置拉伸(80,30) , font = "上架"},
} do
    local 临时函数 = 藏宝阁召唤兽出售寄存:创建我的按钮(v.tcp,v.name,v.x,v.y,v.font)
    function 临时函数:左键弹起(x, y)
        if v.name == '取回' then
            if 藏宝阁召唤兽出售寄存.选中 and 藏宝阁召唤兽出售寄存.仓库召唤兽数据[藏宝阁召唤兽出售寄存.选中] then
                发送数据(当前,69,{类型="宝宝商城",文本="取回商品",编号=藏宝阁召唤兽出售寄存.仓库召唤兽数据[藏宝阁召唤兽出售寄存.选中].识别码,类别="上架"})
            else
               多开数据[当前 or self and self.当前].__UI弹出.提示框:打开("#Y请选择你要查看的召唤兽","xt")
            end
        elseif v.name == '上架' then
            if 藏宝阁召唤兽出售寄存.选中 and 藏宝阁召唤兽出售寄存.仓库召唤兽数据[藏宝阁召唤兽出售寄存.选中] then
                if tonumber(藏宝阁召唤兽出售寄存.出售价格:取数值()) == nil then
                    多开数据[当前 or self and self.当前].__UI弹出.提示框:打开("#Y请正确输入价格")
                    return
                end
                if 藏宝阁召唤兽出售寄存.额外数据[藏宝阁召唤兽出售寄存.选中] and 藏宝阁召唤兽出售寄存.额外数据[藏宝阁召唤兽出售寄存.选中].上架 then
                    发送数据(当前 or self and self.当前,69,{类型="宝宝商城",文本="下架商品",编号=藏宝阁召唤兽出售寄存.仓库召唤兽数据[藏宝阁召唤兽出售寄存.选中].识别码})
                else
                    发送数据(当前 or self and self.当前,69,{类型="宝宝商城",文本="上架商品",编号=藏宝阁召唤兽出售寄存.仓库召唤兽数据[藏宝阁召唤兽出售寄存.选中].识别码,价格=藏宝阁召唤兽出售寄存.出售价格:取数值()})
                end
            else
                多开数据[当前 or self and self.当前].__UI弹出.提示框:打开("#Y请选择你要查看的召唤兽","xt")
            end
        end
    end
end

local 仓库召唤兽列表 = 召唤兽控件:创建列表("仓库召唤兽列表",17,100,298,270)

function 仓库召唤兽列表:初始化()
    self:置文字(字体20)
    self.行高度 = 50
    self.行间距 = 0
end

function 仓库召唤兽列表:重置(data)
    藏宝阁召唤兽出售寄存.选中 = nil
    藏宝阁召唤兽出售寄存.出售价格:置数值(0)
    self:清空()
    for _, v in ipairs(data) do
        local nsf = require('SDL.图像')(298,50)
        if nsf:渲染开始() then
            if _%2 == 1 then
                --nsf:填充颜色(167,164,199,255)
            end
            字体16:置颜色(__取颜色('浅黑'))
            字体16:取图像(v.名称):显示(11,15)
            字体16:取图像(v.等级):显示(210,15)
            if 藏宝阁召唤兽出售寄存.额外数据 and 藏宝阁召唤兽出售寄存.额外数据[_] and 藏宝阁召唤兽出售寄存.额外数据[_].上架 then
                字体16:置颜色(__取颜色('红色'))
                字体16:取图像("已上架"):显示(130,15)
            end
            nsf:渲染结束()
        end
        local r = self:添加()
        r:置精灵(nsf:到精灵())
    end
end

function 仓库召唤兽列表:左键弹起(x, y, i, item, msg)
    if 藏宝阁召唤兽出售寄存.数据[i] and 藏宝阁召唤兽出售寄存.额外数据[i] and 藏宝阁召唤兽出售寄存.额外数据[i].上架 then
        藏宝阁召唤兽出售寄存.上架:我的按钮置文字(藏宝阁召唤兽出售寄存.上架,__res:getPNGCC(3,511,11,124,43,true):置拉伸(80,30),"下架")
        藏宝阁召唤兽出售寄存.出售价格:置数值(藏宝阁召唤兽出售寄存.额外数据[i].价格)
    else
        藏宝阁召唤兽出售寄存.上架:我的按钮置文字(藏宝阁召唤兽出售寄存.上架,__res:getPNGCC(3,511,11,124,43,true):置拉伸(80,30),"上架")
    end
    藏宝阁召唤兽出售寄存.选中 = i
end

local 出售价格 = 藏宝阁召唤兽出售寄存:创建我的输入('出售价格',75,432,200,18,2,10,'黑色')