local 光武拓印 = 多开数据[多开数据.当前].__UI界面.窗口层:创建我的窗口("光武拓印",251 + abbr.py.x, 100 + abbr.py.y,500, 243)
local 当前 =  多开数据.当前
local 武器数据 = nil
local 当前等级选择 = 0
local 选择物品 = nil
local 道具格子 = nil

local 武器网格 = 光武拓印:创建网格("武器网格", 80, 105, 55, 55)
function 武器网格:初始化()
  self:创建格子(55, 55, 55, 55, 1, 1)
end
function 武器网格:左键弹起(x, y, a, b, msg)
  if msg == "右键" and self.子控件[a]._spr.物品 then
    self:置物品(nil, a)
    武器数据 = nil
    道具格子 = nil
    当前等级选择 = 0
    选择物品 = nil
    for i = 1, #光武拓印.新武器网格.子控件 do
      光武拓印.新武器网格:置物品(nil, i)
    end
  end
end
function 武器网格:置物品(data, bh)
  if not bh then
    for i = 1, #self.子控件 do
      local lssj = __物品格子.创建(当前)
      lssj:置物品(data and data[i], "白格子", "战斗道具")
      self.子控件[i]:置精灵(lssj)
    end
  else
    local lssj = __物品格子.创建(当前)
    lssj:置物品(data, "白格子", "战斗道具")
    self.子控件[bh]:置精灵(lssj)
  end
end

local 新武器网格 = 光武拓印:创建网格("新武器网格", 180, 105, 220, 55)
function 新武器网格:初始化()
  self:创建格子(55, 55, 20, 20, 1, 3)
end
function 新武器网格:左键弹起(x, y, a, b, msg)
  if self.子控件[a]._spr.物品 then
    if 选择物品 ~= nil then
      self.子控件[选择物品]._spr.确定 = false
    end
    选择物品 = a
    self.子控件[a]._spr.确定 = true
    self.子控件[a]._spr:详情打开(520, 86, w, h, "装备", a)

  end
end
function 新武器网格:置物品(数据, bh)
  if not bh then
    for i = 1, #self.子控件 do
      local lssj = __物品格子.创建(当前)
      lssj:置物品(数据 and 数据[i], "制造")
      self.子控件[i]:置精灵(lssj)
    end
  else
    local lssj = __物品格子.创建(当前)
    lssj:置物品(数据, "白格子", "战斗道具")
    self.子控件[bh]:置精灵(lssj)
  end
end

function 光武拓印:初始化()
  local nsf = require("SDL.图像")(500, 243)
  if nsf:渲染开始() then
    置窗口背景("光武拓印",0,12,480,230,true):显示(0,0)
    for i=1,3 do
      __res:getPNGCC(3, 132, 506, 55, 55):显示(180+(i-1)*75, 105)
    end
    字体18:置颜色(__取颜色('白色'))
    字体18:取图像("选择可变造型"):显示(230, 65)
  end
  self:置精灵(nsf:到精灵())
  self.允许移动=true
  武器网格:初始化()
  新武器网格:初始化()
end

function 光武拓印:打开(data)
  self:置可见(true)
  self.数据 = data
  self:重置()
end

function 光武拓印:重置()
  local nsf = require("SDL.图像")(409, 69)
  if nsf:渲染开始() then
    nsf:渲染结束()
  end
  self.图像 = nsf:到精灵()
  self.图像:置中心(0, -398)
  武器数据 = nil
  当前等级选择 = 0
  选择物品 = nil
  道具格子 = nil
  
  self.武器网格:置物品({})
  self.新武器网格:置物品({})
end

function 光武拓印:刷新(sj)
  if not sj[1] then return end
  local 道具列表 = 多开数据[多开数据.当前].__主控.道具列表
  if 道具列表[sj[1]] and (
    (道具列表[sj[1]].总类 == 2 and 道具列表[sj[1]].分类 == 3) or 
    (道具列表[sj[1]].总类 == 2 and 道具列表[sj[1]].子类 == 911)
  ) then
    道具格子 = sj[1]
    武器数据 = table.copy(道具列表[sj[1]])
    self.武器网格:置物品(武器数据, 1)
  end
end

function 选择等级武器(n)
  if not 武器数据 then
    多开数据[多开数据.当前].__UI弹出.提示框:打开("#Y请先选择武器！")
    return
  end
  if 当前等级选择 == n then
    return
  end
  local 武器表 = {
    枪矛 = {"红缨枪","曲尖枪","锯齿矛","乌金三叉戟","火焰枪","墨杆金钩","玄铁矛","金蛇信","丈八点钢矛","暗夜","梨花","霹雳","刑天之逆","五虎断魂","飞龙在天","天龙破城","弑皇"},
    斧钺 = {"青铜斧","开山斧","双面斧","双弦钺","精钢禅钺","黄金钺","乌金鬼头镰","狂魔镰","恶龙之齿","破魄","肃魂","无敌","五丁开山","元神禁锢","护法灭魔","碧血干戚","裂天"},
    剑 = {"青铜短剑","铁齿剑","吴越剑","青锋剑","龙泉剑","黄金剑","游龙剑","北斗七星剑","碧玉剑","鱼肠","倚天","湛卢","魏武青虹","灵犀神剑","四法青云","霜冷九州","擒龙"},
    双短剑 = {"双短剑","镔铁双剑","龙凤双剑","竹节双剑","狼牙双剑","鱼骨双剑","赤焰双剑","墨玉双剑","梅花双剑","阴阳","月光双剑","灵蛇","金龙双剪","连理双树","祖龙对剑","紫电青霜","浮犀"},
    飘带 = {"五色缎带","幻彩银纱","金丝彩带","无极丝","天蚕丝带","云龙绸带","七彩罗刹","缚神绫","九天仙绫","彩虹","流云","碧波","秋水落霞","晃金仙绳","此最相思","揽月摘星","九霄"},
    爪刺 = {"铁爪","天狼爪","幽冥鬼爪","青龙牙","勾魂爪","玄冰刺","青刚刺","华光刺","龙鳞刺","撕天","毒牙","胭脂","九阴勾魂","雪蚕之刺","贵霜之牙","忘川三途","离钩"},
    扇 = {"折扇","铁骨扇","精钢扇","铁面扇","百折扇","劈水扇","神火扇","阴风扇","风云雷电","太极","玉龙","秋风","画龙点睛","秋水人家","逍遥江湖","浩气长舒","星瀚"},
    魔棒 = {"细木棒","金丝魔棒","玉如意","点金棒","云龙棒","幽路引魂","满天星","水晶棒","日月光华","沧海","红莲","盘龙","降魔玉杵","青藤玉树","墨玉骷髅","丝萝乔木","醍醐"},
    锤 = {"松木锤","镔铁锤","八棱金瓜","狼牙锤","烈焰锤","破甲战锤","震天锤","巨灵神锤","天崩地裂","八卦","鬼牙","雷神","混元金锤","九瓣莲花","鬼王蚀日","狂澜碎岳","碎寂"},
    鞭 = {"牛皮鞭","牛筋鞭","乌龙鞭","钢结鞭","蛇骨鞭","玉竹金铃","青藤柳叶鞭","雷鸣嗜血鞭","混元金钩","龙筋","百花","吹雪","游龙惊鸿","仙人指路","血之刺藤","牧云清歌","霜陨"},
    环圈 = {"黄铜圈","精钢日月圈","离情环","金刺轮","风火圈","赤炎环","蛇形月","子母双月","斜月狼牙","如意","乾坤","月光双环","别情离恨","金玉双环","九天金线","无关风月","朝夕"},
    刀 = {"柳叶刀","苗刀","夜魔弯刀","金背大砍刀","雁翅刀","破天宝刀","狼牙刀","龙鳞宝刀","黑炎魔刀","冷月","屠龙","血刃","偃月青龙","晓风残月","斩妖泣血","业火三灾","鸣鸿"},
    法杖 = {"曲柳杖","红木杖","白椴杖","墨铁拐","玄铁牛角杖","鹰眼法杖","腾云杖","引魂杖","碧玺杖","业焰","玉辉","鹿鸣","庄周梦蝶","凤翼流珠","雪蟒霜寒","碧海潮生","弦月"},
    弓弩 = {"硬木弓","铁胆弓","紫檀弓","宝雕长弓","錾金宝弓","玉腰弯弓","连珠神弓","游鱼戏珠","灵犀望月","非攻","幽篁","百鬼","冥火薄天","龙鸣寒水","太极流光","九霄风雷","若木"},
    宝珠 = {"琉璃珠","水晶珠","珍宝珠","翡翠珠","莲华珠","夜灵珠","如意宝珠","沧海明珠","无量玉璧","离火","飞星","月华","回风舞雪","紫金葫芦","裂云啸日","云雷万里","赤明"},
    巨剑 = {"钝铁重剑","桃印铁刃","赭石巨剑","壁玉长铗","青铜古剑","金错巨刃","惊涛雪","醉浮生","沉戟天戊","鸦九","昆吾","弦歌","墨骨枯麟","腾蛇郁刃","秋水澄流","百辟镇魂","长息"},
    灯笼 = {"素纸灯","竹骨灯","红灯笼","鲤鱼灯","芙蓉花灯","如意宫灯","玲珑盏","玉兔盏","冰心盏","蟠龙","云鹤","凤荷","金风玉露","凰火燎原","月露清愁","夭桃秾李","荒尘"},
    伞 = {"油纸伞","红罗伞","紫竹伞","锦绣椎","幽兰帐","琳琅盖","孔雀羽","金刚伞","落梅伞","鬼骨","云梦","枕霞","碧火琉璃","雪羽穿云","月影星痕","浮生归梦","晴雪"},
    双斧乾 = {"顽石双斧(乾)","镔铁双斧(乾)","黑曜双斧(乾)","枭首双斧(乾)","破军双斧(乾)","隳城双戚(乾)","飞头蛮(乾)","竹叶青(乾)","鲛煞(乾)","啖月(乾)","义战(乾)","恶来(乾)","烬世野火(乾)","九州海沸(乾)","八狱末劫(乾)","罗喉计都(乾)","非天(乾)"},
    双斧坤 = {"顽石双斧(坤)","镔铁双斧(坤)","黑曜双斧(坤)","枭首双斧(坤)","破军双斧(坤)","隳城双戚(坤)","飞头蛮(坤)","竹叶青(坤)","鲛煞(坤)","啖月(坤)","义战(坤)","恶来(坤)","烬世野火(坤)","九州海沸(坤)","八狱末劫(坤)","罗喉计都(坤)","非天(坤)"},
  }
  
  local 武器等级 = {
    [1] = {4,5,6},
    [2] = {7,8,9},
    [3] = {10,11,12},
    [4] = {13,14,15},
    [5] = {15,16,17}
  }
  local 武器列表 = 武器等级[n]
  if not 武器列表 then return end
  
  local 武器子类 = 多开数据[多开数据.当前].__主控:取武器子类(武器数据.子类)
  local 临时武器集合 = 武器表[武器子类]
  if not 临时武器集合 then
    return
  end
  for i=1,3 do
    光武拓印.新武器网格:置物品(nil, i)
  end
  当前等级选择 = n
  选择物品 = nil
  for o=1,3 do
    local 物品等级 = 武器列表[o]
    local 物品名称 = 临时武器集合[物品等级]
    if 物品名称 then
      local 临时武器 = table.copy(武器数据)
      临时武器.名称 = 物品名称
      临时武器.原始编号 = 道具格子
      光武拓印.新武器网格:置物品(临时武器, o)
    end
  end
  
  -- if 光武拓印.新武器网格.刷新 then
  --   光武拓印.新武器网格:刷新()
  -- end
end

local 关闭 = 光武拓印:创建我的按钮(__res:getPNGCC(1, 401, 0, 46, 46), "关闭", 450, 0)
function 关闭:左键弹起(x, y, msg)
    光武拓印:置可见(false)
end
local 选择武器 = 光武拓印:创建我的按钮(__res:getPNGCC(1,401,65,175,43,true)["拉伸"](__res:getPNGCC(1,401,65,175,43,true), 85, 35), "选择武器", 70, 60, "选择武器")
function 选择武器:左键弹起(x, y, msg)
  发送数据(当前, 3782)
end

for i, v in ipairs({
  {name = "30级造型",x = 395,y = 55,tcp =  __res:getPNGCC(3, 880, 331, 86, 37, true):拉伸(63, 30),tcp2 = __res:getPNGCC(3, 876, 289, 85, 36, true):拉伸(63, 30),font = "30级", dj = 1},
  {name = "60级造型",x = 395,y = 55+35,tcp =  __res:getPNGCC(3, 880, 331, 86, 37, true):拉伸(63, 30),tcp2 = __res:getPNGCC(3, 876, 289, 85, 36, true):拉伸(63, 30),font = "60级", dj = 2},
  {name = "90级造型",x = 395,y = 55+35*2,tcp =  __res:getPNGCC(3, 880, 331, 86, 37, true):拉伸(63, 30),tcp2 = __res:getPNGCC(3, 876, 289, 85, 36, true):拉伸(63, 30),font = "90级", dj = 3},
  {name = "120级造型",x = 395,y = 55+35*3,tcp =  __res:getPNGCC(3, 880, 331, 86, 37, true):拉伸(63, 30),tcp2 = __res:getPNGCC(3, 876, 289, 85, 36, true):拉伸(63, 30),font = "120级", dj = 4},
  {name = "150级造型",x = 395,y = 55+35*4,tcp =  __res:getPNGCC(3, 880, 331, 86, 37, true):拉伸(63, 30),tcp2 = __res:getPNGCC(3, 876, 289, 85, 36, true):拉伸(63, 30),font = "150级", dj = 5},
}) do
local 等级按钮 = 光武拓印:创建我的单选按钮(v.tcp, v.tcp2, v.name, v.x, v.y, v.font)
function 等级按钮:左键弹起(x, y)
          选择等级武器(v.dj)
  end
end
local 确认转换 = 光武拓印:创建我的按钮(__res:getPNGCC(1,401,65,175,43,true)["拉伸"](__res:getPNGCC(1,401,65,175,43,true), 100, 35), "确认转换", 235, 185, "确认转换")
function 确认转换:左键弹起(x, y)
  if not 武器数据 or not 道具格子 then
    多开数据[多开数据.当前].__UI弹出.提示框:打开("#Y请先选择武器1！")
    return
  end
  if not 选择物品 then
    多开数据[多开数据.当前].__UI弹出.提示框:打开("#Y请选择你要幻化的武器！")
    return
  end
  
  local 新造型物品 = 光武拓印.新武器网格.子控件[选择物品]._spr.物品
  if not 新造型物品 then return end
  
  local 事件 = function()
    发送数据(当前, 3783, {
      道具格子 = 道具格子,
      新造型 = 新造型物品.名称
    })
    光武拓印:重置()
  end
  
  多开数据[当前].__UI界面.窗口层.文本栏:打开("你确定要将#Y"..武器数据.名称.."#W幻化为#Y"..新造型物品.名称.."#W吗？", 285, 155, 390, 200, 事件)
end