local 双斧转换类 = 多开数据[多开数据.当前].__UI界面["窗口层"]["创建我的窗口"](多开数据[多开数据.当前].__UI界面["窗口层"], "双斧转换类", 159 + abbr.py.x, 37 + abbr.py.y, 650, 480)
local 当前=多开数据.当前
function 双斧转换类:初始化()
    local nsf = require('SDL.图像')(769,470)
    if nsf:渲染开始() then
        置窗口背景("双斧转换", 0, 0, 633,469, true):显示(0, 0)
        __res:取图像(__res:取地址("shape/jlc/", 0x5d996705)):显示(0, 20)
        nsf:渲染结束()
    end
    self:置精灵(nsf:到精灵())

end

function 双斧转换类:打开() --九黎城7.25
  self:置可见(true)
  self.乾坤 = 0
  self.选中道具 = 0
  self.材料网格["置物品"](self.材料网格, nil)
  
end
function 双斧转换类:重置()
  local nsf = require("SDL.图像")(650, 480)
  if nsf["渲染开始"](nsf) then
    require("SDL.图像")("assets/shape/jlc/qian.png"):显示(113, 310)
    require("SDL.图像")("assets/shape/jlc/kun.png"):显示(220, 313)
    nsf["渲染结束"](nsf)
  end
  self.图像 = nsf["到精灵"](nsf)
end


local 材料网格 = 双斧转换类["创建网格"](双斧转换类, "材料网格", 155, 147, 55, 55)
function 材料网格:初始化()
  self:创建格子(55, 55, 0, 0, 1, 1)
end
function 材料网格:左键弹起(x, y, a, b, msg)
  双斧转换类["乾坤"] = 0
  多开数据[当前].__UI弹出.双斧转换选择:打开(双斧转换类)
end
function 材料网格:置物品(data, bh, pid)
  if not bh then
    for i = 1, #self.子控件 do
      local lssj = __材料格子["创建"](当前)
      lssj["置物品"](lssj, data)
      self.子控件[i]["置精灵"](self.子控件[i], lssj)
    end
  else
    local lssj = __材料格子["创建"](当前)
    lssj["置物品"](lssj, data)
    self.子控件[bh]["置精灵"](self.子控件[bh], lssj)
    lssj["原始编号"] = pid
  end
end

local 关闭 = 双斧转换类["创建我的按钮"](双斧转换类, __res:getPNGCC(1, 401, 0, 46, 46), "关闭", 597, 0)
local 选择乾 = 双斧转换类["创建我的was单选按钮"](双斧转换类, "shape/jlc/a87ce508.was", "选择乾", 107, 305)
local 选择坤 = 双斧转换类["创建我的was单选按钮"](双斧转换类, "shape/jlc/e9d1ef96.was", "选择坤", 210, 305)
local 还原 = 双斧转换类["创建我的was按钮"](双斧转换类, "shape/jlc/23234be8.was", "还原", 65, 380)
local 铸斧 = 双斧转换类["创建我的was按钮"](双斧转换类, "shape/jlc/29c84780.was", "铸斧", 215, 380)
function 关闭:左键弹起(x, y, msg)
  双斧转换类["置可见"](双斧转换类, false)
  双斧转换类["选择乾"]["置可见"](双斧转换类["选择乾"],true)
  双斧转换类["选择坤"]["置可见"](双斧转换类["选择坤"],true)
end

function 选择乾:左键弹起(x, y, msg)
  双斧转换类["乾坤"] = 1
  双斧转换类["重置"](双斧转换类)
  双斧转换类["选择乾"]["置可见"](双斧转换类["选择乾"],false)
  双斧转换类["选择坤"]["置可见"](双斧转换类["选择坤"],true)
end
function 选择坤:左键弹起(x, y, msg)
  双斧转换类["乾坤"] = 2
  双斧转换类["重置"](双斧转换类)
  双斧转换类["选择乾"]["置可见"](双斧转换类["选择乾"],true)
  双斧转换类["选择坤"]["置可见"](双斧转换类["选择坤"],false)
end
function 还原:左键弹起(x, y, msg)
  if 双斧转换类["选中道具"]==0 then
    多开数据[当前].__UI弹出["提示框"]["打开"](多开数据[当前].__UI弹出["提示框"], "请选择一把武器")
  elseif 双斧转换类["材料网格"]["子控件"][1]._spr["原始编号"] then
    local 事件 = function()
        发送数据(当前,3810.9, {
          ["编号"] = 双斧转换类["材料网格"]["子控件"][1]._spr["原始编号"],
          ["识别码"] = 双斧转换类["材料网格"]["子控件"][1]._spr["物品"].识别码,
        })
        关闭:左键弹起(0, 0, nil)

    end
    多开数据[当前].__UI界面.窗口层.文本栏:打开("你确定要还原这个武器吗？", 285, 155, 390, 200, 事件)
  end
end
function 铸斧:左键弹起(x, y, msg)
  if 双斧转换类["选中道具"]==0 then
    多开数据[当前].__UI弹出["提示框"]["打开"](多开数据[当前].__UI弹出["提示框"], "请选择一把武器")
  elseif 双斧转换类["乾坤"]==0 then
    多开数据[当前].__UI弹出["提示框"]["打开"](多开数据[当前].__UI弹出["提示框"], "请选择铸成乾还是坤")
  elseif 双斧转换类["材料网格"]["子控件"][1]._spr["原始编号"] then
    local 事件 = function()
        发送数据(当前,3810.5, {
          ["乾坤"] = 双斧转换类["乾坤"],
          ["编号"] = 双斧转换类["材料网格"]["子控件"][1]._spr["原始编号"],
          ["识别码"] = 双斧转换类["材料网格"]["子控件"][1]._spr["物品"].识别码,
        })
        关闭:左键弹起(0, 0, nil)
    end
    local fjwz="乾"
    if 双斧转换类["乾坤"]==2 then
      fjwz="坤"
    end
    多开数据[当前].__UI界面.窗口层.文本栏:打开("你确定要将这武器铸成#R/" ..fjwz .."#W/吗？", 285, 155, 390, 200, 事件)
  end
end