local 召唤兽换造型 = 多开数据[多开数据.当前].__UI界面.窗口层:创建我的窗口("召唤兽换造型",80+67+30 + abbr.py.x, 42-25 + abbr.py.y, 610, 470+18+25+10)
local 当前=多开数据.当前

function 召唤兽换造型:初始化()
  local nsf = require("SDL.图像")(610, 470+18+25+10)
  if nsf["渲染开始"](nsf) then
    置窗口背景("召唤兽换造型", 0, 12, 535,460+18+25, true):显示(0, 0)
    __res:getPNGCC(5, 686, 0, 213, 304):拉伸(157, 158):显示(9, 89) --两底图
    __res:getPNGCC(5, 686, 0, 213, 304):拉伸(157, 158):显示(9+331+27, 89) --两底图
    字体16:置颜色(__取颜色("白色"))
    字体16:取图像("每次改变需花费3000W银子"):显示(46+18,258+11)
    字体16:取图像("*上下滚动可翻页*"):显示(301,258+11)
  end
  self:置精灵(nsf["到精灵"](nsf))
end


function 召唤兽换造型:打开(内容)
  self.模型格子1 = __UI模型格子.创建(当前)
  self.模型格子2 = __UI模型格子.创建(当前)
  self.选择范围=1
  self.是否进阶=false
  self.主bb认证码=nil
  self.副bb模型=nil
  self:置可见(true)
  self:计算范围宝宝名称()
  self:我的按钮18置文字(召唤兽换造型.切换进阶造型按钮,__res:getPNGCC(3, 511, 11, 117, 43, true):拉伸(120, 35), "非进阶造型")
  self.an1:置选中(true)
  -- self.bb列表:重置头像()
end


function 召唤兽换造型:更新(dt)
  self.模型格子1:更新(dt)
  self.模型格子2:更新(dt)
end
function 召唤兽换造型:显示(x, y)
  self.模型格子1:显示(x, y)
  self.模型格子2:显示(x, y)
end

function 召唤兽换造型:重置模型1(num)
  if 多开数据[当前].角色信息.宝宝列表[num] then
    self.主bb认证码=多开数据[当前].角色信息.宝宝列表[num].认证码
    召唤兽换造型.模型格子1:置数据(多开数据[当前].角色信息.宝宝列表[num], "召唤兽", 150-28-42, 225-37+21)
  end
end

function 召唤兽换造型:重置模型2(bb2)
  if  召唤兽换造型.是否进阶 then
    self.副bb模型="进阶"..bb2.模型
    召唤兽换造型.模型格子2:置数据({模型="进阶"..bb2.模型}, "召唤兽", 150-28-42+331+27, 225-37+21)
  else
    self.副bb模型=bb2.模型
    召唤兽换造型.模型格子2:置数据(bb2, "召唤兽", 150-28-42+331+27, 225-37+21)
  end
  
end



local bb列表按钮 = 召唤兽换造型["创建我的按钮18"](召唤兽换造型,  __res:getPNGCC(5, 943, 59, 34, 34), "bb列表按钮",113+15, 109-19)
function bb列表按钮:左键弹起(x, y, msg)
  多开数据[当前].__UI弹出["召唤兽选择"]["打开"](多开数据[当前].__UI弹出["召唤兽选择"], 151+150, 133, "召唤兽换造型")
end





local bbfw={
	[1]={"泡泡","树怪","巨蛙","大海龟","海星","章鱼","护卫","草龟","草叶虫","竹笋虫","积水蛙","元宝龟","天机虫","野猪","大蝙蝠","海毛虫",
	       "狸","强盗","山贼","赌徒","沙狸","海狸","羊头怪","花妖","骷髅怪","蛤蟆精","老虎","黑熊","狐狸精","岩龟","望月蛙","强盗狸","雪狸","小龙女","狼",
	       "野鬼","虾兵","蟹将","牛妖","熔岩龟","冰龟","沙虫","熔火虫","雪蛙","熔火蛙","纵火狸","兔子怪","黑熊精","牛头","马面","僵尸","龟丞相","蜘蛛精",
	       "毒花龟(日)","毒花龟(夜)", "云龟","金乌虫","月光虫","食魂虫(日)","食魂虫(夜)","鬼蛙","鬼狸","岩冰龟","毒云龟","冰火龟","火云龟",
	       "月光雪蛙","火月蛙","火沙虫","金乌火虫","强盗沙狸","鬼火狸","胖海狸","草叶魂虫","月光金乌虫","积水鬼蛙","雪月蛙","强盗鬼狸","金乌月光虫"},
	--"45-95级"
	[2]={"蝴蝶仙子","雷鸟人","白熊","古代瑞兽","黑山老妖","天将","天兵","风伯","地狱战神","花铃","阿宝","蛟龙","凤凰","蚌精","鲛人","碧水夜叉","雨师","独角鬼王","月影仙","炼丹童子","龙鲤","芙蓉仙子","如意仙子","星灵仙子","巡游天神","犀牛将军兽形","锦毛貂精","千年蛇魅","野猪精","百足将军","鼠先锋","泪妖","镜妖","日游神","金翼","吸血鬼","幽灵","灵符女娲","律法女娲","阴阳伞","犀牛将军人形"},
	--"105-135级"
	[3]={"云游火","玄珠灵仙","巨石守卫夜","巨石守卫昼","五行山神(火)","五行山神(金)","五行山神(木)","五行山神(水)","五行山神(土)","鬼将","净瓶女娲","幽萤娃娃","画魂","涂山瞳","大力金刚","夜罗刹","雾中仙","灵鹤","炎魔神","噬天虎","金饶僧","月魅","夜游神","幻姬","琴仙","踏云兽","红萼仙子","葫芦宝贝","猫灵兽形","狂豹兽形","蝎子精","龙龟","机关人车形","机关人人形"},
	--"145-175级"
	[4]={"机关兽","机关鸟","连弩车","巴蛇","猫灵人形","狂豹人形","长眉灵猴","巨力神猿","修罗傀儡鬼","藤蔓妖花","无常鬼差白","无常鬼差黑","执音","有苏鸩",
	       "司辰侍者过去","司辰侍者未来","混沌兽","蜃气妖","修罗傀儡妖","金身罗汉","曼珠沙华","毗舍童子","真陀护法","灵灯侍者","涂山雪","魔化毗舍童子",
	       "雷龙","觉醒涂山雪","司风","司雪","司雨","自在心猿","持国巡守","增长巡守","般若天女","广目巡守","多闻巡守","妙华天女","谛听","长乐灵仙","沙暴","蛟魔王"},
  [5]={"超级六耳猕猴","超级神龙","超级青鸾","超级玉兔","超级白泽","超级泡泡","超级赤焰兽","超级神牛","超级神虎","超级海豚","超级人参娃娃","超级大熊猫","超级金猴","超级神蛇乙巳",
		"超级大象","超级灵鹿","超级大鹏","超级筋斗云","超级神兔","超级灵狐","超级神蛇","超级神马","超级麒麟","超级神羊","超级孔雀","超级神猴","超级神鸡","超级小白龙","超级土地公公"}

}
function 召唤兽换造型:计算范围宝宝名称()
  self.宝宝名称按钮=bbfw[self.选择范围]
  召唤兽换造型.bb名称网格:置数据()
end


local bb名称网格 = 召唤兽换造型["创建网格"](召唤兽换造型, "bb名称网格", 9, 276+40, 574, 181)
function bb名称网格:初始化()
  -- self:创建格子(328, 140, 0, 0, 3, 2,true)
end

function bb名称网格:置数据()
  -- print(#召唤兽换造型.宝宝名称按钮//5)
  self:创建格子(100+5, 35+5, 6, 0,#召唤兽换造型.宝宝名称按钮//5+1 ,5 ,true)--//5+1
  for i, v in ipairs(self.子控件) do
    if 召唤兽换造型.宝宝名称按钮[i] then
      local annsdad =  self.子控件[i]["创建我的按钮18"]( self.子控件[i], __res:getPNGCC(3, 126, 563, 111, 36, true):拉伸(85, 35), "annsdad"..i,  0, 0, 召唤兽换造型.宝宝名称按钮[i])
      function annsdad:左键单击(x, y, msg)
        召唤兽换造型:重置模型2({模型=召唤兽换造型.宝宝名称按钮[i]})
      end
      v:置可见(true, true)
      bb名称网格["子控件"][i]["置精灵"](bb名称网格["子控件"][i], lssj)
    end
  end
end





local 切换进阶造型按钮 = 召唤兽换造型["创建我的按钮18"](召唤兽换造型,  __res:getPNGCC(3, 511, 11, 117, 43, true):拉伸(120, 35), "切换进阶造型按钮",205, 109,"非进阶造型")
function 切换进阶造型按钮:左键弹起(x, y, msg)
  召唤兽换造型.是否进阶=not 召唤兽换造型.是否进阶
  if  召唤兽换造型.是否进阶 then
    self:我的按钮18置文字(召唤兽换造型.切换进阶造型按钮,__res:getPNGCC(3, 511, 11, 117, 43, true):拉伸(120, 35), "进阶造型")
  else
    self:我的按钮18置文字(召唤兽换造型.切换进阶造型按钮,__res:getPNGCC(3, 511, 11, 117, 43, true):拉伸(120, 35), "非进阶造型")
  end

end

local 确认修改 = 召唤兽换造型["创建我的按钮18"](召唤兽换造型,  __res:getPNGCC(3, 511, 11, 117, 43, true):拉伸(120, 35), "确认修改",205, 109+36+14,"确认修改")
function 确认修改:左键弹起(x, y, msg)
  if 召唤兽换造型.主bb认证码 and  召唤兽换造型.副bb模型 then
    local 事件 = function()
      发送数据(当前,5027,{新造型=召唤兽换造型.副bb模型,认证码=召唤兽换造型.主bb认证码})
    end
    多开数据[当前].__UI界面.窗口层.文本栏:打开("是否需要花费#G3000W#W银子，将这个宝宝造型更改为#Y"..召唤兽换造型.副bb模型.."#W？", 285, 155, 390, 200, 事件)
  end
end





for i, v in ipairs({
  {
    name = "an1",
    x = 5,
    y = 0,
    tcp = __res:getPNGCC(3, 511, 11, 117, 43, true):拉伸(100,32),
    tcp2 = __res:getPNGCC(3, 390, 12, 118, 43, true):拉伸(100,32),
    font = "0-35级"
  },
  {
    name = "an2",
    x = 5+105*1,
    y = 0,
    tcp = __res:getPNGCC(3, 511, 11, 117, 43, true):拉伸(100,32),
    tcp2 = __res:getPNGCC(3, 390, 12, 118, 43, true):拉伸(100,32),
    font = "45-95级"
  },
  {
    name = "an3",
    x =  5+105*2,
    y = 0,
    tcp = __res:getPNGCC(3, 511, 11, 117, 43, true):拉伸(100,32),
    tcp2 = __res:getPNGCC(3, 390, 12, 118, 43, true):拉伸(100,32),
    font = "105-135级"
  },
  {
    name = "an4",
    x =  5+105*3,
    y = 0,
    tcp = __res:getPNGCC(3, 511, 11, 117, 43, true):拉伸(100,32),
    tcp2 = __res:getPNGCC(3, 390, 12, 118, 43, true):拉伸(100,32),
    font = "145-175级"
  },
  {
    name = "an5",
    x =  5+105*4,
    y = 0,
    tcp = __res:getPNGCC(3, 511, 11, 117, 43, true):拉伸(100,32),
    tcp2 = __res:getPNGCC(3, 390, 12, 118, 43, true):拉伸(100,32),
    font = "神兽"
  }
}) do
  local 临时函数 = 召唤兽换造型["创建我的单选按钮"](召唤兽换造型, v.tcp, v.tcp2, v.name, v.x, v.y+49, v.font)
  function  临时函数:左键弹起(x, y)
    召唤兽换造型.选择范围=i
    召唤兽换造型:计算范围宝宝名称()
  end
end

local 关闭 = 召唤兽换造型["创建我的按钮"](召唤兽换造型, __res:getPNGCC(1, 401, 0, 46, 46), "关闭", 665-40-48-87, 0)
function 关闭:左键弹起(x, y, msg)
  召唤兽换造型["置可见"](召唤兽换造型, false)
end
