-- @Author: baidwwy
-- @Date:   2025-06-06 13:11:28
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2026-04-19 23:20:43
local s窗宽,s窗高 =820,581
local 武神坛比武 = 多开数据[多开数据.当前].__UI界面.窗口层:创建我的窗口("武神坛比武", 50+20  + abbr.py.x, 10 + abbr.py.y,820,581)
local 当前 = 多开数据.当前

local format = string.format
local 介绍文本 = 武神坛比武:创建文本("介绍文本", 170, 89, 230, 253)
function 介绍文本:初始化()
end

function 武神坛比武:初始化()
  local nsf = require("SDL.图像")(s窗宽,s窗高)
  if nsf:渲染开始() then

    __res:取图片("shape/pic/wstbj.png"):显示(0, 0)
    nsf:渲染结束()
  end
  self:置精灵(nsf:到精灵())
  self.赛前技能={}
end
function 武神坛比武:重置()
  local nsf = require("SDL.图像")(s窗宽,s窗高)
  if nsf:渲染开始() then
 __res:取图片("shape/pic/wstbj.png"):显示(0, 0)



 字体16:置颜色(__取颜色('黑色'))
 字体16:取图像(self.冠军 or ""):显示(185+50+130,343-45*3+23)

字体16:取图像(self.二强1 or ""):显示(195+128,342-45*2+27)
字体16:取图像(self.二强2 or ""):显示(440-72-75+128,342-45*2+27)

字体16:取图像(self.四强1 or ""):显示(120+131,343-45*3+25)
字体16:取图像(self.四强2 or ""):显示(120+131,343-45*2+25)
字体16:取图像(self.四强3 or ""):显示(200+120+125+55,343-45*3+25)
字体16:取图像(self.四强4 or ""):显示(200+120+125+55,343-45*2+25)

字体16:取图像(self.八强1 or ""):显示(135+40,346-45*4+27)
字体16:取图像(self.八强2 or ""):显示(135+40,343-45*3+27)
字体16:取图像(self.八强3 or ""):显示(135+40,342-45*2+27)
字体16:取图像(self.八强4 or ""):显示(135+40,340-45+27)

字体16:取图像(self.八强5 or ""):显示(440+130,346-45*4+27)
字体16:取图像(self.八强6 or ""):显示(440+130,343-45*3+27)
字体16:取图像(self.八强7 or ""):显示(440+130,342-45*2+27)
字体16:取图像(self.八强8 or ""):显示(440+130,340-45+27)
---------------------------------
字体16:取图像(self.十六强1 or ""):显示(29+75,349-45*6+28)
字体16:取图像(self.十六强2 or ""):显示(29+75,346-45*5+28)
字体16:取图像(self.十六强3 or ""):显示(29+75,344-45*4+28)
字体16:取图像(self.十六强4 or ""):显示(29+75,342-45*3+28)
字体16:取图像(self.十六强5 or ""):显示(29+75,341-45*2+28)
字体16:取图像(self.十六强6 or ""):显示(29+75,338-45+28)
字体16:取图像(self.十六强7 or ""):显示(29+75,338+28)
字体16:取图像(self.十六强8 or ""):显示(29+75,338+42+28)

字体16:取图像(self.十六强9 or ""):显示(515+130,348-45*6+28)
字体16:取图像(self.十六强10 or ""):显示(515+130,346-45*5+28)
字体16:取图像(self.十六强11 or ""):显示(515+130,344-45*4+28)
字体16:取图像(self.十六强12 or ""):显示(515+130,342-45*3+28)
字体16:取图像(self.十六强13 or ""):显示(515+130,341-45*2+28)
字体16:取图像(self.十六强14 or ""):显示(515+130,338-45+28)
字体16:取图像(self.十六强15 or ""):显示(515+130,338+28)
字体16:取图像(self.十六强16 or ""):显示(515+130,338+41+28)
字体14:置颜色(__取颜色('白色'))
字体14:取图像(self.说明1 or ""):显示(168,297+50+30)
字体14:取图像(self.说明2 or ""):显示(168,317+50+30 )
字体14:取图像(self.说明3 or ""):显示(168,337+50+30)

    nsf:渲染结束()
  end
  self:置精灵(nsf:到精灵())
 
end

for i, v in ipairs {
  { name = '报名', x = 260,y =320 , tcp = __res:getPNGCC(3, 511, 11, 117, 43, true):置拉伸(55, 33), font = "报名" },
  { name = '领取', x = 400,y =320 , tcp = __res:getPNGCC(3, 511, 11, 117, 43, true):置拉伸(55, 33), font = "领取" },
--  { name = '赛前备战', x = 660, y =490 , tcp = __res:getPNGCC(3, 511, 11, 117, 43, true):置拉伸(55, 33), font = "赛前备战" },
 
} do
  local 临时函数 = 武神坛比武:创建我的按钮(v.tcp, v.name, v.x, v.y, v.font)
  function 临时函数:左键弹起(x, y)
      if v.name == '报名' then
        发送数据(当前,197.1)
        elseif v.name == '领取' then
          发送数据(当前,197.2)
      end
    end
  end
function 武神坛比武:打开(数据 )
  self:置可见(true)
        self.武神坛开启=数据.武神坛开启
       
        self.冠军=数据.武神坛冠军[1] or "冠军"
 
        self.二强1=数据.武神坛二强[1] or "冠军"
        self.二强2=数据.武神坛二强[2] or "冠军"
  
        self.四强1=数据.武神坛四强[1] or "冠军"
        self.四强2=数据.武神坛四强[2] or "冠军"
        self.四强3=数据.武神坛四强[3] or "冠军"
        self.四强4=数据.武神坛四强[4] or "冠军"
  
        self.八强1=数据.武神坛八强[1] or "冠军"
        self.八强2=数据.武神坛八强[2] or "冠军"
        self.八强3=数据.武神坛八强[3] or "冠军"
        self.八强4=数据.武神坛八强[4] or "冠军"
        self.八强5=数据.武神坛八强[5] or "冠军"
        self.八强6=数据.武神坛八强[6] or "冠军"
        self.八强7=数据.武神坛八强[7] or "冠军"
        self.八强8=数据.武神坛八强[8] or "冠军"
  
         self.十六强1=数据.武神坛十六强[1] or "冠军"
        self.十六强2=数据.武神坛十六强[2] or "冠军"
        self.十六强3=数据.武神坛十六强[3]or "冠军"
        self.十六强4=数据.武神坛十六强[4] or "冠军"
        self.十六强5=数据.武神坛十六强[5] or "冠军"
        self.十六强6=数据.武神坛十六强[6] or "冠军"
        self.十六强7=数据.武神坛十六强[7] or "冠军"
        self.十六强8=数据.武神坛十六强[8] or "冠军"
        self.十六强9=数据.武神坛十六强[9] or "冠军"
        self.十六强10=数据.武神坛十六强[10] or "冠军"
        self.十六强11=数据.武神坛十六强[11]or "冠军"
        self.十六强12=数据.武神坛十六强[12] or "冠军"
        self.十六强13=数据.武神坛十六强[13] or "冠军"
        self.十六强14=数据.武神坛十六强[14] or "冠军"
        self.十六强15=数据.武神坛十六强[15] or "冠军"
        self.十六强16=数据.武神坛十六强[16] or "冠军"
 
        self.说明1=数据.说明1
        self.说明2=数据.说明2
        self.说明3=数据.说明3
 
 
    self:重置()
  end
function 武神坛比武:刷新数据(数据)

  self.武神坛开启=数据.武神坛开启
  
        self.冠军=数据.武神坛冠军[1] or nil
  
        self.二强1=数据.武神坛二强[1] or nil
        self.二强2=数据.武神坛二强[2] or nil
  
        self.四强1=数据.武神坛四强[1] or nil
        self.四强2=数据.武神坛四强[2] or nil
        self.四强3=数据.武神坛四强[3] or nil
        self.四强4=数据.武神坛四强[4] or nil
  
         self.八强1=数据.武神坛八强[1] or nil
        self.八强2=数据.武神坛八强[2] or nil
        self.八强3=数据.武神坛八强[3]or nil
        self.八强4=数据.武神坛八强[4] or nil
        self.八强5=数据.武神坛八强[5] or nil
        self.八强6=数据.武神坛八强[6] or nil
        self.八强7=数据.武神坛八强[7] or nil
        self.八强8=数据.武神坛八强[8] or nil
  
        self.十六强1=数据.武神坛十六强[1] or nil
        self.十六强2=数据.武神坛十六强[2] or nil
        self.十六强3=数据.武神坛十六强[3]or nil
        self.十六强4=数据.武神坛十六强[4] or nil
        self.十六强5=数据.武神坛十六强[5] or nil
        self.十六强6=数据.武神坛十六强[6] or nil
        self.十六强7=数据.武神坛十六强[7] or nil
        self.十六强8=数据.武神坛十六强[8] or nil
        self.十六强9=数据.武神坛十六强[9] or nil
        self.十六强10=数据.武神坛十六强[10] or nil
        self.十六强11=数据.武神坛十六强[11]or nil
        self.十六强12=数据.武神坛十六强[12] or nil
        self.十六强13=数据.武神坛十六强[13] or nil
        self.十六强14=数据.武神坛十六强[14] or nil
        self.十六强15=数据.武神坛十六强[15] or nil
        self.十六强16=数据.武神坛十六强[16] or nil
  
        self.说明1=数据.说明1
        self.说明2=数据.说明2
        self.说明3=数据.说明3
  
        self:重置()
  
  end
local 关闭 = 武神坛比武:创建我的按钮(__res:getPNGCC(1, 401, 0, 46, 46), "关闭", s窗宽-37-50, 0)
function 关闭:左键弹起(x, y, msg)
  武神坛比武:置可见(false)
end

