--[[
Author: GGELUA
Date: 2024-12-26 23:06:42
Last Modified by: GGELUA
Last Modified time: 2024-12-26 23:16:31
--]]
local 阵法系统 = 多开数据[多开数据.当前].__UI界面.窗口层:创建我的窗口("阵法系统",80+67-38 + abbr.py.x, 20+42 + abbr.py.y, 800, 440)
local 当前 =  多开数据.当前

local zhenxing = {
  天覆阵=346+390,
  地载阵=130+390,
  风扬阵=58+390,
  云垂阵=202+390,-- 878    64 64
  鸟翔阵=490+390,
  龙飞阵=562+390,
  虎翼阵=706+390,
  蛇蟠阵=418+390,
  鹰啸阵=274+390,
  雷绝阵=634+390,
}
local sdfh={
  [1]="风扬阵",
  [2]="虎翼阵",
  [3]="天覆阵",
  [4]="云垂阵",
  [5]="鸟翔阵",
  [6]="地载阵",
  [7]="龙飞阵",
  [8]="蛇蟠阵",
  [9]="鹰啸阵",
  [10]="雷绝阵",
}
function 阵法系统:初始化()
  local nsf = require("SDL.图像")(800, 440)
  if nsf["渲染开始"](nsf) then
    置窗口背景("阵法系统", 0, 12, 706+26,429, true):置透明(230):显示(0, 0)
    取灰色背景(0, 0, 589+26, 374, true):置透明(230):显示(18+88, 67-18)
    __res:getPNGCC(4, 75, 17, 2, 2):拉伸(466, 2):显示(18+88, 67-18+86)
    __res:getPNGCC(4, 75, 17, 2, 2):拉伸(2, 374):显示(18+88+466, 67-18)
    for i = 1, 5 do
      置轮廓文字(字体25,i,"黑色","红色",628+15, 63+(i-1)*69)
    end
    __res:getPNGCC(1, 400, 108, 184, 18):显示(292,63+40-1) --经验背景
  end
  self:置精灵(nsf["到精灵"](nsf))
  self.标识 = {}
  字体16["置颜色"](字体16, 255, 255, 255)
  local man = __res["取图像"](__res, __res["取地址"](__res, "shape/ui/dw/", 239329503))
  for i = 1, 5 do
    local nsf = require("SDL.图像")(man["宽度"], man["高度"])
    if nsf["渲染开始"](nsf) then
      man["显示"](man, 0, 0)
      字体16["取描边图像"](字体16, i)["显示"](字体16["取描边图像"](字体16, i), 1, 12)
      nsf["渲染结束"](nsf)
    end
    self.标识[i] = nsf
  end
end
local 升级经验={
	[0]=100,
	[1]=100,
	[2]=2000,
	[3]=3000,
	[4]=4000,
	[5]=5000,
}
function 阵法系统:刷新(内容)
	self.学会阵法=内容.学会阵法
	self.阵法经验=内容.阵法经验
  	self.加成=内容.加成
  	if sdfh[self.选中] then
    	阵法系统:chongz(sdfh[self.选中])
  	end
  	self:详情()
end
function 阵法系统:打开(内容)
  self:置可见(true)
  self.学会阵法=内容.学会阵法
  self.阵法经验=内容.阵法经验
  self.加成=内容.加成
  self.选中=1
  self:详情()
  阵法系统.左侧网格:置数据()
  if self.选中 then
    阵法系统.左侧网格.子控件[self.选中]._spr["确定"] = true  -- 强制选中状态
  end
  self.阵型信息 = __取阵法(sdfh[self.选中])  -- 获取风扬阵的站位信息
  self:chongz(sdfh[self.选中])  -- 渲染风扬阵的详情

end
function 阵法系统:详情()
		self.阵型位置={}
		local NX=self.学会阵法["鸟翔阵"] or 0
		local LJ=self.学会阵法["雷绝阵"] or 0
		local YX=self.学会阵法["鹰啸阵"] or 0
		local SP=self.学会阵法["蛇蟠阵"] or 0
		local LF=self.学会阵法["龙飞阵"] or 0
		local YC=self.学会阵法["云垂阵"] or 0
		local FY=self.学会阵法["风扬阵"] or 0
		local TF=self.学会阵法["天覆阵"] or 0
		local HY=self.学会阵法["虎翼阵"] or 0
		local DZ=self.学会阵法["地载阵"] or 0
		self.阵型位置.鸟翔阵={
			[1]={{x=363,y=255},{增加="速度+"..20+(NX*self.加成*100).."％",减少=""}},
			[2]={{x=429,y=262},{增加="速度+"..20+(NX*self.加成*100).."％",减少=""}},
			[3]={{x=368,y=298},{增加="速度+"..20+(NX*self.加成*100).."％",减少=""}},
			[4]={{x=429,y=223},{增加="速度+"..20+(NX*self.加成*100).."％",减少=""}},
			[5]={{x=297,y=295},{增加="速度+"..20+(NX*self.加成*100).."％",减少=""}},
			说明="全速型阵法，所有队员的速度大幅度提高。每一级效果增加5%，负面效果不变",
		}
		self.阵型位置.雷绝阵={
			[1]={{x=429,y=312},{增加="固定伤害效果+"..12+(LJ*self.加成*100).."%",减少="BB物法伤害+"..10+(LJ*self.加成*100).."%"}},
			[3]={{x=433,y=264},{增加="固定伤害效果+"..12+(LJ*self.加成*100).."%",减少="BB物法伤害+"..10+(LJ*self.加成*100).."%"}},
			[2]={{x=365,y=299},{增加="固定伤害效果+"..12+(LJ*self.加成*100).."%",减少="BB物法伤害+"..10+(LJ*self.加成*100).."%"}},
			[5]={{x=404,y=246},{增加="伤害+"..10+(LJ*self.加成*100).."%",减少="BB伤害+"..10+(LJ*self.加成*100).."%"}},
			[4]={{x=333,y=284},{增加="伤害+"..10+(LJ*self.加成*100).."%",减少="BB伤害+"..10+(LJ*self.加成*100).."%"}},
			说明="全队携带的召唤兽物法伤害效果+10%；1号位固定伤害效果+15%（包括暗器）；2、3号位速度+5%；4号位物法防御+10%，物理伤害+15%；5号位物法防御+10%，法术伤害+15%",
		}
		self.阵型位置.鹰啸阵={
			[1]={{x=419,y=306},{增加="防御+"..10+(YX*self.加成*100).."%",减少=""}},
			[2]={{x=364,y=298},{增加="速度+"..15+(YX*self.加成*100).."%",减少=""}},
			[3]={{x=433,y=266},{增加="速度+"..15+(YX*self.加成*100).."%",减少=""}},
			[4]={{x=399,y=281},{增加="伤害+"..15+(YX*self.加成*100).."%",减少=""}},
			[5]={{x=444,y=329},{增加="伤害+"..15+(YX*self.加成*100).."%",减少=""}},
			说明="攻击型阵法，两翼速度提高，阵前阵尾攻击效果提高，阵中物理防御效果提高。每一级效果增加5%，负面效果不变",
		}
		self.阵型位置.蛇蟠阵={
			[1]={{x=400,y=287},{增加="全体法术防御+"..15+(SP*self.加成*100).."%",减少=""}},
			[2]={{x=367,y=302},{增加="全体法术防御+"..15+(SP*self.加成*100).."%",减少=""}},
			[3]={{x=430,y=274},{增加="全体法术防御+"..15+(SP*self.加成*100).."%",减少=""}},
			[4]={{x=331,y=276},{增加="全体法术防御+"..15+(SP*self.加成*100).."%",减少=""}},
			[5]={{x=433,y=317},{增加="全体法术防御+"..15+(SP*self.加成*100).."%",减少=""}},
			说明="灵力型阵法，阵中及两侧抵御敌人法术的几率增加，阵前及阵尾攻击效果提高。每一级效果增加5%，负面效果不变",
		}
		self.阵型位置.龙飞阵={
			[1]={{x=377,y=293},{增加="法术防御效果+"..10+(LF*self.加成*100).."%",减少=""}},
			[2]={{x=408,y=317},{增加="物理防御效果+"..10+(LF*self.加成*100).."%",减少=""}},
			[3]={{x=419,y=228},{增加="法术对敌伤害+"..30+(LF*self.加成*100).."%",减少="速度-20%"}},
			[4]={{x=306,y=292},{增加="速度+"..10+(LF*self.加成*100).."%",减少=""}},
			[5]={{x=346,y=271},{增加="物法伤害效果+"..20+(LF*self.加成*100).."%",减少=""}},
			说明="全能型阵法，队长法术防御效果提高，阵尾物理防御效果提高，阵前中间队员攻击效果提高，左翼速度提高，右翼法术对敌伤害提高、速度降低。每一级效果增加5%，负面效果不变",
		}
		self.阵型位置.云垂阵={
			[1]={{x=425,y=305},{增加="物法防御+"..20+(YC*self.加成*100).."%",减少="\n速度-15%"}},
			[2]={{x=387,y=242},{增加="物法防御效果+"..10+(YC*self.加成*100).."%",减少=""}},
			[3]={{x=322,y=280},{增加="物法伤害效果+"..20+(YC*self.加成*100).."%",减少=""}},
			[4]={{x=424,y=219},{增加="速度+"..10+(YC*self.加成*100).."%",减少=""}},
			[5]={{x=279,y=301},{增加="速度+"..10+(YC*self.加成*100).."%",减少=""}},
			说明="防御型阵法，两翼队员速度提高，右肋防御效果提高，左肋攻击效果大幅度提高，阵尾防御效果大幅度提高，速度大幅度降低。每一级效果增加5%，负面效果不变",
		}
		self.阵型位置.风扬阵={
			[1]={{x=399,y=282},{增加="物法伤害+"..20+(FY*self.加成*100).."%速度+"..5+(FY*self.加成*100).."%",减少=""}},
			[2]={{x=433,y=264},{增加="物法伤害+"..10+(FY*self.加成*100).."%",减少=""}},
			[3]={{x=365,y=299},{增加="物法伤害+"..10+(FY*self.加成*100).."%",减少=""}},
			[4]={{x=404,y=246},{增加="速度+"..10+(FY*self.加成*100).."%",减少=""}},
			[5]={{x=333,y=284},{增加="速度+"..10+(FY*self.加成*100).."%",减少=""}},
			说明="攻速型阵法，两翼速度效果提高，其余位置攻击效果提高。每一级效果增加5%，负面效果不变",
		}
		self.阵型位置.普通={
			[1]={{x=357,y=255},{增加="1111111",减少=""}},
			[3]={{x=324,y=273},{增加="1111111",减少=""}},
			[2]={{x=389,y=240},{增加="1111111",减少=""}},
			[5]={{x=291,y=292},{增加="1111111",减少=""}},
			[4]={{x=422,y=226},{增加="1111111",减少=""}},
			说明="普通的一字阵形，没有特别的站位效果。",
		}
		self.阵型位置.天覆阵={
			[1]={{x=379,y=278},{增加="   伤害+"..20+(TF*self.加成*100).."％",减少="   速度-10％"}},
			[3]={{x=324,y=273},{增加="   伤害+"..20+(TF*self.加成*100).."％",减少="   速度-10％"}},
			[2]={{x=389,y=240},{增加="   伤害+"..20+(TF*self.加成*100).."％",减少="   速度-10％"}},
			[5]={{x=291,y=292},{增加="   伤害+"..20+(TF*self.加成*100).."％",减少="   速度-10％"}},
			[4]={{x=422,y=226},{增加="   伤害+"..20+(TF*self.加成*100).."％",减少="   速度-10％"}},
			说明="全体队员物理和法术攻击结果+20%，速度-10%（召唤兽无影响）每一级效果增加5%，负面效果不变",
		}
		self.阵型位置.虎翼阵={
			[1]={{x=426,y=299},{增加="物法伤害效果+"..30+(HY*self.加成*100).."%",减少=""}},
			[2]={{x=429,y=262},{增加="物法防御效果+"..10+(HY*self.加成*100).."%",减少=""}},
			[3]={{x=368,y=298},{增加="物法防御效果+"..10+(HY*self.加成*100).."%",减少=""}},
			[4]={{x=429,y=223},{增加="物法伤害效果+"..10+(HY*self.加成*100).."%",减少=""}},
			[5]={{x=297,y=295},{增加="物法伤害效果+"..10+(HY*self.加成*100).."%",减少=""}},
			说明="攻击型阵法，两翼攻击效果提高，中间防御效果提高，阵尾攻击效果大幅度提高。每一级效果增加5%，负面效果不变",
		}
		self.阵型位置.地载阵={
			[1]={{x=399,y=281},{增加="物法防御效果+"..15+(DZ*self.加成*100).."%",减少=""}},
			[2]={{x=373,y=256},{增加="物法伤害效果+"..15+(DZ*self.加成*100).."%",减少=""}},
			[3]={{x=433,y=266},{增加="物法防御效果+"..15+(DZ*self.加成*100).."%",减少=""}},
			[4]={{x=364,y=298},{增加="物法防御效果+"..15+(DZ*self.加成*100).."%",减少=""}},
			[5]={{x=419,y=306},{增加="速度+"..10+(DZ*self.加成*100).."%",减少=""}},
			说明="1、3、4号位物法防御效果+15%，2号位物法伤害效果+15%，5号位速度+10%。每一级效果增加5%，负面效果不变",
		}
end
function 阵法系统:chongz(zf)
  local nsf = require("SDL.图像")(800, 440)
  if nsf["渲染开始"](nsf) then
    if zf then
      for i = 1, 5 do
        self.标识[i]["显示"](self.标识[i], self.阵型信息[i].x + 74-59-14-30-27, self.阵型信息[i].y - 20+24+11-15-23)
      end
      字体18:置颜色(__取颜色("白色"))
      字体18:取图像("当前阵法："):置混合(0):显示(140,63)
      字体18:取图像("当前等级："):置混合(0):显示(140,63+40)
      if self.学会阵法[sdfh[self.选中]] then
        字体18:置颜色(__取颜色("绿色")):取图像(zf.."（已学会）"):置混合(0):显示(140+100,63)
        字体18:置颜色(__取颜色("绿色")):取图像(self.学会阵法[sdfh[self.选中]].."级"):置混合(0):显示(140+100,63+40)
      else
        字体18:置颜色(__取颜色("白色")):取图像(zf.."（未学会）"):置混合(0):显示(140+100,63)
        字体18:置颜色(__取颜色("白色")):取图像("0级"):置混合(0):显示(140+100,63+40)
      end
      for n=1,5 do
        if self.阵型位置[sdfh[self.选中]][n][2].增加 and self.阵型位置[sdfh[self.选中]][n][2].增加~="" then
          字体16:置颜色(__取颜色("绿色"))
          local tsf = 字体16["取图像"](字体16, self.阵型位置[sdfh[self.选中]][n][2].增加)
          tsf:置混合(0)["显示"](tsf, 608-30+(139 - tsf["宽度"]) // 2-0, 63+(n-1)*69+30)
        end
        if self.阵型位置[sdfh[self.选中]][n][2].减少 and self.阵型位置[sdfh[self.选中]][n][2].减少~="" then
          字体16:置颜色(__取颜色("黑色"))
          local tsf = 字体16["取图像"](字体16, self.阵型位置[sdfh[self.选中]][n][2].减少)
          tsf:置混合(0)["显示"](tsf, 608-30+(139 - tsf["宽度"]) // 2-0, 63+25+(n-1)*69+30)
        end
      end
      self:刷新经验()
    end
    
    nsf["渲染结束"](nsf)
  end
  self.图像 = nsf["到精灵"](nsf)
end
function 阵法系统:刷新经验()
  if self.学会阵法[sdfh[self.选中]] then
    if self.学会阵法[sdfh[self.选中]]>=5 then
      阵法系统["经验条"]:置位置(math.floor(升级经验[self.学会阵法[sdfh[self.选中]]]/升级经验[self.学会阵法[sdfh[self.选中]]]  * 100))
    else
      阵法系统["经验条"]:置位置(math.floor(self.阵法经验[sdfh[self.选中]]/升级经验[self.学会阵法[sdfh[self.选中]]]  * 100))
      
    end
  end
end
local 经验条 = 阵法系统["创建进度"](阵法系统, "经验条", 292,63+40, 183, 18)
function 经验条:初始化()
  self:置精灵(__res:getPNGCC(1, 587, 108, 183, 18)["到精灵"]((__res:getPNGCC(1, 587, 108, 183, 18))))
end
function 经验条:显示(x, y)
  if 阵法系统.学会阵法 and sdfh[阵法系统.选中] and 阵法系统.学会阵法[sdfh[阵法系统.选中]] then
    if 阵法系统.学会阵法[sdfh[阵法系统.选中]]>=5 then
      字体14["显示"](字体14, x + 84-10, y + 1, "已满级")
    else
      字体14["显示"](字体14, x + 84-10, y + 1, string.format("%s/%s", 阵法系统.阵法经验[sdfh[阵法系统.选中]],升级经验[阵法系统.学会阵法[sdfh[阵法系统.选中]]]))
    end
  end
  
end
local 左侧网格 = 阵法系统["创建网格"](阵法系统, "左侧网格", 15, 33, 184, 417)
function 左侧网格:初始化()
  self:创建格子(80, 75, 9, 0, 10, 1, true)
end
function 左侧网格:左键弹起(x, y, a, b, msg)
  if 阵法系统["选中"] then
    self.子控件[阵法系统["选中"]]._spr["确定"] = nil
  end
  阵法系统["选中"] = a
  阵法系统["阵型信息"] = __取阵法(sdfh[a])
  阵法系统:chongz(sdfh[a])
  self.子控件[a]._spr["确定"] = true
end
function 左侧网格:置数据()
  for i = 1, #左侧网格["子控件"] do
    local lssj = __阵法系统格子["创建"](当前)
    lssj["置数据"](lssj, sdfh[i])
    左侧网格["子控件"][i]["置精灵"](左侧网格["子控件"][i], lssj)
  end
  
end

local 升级阵法 = 阵法系统["创建我的按钮"](阵法系统, __res:getPNGCC(3, 2, 507, 124, 41, true):拉伸(143, 38), "升级阵法", 40+259,79+50*3+28+34+72, "升级阵法")
function 升级阵法:左键弹起(x, y, msg)
  if  阵法系统.选中 then
    发送数据(当前,3823)
  end

 
end

local 关闭 = 阵法系统["创建我的按钮"](阵法系统, __res:getPNGCC(1, 401, 0, 46, 46), "关闭", 500+29-50+210, 0)
function 关闭:左键弹起(x, y, msg)
  阵法系统["置可见"](阵法系统, false)
end