--[[
    @Author       : GGELUA
    @Date         : 2022-04-02 10:59:32
Last Modified by: GGELUA
Last Modified time: 2023-11-07 12:54:05
--]]

多开数据[多开数据.当前].__UI弹出.技能详情 = 多开数据[多开数据.当前].__UI界面:创建弹出窗口("技能详情",0,0,240,300)
local 技能详情 = 多开数据[多开数据.当前].__UI弹出.技能详情
local 当前 = 多开数据.当前
function 技能详情:初始化()

end

function 技能详情:左键弹起()
    self:置可见(false)
end

function 技能详情:打开(数据,x,y,w,h,mx,学习)
    self.数据 = 数据
    self:置坐标(x,y)
    self:置宽高(w,h)
    self.升级按钮:置可见(学习)

    if self.数据 then
        local nsf = require('SDL.图像')(w,h)
        if nsf:渲染开始() then
            __res:getPNGCC(2,230,964,10,10):显示(0,0)
            __res:getPNGCC(2,230,964+10,10,31):平铺(10,h-20):显示(0,10)
            __res:getPNGCC(2,230,964+41,10,10):显示(0,h-10)

            __res:getPNGCC(2,230+10,964,382,10):平铺(w-20,10):显示(10,0)
            __res:getPNGCC(2,230+10,964+10,382,31):平铺(w-20,h-20):显示(10,10)
            __res:getPNGCC(2,230+10,964+41,382,10):平铺(w-20,10):显示(10,h-10)

            __res:getPNGCC(2,230+392,964,10,10):显示(w-10,0)
            __res:getPNGCC(2,230+392,964+10,10,31):平铺(10,h-20):显示(w-10,10)
            __res:getPNGCC(2,230+392,964+41,10,10):显示(w-10,h-10)
            if mx then
                mx:显示(20,15)
            end
            if 数据.名称 and 数据.名称 ~= "" then
                字体18:置颜色(252,252,8)
                字体18:取图像(数据.名称):显示(90,15)
            end
            nsf:渲染结束()
        end
        self:置精灵(nsf:到精灵())
        if self.数据.类型 == "召唤兽技能" then
            if self.数据[1] then
                技能详情.技能文本:置文本("#G【功效】"..self.数据[1])
            end
            if self.数据[4] then
                技能详情.技能文本:置文本("#Y【消耗】"..self.数据[4])
            end
            if self.数据[12] then
                技能详情.技能文本:置文本("#Y【冷却】"..self.数据[12])
            end
        elseif self.数据.类型 == "召唤兽内丹" then
            if self.数据.等级 then
                技能详情.技能文本:置文本("#G"..self.数据.等级.."层/5层")
            end
            if self.数据.说明 then
                技能详情.技能文本:置文本("#Y"..self.数据.说明)
            end
            if self.数据.效果 then
                技能详情.技能文本:置文本("#G"..self.数据.效果)
            end
        elseif self.数据.类型 == "召唤兽特性" then
            if self.数据.说明 then
                技能详情.技能文本:置文本("#G"..self.数据.说明)
            end
        elseif self.数据.类型 == "坐骑技能" then
            技能详情.技能文本:置文本("#G技能等级："..self.数据.等级.."级")
            技能详情.技能文本:置文本("#Y该技能效果收到饱食度影响,当前效果100%")
            if self.数据[1] then
                技能详情.技能文本:置文本(self.数据[1])
            end
        else
            if self.数据[1] then
                技能详情.技能文本:置文本(self.数据[1])
            end
        end
    else
        local nsf = require('SDL.图像')(w,h)
        if nsf:渲染开始() then
            __res:getPNGCC(2,230,964,10,10):显示(0,0)
            __res:getPNGCC(2,230,964+10,10,31):平铺(10,h-20):显示(0,10)
            __res:getPNGCC(2,230,964+41,10,10):显示(0,h-10)

            __res:getPNGCC(2,230+10,964,382,10):平铺(w-20,10):显示(10,0)
            __res:getPNGCC(2,230+10,964+10,382,31):平铺(w-20,h-20):显示(10,10)
            __res:getPNGCC(2,230+10,964+41,382,10):平铺(w-20,10):显示(10,h-10)

            __res:getPNGCC(2,230+392,964,10,10):显示(w-10,0)
            __res:getPNGCC(2,230+392,964+10,10,31):平铺(10,h-20):显示(w-10,10)
            __res:getPNGCC(2,230+392,964+41,10,10):显示(w-10,h-10)
            nsf:渲染结束()
        end
        self:置精灵(nsf:到精灵())
    end
end


local 升级按钮 = 技能详情:创建我的按钮(__res:getPNGCC(3, 126, 563, 111, 36, true), "升级按钮", 55, 255, "内丹升级"):置可见(false)
function 升级按钮:左键弹起(x, y, msg)
      if 多开数据[多开数据.当前].__UI界面["窗口层"].召唤兽属性.选中召唤兽 and 多开数据[多开数据.当前].角色信息.宝宝列表[多开数据[多开数据.当前].__UI界面["窗口层"].召唤兽属性.选中召唤兽] then
        多开数据[当前].__UI弹出.道具鉴定:打开({[3]="吸附石"}, 多开数据[多开数据.当前].__UI界面["窗口层"].召唤兽属性.选中召唤兽)
  end
  技能详情["置可见"](技能详情, false)
end


local 技能文本 = 技能详情:创建文本("技能文本",20,80,200,200)
function 技能文本:初始化()

end