多开数据[多开数据.当前].__UI弹出.道具详情 = 多开数据[多开数据.当前].__UI界面:创建弹出窗口("道具详情",0,0,295+68,400)
local 道具详情 = 多开数据[多开数据.当前].__UI弹出.道具详情
local 当前 = 多开数据.当前
function 道具详情:初始化()
end
function 道具详情:左键弹起()
  self:置可见(false)
end
function 道具详情:打开(数据, x, y, w, h, Button, Button2, Button3, Button4, bh, lx)
  self.pid = bh
  self.lx = lx
  if x>引擎.宽度-295-190+60 then
    x=引擎.宽度-295-190 +60
  end
  self.数据 = 数据
  if self.数据 then
    道具详情["置坐标"](道具详情, x + abbr.py.x+68, y + abbr.py.y)
    local nsf = require("SDL.图像")(295+68, 400)
    if nsf["渲染开始"](nsf) then
      取黑透明背景(0, 0, 290, 390, true):显示(68, 0)
      self.小模型 = __res:getPNGCC(3, 132, 506, 55, 55):显示(13+68,13)
      local 目录="shape/dj/"
      __res["取图像"](__res, __res["取地址"](__res, 目录, 数据["小模型资源"]))["显示"](__res["取图像"](__res, __res["取地址"](__res, 目录, 数据["小模型资源"])), 15+68, 15)
      ---------------C改
      字体18:置颜色(__取颜色("黄色"))
      local 道具名称 = 数据.升星 and 数据.升星 > 0 and (数据.名称.." +"..数据.升星) or 数据.名称
      字体18:取图像(道具名称 or "未知道具"):显示(145, 17)
      ---------------C改

      nsf["渲染结束"](nsf)
    end
    道具详情["置精灵"](道具详情, nsf["到精灵"](nsf))
  else
    local nsf = require("SDL.图像")(295+68, 400)
    if nsf["渲染开始"](nsf) then
      取黑透明背景(0, 0, 290, 390, true):显示(0+68, 0)
      nsf["渲染结束"](nsf)
    end
    道具详情["置精灵"](道具详情, nsf["到精灵"](nsf))
  end
  __道具提示(self.数据, 道具详情["道具文本"])
  local Buttontable = {
    ["使用"] = false,
    ["卸下"] = false,
    ["移动"] = false,
    ["丢弃"] = false,
    -- ["存入"] = false,
    ["符石"] = false,
    ["镶嵌"] = false,
    ["穿戴"] = false,


  }
  local yy={307+30,267+30,227+30,187+30}
  if Button then
    if Button =="丢弃" then
      道具详情[Button]["置坐标"](道具详情[Button], 3, 227+100)
    elseif Button =="使用" then
      道具详情[Button]["置坐标"](道具详情[Button], 10+65+155, 307+30)
    elseif Button =="穿戴" then
      道具详情[Button]["置坐标"](道具详情[Button], 10+65+155, 307+30)
    else
      道具详情[Button]["置坐标"](道具详情[Button], 10+73, yy[1])
      table.remove(yy,1)
    end
    道具详情[Button]["置可见"](道具详情[Button], true)
    Buttontable[Button] = true
  end
  if Button2 then
    if Button2 =="丢弃" then
      道具详情[Button2]["置坐标"](道具详情[Button2], 3, 227+100)
    elseif Button2 =="使用" then
      道具详情[Button2]["置坐标"](道具详情[Button2], 10+65+155, 307+30)
    elseif Button2 =="穿戴" then
      道具详情[Button2]["置坐标"](道具详情[Button2], 10+65+155, 307+30)
    else
      道具详情[Button2]["置坐标"](道具详情[Button2], 10+73, yy[1])
      table.remove(yy,1)
    end
    道具详情[Button2]["置可见"](道具详情[Button2], true)
    Buttontable[Button2] = true
  end
  if Button3 then
    if Button3 =="丢弃" then
      道具详情[Button3]["置坐标"](道具详情[Button3], 3, 227+100)
    elseif Button3 =="使用" then
      道具详情[Button3]["置坐标"](道具详情[Button3], 10+65+155, 307+30)
    elseif Button2 =="穿戴" then
      道具详情[Button2]["置坐标"](道具详情[Button2], 10+65+155, 307+30)
    else
      道具详情[Button3]["置坐标"](道具详情[Button3], 10+73, yy[1])
      table.remove(yy,1)
    end
    道具详情[Button3]["置可见"](道具详情[Button3], true)
    Buttontable[Button3] = true
  end
  if Button4 then
    if Button4 =="丢弃" then
      道具详情[Button4]["置坐标"](道具详情[Button4], 3, 227+100)
    elseif Button4 =="使用" then
      道具详情[Button4]["置坐标"](道具详情[Button4], 10+65+155, 307+30)
    else
      道具详情[Button4]["置坐标"](道具详情[Button4], 10+73, yy[1])
      table.remove(yy,1)
    end
    道具详情[Button4]["置可见"](道具详情[Button4], true)
    Buttontable[Button4] = true
  end

  if #yy<=2 then
    道具详情.道具文本:置宽高(256, 250-38)
  else
    道具详情.道具文本:置宽高(256, 250)
  end
  for k, v in pairs(Buttontable) do
    if false == v then
      道具详情[k]["置可见"](道具详情[k], false)
    end
  end
end
------------------------
local 镶嵌 = 道具详情:创建我的按钮(__res:getPNGCC(3, 126, 563, 111, 36, true), "镶嵌", 0, 0, "镶嵌"):置可见(false)
function 镶嵌:左键弹起(x, y, msg)
  道具详情:置可见(false)
  发送数据(当前,3800.5,{装备=道具详情.pid,类型=多开数据[当前].__UI界面.窗口层.道具行囊.包裹类型})
end
------------------------
local 穿戴 = 道具详情:创建我的按钮(__res:getPNGCC(3, 126, 563, 111, 36, true), "穿戴", 0, 0, "穿戴"):置可见(false)
function 穿戴:左键弹起(x, y, msg)
    if 道具详情.lx == "锦衣背包" then
        发送数据(当前 or self and self.当前, 3703, {
            道具 = 道具详情.pid,
            角色 = "主角",
            类型 = "锦衣背包"
        })
    end
    道具详情:置可见(false)
end

local 使用 = 道具详情:创建我的按钮(__res:getPNGCC(3, 126, 563, 111, 36, true), "使用", 0, 0, "使用"):置可见(false)
function 使用:左键弹起(x, y, msg)
  local 道具分页递增序列=0
  local lx2
  if 多开数据[当前].__UI界面.窗口层.道具行囊.是否可见 then
        if 多开数据[当前].__UI界面.窗口层.道具行囊.人物.是否选中 then
            lx2 = "主人公" 
        elseif 多开数据[当前].__UI界面.窗口层.道具行囊.召唤兽.是否选中 then
            lx2 = "召唤兽" 
        elseif 多开数据[当前].__UI界面.窗口层.道具行囊.坐骑.是否选中 then
            lx2 = "坐骑" 
        elseif 多开数据[当前].__UI界面.窗口层.道具行囊.子女.是否选中 then
            lx2 = "子女" 
        end
        道具分页递增序列=(多开数据[当前].__UI界面["窗口层"]["道具行囊"].分页状态-1)*20

    end
  if 道具详情.数据.总类 ==2 then
        if lx2 == "主人公" and (道具详情.数据.分类 <= 6 or (道具详情.数据.分类 >= 10 and 道具详情.数据.分类 <= 13)) then
            发送数据(当前 or self and self.当前,3703,{类型=多开数据[当前].__UI界面.窗口层.道具行囊.包裹类型,角色="主角",道具=道具详情.pid+道具分页递增序列})
        elseif lx2 == "主人公" and 道具详情.数据.分类 >= 14 and 道具详情.数据.分类 <= 19 then
          --  多开数据[当前 or self and self.当前].__UI弹出.锦衣弹出:打开(多开数据[当前 or self and self.当前].角色信息.锦衣)
            发送数据(当前 or self and self.当前,3703,{类型=多开数据[当前].__UI界面.窗口层.道具行囊.包裹类型,角色="主角",道具=道具详情.pid+道具分页递增序列})
        elseif lx2 == "召唤兽" and 多开数据[当前].__UI界面.窗口层.道具行囊.选中召唤兽 and 道具详情.数据.分类 >= 7 and 道具详情.数据.分类 <= 9 then
            发送数据(当前 or self and self.当前,3708,{类型=多开数据[当前].__UI界面.窗口层.道具行囊.包裹类型,角色="bb",道具=道具详情.pid+道具分页递增序列,编号=多开数据[当前].__UI界面.窗口层.道具行囊.选中召唤兽})
        end
    elseif lx2 == "主人公" and 道具详情.数据.总类 == 886 then
        多开数据[当前].__UI界面.窗口层.装备自选:打开(道具详情.数据,道具详情.pid,160)
    elseif 道具详情.数据.总类 ==135 then
        多开数据[当前].__UI界面.窗口层.对话栏:打开({模型="普陀_接引仙女",名称=道具详情.数据.名称,对话="请选择你想要的部位，开启一次可获得五套同类型的灵饰书铁。请选择部位：",选项={"手镯","戒指","佩饰","耳饰"},选中名称=""})
    elseif 道具详情.数据.总类 == 104 then
        if 道具详情.数据.属性 then
            发送数据(当前 or self and self.当前,3705,{类型=多开数据[当前].__UI界面.窗口层.道具行囊.包裹类型,编号=道具详情.pid,窗口=lx2,序列=多开数据[当前].__UI界面.窗口层.道具行囊.选中召唤兽})
        else
            多开数据[当前].__UI界面.窗口层.对话栏:打开({模型="普陀_接引仙女",名称=道具详情.数据.名称,对话="你想加强召唤兽的哪种天赋呢？",选项={"攻击","气血","防御","速度","灵力","躲闪","我再想想"},选中名称="",附加事件={类型=多开数据[当前].__UI界面.窗口层.道具行囊.包裹类型,编号=道具详情.pid}})
        end
    else
        if lx2 == "坐骑" and 多开数据[当前].__UI界面.窗口层.道具行囊.选中坐骑 then
            发送数据(当前 or self and self.当前,3705,{类型=多开数据[当前].__UI界面.窗口层.道具行囊.包裹类型,编号=道具详情.pid+道具分页递增序列,窗口=lx2,序列=多开数据[当前].__UI界面.窗口层.道具行囊.选中坐骑})
        elseif lx2 == "子女" then
            发送数据(当前 or self and self.当前,3705,{类型=多开数据[当前].__UI界面.窗口层.道具行囊.包裹类型,编号=道具详情.pid+道具分页递增序列,窗口=lx2,序列=多开数据[当前].__UI界面.窗口层.道具行囊.选中子女})
        else
            发送数据(当前 or self and self.当前,3705,{类型=多开数据[当前].__UI界面.窗口层.道具行囊.包裹类型,编号=道具详情.pid+道具分页递增序列,窗口=lx2,序列=多开数据[当前].__UI界面.窗口层.道具行囊.选中召唤兽})
        end
    end
    道具详情:置可见(false)
end
local 卸下 = 道具详情:创建我的按钮(__res:getPNGCC(3, 126, 563, 111, 36, true), "卸下", 0, 0, "卸下"):置可见(false)
function 卸下:左键弹起(x,y,msg)
    if (道具详情.lx == "装备法宝" or 道具详情.lx == "装备灵宝" ) and 多开数据[当前].__UI界面.窗口层.法宝.是否可见 then
        if 道具详情.lx == "装备法宝" then
            发送数据(当前 or self and self.当前,3734,{序列=道具详情.pid})
        elseif 道具详情.lx == "装备灵宝" then
            发送数据(当前 or self and self.当前,3753,{序列=道具详情.pid})
        end
    elseif 道具详情.lx == "上古玉魄" then
        local xxx = 道具详情.数据.名称
        发送数据(当前,3704.91,{玉魄=xxx})
    elseif 道具详情.lx == "卸下女娲符" then
        发送数据(当前,3800.6,{x操作="卸下",镶嵌孔=道具详情.pid})
    elseif 道具详情.lx == "宝宝饰品" then
    if 多开数据[当前].角色信息.宝宝列表[多开数据[当前].__UI界面["窗口层"]["召唤兽属性"].选中召唤兽] and 多开数据[当前].角色信息.宝宝列表[多开数据[当前].__UI界面["窗口层"]["召唤兽属性"].选中召唤兽].认证码 then 
      发送数据(当前 or self and self.当前,5019,{多开数据[当前].角色信息.宝宝列表[多开数据[当前].__UI界面["窗口层"]["召唤兽属性"].选中召唤兽].认证码})
      多开数据[当前].__UI界面["窗口层"]["召唤兽属性"].饰品网格:置物品()
    end

    else
        if 多开数据[当前].__UI界面.窗口层.道具行囊.是否可见 then
            if 多开数据[当前].__UI界面.窗口层.道具行囊.人物.是否选中 then
                if 道具详情.lx == "装备" and 道具详情.数据.分类 <= 6 then
                    发送数据(当前 or self and self.当前,3704,{类型=多开数据[当前].__UI界面.窗口层.道具行囊.包裹类型,角色="主角",道具=道具详情.pid})
                    多开数据[当前].__主控["播放特效音乐"](多开数据[当前].__主控, 取音效("卸下装备"))
                
                -- elseif 道具详情.lx == "锦衣" and 道具详情.数据.分类 >= 14 and 道具详情.数据.分类 <= 19 then
                --     发送数据(当前 or self and self.当前,3704,{类型=多开数据[当前].__UI界面.窗口层.道具行囊.包裹类型,角色="主角",锦衣=true,道具=道具详情.pid})
                elseif 道具详情.lx == "锦衣" and 道具详情.数据.分类 >= 14 and 道具详情.数据.分类 <= 19 then
                  发送数据(当前 or self and self.当前,3704,{类型=多开数据[当前].__UI界面.窗口层.道具行囊.包裹类型,角色="主角",锦衣=true,道具=道具详情.pid})
                  多开数据[当前].__主控["播放特效音乐"](多开数据[当前].__主控, 取音效("卸下装备"))
                  if 多开数据[当前].__UI弹出.锦衣弹出.是否可见 then
                      if 多开数据[当前].__UI弹出.锦衣弹出.刷新 then
                          发送数据(当前, 3732.1)  -- 重新请求锦衣数据
                      end
                  end

                elseif 道具详情.lx == "灵饰" and 道具详情.数据.分类 >= 10 and 道具详情.数据.分类 <= 13 then
                    发送数据(当前 or self and self.当前,3704,{类型=多开数据[当前].__UI界面.窗口层.道具行囊.包裹类型,角色="主角",灵饰=true,道具=道具详情.pid})
                end
            elseif 多开数据[当前].__UI界面.窗口层.道具行囊.召唤兽.是否选中 then
                if 道具详情.lx == "饰品" then
                    发送数据(当前 or self and self.当前, 5019, {多开数据[当前].角色信息.宝宝列表[多开数据[当前].__UI界面.窗口层.道具行囊.选中召唤兽].认证码})
                    多开数据[当前].__UI界面.窗口层.道具行囊.召唤兽界面.饰品网格:置物品()
                else
                    发送数据(当前 or self and self.当前,3709,{类型=多开数据[当前].__UI界面.窗口层.道具行囊.包裹类型,角色="bb",道具=道具详情.pid,编号=多开数据[当前].__UI界面.窗口层.道具行囊.选中召唤兽})
                end
            elseif 多开数据[当前].__UI界面.窗口层.道具行囊.坐骑.是否选中 then
                发送数据(当前 or self and self.当前,3750.1,{类型=多开数据[当前].__UI界面.窗口层.道具行囊.包裹类型,角色="坐骑",道具=道具详情.pid,编号=多开数据[当前].__UI界面.窗口层.道具行囊.选中坐骑})
            elseif 多开数据[当前].__UI界面.窗口层.道具行囊.子女.是否选中 then
            end
        end
    end
    道具详情:置可见(false)
end


local 移动 = 道具详情:创建我的按钮(__res:getPNGCC(3, 126, 563, 111, 36, true), "移动", 0, 0, "移动"):置可见(false)
function 移动:左键弹起(x,y,msg)
    if 道具详情.lx == "锦衣背包" then
        if not 多开数据[当前].__UI弹出.锦衣弹出 or not 多开数据[当前].__UI弹出.锦衣弹出.是否可见 then
            return
        end
        多开数据[当前].__UI弹出.锦衣弹出.抓取类型 = "锦衣背包"
        多开数据[当前].__UI弹出.锦衣弹出.抓取物品ID = 道具详情.pid
        多开数据[当前].__UI弹出.锦衣弹出.移动1 = true
        local 物品页 = math.floor((道具详情.pid - 1) / 20) + 1
        local 格子位置 = 道具详情.pid - (物品页 - 1) * 20
        if 物品页 ~= 多开数据[当前].__UI弹出.锦衣弹出.分页状态 then
            多开数据[当前].__UI弹出.锦衣弹出.分页状态 = 物品页
            if 多开数据[当前].__UI弹出.锦衣弹出.锦衣背包数据 then
                多开数据[当前].__UI弹出.锦衣弹出.锦衣背包网格:置物品(多开数据[当前].__UI弹出.锦衣弹出.锦衣背包数据)
            end
        end
        抓取物品20格子计算 = 格子位置
        if 多开数据[当前].__UI弹出.锦衣弹出.锦衣背包网格.子控件[格子位置] and 多开数据[当前].__UI弹出.锦衣弹出.锦衣背包网格.子控件[格子位置]._spr then
            多开数据[当前].__UI弹出.锦衣弹出.锦衣背包网格.子控件[格子位置]._spr.确定 = true
        end
        道具详情:置可见(false)

    elseif 道具详情.lx == "法宝" then
        多开数据[当前].__UI界面.窗口层.法宝.移动 = true
    else
        多开数据[当前].__UI界面.窗口层.道具行囊.移动 = true
    end
    道具详情:置可见(false)
end
local 丢弃 = 道具详情:创建我的按钮(__res:getPNGCC(3, 1085, 446, 62, 62, true), "丢弃", 0, 0):置可见(false)
function 丢弃:左键弹起(x,y,msg)
   多开数据[当前 or self and self.当前].__UI弹出.提示弹出:打开('确认#R销毁#Y'..道具详情.数据.名称..'#W?',3702,{物品=道具详情.pid+(多开数据[当前].__UI界面["窗口层"]["道具行囊"].分页状态-1)*20,类型=多开数据[当前].__UI界面.窗口层.道具行囊.包裹类型})
    道具详情:置可见(false)
end


local 符石 = 道具详情:创建我的按钮(__res:getPNGCC(3, 126, 563, 111, 36, true), "符石", 0, 0, "符石"):置可见(false)
function 符石:左键弹起(x,y,msg)
    道具详情:置可见(false)
    发送数据(当前,3800,{装备=道具详情.pid+(多开数据[当前].__UI界面["窗口层"]["道具行囊"].分页状态-1)*20,类型=多开数据[当前].__UI界面.窗口层.道具行囊.包裹类型})
end





local 道具文本 = 道具详情["创建文本"](道具详情, "道具文本", 15+68, 80, 256, 250)---38
function 道具文本:初始化()
  self:置文字(字体17)
end
