local format = string.format
local floor=math.floor
local cos = math.cos
local sin = math.sin
local xys = 生成XY

-- local function 转换斜杠(内容)
-- 	return string.gsub(内容, "/", "·")
-- end
function 角度算四方向(角)
	local 方向 = 0
	if(角 >0 and 角 < 91) then
		方向 = 0 --"东北"
	elseif(角 > 90 and 角 < 181) then
		方向 = 1 --"西北"
	elseif(角 > 180 and 角 < 271) then
		方向 = 2 --"西南"
	elseif(角 > 270 or  角 == 0) then
		方向 = 3 --"东南"
	end
	return 方向
end

function 取移动坐标(src,dst,r)
	local a = 取两点孤度 (src,dst)
	return xys(r* cos(a) +src.x ,r* sin(a)+src.y)
end

两点算近战攻击坐标 = function(target, attacker, offset)
    local jd = floor(取两点角度(target, attacker))
    local fx = 角度算四方向(jd)

    if fx == 0 then
        return 生成XY(target.x + offset.x, target.y + offset.y), 生成XY(target.x + offset.x * 0.2 + 1, target.y + offset.y * 0.2 - 2)
    elseif fx == 1 then
        return 生成XY(target.x - offset.x + 5, target.y + offset.y), 生成XY(target.x - offset.x * 0.2 + 1, target.y + offset.y * 0.2)
    elseif fx == 2 then
        return 生成XY(target.x - offset.x, target.y - offset.y), 生成XY(target.x - offset.x * 0.2 + 1, target.y + offset.y * 0.2)
    elseif fx == 3 then
        return 生成XY(target.x + offset.x, target.y - offset.y - 8), 生成XY(target.x - offset.x * 0.2 + 1, target.y + offset.y * 0.2)
    end
end
九黎城攻击技能 = {枫魂汲魄 = 1,枫影二刃 = 1,三荒尽灭 = 1,力辟苍穹 = 1,铁血生风 = 1,一斧开天 = 1,魔神之刃 = 1}
战斗连击显示 = {}
战斗连击单位 = 0
多重战斗开关 = false
Fight攻击特效加速={}--越小越慢
Fight攻击特效加速["野蛮冲撞（黑）"]={附加x=50,附加y=-10}
Fight攻击特效加速["野蛮冲撞（白）"]={附加x=45,附加y=-13}
Fight攻击特效加速["野蛮冲撞（金）"]={附加x=6,附加y=-15}

Fight特效加速={}--越小越慢
Fight特效加速["生命之泉"]={附加y=-75}
Fight特效加速["变身"]={附加y=-30}

Fight特效加速["炼气化神"]={附加y=-75}
Fight特效加速["紧箍咒"]={附加y=-35}
Fight特效加速["超级紧箍咒"]={附加y=-35}

Fight特效加速["龙腾"]={加速=0.03}
Fight特效加速["月光"]={加速=0.03}
-- Fight特效加速["唧唧歪歪"]={加速=0.022}
Fight特效加速["新_唧唧歪歪"]={加速=0.04}

Fight特效加速["牵魂蛛丝"]={加速=0.04}
Fight特效加速["血雨"]={加速=0.04}
Fight特效加速["碎星诀"]={附加y=-50,加速=0.03}
Fight特效加速["追魂刺"]={加速=0.04}
Fight特效加速["新_金刚护法"]={加速=0.03}
Fight特效加速["金刚护法"]={加速=0.027}
Fight特效加速["三荒尽灭"]={加速=0.023}

Fight特效加速["金刚护体"]={加速=0.024}
Fight特效加速["一苇渡江"]={加速=0.03}
Fight特效加速["救死扶伤"]={加速=0.024}
Fight特效加速["推气过宫"]={加速=0.027}
Fight特效加速["新_金刚护体"]={加速=0.03}
Fight特效加速["新_失心符"]={加速=0.04}
Fight特效加速["新_日月乾坤"]={加速=0.045}
Fight特效加速["日月乾坤"]={加速=0.025}
Fight特效加速["三昧真火"]={加速=0.025}
Fight特效加速["牛劲"]={加速=0.025}
Fight特效加速["百爪狂杀"]={加速=1.5}
Fight特效加速["笑里藏刀"]={加速=0.04}
Fight特效加速["罗汉金钟"]={加速=0.03}
Fight特效加速["新_龙卷雨击"]={加速=0.01}
Fight特效加速["法术暴击"]={加速=10}
Fight特效加速["夺命咒"]={加速=0.03}

Fight特效加速["超级赐福·元吉"]={加速=0.02}
Fight特效加速["超级赐福·双喜"]={加速=0.02}
Fight特效加速["超级赐福·三合"]={加速=0.02}
Fight特效加速["超级赐福·四季"]={加速=0.02}
Fight特效加速["超级赐福·五福"]={加速=0.02}
Fight特效加速["超级赐福·六临"]={加速=0.02}
Fight特效加速["超级赐福·七神"]={加速=0.02}
Fight特效加速["超级赐福·八欲"]={加速=0.02}
Fight特效加速["超级赐福·九功"]={加速=0.02}
Fight特效加速["超级赐福·十满"]={加速=0.02}
Fight特效加速["超级赐福·万利"]={加速=0.02}
Fight特效加速["琴音三叠"]={加速=0.03}

PropertyData={}

PropertyData["血气方刚"]={
    类型="属性",
    戒指={pro="气血",rate=7,status=1},
    耳饰={pro="气血",rate=7,status=1},
    佩饰={pro="气血",rate=7,status=1},
    手镯={pro="气血",rate=7,status=1},
    套装={pro="增加%g%%比例的气血上限",status=2},  
 	套装1=1,套装2=1.5,套装3=2,套装4=2.5,套装5=3,套装6=3.5,套装7=4,套装8=4.5,套装9=5,套装10=6
    
}

PropertyData["通真达灵"] = {
    类型 = "属性",
    戒指 = {pro = "灵力", rate = 1, status = 1},
    耳饰 = {pro = "灵力", rate = 1, status = 1},
    佩饰 = {pro = "灵力", rate = 1, status = 1},
    手镯 = {pro = "灵力", rate = 1, status = 1},
    套装 = {pro = "增加%g%%的灵力", status = 2},  
    套装1 = 1, 套装2 = 2, 套装3 = 3, 套装4 = 4, 套装5 = 5, 套装6 = 6, 套装7 = 7, 套装8 = 8, 套装9 = 9, 套装10 = 10
}

PropertyData["心无旁骛"]={
    类型="属性",
    戒指={pro="抵抗封印等级",rate=2,status=1},
    耳饰={pro="抵抗封印等级",rate=2,status=1},
    佩饰={pro="抵抗封印等级",rate=2,status=1},
    手镯={pro="抵抗封印等级",rate=2,status=1},
    套装={pro="增加%g点抵抗封印等级",status=2},  
    套装1=10,套装2=20,套装3=30,套装4=40,套装5=50,套装6=60,套装7=70,套装8=80,套装9=90,套装10=100
}

PropertyData["健步如飞"] = {
    类型 = "属性",
    戒指 = {pro = "速度", rate = 1, status = 1},
    耳饰 = {pro = "速度", rate = 1, status = 1},
    佩饰 = {pro = "速度", rate = 1, status = 1},
    手镯 = {pro = "速度", rate = 1, status = 1},
    套装 = {pro = "速度增加%g%%", status = 2},  
    套装1 = 1, 套装2 = 2, 套装3 = 3, 套装4 = 4, 套装5 = 5, 套装6 = 6, 套装7 = 7, 套装8 = 8, 套装9 = 9, 套装10 = 10
}

PropertyData["回春之术"] = {
    类型 = "属性",
    戒指 = {pro = "治疗能力", rate = 5, status = 1},
    耳饰 = {pro = "治疗能力", rate = 5, status = 1},
    佩饰 = {pro = "治疗能力", rate = 5, status = 1},
    手镯 = {pro = "治疗能力", rate = 5, status = 1},
    套装 = {pro = "增加%g点治疗能力", status = 2},  
    套装1 = 20, 套装2 = 40, 套装3 = 60, 套装4 = 80, 套装5 = 100, 套装6 = 120, 套装7 = 140, 套装8 = 160, 套装9 = 180, 套装10 = 200
}

PropertyData["风雨不动"]={
    类型="属性",
    戒指={pro="抗法术暴击等级",rate=2,status=1},
    耳饰={pro="抗法术暴击等级",rate=2,status=1},
    佩饰={pro="抗法术暴击等级",rate=2,status=1},
    手镯={pro="抗法术暴击等级",rate=2,status=1},
    套装={pro="增加%g点抗法术暴击等级",status=2},  
    套装1=10,套装2=20,套装3=30,套装4=40,套装5=50,套装6=60,套装7=70,套装8=80,套装9=90,套装10=100
}

PropertyData["固若金汤"]={
    类型="属性",
    戒指={pro="抗物理暴击等级",rate=2,status=1},
    耳饰={pro="抗物理暴击等级",rate=2,status=1},
    佩饰={pro="抗物理暴击等级",rate=2,status=1},
    手镯={pro="抗物理暴击等级",rate=2,status=1},
    套装={pro="增加%g点抗物理暴击等级",status=2},  
    套装1=10,套装2=20,套装3=30,套装4=40,套装5=50,套装6=60,套装7=70,套装8=80,套装9=90,套装10=100
}

PropertyData["气壮山河"]={
    类型="属性",
    戒指={pro="气血回复效果",rate=1,status=1},
    耳饰={pro="气血回复效果",rate=1,status=1},
    佩饰={pro="气血回复效果",rate=1,status=1},
    手镯={pro="气血回复效果",rate=1,status=1},
    套装={pro="增加%g点气血回复效果",status=2},  
    套装1=5,套装2=10,套装3=15,套装4=20,套装5=25,套装6=30,套装7=35,套装8=40,套装9=45,套装10=50
}

PropertyData["锐不可当"]={
    类型="属性",
    戒指={pro="固定伤害",rate=1,status=1},
    耳饰={pro="固定伤害",rate=1,status=1},
    佩饰={pro="固定伤害",rate=1,status=1},
    手镯={pro="固定伤害",rate=1,status=1},
    套装={pro="增加%g点固定伤害",status=2},  
    套装1=5,套装2=10,套装3=15,套装4=20,套装5=25,套装6=30,套装7=35,套装8=40,套装9=45,套装10=50
}

PropertyData["法术吸收"]={
    类型="战斗效果",
    戒指={pro="雷属性吸收",rate=1,status=1},
    耳饰={pro="土属性吸收",rate=1,status=1},
    佩饰={pro="水属性吸收",rate=1,status=1},
    手镯={pro="火属性吸收",rate=1,status=1},
    套装={pro="气血低于百分之30的时候，额外增加%g%%的法术吸收能力（测试中暂不生效）",status=2},  
    套装1=2,套装2=4,套装3=6,套装4=8,套装5=10,套装6=12,套装7=14,套装8=16,套装9=18,套装10=20
}

PropertyData["心狠手辣"] = {
    类型 = "属性",
    戒指 = {pro = "伤害", rate = 1, status = 1},
    耳饰 = {pro = "伤害", rate = 1, status = 1},
    佩饰 = {pro = "伤害", rate = 1, status = 1},
    手镯 = {pro = "伤害", rate = 1, status = 1},
    套装 = {pro = "伤害增加%g%%", status = 2},  
    套装1 = 1, 套装2 = 2, 套装3 = 3, 套装4 = 4, 套装5 = 5, 套装6 = 6, 套装7 = 7, 套装8 = 8, 套装9 = 9, 套装10 = 10
}

PropertyData["自我陶醉"]={
    类型="属性",
    戒指={pro="全属性",rate=1,status=1},
    耳饰={pro="全属性",rate=1,status=1},
    佩饰={pro="全属性",rate=1,status=1},
    手镯={pro="全属性",rate=1,status=1},
    套装={pro="全属性增加%g%%",status=2},  
    套装1=1,套装2=2,套装3=3,套装4=4,套装5=5,套装6=6,套装7=7,套装8=8,套装9=9,套装10=10
}

PropertyData["心源"]={
    类型="属性",
    戒指={pro="心源",rate=1,status=1},
    耳饰={pro="心源",rate=1,status=1},
    佩饰={pro="心源",rate=1,status=1},
    手镯={pro="心源",rate=1,status=1},
    套装={pro="每回合开始有百分二十概率触发心源，当前回合造成的伤害增加%g%%",status=2},  
    套装1=10,套装2=20,套装3=30,套装4=40,套装5=50,套装6=60,套装7=70,套装8=80,套装9=90,套装10=100
}
PropertyData["163"]={
    类型="属性",
    戒指={pro="无属性",rate=1,status=1},
    耳饰={pro="无属性",rate=1,status=1},
    佩饰={pro="无属性",rate=1,status=1},
    手镯={pro="无属性",rate=1,status=1},
    套装={pro="每次角色死亡时候有%g%%几率复活并恢复163点气血,每次复活概率降低百分之20,并在163气血时,提高对应几率比例的法术伤害以及伤害.",status=2}, 
    套装1=20,套装2=30,套装3=40,套装4=45,套装5=50,套装6=55,套装7=60,套装8=70,套装9=80,套装10=90
}
local function 取附灵说明(x附灵,sss)
    local xxx
    sss = tonumber(sss) or 1
    if x附灵 == "叶障" then
        local aaa = sss * 4
        xxx = "进入战斗时，获得" ..aaa .."%最大生命值的护盾"
    elseif x附灵 == "岚载" then
        local aaa = sss * 2.5
        xxx = "战斗前4回合有" ..aaa .."%几率使受到的伤害降低50%"
    elseif x附灵 == "泉愈" then
        local aaa = sss * 5
        xxx = "战斗前4回合受到的治疗量提高" ..aaa .."%"
    end
    return xxx
end


function 取星位颜色(部位)
	if 部位==1 then
	  return {[1]="黑",[2]="白"}
	elseif 部位==2 then
	  return {[1]="红",[2]="蓝"}
	elseif 部位==3 then
	  return {[1]="红",[2]="金"}
	elseif 部位==4 then
	  return {[1]="白",[2]="黑"}
	elseif 部位==5 then
	  return {[1]="蓝",[2]="绿"}
	elseif 部位==6 then
	  return {[1]="蓝",[2]="红"}
	else
	  return {[1]="无效道具",[2]="无效道具"}
	end
  end
  
  function 取星石部位(部位)
	if 部位==1 then
	  return "头盔"
	elseif 部位==2 then
	  return "饰物"
	elseif 部位==3 then
	  return "武器"
	elseif 部位==4 then
	  return "衣甲"
	elseif 部位==5 then
	  return "腰带"
	elseif 部位==6 then
	  return "靴子"
	else
	  return "无效道具"
	end
  end
  
  function 取星位相互(部位)
	  if 部位==1 then
		  return "力量"
	  elseif 部位==2 then
		  return "魔力"
	  elseif 部位==3 then
		  return "体质"
	  elseif 部位==4 then
		  return "耐力"
	  elseif 部位==5 then
		  return "体质"
	  elseif 部位==6 then
		  return "敏捷"
	  else
		  return "力量"
	  end
  end
  

function 取星位组合(sj,level,强制)
	if sj==nil or type(sj)~="table" then
	  return nil
	end
	if not 强制 then
	  if sj[1] ==nil or sj[1].颜色==nil or sj[2] ==nil or sj[2].颜色==nil then
		return nil
	  elseif sj[3] ==nil or sj[3].颜色==nil then
		level = 1
	  elseif sj[4] ==nil or sj[4].颜色==nil then
		level = 2
	  elseif  sj[5] ==nil or sj[5].颜色==nil then
		level = 3
	  else
		level = 4
	  end
	end
	local 返回数据 = nil
	-- 部位限制 头=1 项链=2 武器=3 衣服=4 腰带=5 鞋子=6
	if level==1 then
	  --一级符石组合
	  if sj[1].颜色 == "红色" and sj[2].颜色 == "蓝色" then
		返回数据={组合="真元护体",部位=nil,门派=nil}
	  elseif sj[1].颜色 == "红色" and sj[2].颜色 == "黄色" then
		返回数据={组合="风卷残云",部位=nil,门派=nil}
	  elseif sj[1].颜色 == "绿色" and sj[2].颜色 == "紫色" then
		返回数据={组合="万丈霞光",部位=nil,门派=nil}
	  elseif sj[1].颜色 == "红色" and sj[2].颜色 == "白色" then
		返回数据={组合="无所畏惧",部位=nil,门派=nil}
	  elseif sj[1].颜色 == "白色" and sj[2].颜色 == "蓝色" then
		返回数据={组合="回眸一笑",部位=nil,门派=nil}
	  elseif sj[1].颜色 == "红色" and sj[2].颜色 == "绿色" then
		返回数据={组合="柳暗花明",部位=nil,门派=nil}
	  elseif sj[1].颜色 == "黑色" and sj[2].颜色 == "黄色" then
		返回数据={组合="雪照云光",部位=nil,门派=nil}
	  elseif sj[1].颜色 == "黄色" and sj[2].颜色 == "紫色" then
		返回数据={组合="心灵手巧",部位=nil,门派=nil}
	  elseif sj[1].颜色 == "紫色" and sj[2].颜色 == "绿色" then
		返回数据={组合="点石成金",部位=nil,门派=nil}
	  elseif sj[1].颜色 == "黑色" and sj[2].颜色 == "紫色" then
		返回数据={组合="百步穿杨",部位=nil,门派=nil}
	  elseif sj[1].颜色 == "白色" and sj[2].颜色 == "红色" then
		返回数据={组合="隔山打牛",部位=nil,门派=nil}
	  elseif sj[1].颜色 == "黑色" and sj[2].颜色 == "蓝色" then
		返回数据={组合="心随我动",部位=nil,门派=nil}
	  elseif sj[1].颜色 == "白色" and sj[2].颜色 == "黄色" then
		返回数据={组合="云随风舞",部位=nil,门派=nil}
	  elseif sj[1].颜色 == "蓝色" and sj[2].颜色 == "红色" then
		返回数据={组合="无懈可击",部位=nil,门派=nil}
	  elseif sj[1].颜色 == "蓝色" and sj[2].颜色 == "白色" then
		返回数据={组合="望穿秋水",部位=nil,门派=nil}
	  elseif sj[1].颜色 == "黄色" and sj[2].颜色 == "黑色" then
		返回数据={组合="万里横行",部位=nil,门派=nil}
	  elseif sj[1].颜色 == "红色" and sj[2].颜色 == "紫色" then
		返回数据={组合="日落西山",部位=nil,门派=nil}
	  elseif sj[1].颜色 == "黄色" and sj[2].颜色 == "绿色" then
		返回数据={组合="网罗乾坤",部位=nil,门派="盘丝洞"}
	  elseif sj[1].颜色 == "绿色" and sj[2].颜色 == "红色" then
		返回数据={组合="石破天惊",部位=nil,门派="方寸山"}
	  elseif sj[1].颜色 == "红色" and sj[2].颜色 == "红色" then
		返回数据={组合="天雷地火",部位=nil,门派="天宫"}
	  elseif sj[1].颜色 == "黄色" and sj[2].颜色 == "黄色" then
		返回数据={组合="凤舞九天",部位=nil,门派="女儿村"}
	  elseif sj[1].颜色 == "蓝色" and sj[2].颜色 == "黄色" then
		返回数据={组合="烟雨飘摇",部位=nil,门派="五庄观"}
	  elseif sj[1].颜色 == "黄色" and sj[2].颜色 == "蓝色" then
		返回数据={组合="索命无常",部位=nil,门派="阴曹地府"}
	  elseif sj[1].颜色 == "绿色" and sj[2].颜色 == "黄色" then
		返回数据={组合="行云流水",部位=nil,门派="普陀山"}
	  elseif sj[1].颜色 == "黄色" and sj[2].颜色 == "红色" then
		返回数据={组合="福泽天下",部位=nil,门派="化生寺"}
	  -- elseif sj[1].颜色 == "绿色" and sj[2].颜色 == "绿色" then
	  --  返回数据={组合="势如破竹",部位=nil,门派="天机城"}
	  elseif sj[1].颜色 == "绿色" and sj[2].颜色 == "蓝色" then
		返回数据={组合="销魂噬骨",部位=nil,门派="无底洞"}
	  elseif sj[1].颜色 == "蓝色" and sj[2].颜色 == "蓝色" then
		返回数据={组合="无心插柳",部位=nil,门派=nil}
	  end
	elseif level==2 then
	  --二级符石效果
	  if  sj[1].颜色 =="红色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="绿色" then
		返回数据={组合="真元护体",部位=nil,门派=nil}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="黑色" then
		返回数据={组合="风卷残云",部位=nil,门派=nil}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="白色" and sj[3].颜色 =="黑色" then
		返回数据={组合="降妖伏魔",部位=nil,门派=nil}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="白色" then
		返回数据={组合="万丈霞光",部位=nil,门派=nil}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="白色" and sj[3].颜色 =="黄色" then
		返回数据={组合="无所畏惧",部位=nil,门派=nil}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="绿色" then
		返回数据={组合="回眸一笑",部位=nil,门派=nil}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="红色" then
		返回数据={组合="柳暗花明",部位=nil,门派=nil}
	  elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="白色" and sj[3].颜色 =="紫色" then
		返回数据={组合="飞檐走壁",部位=nil,门派=nil}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="白色" then
		返回数据={组合="雪照云光",部位=nil,门派=nil}
	  elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="黑色" then
		返回数据={组合="心灵手巧",部位=nil,门派=nil}
	  elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="黑色" then
		返回数据={组合="点石成金",部位=nil,门派=nil}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="蓝色" then
		返回数据={组合="百步穿杨",部位=nil,门派=nil}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="红色" and sj[3].颜色 =="紫色" then
		返回数据={组合="隔山打牛",部位=nil,门派=nil}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="红色" then
		返回数据={组合="心随我动",部位=nil,门派=nil}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="红色" then
		返回数据={组合="云随风舞",部位=nil,门派=nil}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="黄色" then
		返回数据={组合="天降大任",部位=nil,门派=nil}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="蓝色" then
		返回数据={组合="高山流水",部位=nil,门派=nil}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="白色" and sj[3].颜色 =="紫色" then
		返回数据={组合="百无禁忌",部位=6,门派=nil}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="黑色" then
		返回数据={组合="为官之道符石",部位=1,门派="大唐官府"}
	  elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="白色" then
		返回数据={组合="黄庭经符石",部位=1,门派="方寸山"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="紫色" then
		返回数据={组合="小乘佛法符石",部位=1,门派="化生寺"}
	  elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="黑色" then
		返回数据={组合="毒经符石",部位=1,门派="女儿村"}
	  elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="红色" then
		返回数据={组合="天罡气符石",部位=1,门派="天宫"}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="红色" and sj[3].颜色 =="黄色" then
		返回数据={组合="九龙诀符石",部位=1,门派="龙宫"}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="紫色" then
		返回数据={组合="周易学符石",部位=1,门派="五庄观"}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="蓝色" then
		返回数据={组合="灵性符石",部位=1,门派="普陀山"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="黑色" then
		返回数据={组合="灵通术符石",部位=1,门派="阴曹地府"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="紫色" then
		返回数据={组合="牛逼神功符石",部位=1,门派="魔王寨"}
	  elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="红色" then
		返回数据={组合="魔兽神功符石",部位=1,门派="狮驼岭"}
	  elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="红色" and sj[3].颜色 =="蓝色" then
		返回数据={组合="蛛丝阵法符石",部位=1,门派="盘丝洞"}
	  -- elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="白色" and sj[3].颜色 =="紫色" then
	  --  返回数据={组合="天火献誓符石",部位=1,门派="女魃墓"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="红色" and sj[3].颜色 =="绿色" then
		返回数据={组合="燃灯灵宝符石",部位=1,门派="无底洞"}
	  -- elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="绿色" then
	  --  返回数据={组合="神工无形符石",部位=1,门派="天机城"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="白色" and sj[3].颜色 =="绿色" then
		返回数据={组合="巫咒符石",部位=1,门派="神木林"}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="白色" then
		返回数据={组合="文韬武略符石",部位=5,门派="大唐官府"}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="白色" and sj[3].颜色 =="绿色" then
		返回数据={组合="归元心法符石",部位=5,门派="方寸山"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="红色" and sj[3].颜色 =="白色" then
		返回数据={组合="佛光普照符石",部位=5,门派="化生寺"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="白色" and sj[3].颜色 =="红色" then
		返回数据={组合="倾国倾城符石",部位=5,门派="女儿村"}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="红色" then
		返回数据={组合="傲世诀符石",部位=5,门派="天宫"}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="红色" and sj[3].颜色 =="绿色" then
		返回数据={组合="逆鳞符石",部位=5,门派="龙宫"}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="黑色" then
		返回数据={组合="明性修身符石",部位=5,门派="五庄观"}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="绿色" then
		返回数据={组合="五行扭转符石",部位=5,门派="普陀山"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="红色" and sj[3].颜色 =="黑色" then
		返回数据={组合="拘魂诀符石",部位=5,门派="阴曹地府"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="红色" then
		返回数据={组合="回身击符石",部位=5,门派="魔王寨"}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="红色" then
		返回数据={组合="魔兽反噬符石",部位=5,门派="狮驼岭"}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="红色" and sj[3].颜色 =="绿色" then
		返回数据={组合="盘丝大法符石",部位=5,门派="盘丝洞"}
	  -- elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="紫色" then
	  --  返回数据={组合="藻光灵狱符石",部位=5,门派="女魃墓"}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="紫色" then
		返回数据={组合="地冥妙法符石",部位=5,门派="无底洞"}
	  -- elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="红色" then
	  --  返回数据={组合="千机奇巧符石",部位=5,门派="天机城"}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="紫色" then
		返回数据={组合="万物轮转符石",部位=5,门派="神木林"}
	  elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="黑色" then
		返回数据={组合="十方无敌符石",部位=4,门派="大唐官府"}
	  elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="蓝色" then
		返回数据={组合="符之术符石",部位=4,门派="方寸山"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="黄色" then
		返回数据={组合="歧黄之术符石",部位=4,门派="化生寺"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="黑色" then
		返回数据={组合="闭月羞花符石",部位=4,门派="女儿村"}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="黄色" then
		返回数据={组合="乾坤塔符石",部位=4,门派="天宫"}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="蓝色" then
		返回数据={组合="呼风唤雨符石",部位=4,门派="龙宫"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="黑色" then
		返回数据={组合="乾坤袖符石",部位=4,门派="五庄观"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="蓝色" then
		返回数据={组合="金刚经符石",部位=4,门派="普陀山"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="黑色" then
		返回数据={组合="幽冥术符石",部位=4,门派="阴曹地府"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="绿色" then
		返回数据={组合="火牛阵符石",部位=4,门派="魔王寨"}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="绿色" then
		返回数据={组合="生死搏符石",部位=4,门派="狮驼岭"}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="蓝色" then
		返回数据={组合="催情大法符石",部位=4,门派="盘丝洞"}
	  -- elseif sj[1].颜色 =="红色" and sj[2].颜色 =="红色" and sj[3].颜色 =="紫色" then
	  --  返回数据={组合="煌火无明符石",部位=4,门派="女魃墓"}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="红色" and sj[3].颜色 =="白色" then
		返回数据={组合="阴风绝章符石",部位=4,门派="无底洞"}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="蓝色" then
		返回数据={组合="瞬息万变符石",部位=4,门派="神木林"}
	  -- elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="红色" and sj[3].颜色 =="蓝色" then
	  --  返回数据={组合="匠心不移符石",部位=4,门派="天机城"}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="白色" then
		返回数据={组合="神兵鉴赏符石",部位=3,门派="大唐官府"}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="白色" and sj[3].颜色 =="蓝色" then
		返回数据={组合="霹雳咒符石",部位=3,门派="方寸山"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="红色" and sj[3].颜色 =="白色" then
		返回数据={组合="诵经符石",部位=3,门派="化生寺"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="白色" and sj[3].颜色 =="红色" then
		返回数据={组合="沉鱼落雁符石",部位=3,门派="女儿村"}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="红色" then
		返回数据={组合="宁气诀符石",部位=3,门派="天宫"}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="红色" and sj[3].颜色 =="蓝色" then
		返回数据={组合="破浪诀符石",部位=3,门派="龙宫"}
	  elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="白色" then
		返回数据={组合="潇湘仙雨符石",部位=3,门派="五庄观"}
	  elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="白色" and sj[3].颜色 =="蓝色" then
		返回数据={组合="五行学说符石",部位=3,门派="普陀山"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="白色" then
		返回数据={组合="尸腐恶符石",部位=3,门派="阴曹地府"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="白色" and sj[3].颜色 =="黄色" then
		返回数据={组合="牛虱阵符石",部位=3,门派="魔王寨"}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="蓝色" then
		返回数据={组合="阴阳二气诀符石",部位=3,门派="狮驼岭"}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="黄色" then
		返回数据={组合="姊妹相随符石",部位=3,门派="盘丝洞"}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="紫色" then
		返回数据={组合="无双一击符石",部位=3,门派="大唐官府"}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="黄色" then
		返回数据={组合="磐龙灭法符石",部位=3,门派="方寸山"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="红色" and sj[3].颜色 =="紫色" then
		返回数据={组合="金刚伏魔符石",部位=3,门派="化生寺"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="红色" then
		返回数据={组合="玉质冰肌符石",部位=3,门派="女儿村"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="紫色" then
		返回数据={组合="混天术符石",部位=3,门派="天宫"}
	  elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="紫色" then
		返回数据={组合="龙附符石",部位=3,门派="龙宫"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="紫色" then
		返回数据={组合="修仙术符石",部位=3,门派="五庄观"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="蓝色" then
		返回数据={组合="护法金刚符石",部位=3,门派="普陀山"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="紫色" then
		返回数据={组合="六道轮回符石",部位=3,门派="阴曹地府"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="绿色" then
		返回数据={组合="震天诀符石",部位=3,门派="魔王寨"}
	  elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="蓝色" then
		返回数据={组合="狂兽诀符石",部位=3,门派="狮驼岭"}
	  elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="绿色" then
		返回数据={组合="秋波暗送符石",部位=3,门派="盘丝洞"}
	  -- elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="蓝色" then
	  --  返回数据={组合="化神以灵符石",部位=3,门派="女魃墓"}
	  -- elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="红色" and sj[3].颜色 =="红色" then
	  --  返回数据={组合="弹指成烬符石",部位=3,门派="女魃墓"}
	  -- elseif sj[1].颜色 =="红色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="蓝色" then
	  --  返回数据={组合="攻玉以石符石",部位=3,门派="天机城"}
	  -- elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="紫色" then
	  --  返回数据={组合="擎天之械符石",部位=3,门派="天机城"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="白色" and sj[3].颜色 =="白色" then
		返回数据={组合="混元神功符石",部位=3,门派="无底洞"}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="蓝色" then
		返回数据={组合="秘影迷踪符石",部位=3,门派="无底洞"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="黄色" then
		返回数据={组合="神木恩泽符石",部位=3,门派="神木林"}
	  elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="白色" and sj[3].颜色 =="黑色" then
		返回数据={组合="紫薇之术符石",部位=2,门派="大唐官府"}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="白色" then
		返回数据={组合="神道无念符石",部位=2,门派="方寸山"}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="红色" and sj[3].颜色 =="黑色" then
		返回数据={组合="大慈大悲符石",部位=2,门派="化生寺"}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="红色" then
		返回数据={组合="香飘兰麝符石",部位=2,门派="女儿村"}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="白色" and sj[3].颜色 =="红色" then
		返回数据={组合="清明自在符石",部位=2,门派="天宫"}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="红色" and sj[3].颜色 =="白色" then
		返回数据={组合="龙腾符石",部位=2,门派="龙宫"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="白色" and sj[3].颜色 =="黑色" then
		返回数据={组合="混元道果符石",部位=2,门派="五庄观"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="白色" then
		返回数据={组合="观音咒符石",部位=2,门派="普陀山"}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="黑色" then
		返回数据={组合="九幽阴魂符石",部位=2,门派="阴曹地府"}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="绿色" then
		返回数据={组合="火云术符石",部位=2,门派="魔王寨"}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="白色" and sj[3].颜色 =="绿色" then
		返回数据={组合="训兽诀符石",部位=2,门派="狮驼岭"}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="白色" then
		返回数据={组合="天外魔音符石",部位=2,门派="盘丝洞"}
	  -- elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="绿色" then
	  --  返回数据={组合="天罚之焰符石",部位=2,门派="女魃墓"}
	  elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="黄色" then
		返回数据={组合="万灵诸念符石",部位=2,门派="神木林"}
	  -- elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="红色" and sj[3].颜色 =="黑色" then
	  --  返回数据={组合="探奥索隐符石",部位=2,门派="天机城"}
	  elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="白色" and sj[3].颜色 =="黑色" then
		返回数据={组合="枯骨心法符石",部位=2,门派="无底洞"}
	  elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="紫色" then
		返回数据={组合="疾风步符石",部位=6,门派="大唐官府"}
	  elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="绿色" then
		返回数据={组合="斜月步符石",部位=6,门派="方寸山"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="紫色" then
		返回数据={组合="渡世步符石",部位=6,门派="化生寺"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="黄色" then
		返回数据={组合="清歌妙舞符石",部位=6,门派="女儿村"}
	  elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="黄色" then
		返回数据={组合="云霄步符石",部位=6,门派="天宫"}
	  elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="绿色" then
		返回数据={组合="游龙术符石",部位=6,门派="  龙宫"}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="紫色" then
		返回数据={组合="七星遁符石",部位=6,门派="五庄观"}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="绿色" then
		返回数据={组合="莲花宝座符石",部位=6,门派="普陀山"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="红色" and sj[3].颜色 =="紫色" then
		返回数据={组合="无常步符石",部位=6,门派="阴曹地府"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="红色" then
		返回数据={组合="裂石步符石",部位=6,门派="魔王寨"}
	  elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="红色" then
		返回数据={组合="大鹏展翅符石",部位=6,门派="狮驼岭"}
	  elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="红色" and sj[3].颜色 =="绿色" then
		返回数据={组合="盘丝步符石",部位=6,门派="盘丝洞"}
	  -- elseif sj[1].颜色 =="白色" and sj[2].颜色 =="红色" and sj[3].颜色 =="红色" then
	  --  返回数据={组合="离魂符石",部位=6,门派="女魃墓"}
	  elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="紫色" then
		返回数据={组合="驭灵咒符石",部位=6,门派="神木林"}
	  -- elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="白色" and sj[3].颜色 =="黄色" then
	  --  返回数据={组合="运思如电符石",部位=6,门派="天机城"}
	  elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="红色" then
		返回数据={组合="鬼蛊灵蕴符石",部位=6,门派="无底洞"}
	  elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="黄色" then
		返回数据={组合="网罗乾坤",部位=nil,门派="盘丝洞"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="红色" and sj[3].颜色 =="红色" then
		返回数据={组合="石破天惊",部位=nil,门派="方寸山"}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="红色" and sj[3].颜色 =="蓝色" then
		返回数据={组合="天雷地火",部位=nil,门派="天宫"}
	  elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="绿色" then
		返回数据={组合="凤舞九天",部位=nil,门派="女儿村"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="黄色" then
		返回数据={组合="烟雨飘摇",部位=nil,门派="五庄观"}
	  elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="黄色" then
		返回数据={组合="索命无常",部位=nil,门派="阴曹地府"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="红色" then
		返回数据={组合="行云流水",部位=nil,门派="普陀山"}
	  elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="红色" and sj[3].颜色 =="蓝色" then
		返回数据={组合="福泽天下",部位=nil,门派="化生寺"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="红色" then
		返回数据={组合="销魂噬骨",部位=nil,门派="无底洞"}
	  -- elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="黄色" then
	  --  返回数据={组合="势如破竹",部位=nil,门派="天机城"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="黄色" then
		返回数据={组合="无心插柳",部位=nil,门派=nil}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="黑色" then
		返回数据={组合="天地无极符石",部位=3,门派="凌波城"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="白色" and sj[3].颜色 =="蓝色" then
		返回数据={组合="啸嗷符石",部位=3,门派="凌波城"}
	  elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="蓝色" then
		返回数据={组合="法天象地符石",部位=6,门派="凌波城"}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="蓝色" then
		返回数据={组合="气吞山河符石",部位=4,门派="凌波城"}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="绿色" then
		返回数据={组合="武神显圣符石",部位=5,门派="凌波城"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="白色" then
		返回数据={组合="诛魔符石",部位=1,门派="凌波城"}
	  elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="蓝色" then
		返回数据={组合="九转玄功符石",部位=2,门派="凌波城"}
	elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="白色" and sj[3].颜色 =="红色" then
      返回数据={组合="灵猴九窍符石",部位=1,门派="花果山"}
    elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="红色" then
      返回数据={组合="金刚之躯符石",部位=5,门派="花果山"}
    elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="白色" and sj[3].颜色 =="绿色" then
      返回数据={组合="七十二变符石",部位=4,门派="花果山"}
    elseif sj[1].颜色 =="红色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="绿色" then
      返回数据={组合="神通广大符石",部位=3,门派="花果山"}
    elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="黑色" then
      返回数据={组合="如意金箍符石",部位=3,门派="花果山"}
    elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="红色" then
      返回数据={组合="齐天逞胜符石",部位=2,门派="花果山"}
    elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="黑色" then
      返回数据={组合="腾云驾雾符石",部位=6,门派="花果山"}

	     --九黎
    elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="黄色" then
      返回数据={组合="战火雄魂符石",部位=3,门派="九黎城"}
    elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="白色" then
      返回数据={组合="九黎战歌符石",部位=3,门派="九黎城"}
    elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="蓝色" then
      返回数据={组合="燃铁飞花符石",部位=4,门派="九黎城"}
    elseif sj[1].颜色 =="红色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="黄色" then
      返回数据={组合="风行九黎符石",部位=6,门派="九黎城"}
    elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="白色" and sj[3].颜色 =="绿色" then
      返回数据={组合="魔神降世符石",部位=5,门派="九黎城"}
    elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="红色" and sj[3].颜色 =="黄色" then
      返回数据={组合="兵铸乾坤符石",部位=1,门派="九黎城"}
    elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="红色" and sj[3].颜色 =="蓝色" then
      返回数据={组合="魂枫战舞符石",部位=2,门派="九黎城"}



	  end
	elseif level==3 then
	  --三级符石效果
	  if  sj[1].颜色 =="红色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="绿色" and sj[4].颜色 =="白色" then
		返回数据={组合="真元护体",部位=nil,门派=nil}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="黑色" and sj[4].颜色 =="白色" then
		返回数据={组合="风卷残云",部位=nil,门派=nil}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="白色" and sj[3].颜色 =="黑色" and sj[4].颜色 =="黄色" then
		返回数据={组合="降妖伏魔",部位=nil,门派=nil}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="白色" and sj[4].颜色 =="红色" then
		返回数据={组合="万丈霞光",部位=nil,门派=nil}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="白色" and sj[3].颜色 =="黄色" and sj[4].颜色 =="蓝色" then
		返回数据={组合="无所畏惧",部位=nil,门派=nil}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="绿色" and sj[4].颜色 =="黑色" then
		返回数据={组合="回眸一笑",部位=nil,门派=nil}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="红色" and sj[4].颜色 =="蓝色" then
		返回数据={组合="柳暗花明",部位=nil,门派=nil}
	  elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="白色" and sj[3].颜色 =="紫色" and sj[4].颜色 =="蓝色" then
		返回数据={组合="飞檐走壁",部位=nil,门派=nil}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="白色" and sj[4].颜色 =="蓝色" then
		返回数据={组合="雪照云光",部位=nil,门派=nil}
	  elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="黑色" and sj[4].颜色 =="紫色" then
		返回数据={组合="心灵手巧",部位=nil,门派=nil}
	  elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="黑色" and sj[4].颜色 =="红色" then
		返回数据={组合="点石成金",部位=nil,门派=nil}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="黄色" then
		返回数据={组合="百步穿杨",部位=nil,门派=nil}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="红色" and sj[3].颜色 =="紫色" and sj[4].颜色 =="蓝色" then
		返回数据={组合="隔山打牛",部位=nil,门派=nil}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="红色" and sj[4].颜色 =="绿色" then
		返回数据={组合="心随我动",部位=nil,门派=nil}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="红色" and sj[4].颜色 =="绿色" then
		返回数据={组合="云随风舞",部位=nil,门派=nil}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="黄色" and sj[4].颜色 =="黑色" then
		返回数据={组合="天降大任",部位=nil,门派=nil}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="白色" then
		返回数据={组合="高山流水",部位=nil,门派=nil}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="白色" and sj[3].颜色 =="紫色" and sj[4].颜色 =="绿色" then
		返回数据={组合="百无禁忌",部位=6,门派=nil}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="黑色" and sj[4].颜色 =="紫色" then
		返回数据={组合="为官之道符石",部位=1,门派="大唐官府"}
	  elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="白色" and sj[4].颜色 =="蓝色" then
		返回数据={组合="黄庭经符石",部位=1,门派="方寸山"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="紫色" and sj[4].颜色 =="红色" then
		返回数据={组合="小乘佛法符石",部位=1,门派="化生寺"}
	  elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="黑色" and sj[4].颜色 =="紫色" then
		返回数据={组合="毒经符石",部位=1,门派="女儿村"}
	  elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="红色" and sj[4].颜色 =="蓝色" then
		返回数据={组合="天罡气符石",部位=1,门派="天宫"}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="红色" and sj[3].颜色 =="黄色" and sj[4].颜色 =="蓝色" then
		返回数据={组合="九龙诀符石",部位=1,门派="龙宫"}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="紫色" and sj[4].颜色 =="黄色" then
		返回数据={组合="周易学符石",部位=1,门派="五庄观"}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="白色" then
		返回数据={组合="灵性符石",部位=1,门派="普陀山"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="黑色" and sj[4].颜色 =="红色" then
		返回数据={组合="灵通术符石",部位=1,门派="阴曹地府"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="紫色" and sj[4].颜色 =="红色" then
		返回数据={组合="牛逼神功符石",部位=1,门派="魔王寨"}
	  elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="红色" and sj[4].颜色 =="白色" then
		返回数据={组合="魔兽神功符石",部位=1,门派="狮驼岭"}
	  elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="红色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="黑色" then
		返回数据={组合="蛛丝阵法符石",部位=1,门派="盘丝洞"}
	  -- elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="白色" and sj[3].颜色 =="紫色" and sj[4].颜色 =="绿色" then
	  --  返回数据={组合="天火献誓符石",部位=1,门派="女魃墓"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="红色" and sj[3].颜色 =="绿色" and sj[4].颜色 =="黑色" then
		返回数据={组合="燃灯灵宝符石",部位=1,门派="无底洞"}
	  -- elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="绿色" and sj[4].颜色 =="白色" then
	  --  返回数据={组合="神工无形符石",部位=1,门派="天机城"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="白色" and sj[3].颜色 =="绿色" and sj[4].颜色 =="紫色" then
		返回数据={组合="巫咒符石",部位=1,门派="神木林"}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="白色" and sj[4].颜色 =="黑色" then
		返回数据={组合="文韬武略符石",部位=5,门派="大唐官府"}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="白色" and sj[3].颜色 =="绿色" and sj[4].颜色 =="紫色" then
		返回数据={组合="归元心法符石",部位=5,门派="方寸山"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="红色" and sj[3].颜色 =="白色" and sj[4].颜色 =="黑色" then
		返回数据={组合="佛光普照符石",部位=5,门派="化生寺"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="白色" and sj[3].颜色 =="红色" and sj[4].颜色 =="黄色" then
		返回数据={组合="倾国倾城符石",部位=5,门派="女儿村"}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="红色" and sj[4].颜色 =="蓝色" then
		返回数据={组合="傲世诀符石",部位=5,门派="天宫"}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="红色" and sj[3].颜色 =="绿色" and sj[4].颜色 =="紫色" then
		返回数据={组合="逆鳞符石",部位=5,门派="龙宫"}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="黑色" and sj[4].颜色 =="蓝色" then
		返回数据={组合="明性修身符石",部位=5,门派="五庄观"}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="绿色" and sj[4].颜色 =="蓝色" then
		返回数据={组合="五行扭转符石",部位=5,门派="普陀山"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="红色" and sj[3].颜色 =="黑色" and sj[4].颜色 =="紫色" then
		返回数据={组合="拘魂诀符石",部位=5,门派="阴曹地府"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="红色" and sj[4].颜色 =="白色" then
		返回数据={组合="回身击符石",部位=5,门派="魔王寨"}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="红色" and sj[4].颜色 =="白色" then
		返回数据={组合="魔兽反噬符石",部位=5,门派="狮驼岭"}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="红色" and sj[3].颜色 =="绿色" and sj[4].颜色 =="紫色" then
		返回数据={组合="盘丝大法符石",部位=5,门派="盘丝洞"}
	  -- elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="紫色" and sj[4].颜色 =="白色" then
	  --  返回数据={组合="藻光灵狱符石",部位=5,门派="女魃墓"}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="紫色" and sj[4].颜色 =="红色" then
		返回数据={组合="地冥妙法符石",部位=5,门派="无底洞"}
	  -- elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="红色" and sj[4].颜色 =="绿色" then
	  --  返回数据={组合="千机奇巧符石",部位=5,门派="天机城"}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="紫色" and sj[4].颜色 =="黑色" then
		返回数据={组合="万物轮转符石",部位=5,门派="神木林"}
	  elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="黑色" and sj[4].颜色 =="白色" then
		返回数据={组合="十方无敌符石",部位=4,门派="大唐官府"}
	  elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="红色" then
		返回数据={组合="符之术符石",部位=4,门派="方寸山"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="黄色" and sj[4].颜色 =="红色" then
		返回数据={组合="歧黄之术符石",部位=4,门派="化生寺"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="黑色" and sj[4].颜色 =="绿色" then
		返回数据={组合="闭月羞花符石",部位=4,门派="女儿村"}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="黄色" and sj[4].颜色 =="紫色" then
		返回数据={组合="乾坤塔符石",部位=4,门派="天宫"}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="绿色" then
		返回数据={组合="呼风唤雨符石",部位=4,门派="龙宫"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="黑色" and sj[4].颜色 =="黄色" then
		返回数据={组合="乾坤袖符石",部位=4,门派="五庄观"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="紫色" then
		返回数据={组合="金刚经符石",部位=4,门派="普陀山"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="黑色" and sj[4].颜色 =="黄色" then
		返回数据={组合="幽冥术符石",部位=4,门派="阴曹地府"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="绿色" and sj[4].颜色 =="紫色" then
		返回数据={组合="火牛阵符石",部位=4,门派="魔王寨"}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="绿色" and sj[4].颜色 =="白色" then
		返回数据={组合="生死搏符石",部位=4,门派="狮驼岭"}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="紫色" then
		返回数据={组合="催情大法符石",部位=4,门派="盘丝洞"}
	  -- elseif sj[1].颜色 =="红色" and sj[2].颜色 =="红色" and sj[3].颜色 =="紫色" and sj[4].颜色 =="绿色" then
	  --  返回数据={组合="煌火无明符石",部位=4,门派="女魃墓"}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="红色" and sj[3].颜色 =="白色" and sj[4].颜色 =="黑色" then
		返回数据={组合="阴风绝章符石",部位=4,门派="无底洞"}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="蓝色" then
		返回数据={组合="瞬息万变符石",部位=4,门派="神木林"}
	  -- elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="红色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="黄色" then
	  --  返回数据={组合="匠心不移符石",部位=4,门派="天机城"}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="白色" and sj[4].颜色 =="黑色" then
		返回数据={组合="神兵鉴赏符石",部位=3,门派="大唐官府"}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="白色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="绿色" then
		返回数据={组合="霹雳咒符石",部位=3,门派="方寸山"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="红色" and sj[3].颜色 =="白色" and sj[4].颜色 =="黄色" then
		返回数据={组合="诵经符石",部位=3,门派="化生寺"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="白色" and sj[3].颜色 =="红色" and sj[4].颜色 =="紫色" then
		返回数据={组合="沉鱼落雁符石",部位=3,门派="女儿村"}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="红色" and sj[4].颜色 =="黄色" then
		返回数据={组合="宁气诀符石",部位=3,门派="天宫"}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="红色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="黑色"  then
		返回数据={组合="破浪诀符石",部位=3,门派="龙宫"}
	  elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="白色" and sj[4].颜色 =="黑色" then
		返回数据={组合="潇湘仙雨符石",部位=3,门派="五庄观"}
	  elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="白色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="黑色" then
		返回数据={组合="五行学说符石",部位=3,门派="普陀山"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="白色" and sj[4].颜色 =="红色" then
		返回数据={组合="尸腐恶符石",部位=3,门派="阴曹地府"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="白色" and sj[3].颜色 =="黄色" and sj[4].颜色 =="黑色" then
		返回数据={组合="牛虱阵符石",部位=3,门派="魔王寨"}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="紫色"  then
		返回数据={组合="阴阳二气诀符石",部位=3,门派="狮驼岭"}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="黄色" and sj[4].颜色 =="紫色" then
		返回数据={组合="姊妹相随符石",部位=3,门派="盘丝洞"}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="紫色" and sj[4].颜色 =="白色" then
		返回数据={组合="无双一击符石",部位=3,门派="大唐官府"}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="黄色" and sj[4].颜色 =="蓝色" then
		返回数据={组合="磐龙灭法符石",部位=3,门派="方寸山"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="红色" and sj[3].颜色 =="紫色" and sj[4].颜色 =="黑色" then
		返回数据={组合="金刚伏魔符石",部位=3,门派="化生寺"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="红色" and sj[4].颜色 =="黄色" then
		返回数据={组合="玉质冰肌符石",部位=3,门派="女儿村"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="紫色" and sj[4].颜色 =="紫色" then
		返回数据={组合="混天术符石",部位=3,门派="天宫"}
	  elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="紫色" and sj[4].颜色 =="红色" then
		返回数据={组合="龙附符石",部位=3,门派="龙宫"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="紫色" and sj[4].颜色 =="白色" then
		返回数据={组合="修仙术符石",部位=3,门派="五庄观"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="黄色" then
		返回数据={组合="护法金刚符石",部位=3,门派="普陀山"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="紫色" and sj[4].颜色 =="白色" then
		返回数据={组合="六道轮回符石",部位=3,门派="阴曹地府"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="绿色" and sj[4].颜色 =="黑色" then
		返回数据={组合="震天诀符石",部位=3,门派="魔王寨"}
	  elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="黄色" then
		返回数据={组合="狂兽诀符石",部位=3,门派="狮驼岭"}
	  elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="绿色" and sj[4].颜色 =="白色" then
		返回数据={组合="秋波暗送符石",部位=3,门派="盘丝洞"}
	  -- elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="绿色" then
	  --  返回数据={组合="化神以灵符石",部位=3,门派="女魃墓"}
	  -- elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="红色" and sj[3].颜色 =="红色" and sj[4].颜色 =="紫色" then
	  --  返回数据={组合="弹指成烬符石",部位=3,门派="女魃墓"}
	  -- elseif sj[1].颜色 =="红色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="白色" then
	  --  返回数据={组合="攻玉以石符石",部位=3,门派="天机城"}
	  -- elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="紫色" and sj[4].颜色 =="红色" then
	  --  返回数据={组合="擎天之械符石",部位=3,门派="天机城"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="白色" and sj[3].颜色 =="白色" and sj[4].颜色 =="蓝色"  then
		返回数据={组合="混元神功符石",部位=3,门派="无底洞"}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="黑色" then
		返回数据={组合="秘影迷踪符石",部位=3,门派="无底洞"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="黄色" and sj[4].颜色 =="蓝色" then
		返回数据={组合="神木恩泽符石",部位=3,门派="神木林"}
	  elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="白色" and sj[3].颜色 =="黑色" and sj[4].颜色 =="红色" then
		返回数据={组合="紫薇之术符石",部位=2,门派="大唐官府"}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="白色" and sj[4].颜色 =="紫色" then
		返回数据={组合="神道无念符石",部位=2,门派="方寸山"}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="红色" and sj[3].颜色 =="黑色" and sj[4].颜色 =="黄色" then
		返回数据={组合="大慈大悲符石",部位=2,门派="化生寺"}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="红色" and sj[4].颜色 =="蓝色" then
		返回数据={组合="香飘兰麝符石",部位=2,门派="女儿村"}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="白色" and sj[3].颜色 =="红色" and sj[4].颜色 =="蓝色" then
		返回数据={组合="清明自在符石",部位=2,门派="天宫"}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="红色" and sj[3].颜色 =="白色" and sj[4].颜色 =="蓝色" then
		返回数据={组合="龙腾符石",部位=2,门派="龙宫"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="白色" and sj[3].颜色 =="黑色" and sj[4].颜色 =="红色" then
		返回数据={组合="混元道果符石",部位=2,门派="五庄观"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="白色" and sj[4].颜色 =="蓝色" then
		返回数据={组合="观音咒符石",部位=2,门派="普陀山"}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="黑色" and sj[4].颜色 =="红色" then
		返回数据={组合="九幽阴魂符石",部位=2,门派="阴曹地府"}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="绿色" and sj[4].颜色 =="紫色" then
		返回数据={组合="火云术符石",部位=2,门派="魔王寨"}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="白色" and sj[3].颜色 =="绿色" and sj[4].颜色 =="蓝色" then
		返回数据={组合="训兽诀符石",部位=2,门派="狮驼岭"}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="白色" and sj[4].颜色 =="蓝色" then
		返回数据={组合="天外魔音符石",部位=2,门派="盘丝洞"}
	  -- elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="绿色" and sj[4].颜色 =="红色" then
	  --  返回数据={组合="天罚之焰符石",部位=2,门派="女魃墓"}
	  elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="黄色" and sj[4].颜色 =="白色" then
		返回数据={组合="万灵诸念符石",部位=2,门派="神木林"}
	  -- elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="红色" and sj[3].颜色 =="黑色" and sj[4].颜色 =="绿色" then
	  --  返回数据={组合="探奥索隐符石",部位=2,门派="天机城"}
	  elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="白色" and sj[3].颜色 =="黑色" and sj[4].颜色 =="绿色" then
		返回数据={组合="枯骨心法符石",部位=2,门派="无底洞"}
	  elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="紫色" and sj[4].颜色 =="黑色" then
		返回数据={组合="疾风步符石",部位=6,门派="大唐官府"}
	  elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="绿色" and sj[4].颜色 =="黑色" then
		返回数据={组合="斜月步符石",部位=6,门派="方寸山"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="紫色" and sj[4].颜色 =="蓝色" then
		返回数据={组合="渡世步符石",部位=6,门派="化生寺"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="黄色" and sj[4].颜色 =="红色" then
		返回数据={组合="清歌妙舞符石",部位=6,门派="女儿村"}
	  elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="黄色" and sj[4].颜色 =="蓝色" then
		返回数据={组合="云霄步符石",部位=6,门派="天宫"}
	  elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="绿色" and sj[4].颜色 =="红色" then
		返回数据={组合="游龙术符石",部位=6,门派="  龙宫"}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="紫色" and sj[4].颜色 =="白色" then
		返回数据={组合="七星遁符石",部位=6,门派="五庄观"}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="绿色" and sj[4].颜色 =="黑色" then
		返回数据={组合="莲花宝座符石",部位=6,门派="普陀山"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="红色" and sj[3].颜色 =="紫色" and sj[4].颜色 =="黑色" then
		返回数据={组合="无常步符石",部位=6,门派="阴曹地府"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="红色" and sj[4].颜色 =="蓝色" then
		返回数据={组合="裂石步符石",部位=6,门派="魔王寨"}
	  elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="红色" and sj[4].颜色 =="白色" then
		返回数据={组合="大鹏展翅符石",部位=6,门派="狮驼岭"}
	  elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="红色" and sj[3].颜色 =="绿色" and sj[4].颜色 =="蓝色" then
		返回数据={组合="盘丝步符石",部位=6,门派="盘丝洞"}
	  -- elseif sj[1].颜色 =="白色" and sj[2].颜色 =="红色" and sj[3].颜色 =="红色" and sj[4].颜色 =="黄色" then
	  --  返回数据={组合="离魂符石",部位=6,门派="女魃墓"}
	  elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="紫色" and sj[4].颜色 =="白色" then
		返回数据={组合="驭灵咒符石",部位=6,门派="神木林"}
	  -- elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="白色" and sj[3].颜色 =="黄色" and sj[4].颜色 =="黄色" then
	  --  返回数据={组合="运思如电符石",部位=6,门派="天机城"}
	  elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="红色" and sj[4].颜色 =="黑色" then
		返回数据={组合="鬼蛊灵蕴符石",部位=6,门派="无底洞"}
	  elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="黄色" and sj[4].颜色 =="黑色" then
		返回数据={组合="网罗乾坤",部位=nil,门派="盘丝洞"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="红色" and sj[3].颜色 =="红色" and sj[4].颜色 =="白色" then
		返回数据={组合="石破天惊",部位=nil,门派="方寸山"}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="红色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="紫色" then
		返回数据={组合="天雷地火",部位=nil,门派="天宫"}
	  elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="绿色" and sj[4].颜色 =="黑色" then
		返回数据={组合="凤舞九天",部位=nil,门派="女儿村"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="黄色" and sj[4].颜色 =="紫色" then
		返回数据={组合="烟雨飘摇",部位=nil,门派="五庄观"}
	  elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="黄色" and sj[4].颜色 =="白色" then
		返回数据={组合="索命无常",部位=nil,门派="阴曹地府"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="红色" and sj[4].颜色 =="紫色" then
		返回数据={组合="行云流水",部位=nil,门派="普陀山"}
	  elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="红色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="白色" then
		返回数据={组合="福泽天下",部位=nil,门派="化生寺"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="红色" and sj[4].颜色 =="黑色" then
		返回数据={组合="销魂噬骨",部位=nil,门派="无底洞"}
	  -- elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="黄色" and sj[4].颜色 =="白色" then
	  --  返回数据={组合="势如破竹",部位=nil,门派="盘丝洞"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="黄色" and sj[4].颜色 =="黑色" then
		返回数据={组合="无心插柳",部位=nil,门派=nil}
  
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="黑色" and sj[4].颜色 =="黄色" then
		返回数据={组合="天地无极符石",部位=3,门派="凌波城"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="白色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="红色" then
		返回数据={组合="啸嗷符石",部位=3,门派="凌波城"}
	  elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="紫色" then
		返回数据={组合="法天象地符石",部位=6,门派="凌波城"}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="红色" then
		返回数据={组合="气吞山河符石",部位=4,门派="凌波城"}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="绿色" and sj[4].颜色 =="蓝色" then
		返回数据={组合="武神显圣符石",部位=5,门派="凌波城"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="白色" and sj[4].颜色 =="紫色" then
		返回数据={组合="诛魔符石",部位=1,门派="凌波城"}
	  elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="红色" then
		返回数据={组合="九转玄功符石",部位=2,门派="凌波城"}
	 elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="白色" and sj[3].颜色 =="红色" and sj[4].颜色 =="红色" then
      返回数据={组合="灵猴九窍符石",部位=1,门派="花果山"}
    elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="红色" and sj[4].颜色 =="绿色" then
      返回数据={组合="金刚之躯符石",部位=5,门派="花果山"}
    elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="白色" and sj[3].颜色 =="绿色" and sj[4].颜色 =="黄色" then
      返回数据={组合="七十二变符石",部位=4,门派="花果山"}
    elseif sj[1].颜色 =="红色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="绿色" and sj[4].颜色 =="白色" then
      返回数据={组合="神通广大符石",部位=3,门派="花果山"}
    elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="黑色" and sj[4].颜色 =="黄色" then
      返回数据={组合="如意金箍符石",部位=3,门派="花果山"}
    elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="红色" and sj[4].颜色 =="紫色" then
      返回数据={组合="齐天逞胜符石",部位=2,门派="花果山"}
    elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="黑色" and sj[4].颜色 =="红色" then
      返回数据={组合="腾云驾雾符石",部位=6,门派="花果山"}


	   --九黎
      elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="黄色" and sj[4].颜色 =="红色" then
      返回数据={组合="战火雄魂符石",部位=3,门派="九黎城"}
    elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="白色" and sj[4].颜色 =="红色" then
      返回数据={组合="九黎战歌符石",部位=3,门派="九黎城"}
    elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="蓝色" then
      返回数据={组合="燃铁飞花符石",部位=4,门派="九黎城"}
    elseif sj[1].颜色 =="红色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="黄色" and sj[4].颜色 =="红色" then
      返回数据={组合="风行九黎符石",部位=6,门派="九黎城"}
    elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="白色" and sj[3].颜色 =="绿色" and sj[4].颜色 =="红色" then
      返回数据={组合="魔神降世符石",部位=5,门派="九黎城"}
    elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="红色" and sj[3].颜色 =="黄色" and sj[4].颜色 =="蓝色" then
      返回数据={组合="兵铸乾坤符石",部位=1,门派="九黎城"}
    elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="红色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="白色" then
      返回数据={组合="魂枫战舞符石",部位=2,门派="九黎城"}
	  end
	elseif level==4 then
	  --四级符石效果
	  if sj[1].颜色 =="红色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="黑色" and sj[4].颜色 =="白色" and sj[5].颜色 =="蓝色" then
		返回数据={组合="风卷残云",部位=nil,门派=nil}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="白色" and sj[4].颜色 =="红色" and sj[5].颜色 =="黄色" then
		返回数据={组合="万丈霞光",部位=nil,门派=nil}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="白色" and sj[3].颜色 =="黄色" and sj[4].颜色 =="蓝色" and sj[5].颜色 =="黑色" then
		返回数据={组合="无所畏惧",部位=nil,门派=nil}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="绿色" and sj[4].颜色 =="黑色" and sj[5].颜色 =="红色" then
		返回数据={组合="回眸一笑",部位=nil,门派=nil}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="红色" and sj[4].颜色 =="蓝色" and sj[5].颜色 =="紫色" then
		返回数据={组合="柳暗花明",部位=nil,门派=nil}
	  elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="白色" and sj[3].颜色 =="紫色" and sj[4].颜色 =="蓝色" and sj[5].颜色 =="紫色" then
		返回数据={组合="飞檐走壁",部位=nil,门派=nil}
	  elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="黑色" and sj[4].颜色 =="红色" and sj[5].颜色 =="蓝色" then
		返回数据={组合="点石成金",部位=nil,门派=nil}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="黄色" and sj[5].颜色 =="绿色" then
		返回数据={组合="百步穿杨",部位=nil,门派=nil}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="红色" and sj[3].颜色 =="紫色" and sj[4].颜色 =="蓝色" and sj[5].颜色 =="黄色" then
		返回数据={组合="隔山打牛",部位=nil,门派=nil}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="红色" and sj[4].颜色 =="绿色" and sj[5].颜色 =="白色" then
		返回数据={组合="心随我动",部位=nil,门派=nil}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="红色" and sj[4].颜色 =="绿色" and sj[5].颜色 =="黑色" then
		返回数据={组合="云随风舞",部位=nil,门派=nil}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="黄色" and sj[4].颜色 =="白色" and sj[5].颜色 =="紫色" then
		返回数据={组合="暗渡陈仓",部位=nil,门派=nil}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="紫色" and sj[4].颜色 =="紫色" and sj[5].颜色 =="白色" then
		返回数据={组合="化敌为友",部位=nil,门派=nil}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="黄色" and sj[4].颜色 =="黑色" and sj[5].颜色 =="白色" then
		返回数据={组合="天降大任",部位=nil,门派=nil}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="白色" and sj[5].颜色 =="红色" then
		返回数据={组合="高山流水",部位=nil,门派=nil}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="白色" and sj[3].颜色 =="紫色" and sj[4].颜色 =="绿色" and sj[5].颜色 =="红色" then
		返回数据={组合="百无禁忌",部位=6,门派=nil}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="黑色" and sj[4].颜色 =="紫色" and sj[5].颜色 =="黑色" then
		返回数据={组合="为官之道符石",部位=1,门派="大唐官府"}
	  elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="白色" and sj[4].颜色 =="蓝色" and sj[5].颜色 =="红色" then
		返回数据={组合="黄庭经符石",部位=1,门派="方寸山"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="紫色" and sj[4].颜色 =="红色" and sj[5].颜色 =="蓝色" then
		返回数据={组合="小乘佛法符石",部位=1,门派="化生寺"}
	  elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="黑色" and sj[4].颜色 =="紫色" and sj[5].颜色 =="白色" then
		返回数据={组合="毒经符石",部位=1,门派="女儿村"}
	  elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="红色" and sj[4].颜色 =="蓝色" and sj[5].颜色 =="白色" then
		返回数据={组合="天罡气符石",部位=1,门派="天宫"}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="红色" and sj[3].颜色 =="黄色" and sj[4].颜色 =="蓝色" and sj[5].颜色 =="绿色" then
		返回数据={组合="九龙诀符石",部位=1,门派="龙宫"}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="紫色" and sj[4].颜色 =="黄色" and sj[5].颜色 =="黑色" then
		返回数据={组合="周易学符石",部位=1,门派="五庄观"}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="白色" and sj[5].颜色 =="黑色" then
		返回数据={组合="灵性符石",部位=1,门派="普陀山"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="黑色" and sj[4].颜色 =="红色" and sj[5].颜色 =="白色" then
		返回数据={组合="灵通术符石",部位=1,门派="阴曹地府"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="紫色" and sj[4].颜色 =="红色" and sj[5].颜色 =="白色" then
		返回数据={组合="牛逼神功符石",部位=1,门派="魔王寨"}
	  elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="红色" and sj[4].颜色 =="白色" and sj[5].颜色 =="黑色" then
		返回数据={组合="魔兽神功符石",部位=1,门派="狮驼岭"}
	  elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="红色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="黑色" and sj[5].颜色 =="黄色" then
		返回数据={组合="蛛丝阵法符石",部位=1,门派="盘丝洞"}
	  -- elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="白色" and sj[3].颜色 =="紫色" and sj[4].颜色 =="绿色" and sj[5].颜色 =="红色" then
	  --  返回数据={组合="天火献誓符石",部位=1,门派="女魃墓"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="红色" and sj[3].颜色 =="绿色" and sj[4].颜色 =="黑色" and sj[5].颜色 =="紫色" then
		返回数据={组合="燃灯灵宝符石",部位=1,门派="无底洞"}
	  -- elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="绿色" and sj[4].颜色 =="白色" and sj[5].颜色 =="红色" then
	  --  返回数据={组合="神工无形符石",部位=1,门派="天机城"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="白色" and sj[3].颜色 =="绿色" and sj[4].颜色 =="紫色" and sj[5].颜色 =="红色" then
		返回数据={组合="巫咒符石",部位=1,门派="神木林"}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="白色" and sj[4].颜色 =="黑色" and sj[5].颜色 =="紫色" then
		返回数据={组合="文韬武略符石",部位=5,门派="大唐官府"}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="白色" and sj[3].颜色 =="绿色" and sj[4].颜色 =="紫色" and sj[5].颜色 =="黑色" then
		返回数据={组合="归元心法符石",部位=5,门派="方寸山"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="红色" and sj[3].颜色 =="白色" and sj[4].颜色 =="黑色" and sj[5].颜色 =="紫色" then
		返回数据={组合="佛光普照符石",部位=5,门派="化生寺"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="白色" and sj[3].颜色 =="红色" and sj[4].颜色 =="黄色" and sj[5].颜色 =="蓝色" then
		返回数据={组合="倾国倾城符石",部位=5,门派="女儿村"}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="红色" and sj[4].颜色 =="蓝色" and sj[5].颜色 =="黄色" then
		返回数据={组合="傲世诀符石",部位=5,门派="天宫"}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="红色" and sj[3].颜色 =="绿色" and sj[4].颜色 =="紫色" and sj[5].颜色 =="蓝色" then
		返回数据={组合="逆鳞符石",部位=5,门派="龙宫"}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="黑色" and sj[4].颜色 =="蓝色" and sj[5].颜色 =="白色" then
		返回数据={组合="明性修身符石",部位=5,门派="五庄观"}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="绿色" and sj[4].颜色 =="蓝色" and sj[5].颜色 =="白色" then
		返回数据={组合="五行扭转符石",部位=5,门派="普陀山"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="红色" and sj[3].颜色 =="黑色" and sj[4].颜色 =="紫色" and sj[5].颜色 =="黄色" then
		返回数据={组合="拘魂诀符石",部位=5,门派="阴曹地府"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="红色" and sj[4].颜色 =="白色" and sj[5].颜色 =="蓝色" then
		返回数据={组合="回身击符石",部位=5,门派="魔王寨"}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="红色" and sj[4].颜色 =="白色" and sj[5].颜色 =="紫色" then
		返回数据={组合="魔兽反噬符石",部位=5,门派="狮驼岭"}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="红色" and sj[3].颜色 =="绿色" and sj[4].颜色 =="紫色" and sj[5].颜色 =="蓝色" then
		返回数据={组合="盘丝大法符石",部位=5,门派="盘丝洞"}
	  -- elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="紫色" and sj[4].颜色 =="白色" and sj[5].颜色 =="黑色" then
	  --  返回数据={组合="藻光灵狱符石",部位=5,门派="女魃墓"}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="紫色" and sj[4].颜色 =="红色" and sj[5].颜色 =="黄色" then
		返回数据={组合="地冥妙法符石",部位=5,门派="无底洞"}
	  -- elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="红色" and sj[4].颜色 =="绿色" and sj[5].颜色 =="白色" then
	  --  返回数据={组合="千机奇巧符石",部位=5,门派="天机城"}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="紫色" and sj[4].颜色 =="黑色" and sj[5].颜色 =="黄色" then
		返回数据={组合="万物轮转符石",部位=5,门派="神木林"}
	  elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="黑色" and sj[4].颜色 =="白色" and sj[5].颜色 =="红色" then
		返回数据={组合="十方无敌符石",部位=4,门派="大唐官府"}
	  elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="红色" and sj[5].颜色 =="白色" then
		返回数据={组合="符之术符石",部位=4,门派="方寸山"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="黄色" and sj[4].颜色 =="红色" and sj[5].颜色 =="紫色" then
		返回数据={组合="歧黄之术符石",部位=4,门派="化生寺"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="黑色" and sj[4].颜色 =="绿色" and sj[5].颜色 =="紫色" then
		返回数据={组合="闭月羞花符石",部位=4,门派="女儿村"}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="黄色" and sj[4].颜色 =="紫色" and sj[5].颜色 =="红色" then
		返回数据={组合="乾坤塔符石",部位=4,门派="天宫"}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="绿色" and sj[5].颜色 =="白色" then
		返回数据={组合="呼风唤雨符石",部位=4,门派="龙宫"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="黑色" and sj[4].颜色 =="黄色" and sj[5].颜色 =="红色" then
		返回数据={组合="乾坤袖符石",部位=4,门派="五庄观"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="紫色" and sj[5].颜色 =="黄色" then
		返回数据={组合="金刚经符石",部位=4,门派="普陀山"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="黑色" and sj[4].颜色 =="黄色" and sj[5].颜色 =="白色" then
		返回数据={组合="幽冥术符石",部位=4,门派="阴曹地府"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="绿色" and sj[4].颜色 =="紫色" and sj[5].颜色 =="红色" then
		返回数据={组合="火牛阵符石",部位=4,门派="魔王寨"}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="绿色" and sj[4].颜色 =="白色" and sj[5].颜色 =="黄色" then
		返回数据={组合="生死搏符石",部位=4,门派="狮驼岭"}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="紫色" and sj[5].颜色 =="红色" then
		返回数据={组合="催情大法符石",部位=4,门派="盘丝洞"}
	  -- elseif sj[1].颜色 =="红色" and sj[2].颜色 =="红色" and sj[3].颜色 =="紫色" and sj[4].颜色 =="绿色" and sj[5].颜色 =="黑色" then
	  --  返回数据={组合="煌火无明符石",部位=4,门派="女魃墓"}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="红色" and sj[3].颜色 =="白色" and sj[4].颜色 =="黑色" and sj[5].颜色 =="绿色" then
		返回数据={组合="阴风绝章符石",部位=4,门派="无底洞"}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="蓝色" and sj[5].颜色 =="紫色" then
		返回数据={组合="瞬息万变符石",部位=4,门派="神木林"}
	  -- elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="红色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="黄色" and sj[5].颜色 =="白色" then
	  --  返回数据={组合="匠心不移符石",部位=4,门派="天机城"}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="白色" and sj[4].颜色 =="黑色" and sj[5].颜色 =="蓝色" then
		返回数据={组合="神兵鉴赏符石",部位=3,门派="大唐官府"}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="白色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="绿色" and sj[5].颜色 =="黑色" then
		返回数据={组合="霹雳咒符石",部位=3,门派="方寸山"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="红色" and sj[3].颜色 =="白色" and sj[4].颜色 =="黄色" and sj[5].颜色 =="紫色" then
		返回数据={组合="诵经符石",部位=3,门派="化生寺"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="白色" and sj[3].颜色 =="红色" and sj[4].颜色 =="紫色" and sj[5].颜色 =="黄色" then
		返回数据={组合="沉鱼落雁符石",部位=3,门派="女儿村"}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="红色" and sj[4].颜色 =="黄色" and sj[5].颜色 =="紫色" then
		返回数据={组合="宁气诀符石",部位=3,门派="天宫"}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="红色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="黑色" and sj[5].颜色 =="绿色" then
		返回数据={组合="破浪诀符石",部位=3,门派="龙宫"}
	  elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="白色" and sj[4].颜色 =="黑色" and sj[5].颜色 =="红色" then
		返回数据={组合="潇湘仙雨符石",部位=3,门派="五庄观"}
	  elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="白色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="黑色" and sj[5].颜色 =="红色" then
		返回数据={组合="五行学说符石",部位=3,门派="普陀山"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="白色" and sj[4].颜色 =="红色" and sj[5].颜色 =="紫色" then
		返回数据={组合="尸腐恶符石",部位=3,门派="阴曹地府"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="白色" and sj[3].颜色 =="黄色" and sj[4].颜色 =="黑色" and sj[5].颜色 =="红色" then
		返回数据={组合="牛虱阵符石",部位=3,门派="魔王寨"}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="紫色" and sj[5].颜色 =="绿色" then
		返回数据={组合="阴阳二气诀符石",部位=3,门派="狮驼岭"}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="黄色" and sj[4].颜色 =="紫色" and sj[5].颜色 =="红色" then
		返回数据={组合="姊妹相随符石",部位=3,门派="盘丝洞"}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="紫色" and sj[4].颜色 =="白色" and sj[5].颜色 =="黑色" then
		返回数据={组合="无双一击符石",部位=3,门派="大唐官府"}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="黄色" and sj[4].颜色 =="蓝色" and sj[5].颜色 =="白色" then
		返回数据={组合="磐龙灭法符石",部位=3,门派="方寸山"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="红色" and sj[3].颜色 =="紫色" and sj[4].颜色 =="黑色" and sj[5].颜色 =="绿色" then
		返回数据={组合="金刚伏魔符石",部位=3,门派="化生寺"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="红色" and sj[4].颜色 =="黄色" and sj[5].颜色 =="白色" then
		返回数据={组合="玉质冰肌符石",部位=3,门派="女儿村"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="紫色" and sj[4].颜色 =="紫色" and sj[5].颜色 =="绿色" then
		返回数据={组合="混天术符石",部位=3,门派="天宫"}
	  elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="紫色" and sj[4].颜色 =="红色" and sj[5].颜色 =="白色" then
		返回数据={组合="龙附符石",部位=3,门派="龙宫"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="紫色" and sj[4].颜色 =="白色" and sj[5].颜色 =="黑色" then
		返回数据={组合="修仙术符石",部位=3,门派="五庄观"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="黄色" and sj[5].颜色 =="黑色" then
		返回数据={组合="护法金刚符石",部位=3,门派="普陀山"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="紫色" and sj[4].颜色 =="白色" and sj[5].颜色 =="绿色" then
		返回数据={组合="六道轮回符石",部位=3,门派="阴曹地府"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="绿色" and sj[4].颜色 =="黑色" and sj[5].颜色 =="黄色" then
		返回数据={组合="震天诀符石",部位=3,门派="魔王寨"}
	  elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="黄色" and sj[5].颜色 =="白色" then
		返回数据={组合="狂兽诀符石",部位=3,门派="狮驼岭"}
	  elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="绿色" and sj[4].颜色 =="白色" and sj[5].颜色 =="黑色" then
		返回数据={组合="秋波暗送符石",部位=3,门派="盘丝洞"}
	  -- elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="绿色" and sj[5].颜色 =="绿色" then
	  --  返回数据={组合="化神以灵符石",部位=3,门派="女魃墓"}
	  -- elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="红色" and sj[3].颜色 =="红色" and sj[4].颜色 =="紫色" and sj[5].颜色 =="白色" then
	  --  返回数据={组合="弹指成烬符石",部位=3,门派="女魃墓"}
	  -- elseif sj[1].颜色 =="红色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="白色" and sj[5].颜色 =="紫色" then
	  --  返回数据={组合="攻玉以石符石",部位=3,门派="天机城"}
	  -- elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="紫色" and sj[4].颜色 =="红色" and sj[5].颜色 =="红色" then
	  --  返回数据={组合="擎天之械符石",部位=3,门派="天机城"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="白色" and sj[3].颜色 =="白色" and sj[4].颜色 =="蓝色" and sj[5].颜色 =="红色"  then
		返回数据={组合="混元神功符石",部位=3,门派="无底洞"}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="黑色" and sj[5].颜色 =="紫色" then
		返回数据={组合="秘影迷踪符石",部位=3,门派="无底洞"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="黄色" and sj[4].颜色 =="蓝色" and sj[5].颜色 =="黄色" then
		返回数据={组合="神木恩泽符石",部位=3,门派="神木林"}
	  elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="白色" and sj[3].颜色 =="黑色" and sj[4].颜色 =="红色" and sj[5].颜色 =="蓝色" then
		返回数据={组合="紫薇之术符石",部位=2,门派="大唐官府"}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="白色" and sj[4].颜色 =="紫色" and sj[5].颜色 =="绿色" then
		返回数据={组合="神道无念符石",部位=2,门派="方寸山"}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="红色" and sj[3].颜色 =="黑色" and sj[4].颜色 =="黄色" and sj[5].颜色 =="蓝色" then
		返回数据={组合="大慈大悲符石",部位=2,门派="化生寺"}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="红色" and sj[4].颜色 =="蓝色" and sj[5].颜色 =="黄色" then
		返回数据={组合="香飘兰麝符石",部位=2,门派="女儿村"}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="白色" and sj[3].颜色 =="红色" and sj[4].颜色 =="蓝色" and sj[5].颜色 =="紫色" then
		返回数据={组合="清明自在符石",部位=2,门派="天宫"}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="红色" and sj[3].颜色 =="白色" and sj[4].颜色 =="蓝色" and sj[5].颜色 =="紫色" then
		返回数据={组合="龙腾符石",部位=2,门派="龙宫"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="白色" and sj[3].颜色 =="黑色" and sj[4].颜色 =="红色" and sj[5].颜色 =="黄色" then
		返回数据={组合="混元道果符石",部位=2,门派="五庄观"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="白色" and sj[4].颜色 =="蓝色" and sj[5].颜色 =="红色" then
		返回数据={组合="观音咒符石",部位=2,门派="普陀山"}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="黑色" and sj[4].颜色 =="红色" and sj[5].颜色 =="紫色" then
		返回数据={组合="九幽阴魂符石",部位=2,门派="阴曹地府"}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="绿色" and sj[4].颜色 =="紫色" and sj[5].颜色 =="红色" then
		返回数据={组合="火云术符石",部位=2,门派="魔王寨"}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="白色" and sj[3].颜色 =="绿色" and sj[4].颜色 =="蓝色" and sj[5].颜色 =="黄色" then
		返回数据={组合="训兽诀符石",部位=2,门派="狮驼岭"}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="白色" and sj[4].颜色 =="蓝色" and sj[5].颜色 =="黑色" then
		返回数据={组合="天外魔音符石",部位=2,门派="盘丝洞"}
	  -- elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="绿色" and sj[4].颜色 =="红色" and sj[5].颜色 =="黑色" then
	  --  返回数据={组合="天罚之焰符石",部位=2,门派="女魃墓"}
	  elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="黄色" and sj[4].颜色 =="白色" and sj[5].颜色 =="紫色" then
		返回数据={组合="万灵诸念符石",部位=2,门派="神木林"}
	  -- elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="红色" and sj[3].颜色 =="黑色" and sj[4].颜色 =="绿色" and sj[5].颜色 =="紫色" then
	  --  返回数据={组合="探奥索隐符石",部位=2,门派="天机城"}
	  elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="白色" and sj[3].颜色 =="黑色" and sj[4].颜色 =="绿色" and sj[5].颜色 =="红色" then
		返回数据={组合="枯骨心法符石",部位=2,门派="无底洞"}
	  elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="紫色" and sj[4].颜色 =="黑色" and sj[5].颜色 =="红色" then
		返回数据={组合="疾风步符石",部位=6,门派="大唐官府"}
	  elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="绿色" and sj[4].颜色 =="黑色" and sj[5].颜色 =="白色" then
		返回数据={组合="斜月步符石",部位=6,门派="方寸山"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="紫色" and sj[4].颜色 =="蓝色" and sj[5].颜色 =="黑色" then
		返回数据={组合="渡世步符石",部位=6,门派="化生寺"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="黄色" and sj[4].颜色 =="红色" and sj[5].颜色 =="蓝色" then
		返回数据={组合="清歌妙舞符石",部位=6,门派="女儿村"}
	  elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="黄色" and sj[4].颜色 =="蓝色" and sj[5].颜色 =="黑色" then
		返回数据={组合="云霄步符石",部位=6,门派="天宫"}
	  elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="绿色" and sj[4].颜色 =="红色" and sj[5].颜色 =="黑色" then
		返回数据={组合="游龙术符石",部位=6,门派="  龙宫"}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="紫色" and sj[4].颜色 =="白色" and sj[5].颜色 =="蓝色" then
		返回数据={组合="七星遁符石",部位=6,门派="五庄观"}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="绿色" and sj[4].颜色 =="黑色" and sj[5].颜色 =="蓝色" then
		返回数据={组合="莲花宝座符石",部位=6,门派="普陀山"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="红色" and sj[3].颜色 =="紫色" and sj[4].颜色 =="黑色" and sj[5].颜色 =="黄色" then
		返回数据={组合="无常步符石",部位=6,门派="阴曹地府"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="红色" and sj[4].颜色 =="蓝色" and sj[5].颜色 =="黄色" then
		返回数据={组合="裂石步符石",部位=6,门派="魔王寨"}
	  elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="红色" and sj[4].颜色 =="白色" and sj[5].颜色 =="蓝色" then
		返回数据={组合="大鹏展翅符石",部位=6,门派="狮驼岭"}
	  elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="红色" and sj[3].颜色 =="绿色" and sj[4].颜色 =="蓝色" and sj[5].颜色 =="黄色" then
		返回数据={组合="盘丝步符石",部位=6,门派="盘丝洞"}
	  -- elseif sj[1].颜色 =="白色" and sj[2].颜色 =="红色" and sj[3].颜色 =="红色" and sj[4].颜色 =="黄色" and sj[5].颜色 =="紫色" then
	  --  返回数据={组合="离魂符石",部位=6,门派="女魃墓"}
	  elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="紫色" and sj[4].颜色 =="白色" and sj[5].颜色 =="绿色" then
		返回数据={组合="驭灵咒符石",部位=6,门派="神木林"}
	  -- elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="白色" and sj[3].颜色 =="黄色" and sj[4].颜色 =="黄色" and sj[5].颜色 =="黑色" then
	  --  返回数据={组合="运思如电符石",部位=6,门派="天机城"}
	  elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="红色" and sj[4].颜色 =="黑色" and sj[5].颜色 =="紫色" then
		返回数据={组合="鬼蛊灵蕴符石",部位=6,门派="无底洞"}
	  elseif sj[1].颜色 =="红色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="黑色" and sj[4].颜色 =="黄色" and sj[5].颜色 =="蓝色" then
		返回数据={组合="天地无极符石",部位=3,门派="凌波城"}
	  elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="白色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="红色" and sj[5].颜色 =="紫色" then
		返回数据={组合="啸嗷符石",部位=3,门派="凌波城"}
	  elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="紫色" and sj[5].颜色 =="红色" then
		返回数据={组合="法天象地符石",部位=6,门派="凌波城"}
	  elseif sj[1].颜色 =="白色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="红色" and sj[5].颜色 =="红色" then
		返回数据={组合="气吞山河符石",部位=4,门派="凌波城"}
	  elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="绿色" and sj[4].颜色 =="蓝色" and sj[5].颜色 =="红色" then
		返回数据={组合="武神显圣符石",部位=5,门派="凌波城"}
	  elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="白色" and sj[4].颜色 =="紫色" and sj[5].颜色 =="紫色" then
		返回数据={组合="诛魔符石",部位=1,门派="凌波城"}
	  elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="红色" and sj[5].颜色 =="黑色" then
		返回数据={组合="九转玄功符石",部位=2,门派="凌波城"}

		elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="白色" and sj[3].颜色 =="红色" and sj[4].颜色 =="红色" and sj[5].颜色 =="紫色" then
      返回数据={组合="灵猴九窍符石",部位=1,门派="花果山"}
    elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="红色" and sj[4].颜色 =="绿色" and sj[5].颜色 =="黑色" then
      返回数据={组合="金刚之躯符石",部位=5,门派="花果山"}
    elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="白色" and sj[3].颜色 =="绿色" and sj[4].颜色 =="黄色" and sj[5].颜色 =="白色" then
      返回数据={组合="七十二变符石",部位=4,门派="花果山"}
    elseif sj[1].颜色 =="红色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="绿色" and sj[4].颜色 =="白色" and sj[5].颜色 =="白色" then
      返回数据={组合="神通广大符石",部位=3,门派="花果山"}
    elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="黑色" and sj[4].颜色 =="黄色" and sj[5].颜色 =="绿色" then
      返回数据={组合="如意金箍符石",部位=3,门派="花果山"}
    elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="红色" and sj[4].颜色 =="紫色" and sj[5].颜色 =="白色" then
      返回数据={组合="齐天逞胜符石",部位=2,门派="花果山"}
    elseif sj[1].颜色 =="黑色" and sj[2].颜色 =="黄色" and sj[3].颜色 =="黑色" and sj[4].颜色 =="红色" and sj[5].颜色 =="黄色" then
      返回数据={组合="腾云驾雾符石",部位=6,门派="花果山"}


	      --九黎
    elseif sj[1].颜色 =="蓝色" and sj[2].颜色 =="紫色" and sj[3].颜色 =="黄色" and sj[4].颜色 =="红色" and sj[5].颜色 =="黑色" then
      返回数据={组合="战火雄魂符石",部位=3,门派="九黎城"}
    elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="蓝色" and sj[3].颜色 =="白色" and sj[4].颜色 =="红色" and sj[5].颜色 =="黑色" then
      返回数据={组合="九黎战歌符石",部位=3,门派="九黎城"}
    elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="绿色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="红色" and sj[5].颜色 =="白色" then
      返回数据={组合="燃铁飞花符石",部位=4,门派="九黎城"}
    elseif sj[1].颜色 =="红色" and sj[2].颜色 =="黑色" and sj[3].颜色 =="黄色" and sj[4].颜色 =="蓝色" and sj[5].颜色 =="绿色" then
      返回数据={组合="风行九黎符石",部位=6,门派="九黎城"}
    elseif sj[1].颜色 =="黄色" and sj[2].颜色 =="白色" and sj[3].颜色 =="绿色" and sj[4].颜色 =="红色" and sj[5].颜色 =="蓝色" then
      返回数据={组合="魔神降世符石",部位=5,门派="九黎城"}
    elseif sj[1].颜色 =="紫色" and sj[2].颜色 =="红色" and sj[3].颜色 =="黄色" and sj[4].颜色 =="蓝色" and sj[5].颜色 =="白色" then
      返回数据={组合="兵铸乾坤符石",部位=1,门派="九黎城"}
    elseif sj[1].颜色 =="绿色" and sj[2].颜色 =="红色" and sj[3].颜色 =="蓝色" and sj[4].颜色 =="白色" and sj[5].颜色 =="紫色" then
      返回数据={组合="魂枫战舞符石",部位=2,门派="九黎城"}

	  end
	end
	if 返回数据~=nil and 返回数据.组合~=nil then
	  返回数据.等级=level
	elseif 返回数据==nil then
	  if level~=1 then
		return 取星位组合(sj,level-1,true)
	  end
	end
	return 返回数据
  end
  
function 取符石组合(数据)
	local jies = {}
	if 数据.符石组合 == "无懈可击" then
		jies.介绍 = "提升自身6点防御力"
		jies.门派 = "无"
		jies.部位 = "所有"
	elseif 数据.符石组合 == "望穿秋水" then
		jies.介绍 = "提升自身3点灵力"
		jies.门派 = "无"
		jies.部位 = "所有"
	elseif 数据.符石组合 == "万里横行" then
		jies.介绍 = "提升自身4点伤害"
		jies.门派 = "无"
		jies.部位 = "所有"
	elseif 数据.符石组合 == "日落西山" then
		jies.介绍 = "提升自身4点速度"
		jies.门派 = "无"
		jies.部位 = "所有"
	elseif 数据.符石组合 == "万丈霞光" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加3点恢复气血效果，包括师门技能和特技"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加5点恢复气血效果，包括师门技能和特技"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加8点恢复气血效果，包括师门技能和特技"
		elseif 数据.等级 == 4 then
			jies.介绍 = "增加10点恢复气血效果，包括师门技能和特技"
		end
		jies.门派 = "无"
		jies.部位 = "所有"
	elseif 数据.符石组合 == "无心插柳" then
		if 数据.等级 == 1 then
			jies.介绍 = "每回合第1下物理攻击怪物目标时溅射其他目标并造成当前伤害的15%伤害。"
		elseif 数据.等级 == 2 then
			jies.介绍 = "每回合第1下物理攻击怪物目标时溅射其他目标并造成当前伤害的20%伤害。"
		elseif 数据.等级 == 3 then
			jies.介绍 = "每回合第1下物理攻击怪物目标时溅射其他目标并造成当前伤害的25%伤害。"
		end
		jies.门派 = "无"
		jies.部位 = "所有"
	elseif 数据.符石组合 == "百步穿杨" then
		if 数据.等级 == 1 then
			jies.介绍 = "物理类攻击时有20%的几率给目标额外造成25点伤害"
		elseif 数据.等级 == 2 then
			jies.介绍 = "物理类攻击时有20%的几率给目标额外造成50点伤害"
		elseif 数据.等级 == 3 then
			jies.介绍 = "物理类攻击时有20%的几率给目标额外造成75点伤害"
		elseif 数据.等级 == 4 then
			jies.介绍 = "物理类攻击时有20%的几率给目标额外造成100点伤害"
		end
		jies.门派 = "无"
		jies.部位 = "所有"
	elseif 数据.符石组合 == "隔山打牛" then
		if 数据.等级 == 1 then
			jies.介绍 = "法术攻击时有25%的几率临时提升自身20点灵力"
		elseif 数据.等级 == 2 then
			jies.介绍 = "法术攻击时有25%的几率临时提升自身30点灵力"
		elseif 数据.等级 == 3 then
			jies.介绍 = "法术攻击时有25%的几率临时提升自身50点灵力"
		elseif 数据.等级 == 4 then
			jies.介绍 = "法术攻击时有25%的几率临时提升自身70点灵力"
		end
		jies.门派 = "无"
		jies.部位 = "所有"
	elseif 数据.符石组合 == "心随我动" then
		if 数据.等级 == 1 then
			jies.介绍 = "遭受物理类攻击时有25%几率抵挡25点伤害"
		elseif 数据.等级 == 2 then
			jies.介绍 = "遭受物理攻击时有25%几率抵挡40点伤害"
		elseif 数据.等级 == 3 then
			jies.介绍 = "遭受物理类攻击时有25%几率抵挡70点伤害"
		elseif 数据.等级 == 4 then
			jies.介绍 = "遭受物理类攻击时有25%几率抵挡90点伤害"
		end
		jies.门派 = "无"
		jies.部位 = "所有"
	elseif 数据.符石组合 == "云随风舞" then
		if 数据.等级 == 1 then
			jies.介绍 = "遭受法术攻击时有25%几率抵挡25点伤害"
		elseif 数据.等级 == 2 then
			jies.介绍 = "遭受法术攻击时有25%几率抵挡40点伤害"
		elseif 数据.等级 == 3 then
			jies.介绍 = "遭受法术攻击时有20%几率抵挡70点伤害"
		elseif 数据.等级 == 4 then
			jies.介绍 = "遭受法术攻击时有20%几率抵挡80点伤害"
		end
		jies.门派 = "无"
		jies.部位 = "所有"
		---以上已完成
	elseif 数据.符石组合 == "飞檐走壁" then
		if 数据.等级 == 1 then
			jies.介绍 = "释放法术时降低8%的MP消耗"
		elseif 数据.等级 == 2 then
			jies.介绍 = "释放法术时降低12%的MP消耗"
		elseif 数据.等级 == 3 then
			jies.介绍 = "释放法术时降低16%的MP消耗"
		end
		jies.门派 = "无"
		jies.部位 = "所有"
	elseif 数据.符石组合 == "风卷残云" then
		if 数据.等级 == 1 then
			jies.介绍 = "击倒鬼魂目标时有5%几率将其打飞出场"
		elseif 数据.等级 == 2 then
			jies.介绍 = "击倒鬼魂目标时有10%几率将其打飞出场"
		elseif 数据.等级 == 3 then
			jies.介绍 = "击倒鬼魂目标时有15%几率将其打飞出场"
		elseif 数据.等级 == 4 then
			jies.介绍 = "击倒鬼魂目标时有20%几率将其打飞出场"
		end
		jies.门派 = "无"
		jies.部位 = "所有"
	elseif 数据.符石组合 == "天降大任" then
		if 数据.等级 == 1 then
			jies.介绍 = "无视召唤兽5%的物理防御进行攻击。(该组合全身只有一件装备起效)"
		elseif 数据.等级 == 2 then
			jies.介绍 = "无视召唤兽10%的物理防御进行攻击。(该组合全身只有一件装备起效)"
		elseif 数据.等级 == 3 then
			jies.介绍 = "无视召唤兽15%的物理防御进行攻击。(该组合全身只有一件装备起效)"
		end
		jies.门派 = "无"
		jies.部位 = "所有"
	elseif 数据.符石组合 == "凤舞九天" then
		if 数据.等级 == 1 then
			jies.介绍 = "使用暗器时增加人物等级/2的伤害，装备该组合时降低5%的防御，仅对NPC使用时有效"
		elseif 数据.等级 == 2 then
			jies.介绍 = "使用暗器时增加人物等级/1.5的伤害，装备该组合时降低5%的防御，仅对NPC使用时有效"
		elseif 数据.等级 == 3 then
			jies.介绍 = "使用暗器时增加人物等级*1的伤害，装备该组合时降低5%的防御，仅对NPC使用时有效"
		end
		jies.门派 = "女儿村"
		jies.部位 = "所有"
	elseif 数据.符石组合 == "网罗乾坤" then
		if 数据.等级 == 1 then
			jies.介绍 = "使用天罗地网时，增加人物等级/2的伤害"
		elseif 数据.等级 == 2 then
			jies.介绍 = "使用天罗地网时，增加人物等级/1.5的伤害"
		elseif 数据.等级 == 3 then
			jies.介绍 = "使用天罗地网时，增加人物等级*1的伤害"
		end
		jies.门派 = "盘丝洞"
		jies.部位 = "所有"
	elseif 数据.符石组合 == "石破天惊" then
		if 数据.等级 == 1 then
			jies.介绍 = "使用落雷符时增加人物等级/2的伤害，装备该组合时降低5%的防御"
		elseif 数据.等级 == 2 then
			jies.介绍 = "使用落雷符时增加人物等级/1.5的伤害，装备该组合时降低5%的防御"
		elseif 数据.等级 == 3 then
			jies.介绍 = "使用落雷符时增加人物等级的伤害，装备该组合时降低5%的防御"
		end
		jies.门派 = "方寸山"
		jies.部位 = "所有"
	elseif 数据.符石组合 == "天雷地火" then
		if 数据.等级 == 1 then
			jies.介绍 = "使用天雷斩、雷霆万钧时增加人物等级/2的伤害，装备该组合时降低5%的防御"
		elseif 数据.等级 == 2 then
			jies.介绍 = "使用天雷斩、雷霆万钧时增加人物等级/1.5的伤害，装备该组合时降低5%的防御"
		elseif 数据.等级 == 3 then
			jies.介绍 = "使用天雷斩、雷霆万钧时增加人物等级的伤害，装备该组合时降低5%的防御"
		end
		jies.门派 = "天宫"
		jies.部位 = "所有"
	elseif 数据.符石组合 == "烟雨飘摇" then
		if 数据.等级 == 1 then
			jies.介绍 = "使用烟雨剑法、飘渺式时增加人物等级/2的伤害，装备该组合时降低5%的防御"
		elseif 数据.等级 == 2 then
			jies.介绍 = "使用烟雨剑法、飘渺式时增加人物等级/1.5的伤害，装备该组合时降低5%的防御"
		elseif 数据.等级 == 3 then
			jies.介绍 = "使用烟雨剑法、飘渺式时增加人物等级的伤害，装备该组合时降低5%的防御"
		end
		jies.门派 = "五庄观"
		jies.部位 = "所有"
	elseif 数据.符石组合 == "索命无常" then
		if 数据.等级 == 1 then
			jies.介绍 = "使用阎罗令时，增加人物等级*0.12的伤害"
		elseif 数据.等级 == 2 then
			jies.介绍 = "使用阎罗令时，增加人物等级*0.16的伤害"
		elseif 数据.等级 == 3 then
			jies.介绍 = "使用阎罗令时，增加人物等级*0.25的伤害"
		end
		jies.门派 = "阴曹地府"
		jies.部位 = "所有"
	elseif 数据.符石组合 == "行云流水" then
		if 数据.等级 == 1 then
			jies.介绍 = "使用五行法术时，增加人物等级*0.25的伤害"
		elseif 数据.等级 == 2 then
			jies.介绍 = "使用五行法术时，增加人物等级*0.33的伤害"
		elseif 数据.等级 == 3 then
			jies.介绍 = "使用五行法术时，增加人物等级*0.5的伤害"
		end
		jies.门派 = "普陀山"
		jies.部位 = "所有"
	elseif 数据.符石组合 == "福泽天下" then
		if 数据.等级 == 1 then
			jies.介绍 = "使用唧唧歪歪时，增加人物等级/2的伤害，装备该组合时降低5%的防御"
		elseif 数据.等级 == 2 then
			jies.介绍 = "使用唧唧歪歪时，增加人物等级/2的伤害，装备该组合时降低5%的防御"
		elseif 数据.等级 == 3 then
			jies.介绍 = "使用唧唧歪歪时，增加人物等级/2的伤害，装备该组合时降低5%的防御"
		end
		jies.门派 = "化生寺"
		jies.部位 = "所有"
	elseif 数据.符石组合 == "暗度陈仓" then
		jies.介绍 = "受到物理攻击时，降低3%的所受伤害。"
		jies.门派 = "无"
		jies.部位 = "所有"
	elseif 数据.符石组合 == "点石成金" then
		jies.介绍 = "防御时，遭受物理攻击所受到的伤害降低20%"
		jies.门派 = "无"
		jies.部位 = "所有"
	elseif 数据.符石组合 == "化敌为友" then
		jies.介绍 = "受到法术攻击时，降低3%的所受伤害。"
		jies.门派 = "无"
		jies.部位 = "所有"
	elseif 数据.符石组合 == "高山流水" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加人物等级/3+30的法术伤害。(该组合全身只有一件装备起效)"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加人物等级/2+30的法术伤害。(该组合全身只有一件装备起效)"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加人物等级+30的法术伤害。(该组合全身只有一件装备起效)"
		end
		jies.门派 = "无"
		jies.部位 = "所有"
	elseif 数据.符石组合 == "百无禁忌" then
		if 数据.等级 == 1 then
			jies.介绍 = "提高自身4%对抗封印类技能的能力"
		elseif 数据.等级 == 2 then
			jies.介绍 = "提高自身8%对抗封印类技能的能力"
		elseif 数据.等级 == 3 then
			jies.介绍 = "提高自身12%对抗封印类技能的能力"
		end
		jies.门派 = "无"
		jies.部位 = "靴"

		--门派符石结束
	elseif 数据.符石组合 == "为官之道符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能为官之道等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能为官之道等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能为官之道等级6级"
		end
		jies.门派 = "大唐官府"
		jies.部位 = "头盔/发钗"
	elseif 数据.符石组合 == "黄庭经符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能黄庭经等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能黄庭经等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能黄庭经等级6级"
		end
		jies.门派 = "方寸山"
		jies.部位 = "头盔/发钗"
	elseif 数据.符石组合 == "小乘佛法符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能小乘佛法等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能小乘佛法等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能小乘佛法等级6级"
		end
		jies.门派 = "化生寺"
		jies.部位 = "头盔/发钗"
	elseif 数据.符石组合 == "毒经符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能毒经等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能毒经等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能毒经等级6级"
		end
		jies.门派 = "女儿村"
		jies.部位 = "头盔/发钗"
	elseif 数据.符石组合 == "天罡气符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能天罡气等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能天罡气等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能天罡气等级6级"
		end
		jies.门派 = "天宫"
		jies.部位 = "头盔/发钗"
	elseif 数据.符石组合 == "九龙诀符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能九龙诀等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能九龙诀等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能九龙诀等级6级"
		end
		jies.门派 = "龙宫"
		jies.部位 = "头盔/发钗"
	elseif 数据.符石组合 == "周易学符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能周易学等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能周易学等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能周易学等级6级"
		end
		jies.门派 = "五庄观"
		jies.部位 = "头盔/发钗"
	elseif 数据.符石组合 == "灵性符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能灵性等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能灵性等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能灵性等级6级"
		end
		jies.门派 = "普陀山"
		jies.部位 = "头盔/发钗"
	elseif 数据.符石组合 == "灵通术符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能灵通术等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能灵通术等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能灵通术等级6级"
		end
		jies.门派 = "阴曹地府"
		jies.部位 = "头盔/发钗"
	elseif 数据.符石组合 == "牛逼神功符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能牛逼神功等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能牛逼神功等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能牛逼神功等级6级"
		end
		jies.门派 = "魔王寨"
		jies.部位 = "头盔/发钗"
	elseif 数据.符石组合 == "魔兽神功符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能魔兽神功等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能魔兽神功等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能魔兽神功等级6级"
		end
		jies.门派 = "狮驼岭"
		jies.部位 = "头盔/发钗"
	elseif 数据.符石组合 == "蛛丝阵法符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能蛛丝阵法等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能蛛丝阵法等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能蛛丝阵法等级6级"
		end
		jies.门派 = "盘丝洞"
		jies.部位 = "头盔/发钗"
	elseif 数据.符石组合 == "文韬武略符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能文韬武略等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能文韬武略等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能文韬武略等级6级"
		end
		jies.门派 = "大唐官府"
		jies.部位 = "腰带"
	elseif 数据.符石组合 == "归元心法符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能归元心法等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能归元心法等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能归元心法等级6级"
		end
		jies.门派 = "方寸山"
		jies.部位 = "腰带"
	elseif 数据.符石组合 == "佛光普照符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能佛光普照等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能佛光普照等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能佛光普照等级6级"
		end
		jies.门派 = "化生寺"
		jies.部位 = "腰带"
	elseif 数据.符石组合 == "倾国倾城符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能倾国倾城等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能倾国倾城等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能倾国倾城等级6级"
		end
		jies.门派 = "女儿村"
		jies.部位 = "腰带"
	elseif 数据.符石组合 == "傲世诀符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能傲世诀等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能傲世诀等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能傲世诀等级6级"
		end
		jies.门派 = "天宫"
		jies.部位 = "腰带"
	elseif 数据.符石组合 == "逆鳞术符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能逆鳞等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能逆鳞等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能逆鳞等级6级"
		end
		jies.门派 = "龙宫"
		jies.部位 = "腰带"
	elseif 数据.符石组合 == "明性修身符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能明性修身等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能明性修身等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能明性修身等级6级"
		end
		jies.门派 = "五庄观"
		jies.部位 = "腰带"
	elseif 数据.符石组合 == "五行扭转符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能五行扭转等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能五行扭转等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能五行扭转等级6级"
		end
		jies.门派 = "普陀山"
		jies.部位 = "腰带"
	elseif 数据.符石组合 == "拘魂诀符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能拘魂诀等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能拘魂诀等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能拘魂诀等级6级"
		end
		jies.门派 = "阴曹地府"
		jies.部位 = "腰带"
	elseif 数据.符石组合 == "回身击符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能回身击等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能回身击等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能回身击等级6级"
		end
		jies.门派 = "魔王寨"
		jies.部位 = "腰带"
	elseif 数据.符石组合 == "魔兽反嗜符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能魔兽反噬等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能魔兽反噬等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能魔兽反噬等级6级"
		end
		jies.门派 = "狮驼岭"
		jies.部位 = "腰带"
	elseif 数据.符石组合 == "盘丝大法符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能盘丝大法等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能盘丝大法等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能盘丝大法等级6级"
		end
		jies.门派 = "盘丝洞"
		jies.部位 = "腰带"
	elseif 数据.符石组合 == "十方无敌符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能十方无敌等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能十方无敌等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能十方无敌等级6级"
		end
		jies.门派 = "大唐官府"
		jies.部位 = "铠甲/女衣"
	elseif 数据.符石组合 == "符之术符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能符之术等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能符之术等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能符之术等级6级"
		end
		jies.门派 = "方寸山"
		jies.部位 = "铠甲/女衣"
	elseif 数据.符石组合 == "歧黄之术符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能歧黄之术等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能歧黄之术等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能歧黄之术等级6级"
		end
		jies.门派 = "化生寺"
		jies.部位 = "铠甲/女衣"
	elseif 数据.符石组合 == "闭月羞花符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能闭月羞花等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能闭月羞花等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能闭月羞花等级6级"
		end
		jies.门派 = "女儿村"
		jies.部位 = "铠甲/女衣"
	elseif 数据.符石组合 == "乾坤塔符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能乾坤塔等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能乾坤塔等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能乾坤塔等级6级"
		end
		jies.门派 = "天宫"
		jies.部位 = "铠甲/女衣"
	elseif 数据.符石组合 == "呼风唤雨符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能呼风唤雨等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能呼风唤雨等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能呼风唤雨等级6级"
		end
		jies.门派 = "龙宫"
		jies.部位 = "铠甲/女衣"
	elseif 数据.符石组合 == "乾坤袖符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能乾坤袖等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能乾坤袖等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能乾坤袖等级6级"
		end
		jies.门派 = "五庄观"
		jies.部位 = "铠甲/女衣"
	elseif 数据.符石组合 == "金刚经符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能金刚经等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能金刚经等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能金刚经等级6级"
		end
		jies.门派 = "普陀山"
		jies.部位 = "铠甲/女衣"
	elseif 数据.符石组合 == "幽冥术符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能幽冥术等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能幽冥术等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能幽冥术等级6级"
		end
		jies.门派 = "阴曹地府"
		jies.部位 = "铠甲/女衣"
	elseif 数据.符石组合 == "火牛阵符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能火牛阵等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能火牛阵等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能火牛阵等级6级"
		end
		jies.门派 = "魔王寨"
		jies.部位 = "铠甲/女衣"
	elseif 数据.符石组合 == "生死搏符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能生死搏等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能生死搏等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能生死搏等级6级"
		end
		jies.门派 = "狮驼岭"
		jies.部位 = "铠甲/女衣"
	elseif 数据.符石组合 == "迷情大法符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能迷情大法等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能迷情大法等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能迷情大法等级6级"
		end
		jies.门派 = "盘丝洞"
		jies.部位 = "铠甲/女衣"
	elseif 数据.符石组合 == "神兵鉴赏符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能神兵鉴赏等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能神兵鉴赏等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能神兵鉴赏等级6级"
		end
		jies.门派 = "大唐官府"
		jies.部位 = "武器"
	elseif 数据.符石组合 == "霹雳咒符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能霹雳咒等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能霹雳咒等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能霹雳咒等级6级"
		end
		jies.门派 = "方寸山"
		jies.部位 = "武器"
	elseif 数据.符石组合 == "诵经符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能诵经等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能诵经等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能诵经等级6级"
		end
		jies.门派 = "化生寺"
		jies.部位 = "武器"
	elseif 数据.符石组合 == "沉鱼落雁符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能沉鱼落雁等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能沉鱼落雁等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能沉鱼落雁等级6级"
		end
		jies.门派 = "女儿村"
		jies.部位 = "武器"
	elseif 数据.符石组合 == "宁气诀符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能宁气诀等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能宁气诀等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能宁气诀等级6级"
		end
		jies.门派 = "天宫"
		jies.部位 = "武器"
	elseif 数据.符石组合 == "破浪诀符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能破浪诀等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能破浪诀等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能破浪诀等级6级"
		end
		jies.门派 = "龙宫"
		jies.部位 = "武器"
	elseif 数据.符石组合 == "潇湘仙雨符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能潇湘仙雨等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能潇湘仙雨等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能潇湘仙雨等级6级"
		end
		jies.门派 = "五庄观"
		jies.部位 = "武器"
	elseif 数据.符石组合 == "五行学说符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能五行学说等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能五行学说等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能五行学说等级6级"
		end
		jies.门派 = "普陀山"
		jies.部位 = "武器"
	elseif 数据.符石组合 == "尸腐恶符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能尸腐恶等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能尸腐恶等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能尸腐恶等级6级"
		end
		jies.门派 = "阴曹地府"
		jies.部位 = "武器"
	elseif 数据.符石组合 == "牛虱阵符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能牛虱阵等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能牛虱阵等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能牛虱阵等级6级"
		end
		jies.门派 = "魔王寨"
		jies.部位 = "武器"
	elseif 数据.符石组合 == "阴阳二气诀符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能阴阳二气诀等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能阴阳二气诀等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能阴阳二气诀等级6级"
		end
		jies.门派 = "狮驼岭"
		jies.部位 = "武器"
	elseif 数据.符石组合 == "姊妹相随符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能姊妹相随等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能姊妹相随等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能姊妹相随等级6级"
		end
		jies.门派 = "盘丝洞"
		jies.部位 = "武器"
	elseif 数据.符石组合 == "无双一击符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能无双一击等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能无双一击等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能无双一击等级6级"
		end
		jies.门派 = "大唐官府"
		jies.部位 = "武器"
	elseif 数据.符石组合 == "磬龙灭法符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能磬龙灭法等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能磬龙灭法等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能磬龙灭法等级6级"
		end
		jies.门派 = "方寸山"
		jies.部位 = "武器"
	elseif 数据.符石组合 == "金刚伏魔符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能金刚伏魔等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能金刚伏魔等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能金刚伏魔等级6级"
		end
		jies.门派 = "化生寺"
		jies.部位 = "武器"
	elseif 数据.符石组合 == "玉质冰肌符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能玉质冰肌等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能玉质冰肌等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能玉质冰肌等级6级"
		end
		jies.门派 = "女儿村"
		jies.部位 = "武器"
	elseif 数据.符石组合 == "混天术符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能混天术等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能混天术等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能混天术等级6级"
		end
		jies.门派 = "天宫"
		jies.部位 = "武器"
	elseif 数据.符石组合 == "龙附符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能龙附等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能龙附等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能龙附等级6级"
		end
		jies.门派 = "龙宫"
		jies.部位 = "武器"
	elseif 数据.符石组合 == "修仙术符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能修仙术等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能修仙术等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能修仙术等级6级"
		end
		jies.门派 = "五庄观"
		jies.部位 = "武器"
	elseif 数据.符石组合 == "护法金刚符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能护法金刚等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能护法金刚等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能护法金刚等级6级"
		end
		jies.门派 = "普陀山"
		jies.部位 = "武器"
	elseif 数据.符石组合 == "六道轮回符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能六道轮回等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能六道轮回等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能六道轮回等级6级"
		end
		jies.门派 = "阴曹地府"
		jies.部位 = "武器"
	elseif 数据.符石组合 == "震天诀符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能震天诀等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能震天诀等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能震天诀等级6级"
		end
		jies.门派 = "魔王寨"
		jies.部位 = "武器"
	elseif 数据.符石组合 == "狂兽诀符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能狂兽诀等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能狂兽诀等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能狂兽诀等级6级"
		end
		jies.门派 = "狮驼岭"
		jies.部位 = "武器"
	elseif 数据.符石组合 == "秋波暗送符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能秋波暗送等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能秋波暗送等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能秋波暗送等级6级"
		end
		jies.门派 = "盘丝洞"
		jies.部位 = "武器"
	elseif 数据.符石组合 == "紫薇之术符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能紫薇之术等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能紫薇之术等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能紫薇之术等级6级"
		end
		jies.门派 = "大唐官府"
		jies.部位 = "项链"
	elseif 数据.符石组合 == "神道无念符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能神道无念等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能神道无念等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能神道无念等级6级"
		end
		jies.门派 = "方寸山"
		jies.部位 = "项链"
	elseif 数据.符石组合 == "大慈大悲符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能大慈大悲等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能大慈大悲等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能大慈大悲等级6级"
		end
		jies.门派 = "化生寺"
		jies.部位 = "项链"
	elseif 数据.符石组合 == "香飘兰麝符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能香飘兰麝等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能香飘兰麝等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能香飘兰麝等级6级"
		end
		jies.门派 = "女儿村"
		jies.部位 = "项链"
	elseif 数据.符石组合 == "清明自在符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能清明自在等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能清明自在等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能清明自在等级6级"
		end
		jies.门派 = "天宫"
		jies.部位 = "项链"
	elseif 数据.符石组合 == "龙腾术符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能龙腾术等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能龙腾术等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能龙腾术等级6级"
		end
		jies.门派 = "龙宫"
		jies.部位 = "项链"
	elseif 数据.符石组合 == "混元道果符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能混元道果等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能混元道果等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能混元道果等级6级"
		end
		jies.门派 = "五庄观"
		jies.部位 = "项链"
	elseif 数据.符石组合 == "观音咒符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能观音咒等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能观音咒等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能观音咒等级6级"
		end
		jies.门派 = "普陀山"
		jies.部位 = "项链"
	elseif 数据.符石组合 == "九幽阴魂符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能九幽阴魂等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能九幽阴魂等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能九幽阴魂等级6级"
		end
		jies.门派 = "阴曹地府"
		jies.部位 = "项链"
	elseif 数据.符石组合 == "火云术符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能火云术等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能火云术等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能火云术等级6级"
		end
		jies.门派 = "魔王寨"
		jies.部位 = "项链"
	elseif 数据.符石组合 == "训兽诀符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能训兽诀等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能训兽诀等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能训兽诀等级6级"
		end
		jies.门派 = "狮驼岭"
		jies.部位 = "项链"
	elseif 数据.符石组合 == "天外魔音符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能天外魔音等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能天外魔音等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能天外魔音等级6级"
		end
		jies.门派 = "盘丝洞"
		jies.部位 = "项链"
	elseif 数据.符石组合 == "疾风步符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能疾风步等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能疾风步等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能疾风步等级6级"
		end
		jies.门派 = "大唐官府"
		jies.部位 = "靴"
	elseif 数据.符石组合 == "斜月步符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能斜月步等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能斜月步等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能斜月步等级6级"
		end
		jies.门派 = "方寸山"
		jies.部位 = "靴"
	elseif 数据.符石组合 == "渡世步符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能渡世步等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能渡世步等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能渡世步等级6级"
		end
		jies.门派 = "化生寺"
		jies.部位 = "靴"
	elseif 数据.符石组合 == "清歌妙舞符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能清歌妙舞等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能清歌妙舞等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能清歌妙舞等级6级"
		end
		jies.门派 = "女儿村"
		jies.部位 = "靴"
	elseif 数据.符石组合 == "云霄步符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能云霄步等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能云霄步等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能云霄步等级6级"
		end
		jies.门派 = "天宫"
		jies.部位 = "靴"
	elseif 数据.符石组合 == "游龙术符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能游龙术等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能游龙术等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能游龙术等级6级"
		end
		jies.门派 = "龙宫"
		jies.部位 = "靴"
	elseif 数据.符石组合 == "七星遁符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能七星遁等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能七星遁等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能七星遁等级6级"
		end
		jies.门派 = "五庄观"
		jies.部位 = "靴"
	elseif 数据.符石组合 == "莲花宝座符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能莲花宝座等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能莲花宝座等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能莲花宝座等级6级"
		end
		jies.门派 = "普陀山"
		jies.部位 = "靴"
	elseif 数据.符石组合 == "无常步符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能无常步等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能无常步等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能无常步等级6级"
		end
		jies.门派 = "阴曹地府"
		jies.部位 = "靴"
	elseif 数据.符石组合 == "裂石步符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能裂石步等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能裂石步等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能裂石步等级6级"
		end
		jies.门派 = "魔王寨"
		jies.部位 = "靴"
	elseif 数据.符石组合 == "大鹏展翅符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能大鹏展翅等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能大鹏展翅等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能大鹏展翅等级6级"
		end
		jies.门派 = "狮驼岭"
		jies.部位 = "靴"
	elseif 数据.符石组合 == "移形换影符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能移形换影等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能移形换影等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能移形换影等级6级"
		end
		jies.门派 = "盘丝洞"
		jies.部位 = "靴"
	elseif 数据.符石组合 == "天地无极符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能天地无极等级2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能天地无极等级4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能天地无极等级6级"
		end
		jies.门派 = "凌波城"
		jies.部位 = "武器"
	elseif 数据.符石组合 == "啸傲符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能啸傲2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能啸傲4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能啸傲6级"
		end
		jies.门派 = "凌波城"
		jies.部位 = "武器"
	elseif 数据.符石组合 == "武神显圣符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能武神显圣2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能武神显圣4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能武神显圣6级"
		end
		jies.门派 = "凌波城"
		jies.部位 = "腰带"
	elseif 数据.符石组合 == "诛魔符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能诛魔2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能诛魔4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能诛魔6级"
		end
		jies.门派 = "凌波城"
		jies.部位 = "头盔/发钗"
	elseif 数据.符石组合 == "气吞山河符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能气吞山河2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能气吞山河4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能气吞山河6级"
		end
		jies.门派 = "凌波城"
		jies.部位 = "铠甲/女衣"
	elseif 数据.符石组合 == "九转玄功符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能九转玄功2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能九转玄功4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能九转玄功6级"
		end
		jies.门派 = "凌波城"
		jies.部位 = "项链"
	elseif 数据.符石组合 == "法天象地符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能法天象地2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能法天象地4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能法天象地6级"
		end
		jies.门派 = "凌波城"
		jies.部位 = "鞋子"
	elseif 数据.符石组合 == "秘影迷踪符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能秘影迷踪2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能秘影迷踪4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能秘影迷踪6级"
		end
		jies.门派 = "无底洞"
		jies.部位 = "武器"
	elseif 数据.符石组合 == "混元神功符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能混元神功2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能混元神功4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能混元神功6级"
		end
		jies.门派 = "无底洞"
		jies.部位 = "武器"
	elseif 数据.符石组合 == "地冥妙法符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能地冥妙法2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能地冥妙法4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能地冥妙法6级"
		end
		jies.门派 = "无底洞"
		jies.部位 = "腰带"
	elseif 数据.符石组合 == "燃灯灵宝符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能燃灯灵宝2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能燃灯灵宝4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能燃灯灵宝6级"
		end
		jies.门派 = "无底洞"
		jies.部位 = "头盔/发钗"
	elseif 数据.符石组合 == "阴风绝章符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能阴风绝章2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能阴风绝章4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能阴风绝章6级"
		end
		jies.门派 = "无底洞"
		jies.部位 = "铠甲/女衣"
	elseif 数据.符石组合 == "枯骨心法符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能枯骨心法2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能枯骨心法4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能枯骨心法6级"
		end
		jies.门派 = "无底洞"
		jies.部位 = "项链"
	elseif 数据.符石组合 == "鬼蛊灵蕴符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能鬼蛊灵蕴2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能鬼蛊灵蕴4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能鬼蛊灵蕴6级"
		end
		jies.门派 = "无底洞"
		jies.部位 = "鞋子"
	elseif 数据.符石组合 == "天人庇护符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能天人庇护2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能天人庇护4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能天人庇护6级"
		end
		jies.门派 = "神木林"
		jies.部位 = "武器"
	elseif 数据.符石组合 == "神木恩泽符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能神木恩泽2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能神木恩泽4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能神木恩泽6级"
		end
		jies.门派 = "神木林"
		jies.部位 = "武器"
	elseif 数据.符石组合 == "万物轮转符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能万物轮转2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能万物轮转4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能万物轮转6级"
		end
		jies.门派 = "神木林"
		jies.部位 = "腰带"
	elseif 数据.符石组合 == "巫咒符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能巫咒2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能巫咒4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能巫咒6级"
		end
		jies.门派 = "神木林"
		jies.部位 = "头盔/发钗"
	elseif 数据.符石组合 == "瞬息万变符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能瞬息万变2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能瞬息万变4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能瞬息万变6级"
		end
		jies.门派 = "神木林"
		jies.部位 = "铠甲/女衣"
	elseif 数据.符石组合 == "万灵诸念符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能万灵诸念2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能万灵诸念4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能万灵诸念6级"
		end
		jies.门派 = "神木林"
		jies.部位 = "项链"
	elseif 数据.符石组合 == "驭灵咒符石" then
		if 数据.等级 == 1 then
			jies.介绍 = "增加门派技能驭灵咒2级"
		elseif 数据.等级 == 2 then
			jies.介绍 = "增加门派技能驭灵咒4级"
		elseif 数据.等级 == 3 then
			jies.介绍 = "增加门派技能驭灵咒6级"
		end
		jies.门派 = "神木林"
		jies.部位 = "鞋子"
	end
	return jies
end

function 取符石组合说明(名称, level)
	-- print(名称,level)
	local 效果说明 = "无"
	if level == 1 then
		if 名称 == "真元护体" then
			效果说明 = "减伤受到所有伤害降低1%"
		elseif 名称 == "风卷残云" then
			效果说明 = "击倒鬼魂目标时\n#X有5%几率将其打飞出场"
		elseif 名称 == "万丈霞光" then
			效果说明 = "增加3点恢复气血效果"
		elseif 名称 == "无所畏惧" then
			效果说明 = "五行克制抵御能力+1%\nX#X该组合没有效果"
		elseif 名称 == "回眸一笑" then
			效果说明 = "五行克制能力+1%\nX#X该组合没有效果"
		elseif 名称 == "柳暗花明" then
			效果说明 = "中毒时降低10%的气血及魔法损失\n#X该组合没有效果"
		elseif 名称 == "雪照云光" then
			效果说明 = "增加2级追捕技巧\n#X该组合没有效果"
		elseif 名称 == "心灵手巧" then
			效果说明 = "增加5%捕获召唤兽宝宝的几率\n#X该组合没有效果"
		elseif 名称 == "点石成金" then
			效果说明 = "遭受物理攻击有5%几率\n#X伤害降低10%"
		elseif 名称 == "百步穿杨" then
			效果说明 = "物理类攻击目标\n#X额外造成25点伤害"
		elseif 名称 == "隔山打牛" then
			效果说明 = "法术攻击时有一定几率对目标\n#X加成20法术伤害"
		elseif 名称 == "心随我动" then
			效果说明 = "遭受物理类攻击时有一定几率\n#X抵挡25点伤害"
		elseif 名称 == "云随风舞" then
			效果说明 = "遭受法术攻击时有一定几率\n#X抵挡20点伤害"
		elseif 名称 == "无懈可击" then
			效果说明 = "提升自身6点防御"
		elseif 名称 == "望穿秋水" then
			效果说明 = "提升自身3点灵力"
		elseif 名称 == "万里横行" then
			效果说明 = "提升自身4点伤害"
		elseif 名称 == "日落西山" then
			效果说明 = "提升自身4点速度"
		elseif 名称 == "网罗乾坤" then
			效果说明 = "使用天罗地网时\n#X增加人物等级*1的伤害"
		elseif 名称 == "石破天惊" then
			效果说明 = "使用落雷符时\n#X增加人物等级%2的伤害"
		elseif 名称 == "天雷地火" then
			效果说明 = "使用天雷斩、雷霆万钧时\n#X增加人物等级%2的伤害"
		elseif 名称 == "凤舞九天" then
			效果说明 = "使用雨落寒沙时\n#X增加人物等级*1的伤害"
		elseif 名称 == "烟雨飘摇" then
			效果说明 = "使用烟雨剑法、飘渺式时\n#X增加人物等级%2的伤害"
		elseif 名称 == "索命无常" then
			效果说明 = "使用阎罗令时\n#X增加人物等级*1的伤害"
		elseif 名称 == "行云流水" then
			效果说明 = "使用五行法术时\n#X增加人物等级*1的伤害"
		elseif 名称 == "福泽天下" then
			效果说明 = "使用唧唧歪歪时\n#X增加人物等级%2的伤害"
			-- elseif 名称=="势如破竹" then
			--   效果说明 = "与NPC战斗时，使用破击，增加人物等级*37%的固定伤害能力"
		elseif 名称 == "销魂噬骨" then
			效果说明 = "使用夺命咒或追魂刺\n#X增加人物等级*1的伤害"
		elseif 名称 == "无心插柳" then
			效果说明 = "你的溅射伤害加成提高15%\n#X从而获得溅射效果"
		end
	elseif level == 2 then
		if 名称 == "真元护体" then
			效果说明 = "减伤受到所有伤害降低3%"
		elseif 名称 == "风卷残云" then
			效果说明 = "击倒鬼魂目标时\n#X有10%几率将其打飞出场"
		elseif 名称 == "降妖伏魔" then
			效果说明 = "增加对鬼魂系目标伤害增加8%"
		elseif 名称 == "万丈霞光" then
			效果说明 = "增加5点恢复气血效果"
		elseif 名称 == "无所畏惧" then
			效果说明 = "五行克制抵御能力+2%\n#X该组合没有效果"
		elseif 名称 == "回眸一笑" then
			效果说明 = "五行克制能力+2%\n#X该组合没有效果"
		elseif 名称 == "柳暗花明" then
			效果说明 = "中毒时降低15%的气血及魔法损失\n#X该组合没有效果"
		elseif 名称 == "飞檐走壁" then
			效果说明 = "释放法术时降低8%的MP消耗\n#X该组合没有效"
		elseif 名称 == "雪照云光" then
			效果说明 = "增加4级追捕技巧\n#X该组合没有效果"
		elseif 名称 == "心灵手巧" then
			效果说明 = "增加8%捕获召唤兽宝宝的几率\n#X该组合没有效果"
		elseif 名称 == "点石成金" then
			效果说明 = "遭受物理攻击有5%几率伤\n#X害降低20%"
		elseif 名称 == "百步穿杨" then
			效果说明 = "物理类攻击目标有一定几率\n#X额外造成45点伤害"
		elseif 名称 == "隔山打牛" then
			效果说明 = "法术攻击时有一定几率对目标\n#X加成30法术伤害"
		elseif 名称 == "心随我动" then
			效果说明 = "遭受物理类攻击时有一定几率\n#X抵挡45点伤害"
		elseif 名称 == "云随风舞" then
			效果说明 = "遭受法术攻击时有一定几率\n#X抵挡40点伤害"
		elseif 名称 == "天降大任" then
			效果说明 = "无视召唤兽5%的物理防御进行攻击。(该组合全身只有一件装备起效)"
		elseif 名称 == "高山流水" then
			效果说明 = "对召唤兽增加人物等级/3+30的法术伤害。(该组合全身只有一件装备起效)"
		elseif 名称 == "百无禁忌" then
			效果说明 = "提高自身4%对抗封印类技能的能力"
		elseif 名称 == "为官之道符石" then
			效果说明 = "增加门派技能为官之道等级2级"
		elseif 名称 == "黄庭经符石" then
			效果说明 = "增加门派技能黄庭经等级2级"
		elseif 名称 == "小乘佛法符石" then
			效果说明 = "增加门派技能小乘佛法等级2级"
		elseif 名称 == "毒经符石" then
			效果说明 = "增加门派技能毒经等级2级"
		elseif 名称 == "天罡气符石" then
			效果说明 = "增加门派技能天罡气等级2级"
		elseif 名称 == "九龙诀符石" then
			效果说明 = "增加门派技能九龙诀等级2级"
		elseif 名称 == "周易学符石" then
			效果说明 = "增加门派技能周易学等级2级"
		elseif 名称 == "灵性符石" then
			效果说明 = "增加门派技能灵性等级2级"
		elseif 名称 == "灵通术符石" then
			效果说明 = "增加门派技能灵通术等级2级"
		elseif 名称 == "牛逼神功符石" then
			效果说明 = "增加门派技能牛逼神功等级2级"
		elseif 名称 == "魔兽神功符石" then
			效果说明 = "增加门派技能魔兽神功等级2级"
		elseif 名称 == "蛛丝阵法符石" then
			效果说明 = "增加门派技能蛛丝阵法等级2级"
			-- elseif 名称=="天火献誓符石" then
			--   效果说明 = "增加门派技能天火献誓等级2级"
		elseif 名称 == "燃灯灵宝符石" then
			效果说明 = "增加门派技能燃灯灵宝等级2级"
			-- elseif 名称=="神工无形符石" then
			--   效果说明 = "增加门派技能神工无形等级2级"
		elseif 名称 == "巫咒符石" then
			效果说明 = "增加门派技能巫咒等级2级"
		elseif 名称 == "文韬武略符石" then
			效果说明 = "增加门派技能文韬武略等级2级"
		elseif 名称 == "归元心法符石" then
			效果说明 = "增加门派技能归元心法等级2级"
		elseif 名称 == "佛光普照符石" then
			效果说明 = "增加门派技能佛光普照等级2级"
		elseif 名称 == "倾国倾城符石" then
			效果说明 = "增加门派技能倾国倾城等级2级"
		elseif 名称 == "傲世诀符石" then
			效果说明 = "增加门派技能傲世诀等级2级"
		elseif 名称 == "逆鳞符石" then
			效果说明 = "增加门派技能逆鳞等级2级"
		elseif 名称 == "明性修身符石" then
			效果说明 = "增加门派技能明性修身等级2级"
		elseif 名称 == "五行扭转符石" then
			效果说明 = "增加门派技能五行扭转等级2级"
		elseif 名称 == "拘魂诀符石" then
			效果说明 = "增加门派技能拘魂诀等级2级"
		elseif 名称 == "回身击符石" then
			效果说明 = "增加门派技能回身击等级2级"
		elseif 名称 == "魔兽反噬符石" then
			效果说明 = "增加门派技能魔兽反噬等级2级"
		elseif 名称 == "盘丝大法符石" then
			效果说明 = "增加门派技能盘丝大法等级2级"
			-- elseif 名称=="藻光灵狱符石" then
			--   效果说明 = "增加门派技能藻光灵狱等级2级"
		elseif 名称 == "地冥妙法符石" then
			效果说明 = "增加门派技能地冥妙法等级2级"
			-- elseif 名称=="千机奇巧符石" then
			--   效果说明 = "增加门派技能千机奇巧等级2级"
		elseif 名称 == "万物轮转符石" then
			效果说明 = "增加门派技能万物轮转等级2级"
		elseif 名称 == "十方无敌符石" then
			效果说明 = "增加门派技能十方无敌等级2级"
		elseif 名称 == "符之术符石" then
			效果说明 = "增加门派技能符之术等级2级"
		elseif 名称 == "歧黄之术符石" then
			效果说明 = "增加门派技能歧黄之术等级2级"
		elseif 名称 == "闭月羞花符石" then
			效果说明 = "增加门派技能闭月羞花等级2级"
		elseif 名称 == "乾坤塔符石" then
			效果说明 = "增加门派技能乾坤塔等级2级"
		elseif 名称 == "呼风唤雨符石" then
			效果说明 = "增加门派技能呼风唤雨等级2级"
		elseif 名称 == "乾坤袖符石" then
			效果说明 = "增加门派技能乾坤袖等级2级"
		elseif 名称 == "金刚经符石" then
			效果说明 = "增加门派技能金刚经等级2级"
		elseif 名称 == "幽冥术符石" then
			效果说明 = "增加门派技能幽冥术等级2级"
		elseif 名称 == "火牛阵符石" then
			效果说明 = "增加门派技能火牛阵等级2级"
		elseif 名称 == "生死搏符石" then
			效果说明 = "增加门派技能生死搏等级2级"
		elseif 名称 == "催情大法符石" then
			效果说明 = "增加门派技能催情大法等级2级"
		elseif 名称 == "煌火无明符石" then
			效果说明 = "增加门派技能煌火无明等级2级"
		elseif 名称 == "阴风绝章符石" then
			效果说明 = "增加门派技能阴风绝章等级2级"
		elseif 名称 == "瞬息万变符石" then
			效果说明 = "增加门派技能瞬息万变等级2级"
		elseif 名称 == "匠心不移符石" then
			效果说明 = "增加门派技能匠心不移等级2级"
		elseif 名称 == "神兵鉴赏符石" then
			效果说明 = "增加门派技能神兵鉴赏等级2级"
		elseif 名称 == "霹雳咒符石" then
			效果说明 = "增加门派技能霹雳咒等级2级"
		elseif 名称 == "诵经符石" then
			效果说明 = "增加门派技能诵经等级2级"
		elseif 名称 == "沉鱼落雁符石" then
			效果说明 = "增加门派技能沉鱼落雁等级2级"
		elseif 名称 == "宁气诀符石" then
			效果说明 = "增加门派技能宁气诀等级2级"
		elseif 名称 == "破浪诀符石" then
			效果说明 = "增加门派技能破浪诀等级2级"
		elseif 名称 == "潇湘仙雨符石" then
			效果说明 = "增加门派技能潇湘仙雨等级2级"
		elseif 名称 == "五行学说符石" then
			效果说明 = "增加门派技能五行学说等级2级"
		elseif 名称 == "尸腐恶符石" then
			效果说明 = "增加门派技能尸腐恶等级2级"
		elseif 名称 == "牛虱阵符石" then
			效果说明 = "增加门派技能牛虱阵等级2级"
		elseif 名称 == "阴阳二气诀符石" then
			效果说明 = "增加门派技能阴阳二气诀等级2级"
		elseif 名称 == "姊妹相随符石" then
			效果说明 = "增加门派技能姊妹相随等级2级"
		elseif 名称 == "无双一击符石" then
			效果说明 = "增加门派技能无双一击等级2级"
		elseif 名称 == "磐龙灭法符石" then
			效果说明 = "增加门派技能磐龙灭法等级2级"
		elseif 名称 == "金刚伏魔符石" then
			效果说明 = "增加门派技能金刚伏魔等级2级"
		elseif 名称 == "玉质冰肌符石" then
			效果说明 = "增加门派技能玉质冰肌等级2级"
		elseif 名称 == "混天术符石" then
			效果说明 = "增加门派技能混天术等级2级"
		elseif 名称 == "龙附符石" then
			效果说明 = "增加门派技能龙附等级2级"
		elseif 名称 == "修仙术符石" then
			效果说明 = "增加门派技能修仙术等级2级"
		elseif 名称 == "护法金刚符石" then
			效果说明 = "增加门派技能护法金刚等级2级"
		elseif 名称 == "六道轮回符石" then
			效果说明 = "增加门派技能六道轮回等级2级"
		elseif 名称 == "震天诀符石" then
			效果说明 = "增加门派技能震天诀等级2级"
		elseif 名称 == "狂兽诀符石" then
			效果说明 = "增加门派技能狂兽诀等级2级"
		elseif 名称 == "秋波暗送符石" then
			效果说明 = "增加门派技能秋波暗送等级2级"
		elseif 名称 == "化神以灵符石" then
			效果说明 = "增加门派技能化神以灵等级2级"
		elseif 名称 == "弹指成烬符石" then
			效果说明 = "增加门派技能弹指成烬等级2级"
		elseif 名称 == "攻玉以石符石" then
			效果说明 = "增加门派技能攻玉以石等级2级"
		elseif 名称 == "擎天之械符石" then
			效果说明 = "增加门派技能擎天之械等级2级"
		elseif 名称 == "混元神功符石" then
			效果说明 = "增加门派技能混元神功等级2级"
		elseif 名称 == "秘影迷踪符石" then
			效果说明 = "增加门派技能秘影迷踪等级2级"
		elseif 名称 == "神木恩泽符石" then
			效果说明 = "增加门派技能神木恩泽等级2级"
		elseif 名称 == "紫薇之术符石" then
			效果说明 = "增加门派技能紫薇之术等级2级"
		elseif 名称 == "神道无念符石" then
			效果说明 = "增加门派技能神道无念等级2级"
		elseif 名称 == "大慈大悲符石" then
			效果说明 = "增加门派技能大慈大悲等级2级"
		elseif 名称 == "香飘兰麝符石" then
			效果说明 = "增加门派技能香飘兰麝等级2级"
		elseif 名称 == "清明自在符石" then
			效果说明 = "增加门派技能清明自在等级2级"
		elseif 名称 == "龙腾符石" then
			效果说明 = "增加门派技能龙腾等级2级"
		elseif 名称 == "混元道果符石" then
			效果说明 = "增加门派技能混元道果等级2级"
		elseif 名称 == "观音咒符石" then
			效果说明 = "增加门派技能观音咒等级2级"
		elseif 名称 == "九幽阴魂符石" then
			效果说明 = "增加门派技能九幽阴魂等级2级"
		elseif 名称 == "火云术符石" then
			效果说明 = "增加门派技能火云术等级2级"
		elseif 名称 == "训兽诀符石" then
			效果说明 = "增加门派技能训兽诀等级2级"
		elseif 名称 == "天外魔音符石" then
			效果说明 = "增加门派技能天外魔音等级2级"
		elseif 名称 == "天罚之焰符石" then
			效果说明 = "增加门派技能天罚之焰等级2级"
		elseif 名称 == "万灵诸念符石" then
			效果说明 = "增加门派技能万灵诸念等级2级"
		elseif 名称 == "探奥索隐符石" then
			效果说明 = "增加门派技能探奥索隐等级2级"
		elseif 名称 == "枯骨心法符石" then
			效果说明 = "增加门派技能枯骨心法等级2级"
		elseif 名称 == "疾风步符石" then
			效果说明 = "增加门派技能疾风步等级2级"
		elseif 名称 == "斜月步符石" then
			效果说明 = "增加门派技能斜月步等级2级"
		elseif 名称 == "渡世步符石" then
			效果说明 = "增加门派技能渡世步等级2级"
		elseif 名称 == "清歌妙舞符石" then
			效果说明 = "增加门派技能清歌妙舞等级2级"
		elseif 名称 == "云霄步符石" then
			效果说明 = "增加门派技能云霄步等级2级"
		elseif 名称 == "游龙术符石" then
			效果说明 = "增加门派技能游龙术等级2级"
		elseif 名称 == "七星遁符石" then
			效果说明 = "增加门派技能七星遁等级2级"
		elseif 名称 == "莲花宝座符石" then
			效果说明 = "增加门派技能莲花宝座等级2级"
		elseif 名称 == "无常步符石" then
			效果说明 = "增加门派技能无常步等级2级"
		elseif 名称 == "裂石步符石" then
			效果说明 = "增加门派技能裂石步等级2级"
		elseif 名称 == "大鹏展翅符石" then
			效果说明 = "增加门派技能大鹏展翅等级2级"
		elseif 名称 == "盘丝步符石" then
			效果说明 = "增加门派技能盘丝步等级2级"
		elseif 名称 == "离魂符石" then
			效果说明 = "增加门派技能离魂等级2级"
		elseif 名称 == "驭灵咒符石" then
			效果说明 = "增加门派技能驭灵咒等级2级"
		elseif 名称 == "运思如电符石" then
			效果说明 = "增加门派技能运思如电等级2级"
		elseif 名称 == "鬼蛊灵蕴符石" then
			效果说明 = "增加门派技能鬼蛊灵蕴等级2级"
		elseif 名称 == "天地无极符石" then
			效果说明 = "增加门派技能天地无极等级2级"
		elseif 名称 == "啸嗷符石" then
			效果说明 = "增加门派技能啸嗷等级2级"
		elseif 名称 == "法天象地符石" then
			效果说明 = "增加门派技能法天象地等级2级"
		elseif 名称 == "武神显圣符石" then
			效果说明 = "增加门派技能武神显圣等级2级"
		elseif 名称 == "诛魔符石" then
			效果说明 = "增加门派技能诛魔等级2级"
		elseif 名称 == "九转玄功符石" then
			效果说明 = "增加门派技能九转玄功等级2级"
		elseif 名称 == "气吞山河符石" then
			效果说明 = "增加门派技能气吞山河等级2级"
		elseif 名称 == "网罗乾坤" then
			效果说明 = "使用天罗地网时\n#X增加人物等级*1.5的伤害"
		elseif 名称 == "石破天惊" then
			效果说明 = "使用落雷符时\n#X增加人物等级%1.5的伤害"
		elseif 名称 == "天雷地火" then
			效果说明 = "使用天雷斩、雷霆万钧时\n#X增加人物等级%1.5的伤害"
		elseif 名称 == "凤舞九天" then
			效果说明 = "使用雨落寒沙时\n#X增加人物等级*1.5的伤害"
		elseif 名称 == "烟雨飘摇" then
			效果说明 = "使用烟雨剑法、飘渺式时\n#X增加人物等级%1.5的伤害"
		elseif 名称 == "索命无常" then
			效果说明 = "使用阎罗令时\n#X增加人物等级*1.5的伤害"
		elseif 名称 == "行云流水" then
			效果说明 = "使用五行法术时\n#X增加人物等级*1.5的伤害"
		elseif 名称 == "福泽天下" then
			效果说明 = "使用唧唧歪歪时\n#X增加人物等级%1.5的伤害"
			-- elseif 名称=="势如破竹" then
			--   效果说明 = "与NPC战斗时，使用破击，增加人物等级*37%的固定伤害能力"
		elseif 名称 == "销魂噬骨" then
			效果说明 = "使用夺命咒或追魂刺\n#X增加人物等级*1.5的伤害"
		elseif 名称 == "无心插柳" then
			效果说明 = "你的溅射伤害加成提高20%\n#X从而获得溅射效果"
		elseif 名称=="灵猴九窍符石" then
      效果说明 = "增加门派技能灵猴九窍等级2级"
    elseif 名称=="金刚之躯符石" then
      效果说明 = "增加门派技能金刚之躯等级2级"
    elseif 名称=="七十二变符石" then
      效果说明 = "增加门派技能七十二变等级2级"
    elseif 名称=="神通广大符石" then
      效果说明 = "增加门派技能神通广大等级2级"
    elseif 名称=="如意金箍符石" then
      效果说明 = "增加门派技能如意金箍等级2级"
    elseif 名称=="齐天逞胜符石" then
      效果说明 = "增加门派技能齐天逞胜等级2级"
    elseif 名称=="腾云驾雾符石" then
      效果说明 = "增加门派技能腾云驾雾等级2级"
	  
		  --九黎
		elseif 名称=="战火雄魂符石" then
		效果说明 = "增加门派技能战火雄魂等级2级"
		elseif 名称=="九黎战歌符石" then
		效果说明 = "增加门派技能九黎战歌等级2级"
		elseif 名称=="燃铁飞花符石" then
		效果说明 = "增加门派技能燃铁飞花等级2级"
		print("2级")
		elseif 名称=="风行九黎符石" then
		效果说明 = "增加门派技能风行九黎等级2级"
		elseif 名称=="魔神降世符石" then
		效果说明 = "增加门派技能魔神降世等级2级"
		elseif 名称=="兵铸乾坤符石" then
		效果说明 = "增加门派技能兵铸乾坤等级2级"
		elseif 名称=="魂枫战舞符石" then
		效果说明 = "增加门派技能魂枫战舞等级2级"

		end
	elseif level == 3 then
		if 名称 == "真元护体" then
			效果说明 = "减伤受到所有伤害降低5%"
		elseif 名称 == "风卷残云" then
			效果说明 = "击倒鬼魂目标时\n#X有15%几率将其打飞出场"
		elseif 名称 == "降妖伏魔" then
			效果说明 = "增加对鬼魂系目标伤害增加15%"
		elseif 名称 == "万丈霞光" then
			效果说明 = "增加8点恢复气血效果"
		elseif 名称 == "无所畏惧" then
			效果说明 = "五行克制抵御能力+3%\n#X该组合没有效果"
		elseif 名称 == "回眸一笑" then
			效果说明 = "五行克制能力+3%\n#X该组合没有效果"
		elseif 名称 == "柳暗花明" then
			效果说明 = "中毒时降低20%的气血及魔法损失\n#X该组合没有效果"
		elseif 名称 == "飞檐走壁" then
			效果说明 = "释放法术时降低12%的MP消耗\n#X该组合没有效果"
		elseif 名称 == "雪照云光" then
			效果说明 = "增加6级追捕技巧\n#X该组合没有效果"
		elseif 名称 == "心灵手巧" then
			效果说明 = "增加10%捕获召唤兽宝宝的几率\n#X该组合没有效果"
		elseif 名称 == "点石成金" then
			效果说明 = "遭受物理攻击有5%几率\n#X伤害降低25%"
		elseif 名称 == "百步穿杨" then
			效果说明 = "物理类攻击目标时有一定几率额外\n#X造成75点伤害"
		elseif 名称 == "隔山打牛" then
			效果说明 = "法术攻击时有一定几率对目标\n#X加成50法术伤害"
		elseif 名称 == "心随我动" then
			效果说明 = "遭受物理类攻击时有一定几率\n#X抵挡70点伤害"
		elseif 名称 == "云随风舞" then
			效果说明 = "遭受法术攻击时有一定几率\n#X抵挡70点伤害"
		elseif 名称 == "天降大任" then
			效果说明 = "无视召唤兽10%的物理防御进行攻击。(该组合全身只有一件装备起效)"
		elseif 名称 == "高山流水" then
			效果说明 = "对召唤兽增加人物等级/2+30的法术伤害。(该组合全身只有一件装备起效)"
		elseif 名称 == "百无禁忌" then
			效果说明 = "提高自身8%对抗封印类技能的能力"
		elseif 名称 == "为官之道符石" then
			效果说明 = "增加门派技能为官之道等级4级"
		elseif 名称 == "黄庭经符石" then
			效果说明 = "增加门派技能黄庭经等级4级"
		elseif 名称 == "小乘佛法符石" then
			效果说明 = "增加门派技能小乘佛法等级4级"
		elseif 名称 == "毒经符石" then
			效果说明 = "增加门派技能毒经等级4级"
		elseif 名称 == "天罡气符石" then
			效果说明 = "增加门派技能天罡气等级4级"
		elseif 名称 == "九龙诀符石" then
			效果说明 = "增加门派技能九龙诀等级4级"
		elseif 名称 == "周易学符石" then
			效果说明 = "增加门派技能周易学等级4级"
		elseif 名称 == "灵性符石" then
			效果说明 = "增加门派技能灵性等级4级"
		elseif 名称 == "灵通术符石" then
			效果说明 = "增加门派技能灵通术等级4级"
		elseif 名称 == "牛逼神功符石" then
			效果说明 = "增加门派技能牛逼神功等级4级"
		elseif 名称 == "魔兽神功符石" then
			效果说明 = "增加门派技能魔兽神功等级4级"
		elseif 名称 == "蛛丝阵法符石" then
			效果说明 = "增加门派技能蛛丝阵法等级4级"
			-- elseif 名称=="天火献誓符石" then
			--   效果说明 = "增加门派技能天火献誓等级4级"
		elseif 名称 == "燃灯灵宝符石" then
			效果说明 = "增加门派技能燃灯灵宝等级4级"
			-- elseif 名称=="神工无形符石" then
			--   效果说明 = "增加门派技能神工无形等级4级"
		elseif 名称 == "巫咒符石" then
			效果说明 = "增加门派技能巫咒等级4级"
		elseif 名称 == "文韬武略符石" then
			效果说明 = "增加门派技能文韬武略等级4级"
		elseif 名称 == "归元心法符石" then
			效果说明 = "增加门派技能归元心法等级4级"
		elseif 名称 == "佛光普照符石" then
			效果说明 = "增加门派技能佛光普照等级4级"
		elseif 名称 == "倾国倾城符石" then
			效果说明 = "增加门派技能倾国倾城等级4级"
		elseif 名称 == "傲世诀符石" then
			效果说明 = "增加门派技能傲世诀等级4级"
		elseif 名称 == "逆鳞符石" then
			效果说明 = "增加门派技能逆鳞等级4级"
		elseif 名称 == "明性修身符石" then
			效果说明 = "增加门派技能明性修身等级4级"
		elseif 名称 == "五行扭转符石" then
			效果说明 = "增加门派技能五行扭转等级4级"
		elseif 名称 == "拘魂诀符石" then
			效果说明 = "增加门派技能拘魂诀等级4级"
		elseif 名称 == "回身击符石" then
			效果说明 = "增加门派技能回身击等级4级"
		elseif 名称 == "魔兽反噬符石" then
			效果说明 = "增加门派技能魔兽反噬等级4级"
		elseif 名称 == "盘丝大法符石" then
			效果说明 = "增加门派技能盘丝大法等级4级"
			-- elseif 名称=="藻光灵狱符石" then
			--   效果说明 = "增加门派技能藻光灵狱等级4级"
		elseif 名称 == "地冥妙法符石" then
			效果说明 = "增加门派技能地冥妙法等级4级"
			-- elseif 名称=="千机奇巧符石" then
			--   效果说明 = "增加门派技能千机奇巧等级4级"
		elseif 名称 == "万物轮转符石" then
			效果说明 = "增加门派技能万物轮转等级4级"
		elseif 名称 == "十方无敌符石" then
			效果说明 = "增加门派技能十方无敌等级4级"
		elseif 名称 == "符之术符石" then
			效果说明 = "增加门派技能符之术等级4级"
		elseif 名称 == "歧黄之术符石" then
			效果说明 = "增加门派技能歧黄之术等级4级"
		elseif 名称 == "闭月羞花符石" then
			效果说明 = "增加门派技能闭月羞花等级4级"
		elseif 名称 == "乾坤塔符石" then
			效果说明 = "增加门派技能乾坤塔等级4级"
		elseif 名称 == "呼风唤雨符石" then
			效果说明 = "增加门派技能呼风唤雨等级4级"
		elseif 名称 == "乾坤袖符石" then
			效果说明 = "增加门派技能乾坤袖等级4级"
		elseif 名称 == "金刚经符石" then
			效果说明 = "增加门派技能金刚经等级4级"
		elseif 名称 == "幽冥术符石" then
			效果说明 = "增加门派技能幽冥术等级4级"
		elseif 名称 == "火牛阵符石" then
			效果说明 = "增加门派技能火牛阵等级4级"
		elseif 名称 == "生死搏符石" then
			效果说明 = "增加门派技能生死搏等级4级"
		elseif 名称 == "催情大法符石" then
			效果说明 = "增加门派技能催情大法等级4级"
		elseif 名称 == "煌火无明符石" then
			效果说明 = "增加门派技能煌火无明等级4级"
		elseif 名称 == "阴风绝章符石" then
			效果说明 = "增加门派技能阴风绝章等级4级"
		elseif 名称 == "瞬息万变符石" then
			效果说明 = "增加门派技能瞬息万变等级4级"
		elseif 名称 == "匠心不移符石" then
			效果说明 = "增加门派技能匠心不移等级4级"
		elseif 名称 == "神兵鉴赏符石" then
			效果说明 = "增加门派技能神兵鉴赏等级4级"
		elseif 名称 == "霹雳咒符石" then
			效果说明 = "增加门派技能霹雳咒等级4级"
		elseif 名称 == "诵经符石" then
			效果说明 = "增加门派技能诵经等级4级"
		elseif 名称 == "沉鱼落雁符石" then
			效果说明 = "增加门派技能沉鱼落雁等级4级"
		elseif 名称 == "宁气诀符石" then
			效果说明 = "增加门派技能宁气诀等级4级"
		elseif 名称 == "破浪诀符石" then
			效果说明 = "增加门派技能破浪诀等级4级"
		elseif 名称 == "潇湘仙雨符石" then
			效果说明 = "增加门派技能潇湘仙雨等级4级"
		elseif 名称 == "五行学说符石" then
			效果说明 = "增加门派技能五行学说等级4级"
		elseif 名称 == "尸腐恶符石" then
			效果说明 = "增加门派技能尸腐恶等级4级"
		elseif 名称 == "牛虱阵符石" then
			效果说明 = "增加门派技能牛虱阵等级4级"
		elseif 名称 == "阴阳二气诀符石" then
			效果说明 = "增加门派技能阴阳二气诀等级4级"
		elseif 名称 == "姊妹相随符石" then
			效果说明 = "增加门派技能姊妹相随等级4级"
		elseif 名称 == "无双一击符石" then
			效果说明 = "增加门派技能无双一击等级4级"
		elseif 名称 == "磐龙灭法符石" then
			效果说明 = "增加门派技能磐龙灭法等级4级"
		elseif 名称 == "金刚伏魔符石" then
			效果说明 = "增加门派技能金刚伏魔等级4级"
		elseif 名称 == "玉质冰肌符石" then
			效果说明 = "增加门派技能玉质冰肌等级4级"
		elseif 名称 == "混天术符石" then
			效果说明 = "增加门派技能混天术等级4级"
		elseif 名称 == "龙附符石" then
			效果说明 = "增加门派技能龙附等级4级"
		elseif 名称 == "修仙术符石" then
			效果说明 = "增加门派技能修仙术等级4级"
		elseif 名称 == "护法金刚符石" then
			效果说明 = "增加门派技能护法金刚等级4级"
		elseif 名称 == "六道轮回符石" then
			效果说明 = "增加门派技能六道轮回等级4级"
		elseif 名称 == "震天诀符石" then
			效果说明 = "增加门派技能震天诀等级4级"
		elseif 名称 == "狂兽诀符石" then
			效果说明 = "增加门派技能狂兽诀等级4级"
		elseif 名称 == "秋波暗送符石" then
			效果说明 = "增加门派技能秋波暗送等级4级"
		elseif 名称 == "化神以灵符石" then
			效果说明 = "增加门派技能化神以灵等级4级"
		elseif 名称 == "弹指成烬符石" then
			效果说明 = "增加门派技能弹指成烬等级4级"
		elseif 名称 == "攻玉以石符石" then
			效果说明 = "增加门派技能攻玉以石等级4级"
		elseif 名称 == "擎天之械符石" then
			效果说明 = "增加门派技能擎天之械等级4级"
		elseif 名称 == "混元神功符石" then
			效果说明 = "增加门派技能混元神功等级4级"
		elseif 名称 == "秘影迷踪符石" then
			效果说明 = "增加门派技能秘影迷踪等级4级"
		elseif 名称 == "神木恩泽符石" then
			效果说明 = "增加门派技能神木恩泽等级4级"
		elseif 名称 == "紫薇之术符石" then
			效果说明 = "增加门派技能紫薇之术等级4级"
		elseif 名称 == "神道无念符石" then
			效果说明 = "增加门派技能神道无念等级4级"
		elseif 名称 == "大慈大悲符石" then
			效果说明 = "增加门派技能大慈大悲等级4级"
		elseif 名称 == "香飘兰麝符石" then
			效果说明 = "增加门派技能香飘兰麝等级4级"
		elseif 名称 == "清明自在符石" then
			效果说明 = "增加门派技能清明自在等级4级"
		elseif 名称 == "龙腾符石" then
			效果说明 = "增加门派技能龙腾等级4级"
		elseif 名称 == "混元道果符石" then
			效果说明 = "增加门派技能混元道果等级4级"
		elseif 名称 == "观音咒符石" then
			效果说明 = "增加门派技能观音咒等级4级"
		elseif 名称 == "九幽阴魂符石" then
			效果说明 = "增加门派技能九幽阴魂等级4级"
		elseif 名称 == "火云术符石" then
			效果说明 = "增加门派技能火云术等级4级"
		elseif 名称 == "训兽诀符石" then
			效果说明 = "增加门派技能训兽诀等级4级"
		elseif 名称 == "天外魔音符石" then
			效果说明 = "增加门派技能天外魔音等级4级"
		elseif 名称 == "天罚之焰符石" then
			效果说明 = "增加门派技能天罚之焰等级4级"
		elseif 名称 == "万灵诸念符石" then
			效果说明 = "增加门派技能万灵诸念等级4级"
		elseif 名称 == "探奥索隐符石" then
			效果说明 = "增加门派技能探奥索隐等级4级"
		elseif 名称 == "枯骨心法符石" then
			效果说明 = "增加门派技能枯骨心法等级4级"
		elseif 名称 == "疾风步符石" then
			效果说明 = "增加门派技能疾风步等级4级"
		elseif 名称 == "斜月步符石" then
			效果说明 = "增加门派技能斜月步等级4级"
		elseif 名称 == "渡世步符石" then
			效果说明 = "增加门派技能渡世步等级4级"
		elseif 名称 == "清歌妙舞符石" then
			效果说明 = "增加门派技能清歌妙舞等级4级"
		elseif 名称 == "云霄步符石" then
			效果说明 = "增加门派技能云霄步等级4级"
		elseif 名称 == "游龙术符石" then
			效果说明 = "增加门派技能游龙术等级4级"
		elseif 名称 == "七星遁符石" then
			效果说明 = "增加门派技能七星遁等级4级"
		elseif 名称 == "莲花宝座符石" then
			效果说明 = "增加门派技能莲花宝座等级4级"
		elseif 名称 == "无常步符石" then
			效果说明 = "增加门派技能无常步等级4级"
		elseif 名称 == "裂石步符石" then
			效果说明 = "增加门派技能裂石步等级4级"
		elseif 名称 == "大鹏展翅符石" then
			效果说明 = "增加门派技能大鹏展翅等级4级"
		elseif 名称 == "盘丝步符石" then
			效果说明 = "增加门派技能盘丝步等级4级"
		elseif 名称 == "离魂符石" then
			效果说明 = "增加门派技能离魂等级4级"
		elseif 名称 == "驭灵咒符石" then
			效果说明 = "增加门派技能驭灵咒等级4级"
		elseif 名称 == "运思如电符石" then
			效果说明 = "增加门派技能运思如电等级4级"
		elseif 名称 == "鬼蛊灵蕴符石" then
			效果说明 = "增加门派技能鬼蛊灵蕴等级4级"
		elseif 名称 == "天地无极符石" then
			效果说明 = "增加门派技能天地无极等级4级"
		elseif 名称 == "啸嗷符石" then
			效果说明 = "增加门派技能啸嗷等级4级"
		elseif 名称 == "法天象地符石" then
			效果说明 = "增加门派技能法天象地等级4级"
		elseif 名称 == "武神显圣符石" then
			效果说明 = "增加门派技能武神显圣等级4级"
		elseif 名称 == "诛魔符石" then
			效果说明 = "增加门派技能诛魔等级4级"
		elseif 名称 == "九转玄功符石" then
			效果说明 = "增加门派技能九转玄功等级4级"
		elseif 名称 == "网罗乾坤" then
			效果说明 = "使用天罗地网时\n#X增加人物等级*2的伤害"
		elseif 名称 == "石破天惊" then
			效果说明 = "使用落雷符时\n#X增加人物等级*1的伤害"
		elseif 名称 == "天雷地火" then
			效果说明 = "使用天雷斩、雷霆万钧时\n#X增加人物等级*1的伤害"
		elseif 名称 == "凤舞九天" then
			效果说明 = "使用雨落寒沙时\n#X增加人物等级*2的伤害"
		elseif 名称 == "烟雨飘摇" then
			效果说明 = "使用烟雨剑法、飘渺式时\n#X增加人物等级*1的伤害"
		elseif 名称 == "索命无常" then
			效果说明 = "使用阎罗令时\n#X增加人物等级*2的伤害"
		elseif 名称 == "行云流水" then
			效果说明 = "使用五行法术时\n#X增加人物等级*2的伤害"
		elseif 名称 == "福泽天下" then
			效果说明 = "使用唧唧歪歪时\n#X增加人物等级*1的伤害"
			-- elseif 名称=="势如破竹" then
			--   效果说明 = "与NPC战斗时，使用破击，增加人物等级*50%的固定伤害能力"
		elseif 名称 == "销魂噬骨" then
			效果说明 = "使用夺命咒或追魂刺\n#X增加人物等级*2的伤害"
		elseif 名称 == "无心插柳" then
			效果说明 = "你的溅射伤害加成提高25%\n#X从而获得溅射效果"
		elseif 名称=="灵猴九窍符石" then
      效果说明 = "增加门派技能灵猴九窍等级4级"
    elseif 名称=="金刚之躯符石" then
      效果说明 = "增加门派技能金刚之躯等级4级"
    elseif 名称=="七十二变符石" then
      效果说明 = "增加门派技能七十二变等级4级"
    elseif 名称=="神通广大符石" then
      效果说明 = "增加门派技能神通广大等级4级"
    elseif 名称=="如意金箍符石" then
      效果说明 = "增加门派技能如意金箍等级4级"
    elseif 名称=="齐天逞胜符石" then
      效果说明 = "增加门派技能齐天逞胜等级4级"
    elseif 名称=="腾云驾雾符石" then
      效果说明 = "增加门派技能腾云驾雾等级4级"

			        --九黎
			elseif 名称=="战火雄魂符石" then
			效果说明 = "增加门派技能战火雄魂等级4级"
			elseif 名称=="九黎战歌符石" then
			效果说明 = "增加门派技能九黎战歌等级4级"
			elseif 名称=="燃铁飞花符石" then
			效果说明 = "增加门派技能燃铁飞花等级4级"
			elseif 名称=="风行九黎符石" then
			效果说明 = "增加门派技能风行九黎等级4级"
			elseif 名称=="魔神降世符石" then
			效果说明 = "增加门派技能魔神降世等级4级"
			elseif 名称=="兵铸乾坤符石" then
			效果说明 = "增加门派技能兵铸乾坤等级4级"
			elseif 名称=="魂枫战舞符石" then
			效果说明 = "增加门派技能魂枫战舞等级4级"

		end
	elseif level == 4 then
		if 名称 == "风卷残云" then
			效果说明 = "击倒鬼魂目标时\n#X有20%几率将其打飞出场"
		elseif 名称 == "万丈霞光" then
			效果说明 = "增加10点恢复气血效果"
		elseif 名称 == "无所畏惧" then
			效果说明 = "五行克制抵御能力+4%\n#X该组合没有效果"
		elseif 名称 == "回眸一笑" then
			效果说明 = "五行克制能力+4%\n#X该组合没有效果"
		elseif 名称 == "柳暗花明" then
			效果说明 = "中毒时降低25%的气血及魔法损失\n#X该组合没有效果"
		elseif 名称 == "飞檐走壁" then
			效果说明 = "释放法术时降低16%的MP消耗\n#X该组合没有效果"
		elseif 名称 == "点石成金" then
			效果说明 = "遭受物理攻击有5%几率\n#X伤害降低25%"
		elseif 名称 == "百步穿杨" then
			效果说明 = "物理类攻击目标时有一定几率额外\n#X造成100点伤害"
		elseif 名称 == "隔山打牛" then
			效果说明 = "法术攻击时有一定几率对目标\n#X加成70法术伤害"
		elseif 名称 == "心随我动" then
			效果说明 = "遭受物理类攻击时有一定几率\n#X抵挡90点伤害"
		elseif 名称 == "云随风舞" then
			效果说明 = "遭受法术攻击时有一定几率\n#X抵挡70点伤害"
		elseif 名称 == "暗渡陈仓" then
			效果说明 = "受到物理攻击时，降低3%的所受伤害"
		elseif 名称 == "化敌为友" then
			效果说明 = "受到法术攻击时，降低3%的所受伤害"
		elseif 名称 == "天降大任" then
			效果说明 = "无视召唤兽15%的物理防御进行攻击。(该组合全身只有一件装备起效)"
		elseif 名称 == "高山流水" then
			效果说明 = "对召唤兽增加人物等级+30的法术伤害。(该组合全身只有一件装备起效)"
		elseif 名称 == "百无禁忌" then
			效果说明 = "提高自身12%对抗封印类技能的能力"
		elseif 名称 == "为官之道符石" then
			效果说明 = "增加门派技能为官之道等级6级"
		elseif 名称 == "黄庭经符石" then
			效果说明 = "增加门派技能黄庭经等级6级"
		elseif 名称 == "小乘佛法符石" then
			效果说明 = "增加门派技能小乘佛法等级6级"
		elseif 名称 == "毒经符石" then
			效果说明 = "增加门派技能毒经等级6级"
		elseif 名称 == "天罡气符石" then
			效果说明 = "增加门派技能天罡气等级6级"
		elseif 名称 == "九龙诀符石" then
			效果说明 = "增加门派技能九龙诀等级6级"
		elseif 名称 == "周易学符石" then
			效果说明 = "增加门派技能周易学等级6级"
		elseif 名称 == "灵性符石" then
			效果说明 = "增加门派技能灵性等级6级"
		elseif 名称 == "灵通术符石" then
			效果说明 = "增加门派技能灵通术等级6级"
		elseif 名称 == "牛逼神功符石" then
			效果说明 = "增加门派技能牛逼神功等级6级"
		elseif 名称 == "魔兽神功符石" then
			效果说明 = "增加门派技能魔兽神功等级6级"
		elseif 名称 == "蛛丝阵法符石" then
			效果说明 = "增加门派技能蛛丝阵法等级6级"
			-- elseif 名称=="天火献誓符石" then
			--   效果说明 = "增加门派技能天火献誓等级6级"
		elseif 名称 == "燃灯灵宝符石" then
			效果说明 = "增加门派技能燃灯灵宝等级6级"
			-- elseif 名称=="神工无形符石" then
			--   效果说明 = "增加门派技能神工无形等级6级"
		elseif 名称 == "巫咒符石" then
			效果说明 = "增加门派技能巫咒等级6级"
		elseif 名称 == "文韬武略符石" then
			效果说明 = "增加门派技能文韬武略等级6级"
		elseif 名称 == "归元心法符石" then
			效果说明 = "增加门派技能归元心法等级6级"
		elseif 名称 == "佛光普照符石" then
			效果说明 = "增加门派技能佛光普照等级6级"
		elseif 名称 == "倾国倾城符石" then
			效果说明 = "增加门派技能倾国倾城等级6级"
		elseif 名称 == "傲世诀符石" then
			效果说明 = "增加门派技能傲世诀等级6级"
		elseif 名称 == "逆鳞符石" then
			效果说明 = "增加门派技能逆鳞等级6级"
		elseif 名称 == "明性修身符石" then
			效果说明 = "增加门派技能明性修身等级6级"
		elseif 名称 == "五行扭转符石" then
			效果说明 = "增加门派技能五行扭转等级6级"
		elseif 名称 == "拘魂诀符石" then
			效果说明 = "增加门派技能拘魂诀等级6级"
		elseif 名称 == "回身击符石" then
			效果说明 = "增加门派技能回身击等级6级"
		elseif 名称 == "魔兽反噬符石" then
			效果说明 = "增加门派技能魔兽反噬等级6级"
		elseif 名称 == "盘丝大法符石" then
			效果说明 = "增加门派技能盘丝大法等级6级"
			-- elseif 名称=="藻光灵狱符石" then
			--   效果说明 = "增加门派技能藻光灵狱等级6级"
		elseif 名称 == "地冥妙法符石" then
			效果说明 = "增加门派技能地冥妙法等级6级"
			-- elseif 名称=="千机奇巧符石" then
			--   效果说明 = "增加门派技能千机奇巧等级6级"
		elseif 名称 == "万物轮转符石" then
			效果说明 = "增加门派技能万物轮转等级6级"
		elseif 名称 == "十方无敌符石" then
			效果说明 = "增加门派技能十方无敌等级6级"
		elseif 名称 == "符之术符石" then
			效果说明 = "增加门派技能符之术等级6级"
		elseif 名称 == "歧黄之术符石" then
			效果说明 = "增加门派技能歧黄之术等级6级"
		elseif 名称 == "闭月羞花符石" then
			效果说明 = "增加门派技能闭月羞花等级6级"
		elseif 名称 == "乾坤塔符石" then
			效果说明 = "增加门派技能乾坤塔等级6级"
		elseif 名称 == "呼风唤雨符石" then
			效果说明 = "增加门派技能呼风唤雨等级6级"
		elseif 名称 == "乾坤袖符石" then
			效果说明 = "增加门派技能乾坤袖等级6级"
		elseif 名称 == "金刚经符石" then
			效果说明 = "增加门派技能金刚经等级6级"
		elseif 名称 == "幽冥术符石" then
			效果说明 = "增加门派技能幽冥术等级6级"
		elseif 名称 == "火牛阵符石" then
			效果说明 = "增加门派技能火牛阵等级6级"
		elseif 名称 == "生死搏符石" then
			效果说明 = "增加门派技能生死搏等级6级"
		elseif 名称 == "催情大法符石" then
			效果说明 = "增加门派技能催情大法等级6级"
		elseif 名称 == "煌火无明符石" then
			效果说明 = "增加门派技能煌火无明等级6级"
		elseif 名称 == "阴风绝章符石" then
			效果说明 = "增加门派技能阴风绝章等级6级"
		elseif 名称 == "瞬息万变符石" then
			效果说明 = "增加门派技能瞬息万变等级6级"
		elseif 名称 == "匠心不移符石" then
			效果说明 = "增加门派技能匠心不移等级6级"
		elseif 名称 == "神兵鉴赏符石" then
			效果说明 = "增加门派技能神兵鉴赏等级6级"
		elseif 名称 == "霹雳咒符石" then
			效果说明 = "增加门派技能霹雳咒等级6级"
		elseif 名称 == "诵经符石" then
			效果说明 = "增加门派技能诵经等级6级"
		elseif 名称 == "沉鱼落雁符石" then
			效果说明 = "增加门派技能沉鱼落雁等级6级"
		elseif 名称 == "宁气诀符石" then
			效果说明 = "增加门派技能宁气诀等级6级"
		elseif 名称 == "破浪诀符石" then
			效果说明 = "增加门派技能破浪诀等级6级"
		elseif 名称 == "潇湘仙雨符石" then
			效果说明 = "增加门派技能潇湘仙雨等级6级"
		elseif 名称 == "五行学说符石" then
			效果说明 = "增加门派技能五行学说等级6级"
		elseif 名称 == "尸腐恶符石" then
			效果说明 = "增加门派技能尸腐恶等级6级"
		elseif 名称 == "牛虱阵符石" then
			效果说明 = "增加门派技能牛虱阵等级6级"
		elseif 名称 == "阴阳二气诀符石" then
			效果说明 = "增加门派技能阴阳二气诀等级6级"
		elseif 名称 == "姊妹相随符石" then
			效果说明 = "增加门派技能姊妹相随等级6级"
		elseif 名称 == "无双一击符石" then
			效果说明 = "增加门派技能无双一击等级6级"
		elseif 名称 == "磐龙灭法符石" then
			效果说明 = "增加门派技能磐龙灭法等级6级"
		elseif 名称 == "金刚伏魔符石" then
			效果说明 = "增加门派技能金刚伏魔等级6级"
		elseif 名称 == "玉质冰肌符石" then
			效果说明 = "增加门派技能玉质冰肌等级6级"
		elseif 名称 == "混天术符石" then
			效果说明 = "增加门派技能混天术等级6级"
		elseif 名称 == "龙附符石" then
			效果说明 = "增加门派技能龙附等级6级"
		elseif 名称 == "修仙术符石" then
			效果说明 = "增加门派技能修仙术等级6级"
		elseif 名称 == "护法金刚符石" then
			效果说明 = "增加门派技能护法金刚等级6级"
		elseif 名称 == "六道轮回符石" then
			效果说明 = "增加门派技能六道轮回等级6级"
		elseif 名称 == "震天诀符石" then
			效果说明 = "增加门派技能震天诀等级6级"
		elseif 名称 == "狂兽诀符石" then
			效果说明 = "增加门派技能狂兽诀等级6级"
		elseif 名称 == "秋波暗送符石" then
			效果说明 = "增加门派技能秋波暗送等级6级"
		elseif 名称 == "化神以灵符石" then
			效果说明 = "增加门派技能化神以灵等级6级"
		elseif 名称 == "弹指成烬符石" then
			效果说明 = "增加门派技能弹指成烬等级6级"
		elseif 名称 == "攻玉以石符石" then
			效果说明 = "增加门派技能攻玉以石等级6级"
		elseif 名称 == "擎天之械符石" then
			效果说明 = "增加门派技能擎天之械等级6级"
		elseif 名称 == "混元神功符石" then
			效果说明 = "增加门派技能混元神功等级6级"
		elseif 名称 == "秘影迷踪符石" then
			效果说明 = "增加门派技能秘影迷踪等级6级"
		elseif 名称 == "神木恩泽符石" then
			效果说明 = "增加门派技能神木恩泽等级6级"
		elseif 名称 == "紫薇之术符石" then
			效果说明 = "增加门派技能紫薇之术等级6级"
		elseif 名称 == "神道无念符石" then
			效果说明 = "增加门派技能神道无念等级6级"
		elseif 名称 == "大慈大悲符石" then
			效果说明 = "增加门派技能大慈大悲等级6级"
		elseif 名称 == "香飘兰麝符石" then
			效果说明 = "增加门派技能香飘兰麝等级6级"
		elseif 名称 == "清明自在符石" then
			效果说明 = "增加门派技能清明自在等级6级"
		elseif 名称 == "龙腾符石" then
			效果说明 = "增加门派技能龙腾等级6级"
		elseif 名称 == "混元道果符石" then
			效果说明 = "增加门派技能混元道果等级6级"
		elseif 名称 == "观音咒符石" then
			效果说明 = "增加门派技能观音咒等级6级"
		elseif 名称 == "九幽阴魂符石" then
			效果说明 = "增加门派技能九幽阴魂等级6级"
		elseif 名称 == "火云术符石" then
			效果说明 = "增加门派技能火云术等级6级"
		elseif 名称 == "训兽诀符石" then
			效果说明 = "增加门派技能训兽诀等级6级"
		elseif 名称 == "天外魔音符石" then
			效果说明 = "增加门派技能天外魔音等级6级"
		elseif 名称 == "天罚之焰符石" then
			效果说明 = "增加门派技能天罚之焰等级6级"
		elseif 名称 == "万灵诸念符石" then
			效果说明 = "增加门派技能万灵诸念等级6级"
		elseif 名称 == "探奥索隐符石" then
			效果说明 = "增加门派技能探奥索隐等级6级"
		elseif 名称 == "枯骨心法符石" then
			效果说明 = "增加门派技能枯骨心法等级6级"
		elseif 名称 == "疾风步符石" then
			效果说明 = "增加门派技能疾风步等级6级"
		elseif 名称 == "斜月步符石" then
			效果说明 = "增加门派技能斜月步等级6级"
		elseif 名称 == "渡世步符石" then
			效果说明 = "增加门派技能渡世步等级6级"
		elseif 名称 == "清歌妙舞符石" then
			效果说明 = "增加门派技能清歌妙舞等级6级"
		elseif 名称 == "云霄步符石" then
			效果说明 = "增加门派技能云霄步等级6级"
		elseif 名称 == "游龙术符石" then
			效果说明 = "增加门派技能游龙术等级6级"
		elseif 名称 == "七星遁符石" then
			效果说明 = "增加门派技能七星遁等级6级"
		elseif 名称 == "莲花宝座符石" then
			效果说明 = "增加门派技能莲花宝座等级6级"
		elseif 名称 == "无常步符石" then
			效果说明 = "增加门派技能无常步等级6级"
		elseif 名称 == "裂石步符石" then
			效果说明 = "增加门派技能裂石步等级6级"
		elseif 名称 == "大鹏展翅符石" then
			效果说明 = "增加门派技能大鹏展翅等级6级"
		elseif 名称 == "盘丝步符石" then
			效果说明 = "增加门派技能盘丝步等级6级"
		elseif 名称 == "离魂符石" then
			效果说明 = "增加门派技能离魂等级6级"
		elseif 名称 == "驭灵咒符石" then
			效果说明 = "增加门派技能驭灵咒等级6级"
		elseif 名称 == "运思如电符石" then
			效果说明 = "增加门派技能运思如电等级6级"
		elseif 名称 == "鬼蛊灵蕴符石" then
			效果说明 = "增加门派技能鬼蛊灵蕴等级6级"
		elseif 名称 == "天地无极符石" then
			效果说明 = "增加门派技能天地无极等级6级"
		elseif 名称 == "啸嗷符石" then
			效果说明 = "增加门派技能啸嗷等级6级"
		elseif 名称 == "法天象地符石" then
			效果说明 = "增加门派技能法天象地等级6级"
		elseif 名称 == "武神显圣符石" then
			效果说明 = "增加门派技能武神显圣等级6级"
		elseif 名称 == "诛魔符石" then
			效果说明 = "增加门派技能诛魔等级6级"
		elseif 名称 == "九转玄功符石" then
			效果说明 = "增加门派技能九转玄功等级6级"

		 elseif 名称=="灵猴九窍符石" then
      效果说明 = "增加门派技能灵猴九窍等级6级"
    elseif 名称=="金刚之躯符石" then
      效果说明 = "增加门派技能金刚之躯等级6级"
    elseif 名称=="七十二变符石" then
      效果说明 = "增加门派技能七十二变等级6级"
    elseif 名称=="神通广大符石" then
      效果说明 = "增加门派技能神通广大等级6级"
    elseif 名称=="如意金箍符石" then
      效果说明 = "增加门派技能如意金箍等级6级"
    elseif 名称=="齐天逞胜符石" then
      效果说明 = "增加门派技能齐天逞胜等级6级"
    elseif 名称=="腾云驾雾符石" then
      效果说明 = "增加门派技能腾云驾雾等级6级"


		 --九黎
    elseif 名称=="战火雄魂符石" then
      效果说明 = "增加门派技能战火雄魂等级6级"
    elseif 名称=="九黎战歌符石" then
      效果说明 = "增加门派技能九黎战歌等级6级"
    elseif 名称=="燃铁飞花符石" then
      效果说明 = "增加门派技能燃铁飞花等级6级"
    elseif 名称=="风行九黎符石" then
      效果说明 = "增加门派技能风行九黎等级6级"
    elseif 名称=="魔神降世符石" then
      效果说明 = "增加门派技能魔神降世等级6级"
    elseif 名称=="兵铸乾坤符石" then
      效果说明 = "增加门派技能兵铸乾坤等级6级"
    elseif 名称=="魂枫战舞符石" then
      效果说明 = "增加门派技能魂枫战舞等级6级"

		end
	end
	return 效果说明
end

function 取符石部位(部位)
	if 部位 == 1 then
		return "头盔/发钗"
	elseif 部位 == 2 then
		return "项链"
	elseif 部位 == 3 then
		return "武器"
	elseif 部位 == 4 then
		return "铠甲/女衣"
	elseif 部位 == 5 then
		return "腰带"
	elseif 部位 == 6 then
		return "靴"
	else
		return "无"
	end
end
function __道具提示(item, 文本)
	-- table.print(item)
	if item == nil then
		return
	end
	local 资质道具={特殊元宵_攻={资质="攻击资质",加成=2,上限=2200},特殊元宵_防={资质="防御资质",加成=2,上限=2200},特殊元宵_速={资质="速度资质",加成=2,上限=2200}
	,特殊元宵_躲={资质="躲闪资质",加成=2,上限=2200},特殊元宵_体={资质="体力资质",加成=2,上限=2200},特殊元宵_法={资质="法力资质",加成=2,上限=2200},特殊元宵_成长={资质="成长",加成=2,上限=3}}

	-- if item.子类型 == "银两商城" then
	-- 	文本:置文本("#Y银子")
	-- else
	-- 	if item.升星 then  
	-- 		文本:置文本("#Y" .. item.名称.." +"..item.升星)	
	-- 	else 	
	-- 	文本:置文本("#Y" .. item.名称)
	-- 	end
	-- end
	-- 文本:置文本("")
	文本:置文本(item.介绍 or "")
	local zls = item.总类
	--print(item.总类,item.子类,item.分类)
	if zls == 1 then
		local gs = ""
		local qgx = 取物品功效(item.名称, item.阶品)
		if item.名称 == "炫彩ID" then
			if item.特效 then
				文本:置文本("#Y/【特效】#G/%s",item.特效)
			else
				文本:置文本("#Y/【特效】#G/%s","随机")
			end
		end
		if item.分类 ~= 10 and item.分类 ~= 11 then
			if item.子类 == 1 and item.分类 == 4 then
				if item.名称 == "包子" then
					文本:置文本("【功效】恢复气血100点")
				elseif item.名称 == "女儿红" then
					文本:置文本("【功效】恢复愤怒值=20")
					文本:置文本("附加昏睡状态")
				elseif item.名称 == "臭豆腐" then
					文本:置文本("【功效】")
					文本:置文本("恢复气血=品质*20+200")
					文本:置文本("#Y品质 " .. item.阶品)
				elseif item.名称 == "烤鸭" then
					文本:置文本("【功效】")
					文本:置文本("恢复气血=品质*10+100")
					文本:置文本("#Y品质 " .. item.阶品)
				elseif item.名称 == "烤肉" then
					文本:置文本("【功效】")
					文本:置文本("恢复气血=品质*10")
					文本:置文本("#Y品质 " .. item.阶品)
				elseif item.名称 == "佛跳墙" then
					文本:置文本("【功效】")
					文本:置文本("恢复魔法=品质*10+100")
					文本:置文本("#Y品质 " .. item.阶品)
				elseif item.名称 == "桂花丸" then
					文本:置文本("【功效】")
					文本:置文本("恢复召唤兽寿命=品质*0.5")
					文本:置文本("#Y品质 " .. item.阶品)
				elseif item.名称 == "豆斋果" then
					文本:置文本("【功效】")
					文本:置文本("恢复召唤兽寿命=品质*3")
					文本:置文本("但有3%几率出现食物中毒而减少某些资质。")
					文本:置文本("#Y品质 " .. item.阶品)
				elseif item.名称 == "长寿面" then
					文本:置文本("【功效】")
					文本:置文本("恢复召唤兽寿命=品质*2+50")
					文本:置文本("但有3%几率出现食物中毒而减少某些资质。")
					文本:置文本("#Y品质 " .. item.阶品)
				elseif item.名称 == "翡翠豆腐" then
					文本:置文本("【功效】")
					文本:置文本("恢复气血=品质*15+150")
					文本:置文本("魔法=品质*10+100")
					文本:置文本("#Y品质 " .. item.阶品)
				elseif item.名称 == "珍露酒" then
					文本:置文本("【功效】")
					文本:置文本("恢复愤怒值=品质*0.4+10")
					文本:置文本("#Y品质 " .. item.阶品)
				elseif item.名称 == "梅花酒" then
					文本:置文本("【功效】")
					文本:置文本("恢复愤怒值=品质*0.6")
					文本:置文本("昏睡2~3回合")
					文本:置文本("#Y品质 " .. item.阶品)
				elseif item.名称 == "百味酒" then
					文本:置文本("【功效】")
					文本:置文本("恢复愤怒值=品质*0.7")
					文本:置文本("昏睡2~3回合或附加中毒状态")
					文本:置文本("#Y品质 " .. item.阶品)
				elseif item.名称 == "蛇胆酒" then
					文本:置文本("【功效】")
					文本:置文本("恢复愤怒值=品质*1")
					文本:置文本("减少防御=品质*1.5")
					文本:置文本("#Y品质 " .. item.阶品)
				elseif item.名称 == "醉生梦死" then
					文本:置文本("【功效】")
					文本:置文本("恢复愤怒值=品质*1")
					文本:置文本("附加疯狂状态3~4回合")
					文本:置文本("#Y品质 " .. item.阶品)
				elseif item.名称 == "虎骨酒" then
					文本:置文本("【功效】")
					文本:置文本("恢复愤怒值=20")
					文本:置文本("附加疯狂状态")
					文本:置文本("#Y品质 " .. item.阶品)
				elseif item.名称 == "红罗羹" then
					文本:置文本("【功效】储有品质*200+15000的气血，每次食用后根据补量扣除相同的数量,到0止。非战斗中使用。")
					文本:置文本("#Y品质 " .. item.阶品)
				elseif item.名称 == "绿芦羹" then
					文本:置文本("【功效】储有品质*70+5000的魔法，每次食用后根据补量扣除相同的数量,到0止。非战斗中使用。")
					文本:置文本("#Y品质 " .. item.阶品)
				elseif item.名称 == "玉露羹" then
					文本:置文本("【功效】")
					文本:置文本("恢复气血=品质*20")
					文本:置文本("恢复气血上限=品质*10")
					文本:置文本("恢复魔法=品质*15")
					文本:置文本("恢复愤怒=品质*0.4")
					文本:置文本("#Y品质 " .. item.阶品)
				elseif item.名称 == "百岁香" then
					文本:置文本("【功效】")
					文本:置文本("恢复品质*2+150的体力和活力每天限用一个")
					文本:置文本("#Y品质 " .. item.阶品)
				elseif item.名称 == "同心肉脯" then
					文本:置文本("【功效】")
					文本:置文本("食用后可以召唤兽的内丹格子+1内丹格子上限6个格子（召唤兽为进阶时不可以使用）")
					文本:置文本("#Y品质 " .. item.阶品)
				elseif item.名称 == "忠义肉脯" then
					文本:置文本("【功效】")
					文本:置文本("上古妖兽死后被割下的肉，召唤兽使用后可随机领悟一个低级技能")
					文本:置文本("#Y品质 " .. item.阶品)
				elseif item.名称 == "神仙饮" then
					文本:置文本("【功效】")
					文本:置文本("使用后可令怪物丢盔卸甲，跳过战斗环节直接获得经验奖励持续场次=（品质*2）（仅限野外挂机生效）")
					文本:置文本("#Y品质 " .. item.阶品)
				elseif item.名称 == "八珍玉液" then
					文本:置文本("【功效】")
					文本:置文本("储有品质*60+3000的气血上限,每次食用后根据补给量扣除相同的数量,到0即止。非战斗中使用。")
					文本:置文本("#Y品质 " .. item.阶品)
				elseif item.名称 == "五味露" then
					文本:置文本("【功效】")
					文本:置文本("为召唤兽增加经验=品质*召唤兽等级*10+10000。每天每只召唤兽限吃1个。")
					文本:置文本("#Y品质 " .. item.阶品)
				elseif item.名称 == "福灵沙" then
					文本:置文本("【功效】")
					文本:置文本("良用后法宝每次获得灵气量增加1点持续时间=(品质0.3+30分钟。")
					文本:置文本("#Y品质 " .. item.阶品)
				elseif item.名称 == "千金露" then
					文本:置文本("【功效】")
					文本:置文本("随机增加召唤兽1点属性每只召唤兽限吃等级/20+1)个")
					文本:置文本("#Y品质 " .. item.阶品)
				elseif item.名称 == "秘制红罗羹" then
					文本:置文本("【功效】储有200000的气血，在每场战斗结束后自动回复人物气血,补满人物魔法时扣除存有的气血量#G(队长拥有即可)")
					文本:置文本("#Y在长安的云来酒店（长安城436,59），酒店老板处兑换不允许交易")
				elseif item.名称 == "秘制绿芦羹" then
					文本:置文本("【功效】储有65000的魔法，在每场战斗结束后自动回复人物魔法,补满人物魔法时扣除存有的魔法量#G(队长拥有即可)")
					文本:置文本("#Y在长安的云来酒店（长安城436,59），酒店老板处兑换不允许交易")
				elseif item.名称 == "秘制八珍玉液" then
					文本:置文本("【功效】储有200000的气血上限，在每场战斗结束后自动回复人物气血上限,补满人物魔法时扣除存有的气血上限量")
					文本:置文本("#Y在长安的云来酒店（长安城436,59），酒店老板处兑换不允许交易")
				elseif item.名称 == "秘制回梦饮" then
					文本:置文本("【功效】储有160点灵气,服用后在副本、抓鬼、神器等任务中可以获得额外经验奖励(约双倍")
					文本:置文本("#Y在长安的云来酒店（长安城436,59），酒店老板处兑换不允许交易")
				elseif item.名称 == "杂烩粥" then
					文本:置文本("【功效】")
					文本:置文本("恢复气血2500点")
					文本:置文本("恢复愤怒10点")
				elseif item.名称 == "红烧鲤鱼" then
					文本:置文本("【功效】")
					文本:置文本("恢复魔法150点")
					文本:置文本("恢复气血1000点")
					文本:置文本("恢复愤怒20点")
					文本:置文本("恢复爆竹充能20%")
				elseif item.名称 == "什锦年糕" then
					文本:置文本("【功效】")
					文本:置文本("恢复魔法330点")
					文本:置文本("恢复气血1100点")
					文本:置文本("恢复愤怒10点")
					文本:置文本("恢复爆竹充能12.5%")
				elseif item.名称 == "油焖对虾" then
					文本:置文本("【功效】")
					elf.道具文本:添加文本("恢复气血2600点")
				elseif item.名称 == "果蔬羹" then
					文本:置文本("【功效】")
					文本:置文本("恢复魔法450点")
					文本:置文本("恢复愤怒10点")
				elseif item.名称 == "白粥" then
					文本:置文本("【功效】")
					文本:置文本("恢复愤怒30点")
				elseif item.名称 == "饺子" then
					文本:置文本("【功效】")
					文本:置文本("恢复气血500点")
					文本:置文本("恢复愤怒10点")
					文本:置文本("恢复爆竹充能10%")
				elseif item.名称 == "果蔬篮" then
					文本:置文本("【功效】")
					文本:置文本("恢复魔法330点")
				elseif item.名称 == "烤肉" then
					文本:置文本("【功效】")
					文本:置文本("恢复气血2200点")
				elseif item.名称 == "药膳粥" then
					文本:置文本("【功效】")
					文本:置文本("恢复愤怒10点")
					文本:置文本("恢复爆竹充能25%")
				elseif item.名称 == "红烧鲫鱼" then
					文本:置文本("【功效】")
					文本:置文本("恢复魔法330点")
					文本:置文本("恢复气血500点")
					文本:置文本("恢复愤怒10点")
				elseif item.名称 == "年糕" then
					文本:置文本("【功效】")
					文本:置文本("恢复魔法150点")
					文本:置文本("恢复愤怒10点")
				elseif item.名称 == "苹果果脯" then
					文本:置文本("【功效】")
					文本:置文本("恢复魔法350点")
				elseif item.名称 == "大乱炖" then
					文本:置文本("【功效】：神器的各种仙家食材制作而成，可食用于非神兽类召唤兽，重置召唤兽种类。")
					--文本:置文本("恢复魔法150点")
					--文本:置文本("恢复气血500点")
					--文本:置文本("恢复愤怒10点")
				end
			end
			if item.名称 == "草果" then
				文本:置文本("【功效】")
				文本:置文本("治疗伤势10点")
				文本:置文本("#Y恢复伤势10, 等级:1")
			elseif item.名称 == "山药" then
				文本:置文本("【功效】")
				文本:置文本("恢复气血40点，治疗伤势10点")
				文本:置文本("#Y恢复气血40，恢复伤势10, 等级:1")
			elseif item.名称 == "九香虫" then
				文本:置文本("【功效】")
				文本:置文本("治疗伤势15点")
				文本:置文本("#Y恢复伤势15, 等级:1")
			elseif item.名称 == "八角莲叶" then
				文本:置文本("【功效】")
				文本:置文本("恢复气血60点，治疗伤势15点")
				文本:置文本("#Y恢复气血60，恢复伤势15, 等级:1")
			elseif item.名称 == "人参" then
				文本:置文本("【功效】")
				文本:置文本("恢复气血80点，治疗伤势20点")
				文本:置文本("#Y恢复气血80，恢复伤势20, 等级:1")
			elseif item.名称 == "四叶花" then
				文本:置文本("【功效】")
				文本:置文本("恢复气血40点")
				文本:置文本("#Y恢复气血40, 等级:1")
			elseif item.名称 == "天青地白" then
				文本:置文本("【功效】")
				文本:置文本("恢复气血80点")
				文本:置文本("#Y恢复气血80, 等级:1")
			elseif item.名称 == "七叶莲" then
				文本:置文本("【功效】")
				文本:置文本("恢复气血60点")
				文本:置文本("#Y恢复气血60, 等级:1")
			elseif item.名称 == "丁香水" or item.名称 == "月星子" then
				文本:置文本("【功效】")
				文本:置文本("恢复魔法75点")
				文本:置文本("#Y恢复魔法75, 等级:2")
			elseif item.名称 == "仙狐涎" or item.名称 == "地狱灵芝" or item.名称 == "麝香" or item.名称 == "血珊瑚" or item.名称 == "餐风饮露" or item.名称 == "白露为霜" then
				文本:置文本("【功效】")
				文本:置文本("恢复魔法100点")
				文本:置文本("#Y恢复魔法100, 等级:2")
			elseif item.名称 == "天龙水" or item.名称 == "孔雀红" then
				文本:置文本("【功效】")
				文本:置文本("恢复魔法150点")
				文本:置文本("#Y恢复魔法150, 等级:2")
			elseif item.名称 == "紫丹罗" or item.名称 == "佛手" or item.名称 == "旋复花" then
				文本:置文本("【功效】")
				文本:置文本("恢复魔法20点")
				文本:置文本("#Y恢复魔法20, 等级:1")
			elseif item.名称 == "龙须草" or item.名称 == "百色花" or item.名称 == "香叶" then
				文本:置文本("【功效】")
				文本:置文本("恢复魔法30点")
				文本:置文本("#Y恢复魔法30, 等级:1")
			elseif item.名称 == "白玉骨头" or item.名称 == "鬼切草" or item.名称 == "灵脂" then
				文本:置文本("【功效】")
				文本:置文本("恢复气魔法40点")
				文本:置文本("#Y恢复魔法40, 等级:1")
			elseif item.名称 == "曼陀罗花" then
				文本:置文本("【功效】")
				文本:置文本("恢复魔法50点")
				文本:置文本("#Y恢复魔法50, 等级:1")
			elseif item.名称 == "天不老" or item.名称 == "紫石英" then
				文本:置文本("【功效】")
				文本:置文本("恢复气血100点")
				文本:置文本("#Y恢复气血100, 等级:2")
			elseif item.名称 == "血色茶花" or item.名称 == "鹿茸" then
				文本:置文本("【功效】")
				文本:置文本("恢复气血150点")
				文本:置文本("#Y恢复气血150, 等级:2")
			elseif item.名称 == "六道轮回" or item.名称 == "熊胆" then
				文本:置文本("【功效】")
				文本:置文本("恢复气血200点")
				文本:置文本("#Y恢复气血200, 等级:2")
			elseif item.名称 == "凤凰尾" or item.名称 == "硫磺草" then
				文本:置文本("【功效】")
				文本:置文本("恢复气血250点")
				文本:置文本("#Y恢复气血250, 等级:2")
			elseif item.名称 == "龙之心屑" or item.名称 == "火凤之睛" then
				文本:置文本("【功效】")
				文本:置文本("恢复气血300点")
				文本:置文本("#Y恢复气血300, 等级:2")
			elseif item.名称 == "金创药" then
				文本:置文本("【功效】")
				文本:置文本("恢复气血400点")
				文本:置文本("#Y恢复气血400,等级：3")
				--文本:置文本("#Y品质 "..item.阶品)
			elseif item.名称 == "金香玉" then
				文本:置文本("【功效】")
				文本:置文本("恢复气血=品质*12+150")
				文本:置文本("#Y品质 " .. item.阶品 .. ",恢复气血=" .. (item.阶品 * 12 + 150) .. ",等级: 3")
			elseif item.名称 == "小还丹" then
				文本:置文本("【功效】")
				文本:置文本("恢复气血=品质*8+100")
				文本:置文本("治疗伤势=品质*90")
				文本:置文本("#Y品质 " .. item.阶品 .. ",恢复气血=" .. (item.阶品 * 8 + 100) .. "  治疗伤势=" .. (item.阶品 + 80) .. ",等级: 3")
			elseif item.名称 == "千年保心丹" then
				文本:置文本("【功效】")
				文本:置文本("恢复气血=品质*4+200")
				文本:置文本("治疗伤势=品质*4+100")
				文本:置文本("#Y品质 " .. item.阶品 .. ",恢复气血=" .. (item.阶品 * 4 + 200) .. "  治疗伤势=" .. (item.阶品 * 4 + 100) ..
					",等级: 3")
			elseif item.名称 == "风水混元丹" then
				文本:置文本("【功效】")
				文本:置文本("恢复魔法=品质*3+50")
				文本:置文本("恢复灵力=品质*0.3")
				文本:置文本("#Y品质 " .. item.阶品 .. ",恢复魔法=" .. (item.阶品 * 3 + 50) .. ",等级: 3")
			elseif item.名称 == "定神香" then
				文本:置文本("【功效】")
				文本:置文本("解除奇经八脉技能产生的异常状态，恢复魔法=品质*5+50")
				文本:置文本("#Y品质 " .. item.阶品 .. ",恢复魔法=" .. (item.阶品 * 5 + 50) .. ",等级: 3")
			elseif item.名称 == "蛇蝎美人" then
				文本:置文本("【功效】")
				文本:置文本("恢复魔法=品质*5+100")
				文本:置文本("#Y品质 " .. item.阶品 .. ",恢复魔法=" .. (item.阶品 * 5 + 100) .. ",等级: 3")
			elseif item.名称 == "九转回魂丹" then
				文本:置文本("【功效】")
				文本:置文本("复活、恢复气血=品质*5+100")
				文本:置文本("#Y品质 " .. item.阶品 .. ",恢复气血=" .. (item.阶品 * 5 + 100) .. ",等级: 3")
			elseif item.名称 == "佛光舍利子" then
				文本:置文本("【功效】")
				文本:置文本("复活、恢复气血=品质*3")
				文本:置文本("#Y品质 " .. item.阶品 .. ",恢复气血=" .. (item.阶品 * 3) .. ",等级: 3")
			elseif item.名称 == "五龙丹" then
				文本:置文本("【功效】")
				文本:置文本("解除封类异常状态")
				文本:置文本("恢复气血=品质*3")
				文本:置文本("#Y品质 " .. item.阶品 .. ",恢复气血=" .. (item.阶品 * 3) .. ",等级: 3")
			elseif item.名称 == "十香返生丸" then
				文本:置文本("【功效】")
				文本:置文本("解除酒类异常状态")
				文本:置文本("恢复魔法=品质*3+50")
				文本:置文本("#Y品质 " .. item.阶品 .. ",恢复魔法=" .. (item.阶品 * 3 + 50) .. ",等级: 3")
			elseif item.名称 == "紫心玉露丸" then
				文本:置文本("【功效】")
				文本:置文本("持续恢复目标当前气血当前回合与下一回合开始时恢复效果为品质*6.5+200")
				文本:置文本("#Y品质 " .. item.阶品 .. ",恢复气血=" .. (item.阶品 * 6.5 + 200) .. ",等级: 3")
			elseif item.名称 == "回春龙沙散" then
				文本:置文本("【功效】")
				文本:置文本("解除常规异常效果使用时恢复目标气血上限=品质*10+100")
				文本:置文本("#Y品质 " .. item.阶品 .. ",恢复气血上限=" .. (item.阶品 * 10 + 100) .. ",等级: 3")
			elseif item.名称 == "生骨续命膏" then
				文本:置文本("【功效】")
				文本:置文本("复活、恢复目标当前气血=品质*3+50,气血上限变为品质3+50(不超过上限)。临时提高目标品质*1点物理防御与法术防御,持续回合,效果不回叠加。")
				文本:置文本("#Y品质 " ..
					item.阶品 ..
					",恢复气血=" ..
					(item.阶品 * 3 + 50) .. ",恢复气血上限=" ..
					(item.阶品 * 3 + 50) .. ",物理防御=" .. (item.阶品 * 1) .. ",法术防御=" .. (item.阶品 * 1) .. ",等级: 3")
			elseif item.名称 == "百炼金乌丸" then
				文本:置文本("【功效】")
				文本:置文本("恢复目标气血=品质*5+100同时分别为本方其他所有成员(包括召唤兽)恢复当前气血=品质*2+50")
				文本:置文本("#Y品质 " .. item.阶品 .. ",恢复气血=" .. (item.阶品 * 5 + 100) .. ",所有成员恢复气血=" .. (item.阶品 * 2 + 50) ..
					",等级: 3")
			elseif item.名称 == "金石返魂丹" then
				文本:置文本("【功效】")
				文本:置文本("解除常规异常效果使用时恢复目标气血上限=品质*10+100")
				文本:置文本("#Y品质 " .. item.阶品 .. ",恢复气血上限=" .. (item.阶品 * 10 + 100) .. ",等级: 3")
			elseif item.名称 == "黑玉云苓膏" then
				文本:置文本("【功效】")
				文本:置文本("从当前回合开始持续三回合恢复目标魔法值与流失的速度。每回合恢复魔法=品质*1.5+100每回合恢复速度=品质*0.1")
				文本:置文本("#Y品质 " .. item.阶品 .. ",恢复魔法=" .. (item.阶品 * 1.5 + 100) .. ",恢复速度=" .. (item.阶品 * 0.1) .. ",等级: 3")
			end
		elseif item.分类 == 11 then --月华露
			if item.名称 == "月华露" then
				gs = gs .. "#W【功效】增加召唤兽经验=品质*2*服用召唤兽等级"
				文本:置文本(gs)
				文本:置文本("#Y品质:" .. item.阶品)
			elseif item.名称 == "九转金丹" then
				文本:置文本("【功效】增加人物修炼经验=品质*0.5")
				文本:置文本("#Y品质:" .. item.阶品)
			elseif item.名称 == "修炼果" then
				文本:置文本("【功能】提高某种修炼经验，经验达到要求后可提高修炼等级，从而控制召唤兽发挥出更强的潜力。")
			end
		elseif item.子类 == 4 then
		elseif item.分类 == 10 and not 资质道具[item.名称] then
			文本:置文本("#Y【特点】:" .. item.子类)
			文本:置文本("#Y【效果】:" .. item.阶品)
		elseif item.分类 == 12 then
			文本:置文本("#Y【激活方式】: 鼠标右键点击使用激活")
			-- if qgx.功效 ~= nil then
			-- 	gs = gs..qgx.功效
			-- end
			-- 文本:置文本(zf.."【功效】"..gs)
		end
	elseif zls == 2 and item.灵饰 then
		文本:置文本("【装备条件】等级" .. item.等级)
		文本:置文本("【灵饰类型】" .. item.部位类型)
		文本:置文本("#Y等级 " .. item.等级)
		if item.鉴定 then
			if item.幻化属性 then
				文本:置文本("#Y" .. item.幻化属性.基础.类型 .. " +" .. item.幻化属性.基础.数值)
			else
				文本:置文本("#Y/自选类型 + 满属性")
			end
			if item.修理失败 ~= nil then
				文本:置文本("#Y耐久度 " .. math.ceil((item.耐久 or 500)) .. "   修理失败 " .. item.修理失败 .. "次")
			else
				文本:置文本("#Y耐久度 " .. math.ceil(item.耐久 or 500))
			end
			if item.特效 ~= nil then
				文本:置文本(string.format("#S特效：%s", item.特效))
			end
			if item.幻化等级 and item.幻化等级 > 0 then 文本:置文本("#Y精炼等级 " .. item.幻化等级) end
			if item.幻化属性 then
				for n = 1, #item.幻化属性.附加 do
					if item.幻化等级 == 0 then
						文本:置文本("#G" .. item.幻化属性.附加[n].类型 .. " +" .. item.幻化属性.附加[n].数值)
					else
						文本:置文本("#G" .. item.幻化属性.附加[n].类型 .. " +" .. item.幻化属性.附加[n].数值 .. " #F[+" .. item.幻化属性.附加[n].强化 ..
							"]")
					end
				end
			else
				for i = 1, 4 do
					文本:置文本("#G/自选类型 + 满属性")
				end
			end
			if item.新特性 then
                文本:置文本("#R/【凤纹灵坠】")
                 文本:置文本("#P/属性：#F/"..item.新特性.属性)
                 文本:置文本("#P/额外增加：#F/"..item.新特性.数值.."%")
            end
			

			if item.特性 then
                文本.置文本(文本, string.format("#S/特效：%s(%d级)",item.特性.技能,item.特性.等级))
			    local tempdata =PropertyData[item.特性.技能][item.部位类型]

			if  tempdata.status ==1 then
                文本.置文本(文本,string.format("#S/%s +%d",tempdata.pro,item.特性.等级*tempdata.rate))
		            	 else
                            文本.置文本(文本,string.format("#S/"..tempdata.pro,item.特性.等级*tempdata.rate))
		            	 end
		             local 颜色 =  item.特性.套装 and "#S/" or "#G"
		             local  等级 =item.特性.套装 and item.特性.套装 or  1
		             local  尾部 = item.特性.套装 and "#S/(已生效)" or "#G/(未生效)"
		             文本.置文本(文本, 颜色.."【套装效果】")

		             文本.置文本(文本,string.format(颜色..PropertyData[item.特性.技能].套装.pro..尾部,
		                     	PropertyData[item.特性.技能]["套装"..等级]))
			end


			if item.制造者 ~= nil then
				文本:置文本("制造者：" .. item.制造者)
			end
			if item.专用 ~= nil then
				if item.专用 == 1 then item.专用 = 多开数据[多开数据.当前].角色信息.数字id end
				文本:置文本(format("#Y/玩家%s专用",item.专用))
			end
		else
			if item.制造者 ~= nil then
				文本:置文本(string.format("#W制造者：%s", item.制造者))
			end
			if jd == nil then
				文本:置文本("#Y未鉴定物品")
			end
		end
	elseif item.名称=="人族时空之钥" then------------佬伍修改（增加种族秘境时空之钥）
		if item.秘境类型~=nil and  item.境界~=nil then
		   文本:置文本("#Y/秘境类型："..item.秘境类型.."\n#Y/境界层数："..item.境界)
		end
			elseif item.名称=="魔族时空之钥" then
					if item.秘境类型~=nil and  item.境界~=nil then
					   文本:置文本("#Y/秘境类型："..item.秘境类型.."\n#Y/境界层数："..item.境界)
					end
			elseif item.名称=="仙族时空之钥" then
					if item.秘境类型~=nil and  item.境界~=nil then
					   文本:置文本("#Y/秘境类型："..item.秘境类型.."\n#Y/境界层数："..item.境界)
					end---------佬伍修改（增加种族秘境时空之钥）
	
	elseif zls == 2 and item.灵饰 == nil and item.分类 >= 14 and item.分类 <= 19  then
		if item.子类==1 then
			文本:置文本("#G/角色#R耐力#G/与#R体质#G额外增加10点")
			if item.锦衣进阶~=nil and  item.锦衣进阶.技能~="无" then
				文本:置文本("#F/锦衣特性："..item.锦衣进阶.技能)
			end
			if item.锦衣升级~=nil and item.锦衣升级 >0 then
				文本:置文本("#Y/【焕彩】")
				文本:置文本("#P/当前焕彩等级：#R"..(item.锦衣升级).."#P级")
				文本:置文本("#P/额外增加对应属性：#R"..(item.锦衣升级*2).."#P点")
			end
		elseif item.子类==3 then
			文本:置文本("#G/角色#R力量#G/与#R魔力#G额外增加10点")
			if item.锦衣进阶~=nil and  item.锦衣进阶.技能~="无" then
				文本:置文本("#F/锦衣特性："..item.锦衣进阶.技能)
			end
			if item.锦衣升级~=nil and item.锦衣升级 >0 then
				文本:置文本("#Y/【焕彩】")
				文本:置文本("#P/当前焕彩等级：#R"..(item.锦衣升级).."#P级")
				文本:置文本("#P/额外增加对应属性：#R"..(item.锦衣升级*2).."#P点")
			end
		elseif item.子类==4 then
			文本:置文本("#G/角色#R敏捷#G/与#R法防#G额外增加10点")
			if item.锦衣进阶~=nil and  item.锦衣进阶.技能~="无" then
				文本:置文本("#F/锦衣特性："..item.锦衣进阶.技能)
			end
			if item.锦衣升级~=nil and item.锦衣升级 >0 then
				文本:置文本("#Y/【焕彩】")
				文本:置文本("#P/当前焕彩等级：#R"..(item.锦衣升级).."#P级")
				文本:置文本("#P/额外增加对应属性：#R"..(item.锦衣升级*2).."#P点")
			end
		elseif item.子类==5 then
			文本:置文本("#G/角色#R力量#G额外增加10点")
			if item.锦衣升级~=nil and item.锦衣升级 >0 then
				文本:置文本("#Y/【焕彩】")
				文本:置文本("#P/当前焕彩等级：#R"..(item.锦衣升级).."#P级")
				文本:置文本("#P/额外增加对应属性：#R"..(item.锦衣升级*2).."#P点")
			end
		elseif item.子类==6 then
			文本:置文本("#G/角色#R魔力#G额外增加10点")
			if item.锦衣升级~=nil and item.锦衣升级 >0 then
				文本:置文本("#Y/【焕彩】")
				文本:置文本("#P/当前焕彩等级：#R"..(item.锦衣升级).."#P级")
				文本:置文本("#P/额外增加对应属性：#R"..(item.锦衣升级*2).."#P点")
			end
		end	

	elseif zls == 2 and item.灵饰 == nil and item.分类 <= 6 then -- 判断装备药品
		if item.鉴定 then
			if item.子类==911 then
				item.防御=0
			end
			if item.分类 == 3 then
				文本:置文本("#W【装备条件】等级" .. item.等级)
				if item.角色限制[3] == nil and item.角色限制[2] ~= nil then
					文本:置文本("#W【装备角色】" .. item.角色限制[1] .. "、" .. item.角色限制[2])
				elseif item.角色限制[2] == nil then
					文本:置文本("#W【装备角色】" .. item.角色限制[1])
				else
					文本:置文本("#W【装备角色】" .. item.角色限制[1] .. "、" .. item.角色限制[2] .. "、" .. item.角色限制[3])
				end
			elseif item.分类 == 1 or item.分类 == 4 then
				文本:置文本("#W【装备条件】等级" .. item.等级)
				if item.性别限制 then
				文本:置文本("#W【装备角色】" .. item.性别限制)
				end
			elseif item.分类 > 6 and item.分类 < 10 then
				文本:置文本("#W【角色限制】召唤兽")
			elseif item.分类 >= 10 then
				文本:置文本("#W【装备等级】" .. item.等级)
			else
				文本:置文本("#W【装备条件】等级" .. item.等级)
				文本:置文本("#W【装备角色】无")
			end
			文本:置文本("#Y等级 " .. item.等级 .. " 五行 " .. item.五行)
			local sx = ""
			local 气血 = item.气血
			local 魔法 = item.魔法
			local 命中 = item.命中
			local 伤害 = item.伤害
			local 防御 = item.防御
			local 速度 = item.速度
			local 躲避 = item.躲避
			local 灵力 = item.灵力
			local 体质 = item.体质
			local 魔力 = item.魔力
			local 力量 = item.力量
			local 耐力 = item.耐力
			local 敏捷 = item.敏捷

			if  item.宝石属性 ~= nil then
				if (item.宝石属性.气血 ~= nil and item.分类~=4) or (气血 ~= 0 and 气血 ~= nil and item.分类~=4) then
					sx = sx.."气血 +"..(气血 or 0)+(item.宝石属性.气血 or 0).." "
				end
				if (item.宝石属性.魔法 ~= nil )  or (魔法 ~= 0 and 魔法 ~= nil ) then
					sx = sx.."魔法 +"..(魔法 or 0)+(item.宝石属性.魔法 or 0).." "
				end
				if(item.宝石属性.命中 ~= nil and item.分类 ~=1) or (命中 ~= 0  and 命中 ~= nil and item.分类 ~=1) then
					sx = sx.."命中 +"..(命中 or 0)+(item.宝石属性.命中 or 0).." "
				end
				if (item.宝石属性.伤害 ~= nil  and item.分类 ~=1)  or (伤害 ~= 0 and 伤害 ~= nil  and item.分类 ~=1) then
					sx = sx.."伤害 +"..(伤害 or 0)+(item.宝石属性.伤害 or 0) .." "
				end
				if (item.宝石属性.防御 ~= nil) or (防御 ~= 0 and 防御 ~= nil )  then
					sx = sx.."防御 +"..(防御 or 0)+(item.宝石属性.防御 or 0).." "
				end
				if (item.宝石属性.灵力 ~= nil  and item.分类 ~= 4) or (灵力 ~= 0 and 灵力 ~= nil  and item.分类 ~= 4 ) then
					sx = sx.."灵力 +"..(灵力 or 0)+(item.宝石属性.灵力 or 0).." "
				end
				if (item.宝石属性.敏捷~=nil and item.分类 == 6 ) or (敏捷 ~= 0 and 敏捷~=nil and item.分类 == 6) then
					sx = sx.."敏捷 +"..(敏捷 or 0)+(item.宝石属性.敏捷 or 0).." "
				end
			else
				if 气血 ~= 0 and 气血 ~= nil and item.分类~=4 then
					sx = sx.."气血 +"..气血.." "
				end
				if 魔法 ~= 0 and 魔法 ~= nil  then
					sx = sx.."魔法 +"..魔法.." "
				end
				if 命中 ~= 0  and 命中 ~= nil and item.分类 ~=1 then
					sx = sx.."命中 +"..命中.." "
				end
				if 伤害 ~= 0 and 伤害 ~= nil  and item.分类 ~=1  then
					sx = sx.."伤害 +"..伤害 .." "
				end
				if 防御 ~= 0 and 防御 ~= nil  then
					sx = sx.."防御 +"..防御.." "
				end
				if 灵力 ~= 0 and 灵力 ~= nil  and item.分类 ~= 4 then
					sx = sx.."灵力 +"..灵力.." "
				end
				if 敏捷 ~= 0 and 敏捷~=nil and item.分类 == 6  then
					sx = sx.."敏捷 +"..敏捷.." "
				end
			end
				
			if sx ~= "" then
				文本:置文本("#Y" .. sx)
			end
			if item.升星 and item.升星>0  then  
				local 属性={防御=true,魔法=true,灵力=true,伤害=true,命中=true,气血=true,敏捷=true}
				local 加成="★"
				for n,v in pairs(属性) do  
					if item[n] then  
						加成=加成.." "..n.." + "..math.floor(item[n]*item.升星*0.01)
					end 	
				end 
				文本:置文本("#R" .. 加成)	
			end 
			if item.修理失败 ~= nil and item.修理失败 > 0  then
				文本:置文本("#Y耐久度 " .. math.ceil((item.耐久 or 500)) .. "   修理失败 " .. item.修理失败 .. "次")
			else
				文本:置文本("#Y耐久度 " .. math.ceil((item.耐久 or 500)))
			end
			if item.锻炼等级 ~= nil then
				local bsz = ""
				for i = 1, #item.镶嵌宝石 do
					local sw = "、"
					if i == #item.镶嵌宝石 then
						sw = ""
					end
					bsz = bsz .. item.镶嵌宝石[i] .. sw
				end
				文本:置文本(string.format("#Y锻炼等级 %s  镶嵌宝石 %s", item.锻炼等级, bsz))
				if item.分类 == 1 then
					sx = ""
					if item.宝石属性.命中 ~= nil and item.宝石属性.命中 ~= 0 then
						sx = sx .. "命中 +" .. item.宝石属性.命中 .. " "
					end
					if item.宝石属性.伤害 ~= nil and item.宝石属性.伤害 ~= 0 then
						sx = sx .. "伤害 +" .. item.宝石属性.伤害 .. " "
					end
					if sx ~= "" then
						文本:置文本("#G" .. sx)
					end
				elseif item.分类 == 3 then
					sx = ""
					if item.宝石属性.躲避 ~= nil and item.宝石属性.躲避 ~= 0 then
						sx = sx .. "躲避 +" .. item.宝石属性.躲避 .. " "
					end
					if sx ~= "" then
						文本:置文本("#G" .. sx)
					end
				elseif item.分类 == 4 then
					sx = ""
					if item.宝石属性.气血 ~= nil and item.宝石属性.气血 ~= 0 then
						sx = sx .. "气血 +" .. item.宝石属性.气血 .. " "
					end
					if item.宝石属性.灵力 ~= nil and item.宝石属性.灵力 ~= 0 then
						sx = sx .. "灵力 +" .. item.宝石属性.灵力 .. " "
					end
					if sx ~= "" then
						文本:置文本("#G" .. sx)
					end
				elseif item.分类 == 5 or item.分类 == 6 then
					sx = ""
					if item.宝石属性.躲避 ~= nil and item.宝石属性.躲避 ~= 0 then
						sx = sx .. "躲避 +" .. item.宝石属性.躲避 .. " "
					end
					if item.宝石属性.速度 ~= nil and item.宝石属性.速度 ~= 0 then
						sx = sx .. "速度 +" .. item.宝石属性.速度 .. " "
					end
					if sx ~= "" then
						文本:置文本("#G" .. sx)
					end
				end
			end
			if item.词条 and #item.词条 > 0 then
				local 存在 = {}
				local 存在1 = {}
				local 存在2 = {}
				-- 遍历词条
				for i = 1, #item.词条 do
					if item.词条[i].类型 and item.词条[i].属性 and item.词条[i].数值 then
						文本:置文本("#G/【" .. item.词条[i].类型 .. "】 " .. item.词条[i].属性 .. "+" .. item.词条[i].数值)
					end
					-- 根据词条数量和类型进行判断
					if i == 1 then
						存在 = {数量 = 1, 类型 = item.词条[i].类型}
					elseif i == 2 then
						if item.词条[1].类型 ~= item.词条[2].类型 then
							存在 = {数量 = 1, 类型 = item.词条[1].类型}
							存在1 = {数量 = 1, 类型 = item.词条[i].类型}
						else
							存在 = {数量 = 2, 类型 = item.词条[i].类型}
						end
					elseif i == 3 then
						if item.词条[1].类型 ~= item.词条[2].类型 and item.词条[1].类型 ~= item.词条[3].类型 then
							存在 = {数量 = 1, 类型 = item.词条[1].类型}
							存在1 = {数量 = 1, 类型 = item.词条[2].类型}
							存在2 = {数量 = 1, 类型 = item.词条[3].类型}
						elseif item.词条[1].类型 == item.词条[2].类型 and item.词条[1].类型 == item.词条[3].类型 then
							存在 = {数量 = 3, 类型 = item.词条[i].类型}
						elseif item.词条[1].类型 == item.词条[2].类型 or item.词条[1].类型 == item.词条[3].类型 then
							存在 = {数量 = 2, 类型 = item.词条[1].类型}
							存在1 = {数量 = 1, 类型 = item.词条[i].类型}
						elseif item.词条[2].类型 == item.词条[3].类型 then
							存在 = {数量 = 2, 类型 = item.词条[2].类型}
							存在1 = {数量 = 1, 类型 = item.词条[1].类型}
						end
					end
				end
				local 颜色 = "M"
				if 存在 and 存在.数量 then
					if 存在.数量 == 3 then 颜色 = "G" end
					文本:置文本("#"..颜色.."/【" .. 存在.类型 .. "】 " .. "("..存在.数量.."\\3) " ..存在.类型.."效果提升25%")
				end
				if 存在1 and 存在1.数量 then
					文本:置文本("#"..颜色.."/【" .. 存在1.类型 .. "】 " .. "("..存在1.数量.."\\3) " ..存在1.类型.."效果提升25%")
				end
				if 存在2 and 存在2.数量 then
					文本:置文本("#"..颜色.."/【" .. 存在2.类型 .. "】 " .. "("..存在2.数量.."\\3) " ..存在2.类型.."效果提升25%")
				end
			end
			local ds = ""
			local lsb = { "体质", "魔力", "力量", "耐力", "敏捷" }
			for i = 1, #lsb do
				if item[lsb[i]] ~= nil and item[lsb[i]] ~= 0 then
					if item[lsb[i]] < 0 then
						ds = ds .. lsb[i] .. " " .. item[lsb[i]] .. " "
					else
						ds = ds .. lsb[i] .. " +" .. item[lsb[i]] .. " "
					end
				end
			end
			if ds ~= "" and item.分类 ~= 6 then
				文本:置文本("#G" .. ds)
			end

			 if item.强化次数~=nil and item.鉴定 then
                if item.强化次数<20 then
                    文本:置文本(string.format("#Y强化次数:"..item.强化次数))
                else
                    文本:置文本(string.format("#R强化次数:"..item.强化次数))
               end
              end

			  
			if item.临时附魔 ~= nil then
				if item.分类 == 1 then
					if item.临时附魔.命中 and item.临时附魔.命中.数值 ~= 0 then
						文本:置文本(format("#G/临时命中 " .. item.临时附魔.命中.数值 .. " " .. 时间转换(item.临时附魔.命中.时间)))
					end
					if item.临时附魔.耐力 and item.临时附魔.耐力.数值 ~= 0 then
						文本:置文本(format("#G/临时耐力 " .. item.临时附魔.耐力.数值 .. " " .. 时间转换(item.临时附魔.耐力.时间)))
					end
				elseif item.分类 == 2 then
					if item.临时附魔.体质 and item.临时附魔.体质.数值 ~= 0 then
						文本:置文本(format("#G/临时体质 " .. item.临时附魔.体质.数值 .. " " .. 时间转换(item.临时附魔.体质.时间)))
					end
					if item.临时附魔.法术伤害 and item.临时附魔.法术伤害.数值 ~= 0 then
						文本:置文本(format("#G/临时法伤 " .. item.临时附魔.法术伤害.数值 .. " " .. 时间转换(item.临时附魔.法术伤害.时间)))
					end
				elseif item.分类 == 3 then
					if item.临时附魔.伤害 and item.临时附魔.伤害.数值 ~= 0 then
						文本:置文本(format("#G/临时伤害 " .. item.临时附魔.伤害.数值 .. " " .. 时间转换(item.临时附魔.伤害.时间)))
					end
					if item.临时附魔.气血 and item.临时附魔.气血.数值 ~= 0 then
						文本:置文本(format("#G/临时气血 " .. item.临时附魔.气血.数值 .. " " .. 时间转换(item.临时附魔.气血.时间)))
					end
					if item.临时附魔.魔法 and item.临时附魔.魔法.数值 ~= 0 then
						文本:置文本(format("#G/临时魔法上限 " .. item.临时附魔.魔法.数值 .. " " .. 时间转换(item.临时附魔.魔法.时间)))
					end
					if item.临时附魔.防御 and item.临时附魔.防御.数值 ~= 0 then
						文本:置文本(format("#G/临时防御 " .. item.临时附魔.防御.数值 .. " " .. 时间转换(item.临时附魔.防御.时间)))
					end
				elseif item.分类 == 4 then
					if item.临时附魔.法术防御 and item.临时附魔.法术防御.数值 ~= 0 then
						文本:置文本(format("#G/临时法防 " .. item.临时附魔.法术防御.数值 .. " " .. 时间转换(item.临时附魔.法术防御.时间)))
					end
					if item.临时附魔.魔力 and item.临时附魔.魔力.数值 ~= 0 then
						文本:置文本(format("#G/临时魔力 " .. item.临时附魔.魔力.数值 .. " " .. 时间转换(item.临时附魔.魔力.时间)))
					end
				elseif item.分类 == 5 then
					if item.临时附魔.愤怒 and item.临时附魔.愤怒.数值 ~= 0 then
						文本:置文本(format("#G/临时愤怒 " .. item.临时附魔.愤怒.数值 .. " " .. 时间转换(item.临时附魔.愤怒.时间)))
					end
					if item.临时附魔.伤害 and item.临时附魔.伤害.数值 ~= 0 then
						文本:置文本(format("#G/临时伤害 " .. item.临时附魔.伤害.数值 .. " " .. 时间转换(item.临时附魔.伤害.时间)))
					end
				elseif item.分类 == 6 then
					if item.临时附魔.速度 and item.临时附魔.速度.数值 ~= 0 then
						文本:置文本(format("#G/临时速度 " .. item.临时附魔.速度.数值 .. " " .. 时间转换(item.临时附魔.速度.时间)))
					end
					if item.临时附魔.魔法 and item.临时附魔.魔法.数值 ~= 0 then
						文本:置文本(format("#G/临时魔法上限 " .. item.临时附魔.魔法.数值 .. " " .. 时间转换(item.临时附魔.魔法.时间)))
					end
				end
			end
			if item.赐福 ~= nil then
				if item.赐福.总类 == "基础" then
					文本:置文本("#P/[仙人赐福]#R/" .. item.赐福.类型 .. "#P/ +#R/" .. item.赐福.数值)
				else
					文本:置文本("#P/[仙人赐福]#R/" .. item.赐福.类型 .. "#P/ +#R/" .. item.赐福.数值 .. "%")
				end
			end
			if item.特技 ~= nil then
				文本:置文本(string.format("#S特技：%s", item.特技))
			end
			if item.特效 ~= nil then
				for i = 1, #item.特效 do
					文本:置文本(string.format("#S特效：%s", item.特效[i]))
				end
			end
			if item.套装效果 ~= nil then
				if item.套装类型 ~= nil then
					文本:置文本(format("#S/套装效果：%s",item.套装类型..item.套装效果))
				else
					文本:置文本(format("#S/套装效果：%s",item.套装效果[1]..item.套装效果[2]))
				end
			end

			if item.光武拓印 ~= nil then
					文本:置文本("#S/光武拓印原造型："..item.光武拓印.原名称)
					文本:置文本("#Y/玩家"..item.光武拓印.id.."专用")
			end

			if item.专用 ~= nil then
				if item.专用 == 1 then item.专用 = 多开数据[多开数据.当前].角色信息.数字id end
				文本:置文本(format("#Y/玩家%s专用",item.专用))
			end
			if item.武器专属 ~= nil then
				if item.武器专属.类型 and item.武器专属.类型 == "治疗能力" then
					文本:置文本("#S/门派专属["..item.武器专属.门派.."]"..item.武器专属.类型.."#R/+"..item.武器专属.数值)
				else
					文本:置文本("#S/门派专属["..item.武器专属.门派.."]"..item.武器专属.类型.."#R/+"..item.武器专属.数值.."%")
				end
			end
			if item.新特效 ~= nil and item.新特效数值 ~= nil then
				if item.新特效数值+0>=6 then
					文本:置文本(format("#S/%s +%s",item.新特效,item.新特效数值))
				else
					文本:置文本(format("#S/%s +%s％",item.新特效,item.新特效数值))
				end
			end
			
			-- if item.第二特效 ~= nil then
			-- 	文本:置文本(string.format("#S特效：%s", item.第二特效))
			-- end
			if item.镶嵌四相 ~= nil then
				文本:置文本(format("#S/四相 %s", item.镶嵌四相))
			end

			if item.开运孔数 ~= nil and item.开运孔数.当前 ~= nil and item.开运孔数.当前 ~= 0 then
				文本:置文本(string.format("#G开运孔数：%s", item.开运孔数.当前 .. "孔/" .. item.开运孔数.上限 .. "孔"))
				for ls = 1, 5 do
					if item.符石[ls] ~= nil then
						local sx = ""
						local lsb = { "气血", "魔法", "命中", "伤害", "防御", "速度", "躲避", "灵力", "体质", "魔力", "力量", "耐力", "敏捷",
							"法术伤害", "法术防御", "固定伤害" }
						for i = 1, #lsb do
							if item.符石[ls][lsb[i]] ~= nil then
								sx = sx .. lsb[i] .. " +" .. item.符石[ls][lsb[i]] .. " "
							end
						end
						if sx ~= "" then
							文本:置文本("#G" .. "符石:" .. " " .. sx)
						end
					end
				end
				if item.符石组合 and next(item.符石组合) ~= nil and #item.符石组合.符石组合 > 0 then
					文本:置文本("#F符石组合：" .. item.符石组合.符石组合)
					local 符石数据 = 取符石组合(item.符石组合)
					if 符石数据.门派 ~= nil then
						文本:置文本("#F门派条件：" .. 符石数据.门派)
					else
						文本:置文本("#F门派条件：")
					end
					if 符石数据.部位 ~= nil then
						文本:置文本("#F部位条件：" .. 符石数据.部位)
					else
						文本:置文本("#F部位条件：")
					end
					文本:置文本("#F" .. 符石数据.介绍)
				end
			end
			if item.星位 ~= nil then
				for n = 1, 5 do
					if item.星位[n] ~= nil then
						local 组合语句 = "#G符石："
						for k, v in pairs(item.星位[n].符石属性) do
							组合语句 = 组合语句 .. k .. " +" .. v .. " "
						end
						文本:置文本(组合语句)
					end
				end
			end
			if item.星位组 ~= nil then
				if item.星位 ~= nil and item.星位[6] ~= nil then
					local 临时属性 = ""
					for k, v in pairs(item.星位[6].符石属性) do
						临时属性 = k .. " +" .. v
					end
					文本:置文本("#G/星位: " .. 临时属性)
					if item.星位[6].相互 ~= nil then
						local 临时属性 = ""
						for k, v in pairs(item.星位[6].相互) do
							临时属性 = k .. " +" .. v
						end
						文本:置文本("#G/星相互合: " .. 临时属性)
					end
				else
					文本:置文本("#G/星位: 已开")
				end
			end
			if item.星位 ~= nil and item.星位.组合 ~= nil then
				文本:置文本(format("#F/符石组合： %s", item.星位.组合))
				文本:置文本(format("#F/门派条件： %s", item.星位.门派 or "无"))
				文本:置文本(format("#F/部位条件： %s", 取符石部位(item.星位.部位)))
				文本:置文本(format("#F/%s", 取符石组合说明(item.星位.组合, item.星位.组合等级)))
			end
			
			if item.制造者 ~= nil then
				文本:置文本(string.format("#W制造者：%s", item.制造者))
			end
			if item.限时 ~= nil then
				文本:置文本(string.format("#Y有效期至：%s", os.date("%Y-%m-%d %H:%M:%S", item.限时)))
			end
			if item.熔炼效果 ~= nil then
				local sx = ""
				local lsb = {"气血","魔法","防御","速度","灵力","体质","魔力","力量","耐力","敏捷"}
				for i=1,#lsb do
					if item.熔炼效果[lsb[i]] ~= nil and item.熔炼效果[lsb[i]]~=0 then
						if item.熔炼效果[lsb[i]] < 0 then
							sx = sx..lsb[i].." "..item.熔炼效果[lsb[i]].." "
						else
							sx = sx..lsb[i].." +"..item.熔炼效果[lsb[i]].." "
						end
					end
				end
				if sx ~= "" then
					文本:置文本(format("#Y/熔炼效果：\n".." #Y/"..sx))
				end
				
			end
			if item.幻化特性 ~= nil then
				文本:置文本("#Y特性：" .. item.幻化特性.名称 .. "+" .. item.幻化特性.数额 .. "%")
				文本:置文本("#Y特性：" .. item.幻化特性.名称 .. "+" .. item.幻化特性.数额 .. "%")
			end
		else
			if item.分类 == 3 then
				if item.角色限制[2] == nil then
					文本:置文本("#W【装备角色】" .. item.角色限制[1])
				else
					文本:置文本("#W【装备角色】" .. item.角色限制[1] .. "、" .. item.角色限制[2])
				end
			elseif item.分类 == 1 or item.分类 == 4 and item.性别限制 then
				文本:置文本("#W【装备角色】" .. item.性别限制)
			elseif item.分类 > 6 then
				文本:置文本("#W【角色限制】召唤兽")
			else
				文本:置文本("#W【角色限制】无角色限制")
			end
			if item.制造者 ~= nil then
				文本:置文本(string.format("#W制造者：%s", item.制造者))
			end
			if jd == nil then
				文本:置文本("#Y未鉴定物品")
			end
		end
	elseif zls == 2 and item.灵饰 == nil and item.分类 <= 10 then -- 判断装备药品
		文本:置文本("#W【装备对象】召唤兽")
		文本:置文本("#W【装备条件】等级" .. item.等级)
		文本:置文本("#W 等级" .. item.等级)
		
		local 气血 = item.气血
		local 魔法 = item.魔法
		local 命中 = item.命中
		local 伤害 = item.伤害
		local 防御 = item.防御
		local 速度 = item.速度
		local sx = ""
		local fh = "+"
		if 命中 ~= 0  and 命中 ~= nil  then
			sx = sx.."命中率 +"..命中.."%".."  "
		end
		if 防御 ~= 0 and 防御 ~= nil  then
			sx = sx.."防御 +"..防御.." "
		end
		if 速度 ~= 0 and 速度 ~= nil  then
			sx = sx.."速度 +"..速度.." "
		end
		if 伤害 ~= 0 and 伤害 ~= nil    then
			if 伤害<0 then
				fh = ""
			end
			sx = sx.."伤害 "..fh..伤害 .." "
		end
		fh = "+"
		if 气血 ~= 0 and 气血 ~= nil then
			if 气血<0 then
				fh = ""
			end
			sx = sx.."气血 "..fh..气血.." "
		end
		fh = "+"
		if 魔法 ~= 0 and 魔法 ~= nil  then
			if 魔法<0 then
				fh = ""
			end
			sx = sx.."魔法 "..fh..魔法.." "
		end
		if sx ~= "" then
			文本:置文本("#Y" .. sx)
		end
		if item.修理失败 ~= nil then
			文本:置文本("#Y耐久度 " .. math.ceil((item.耐久 or 500)) .. "   修理失败 " .. item.修理失败 .. "次")
		else
			文本:置文本("#Y耐久度 " .. math.ceil((item.耐久 or 500)))
		end
		local fj = ""
		local 体质 = item.体质
		local 力量 = item.力量
		local 耐力 = item.耐力
		local 魔力 = item.魔力
		local 敏捷 = item.敏捷
		fh = "+"
		if 体质 ~= 0 and 体质 ~= nil    then
			if 体质<0 then
				fh = ""
			end
			fj = fj.."体质 "..fh..体质 .." "
		end
		fh = "+"
		if 力量 ~= 0 and 力量 ~= nil  then
			if 力量<0 then
				fh = ""
			end
			fj = fj.."力量 "..fh..力量.." "
		end
		fh = "+"
		if 耐力 ~= 0 and 耐力 ~= nil  then
			if 耐力<0 then
				fh = ""
			end
			fj = fj.."耐力 "..fh..耐力.." "
		end
		fh = "+"
		if 魔力 ~= 0 and 魔力 ~= nil then
			if 魔力<0 then
				fh = ""
			end
			fj = fj.."魔力 "..fh..魔力.." "
		end
		fh = "+"
		if 敏捷 ~= 0 and 敏捷 ~= nil  then
			if 敏捷<0 then
				fh = ""
			end
			fj = fj.."敏捷 "..fh..敏捷.." "
		end
		if fj ~= "" then
			文本:置文本("#G" .. fj)
		end
		---------------------------------------------C改
		local 词条伤害=item.词条伤害
		local 词条速度=item.词条速度
		local 词条灵力=item.词条灵力
		local 词条防御=item.词条防御
		local 词条气血=item.词条气血
		local ct=""
		local zf="+"
		if 词条伤害 ~= 0  and 词条伤害 ~= nil  then
			if 词条伤害<0 then
				zf=""
			end
			ct = ct.."五行属性：金"..zf..词条伤害.."%".."  "
			文本:置文本("#P" .. ct)
		end
		zf = "+"
		if 词条速度 ~= 0  and 词条速度 ~= nil  then
			if 词条速度<0 then
				zf=""
			end
			ct = ct.."五行属性：水"..zf..词条速度.."%".."  "
			文本:置文本("#P/"..ct)
		end
		zf = "+"
		if 词条灵力 ~= 0  and 词条灵力 ~= nil  then
			if 词条灵力<0 then
				zf=""
			end
			ct = ct.."五行属性：火"..zf..词条灵力.."%".."  "
			文本:置文本("#P/"..ct)
		end
		zf = "+"
		if 词条防御 ~= 0  and 词条防御 ~= nil  then
			if 词条防御<0 then
				zf=""
			end
			ct = ct.."五行属性：土"..zf..词条防御.."%".."  "
			文本:置文本("#P/"..ct)
		end
		zf = "+"
		if 词条气血 ~= 0  and 词条气血 ~= nil  then
			if 词条气血<0 then
				zf=""
			end
			ct = ct.."五行属性：木"..zf..词条气血.."%".."  "
			文本:置文本("#P/"..ct)
		end
		---------------------------------------------C改

		if item.套装效果 ~= nil then
			if type(item.套装效果) == "table" then
				文本:置文本(string.format("#S套装效果：%s", item.套装效果[1] .. item.套装效果[2]))
			else
				文本:置文本(string.format("#S套装效果：附加状态%s", item.套装效果))
			end
		end

		if item.制造者 ~= nil then
			文本:置文本(string.format("#W制造者：%s", item.制造者))
		end

		if item.精魄~=nil and item.精魄等级~=nil then
			local num = 0
			if item.精魄=="躲避" then
				num=20*item.精魄等级
			elseif item.精魄=="速度" then
				num=6*item.精魄等级
			elseif item.精魄=="伤害" then
				num=10*item.精魄等级
			elseif item.精魄=="灵力" then
				num=4*item.精魄等级
			elseif item.精魄=="防御" then
				num=8*item.精魄等级
			elseif item.精魄=="气血" then
				num=30*item.精魄等级
			end
			if item.精魄等级>0 then
				文本:置文本("#Y/镶嵌效果")
				文本:置文本("#Y/+"..num..item.精魄.." 镶嵌等级: "..item.精魄等级)
			end
		end
		
	elseif zls == 3 then
		if item.分类 == 1 then
			if item.附带技能 == nil then
				item.附带技能 = "购买后随机生成"
			end
			if item.附加参数 ~= nil then
				item.附带技能 = item.附加参数
			end
			文本:置文本("#Y所带技能: " .. item.附带技能)
		elseif item.分类 == 3 then
			if item.等级 then
				文本:置文本("#Y等级 " .. item.等级)
			else
				文本:置文本("#Y购买后随机生成")
			end
		elseif item.分类 == 10 then
			if item.种类 and item.等级 ~= nil then
				文本:置文本("#Y种类 " .. item.种类 .. ",等级 " .. item.等级)
			else
				文本:置文本("#Y购买后随机生成")
			end
			if item.等级 then
				文本:置文本("#Y等级 " .. item.等级)
			end
		elseif item.分类 == 11 then
			if item.灵气 == nil then
				item.灵气 = item.附加参数 or 0
				item.等级 = item.等级
			end
			文本:置文本("#Y等级 " .. item.等级 .. ",灵气 " .. item.灵气)
		end
	elseif zls == 4 then
	elseif zls == 5 then
		if item.分类 == 1 then
			if item.特效 and item.子类 ~= nil then
				local it = 多开数据[多开数据.当前].__主控:取武器子类(item.特效)
				--文本:置文本(string.format("#Y种类 %s, 等级 %d",item.子类,item.特效))
				文本:置文本("#Y种类 " .. it .. ", 等级 " .. item.子类)
			else
				local sx = ""
				if item.附加参数 then
					sx = "#Y种类：" .. item.附加参数
				end
				if item.等级 ~= nil then
					sx = sx .. " 等级" .. item.等级
				end
				if sx == "" then
					sx = "#Y购买后随机生成"
				end
				文本:置文本(sx)
			end
		elseif item.分类 == 2 or item.分类 == 21 then
			if item.子类 ~= nil then
				文本:置文本(string.format("#Y等级 %s", item.子类))
			elseif item.等级 ~= nil then
				文本:置文本(string.format("#Y等级 %s", item.等级))
			else
				文本:置文本("#Y购买后随机生成")
			end
		elseif item.名称 == "点化石" then
			文本:置文本("#Y/附加技能:" .. (item.附带技能 or item.附加参数 or item.技能))
		elseif item.分类 == 3 then
			文本:置文本("#Y功效 用于分解装备获得宝石")
		elseif item.分类 == 4 then
			--文本:置文本(string.format("#Y功效 %s",item.特效))
		elseif item.名称 == "钟灵石" then
		local A属性
			if  item.特性=="自我陶醉" then
				A属性="增加全属性"
			elseif item.特性=="血气方刚" then
				A属性="增加气血"
			elseif item.特性=="通真达灵" then
				A属性="增加灵力"
			elseif item.特性=="心无旁骛" then
				A属性="增加抵抗封印等级"
			elseif item.特性=="健步如飞" then
				A属性="增加速度"
			elseif item.特性=="回春之术" then
				A属性="增加治疗能力"
			elseif item.特性=="风雨不动" then
				A属性="增加抗法术暴击等级"
			elseif item.特性=="固若金汤" then
				A属性="增加抗物理暴击等级"
			elseif item.特性=="气壮山河" then
				A属性="增加气血回复效果"
			elseif item.特性=="锐不可当" then
				A属性="增加固定伤害"
			else
				A属性=""
			end
        文本.置文本(文本, string.format("#W/【镶嵌装备】灵饰"))
    	if item.特性==nil then
        文本.置文本(文本, string.format("#S/获得后随机获取"))
    		else
		文本.置文本(文本, string.format("#Y/特性：%s",item.特性.."（"..item.等级.."级）"))
		if item.特性~="163" and item.特性~="心源"  then
        文本.置文本(文本, string.format("#S/所有部位："..A属性))
		else
        文本.置文本(文本, string.format("#S/所有部位：无属性"))
		end


        -- 文本.置文本(文本, string.format("#Y/特性 %s",item.特性))
        -- 文本.置文本(文本, string.format("#Y/等级 %s",item.等级))
    end
		elseif item.分类 == 6 and item.名称 ~= "精魄灵石" then
			-- if item.名称~="星辉石" and item.名称~="附魔宝珠" and item.名称~="附法宝珠" and item.名称~="钨金"and item.名称~="珍珠"and item.名称~="战魄"and item.名称~="陨铁" and item.名称~="天外陨铁"  and item.名称~="精致碎石锤"  then
			if item.角色限制 and item.名称 ~= "星辉石" then
				文本:置文本(string.format("#W【镶嵌装备】%s", item.角色限制))
				文本:置文本(string.format("#W【镶嵌效果】%s", item.特效))
			end
			if tonumber(item.等级) and tonumber(item.等级) > tonumber(item.等级) then
				item.等级 = tonumber(item.等级)
			end
			文本:置文本(string.format("#Y等级 %s", item.等级))
		elseif item.分类 == 20 then
			if item.特效 ~= nil and item.子类 ~= nil then
				文本:置文本("#Y种类 " .. item.特效 .. ", 等级 " .. item.子类)
			else
				if item.子类 ~= nil then
					文本:置文本(string.format("#Y等级 %s", item.子类))
				elseif item.等级 ~= nil then
					文本:置文本(string.format("#Y等级 %s", item.等级))
				else
					文本:置文本("#Y购买后随机生成")
				end
			end
		end
	elseif zls == 7 then
		if item.分类 == 1 then
			if item.名称 == "藏宝图" then
				文本:置文本("#Y【类型】普通藏宝图")
			else
				文本:置文本("#Y【类型】高级藏宝图")
			end
			if item.地图名称 then
				文本:置文本(string.format("#Y【坐标】#G%s(%s,%s)", item.地图名称, item.x, item.y))
			end
		end
	elseif zls == 8 then
		if item.名称 == "帮派银票" then
			if item.初始资金 < item.目标资金 then
				文本:置文本("#Y/资金：" .. item.初始资金 .. "两银子")
				文本:置文本("#Y/目标：" .. item.目标资金 .. "两银子")
			else
				文本:置文本("#Y/任务已完成，请将本银票还给白虎堂总管")
			end
		elseif item.名称 == "珍珠" then
			文本:置文本("#Y/等级:" .. item.等级)
		elseif item.名称 == "神兵图鉴" then
			文本:置文本("#W/【功效】" .. "使用可以鉴定等级≤图鉴等级的武器和铠甲")
			if item.等级 then
				文本:置文本("#Y/等级：" .. item.等级)
			end
		elseif item.名称 == "灵宝图鉴" then
			文本:置文本("#W/【功效】" .. "使用可以鉴定等级≤图鉴等级的头盔、腰带、饰品和靴子")
			if item.等级 then
				文本:置文本("#Y/等级：" .. item.等级)
			end
		elseif item.名称 == "灵饰图鉴" then
			文本:置文本("#W/【功效】" .. "使用可以鉴定等级≤图鉴等级的戒指、手镯、耳饰和佩饰")
			if item.等级 then
				文本:置文本("#Y/等级：" .. item.等级)
			end
		end
	elseif zls == 9 then
		if item.分类 == 1 then
			文本:置文本("#Y右键双击使用")
		end
	elseif zls == 10 then
		if item.分类 == 4 then
			文本:置文本("#Y右键双击使用")
		end
	elseif zls == 11 then
		if item.分类 == 1 then
			if item.地图 == nil then
				文本:置文本("#Y右击后定标")
			else
				local map = 取地图名称(item.地图)
				文本:置文本(string.format("#Y%s(%d,%d)", map, item.x, item.y))
				文本:置文本(string.format("#Y还可使用%s次", item.次数))
			end
		elseif item.分类 == 2 then
			local map = 取地图名称(item.地图)
			if item.地图 == nil and item.附加参数 then map = item.附加参数 end
			if item.次数 == nil then item.次数 = 99 end
			文本:置文本(string.format("#Y场景:%s,还能使用%s次", map, item.次数))
		end
		--[[if item.伤害 == nil then
			文本:置文本(string.format("#Y右键双击之后在该地点定下坐标，总共可以使用%d次",item.子类))
		else
			local map = 取地图名称(item.伤害)
			文本:置文本(string.format("#Y场景：%s\n#Y坐标x：%d y：%d",map,item.气血,item.魔法))
			文本:置文本(string.format("#Y剩余次数：%s",item.子类))
		end --]]
	elseif zls == 12 then
		文本:置文本(string.format("#Y变化对象：%s", item.子类))
	elseif zls == 13 then
		if item.子类 == nil then item.子类 = item.附加参数 end
		文本:置文本(string.format("#Y阵型:%s", (item.子类 or "随机")))
	elseif zls == 21 and item.特效 ~= nil then
		文本:置文本(string.format("#Y说明：%s", item.特效))
	elseif zls == 30 then
		if item.造型 == nil and item.附加参数 ~= nil then item.造型 = item.附加参数 end
		if item.次数 == nil then item.次数 = item.等级 end
		文本:置文本(string.format("#W卡片类型：%s", item.造型))
		文本:置文本(string.format("#W技能要求：%s", 数字转大写(item.等级) .. "级变化之术"))
		local 变身卡技能 = item.技能
		if 变身卡技能 == "" or 变身卡技能 == nil then 变身卡技能 = "无" end
		文本:置文本(string.format("#W【附加技能】%s", 变身卡技能))
		local 组合语句 = ""
		if item.属性 == nil or item.属性 == 0 then
			组合语句 = "无"
		elseif item.单独 == 1 then
			if item.正负 == 1 then
				组合语句 = item.类型 .. "+" .. item.属性
			else
				组合语句 = item.类型 .. "-" .. item.属性
			end
		else
			if item.正负 == 1 then
				组合语句 = item.类型 .. "+" .. item.属性 .. "%"
			else
				组合语句 = item.类型 .. "-" .. item.属性 .. "%"
			end
		end
		文本:置文本(string.format("#W【属性影响】%s", 组合语句))
		文本:置文本(string.format("#Y等级：%s  剩余使用次数：%s", item.等级, item.次数))
		文本:置文本(string.format("#Y持续时间：%s分钟", "15分钟*(1+变化之术等级)"))
	elseif zls == 170 then
		if item.分类 == 2 then
			if item.造型 == nil and item.附加参数 ~= nil then item.造型 = item.附加参数 end
			if item.次数 == nil then item.次数 = item.等级 end
			文本:置文本(string.format("#W卡片类型：%s", item.造型))
			local 变身卡技能 = item.技能
			if 变身卡技能 == "" then 变身卡技能 = "无" end
			文本:置文本(string.format("#W【附加技能】%s", 变身卡技能))
			local 组合语句 = ""
			if item.属性 == 0 then
				组合语句 = "无"
			elseif item.单独 == 1 then
				if item.正负 == 1 then
					组合语句 = item.类型 .. "+" .. item.属性
				else
					组合语句 = item.类型 .. "-" .. item.属性
				end
			else
				if item.正负 == 1 then
					组合语句 = item.类型 .. "+" .. item.属性 .. "%"
				else
					组合语句 = item.类型 .. "-" .. item.属性 .. "%"
				end
			end
			文本:置文本(string.format("#W【属性影响】%s", 组合语句))
			文本:置文本(string.format("#Y等级：%s  剩余使用次数：%s", item.等级, item.次数))
			文本:置文本(string.format("#Y持续时间：%s分钟", "1440"))
		end
	elseif zls == 190 then
		if item.名称=="焕彩石" and item.等级 then
				文本:置文本("#Y当前级别：#R"..item.等级.."级")
		end
	elseif zls == 55 then
		文本:置文本("【用途】:可以镶嵌在有开运孔数的装备上")
		文本:置文本("#Y等级 " .. (item.等级 or item.符石等级).. "    " .. item.特效)
		local sx = ""
		local 气血 = item.气血
		local 魔法 = item.魔法
		local 命中 = item.命中
		local 伤害 = item.伤害
		local 防御 = item.防御
		local 速度 = item.速度
		local 躲避 = item.躲避
		local 灵力 = item.灵力
		local 体质 = item.体质
		local 魔力 = item.魔力
		local 力量 = item.力量
		local 耐力 = item.耐力
		local 敏捷 = item.敏捷
		local 法术伤害 = item.法术伤害
		local 法术防御 = item.法术防御
		local 固定伤害 = item.固定伤害
		if 气血 ~= 0 and 气血 ~= nil then
			sx = sx .. "气血 +" .. 气血 .. " "
		end
		if 魔法 ~= 0 and 魔法 ~= nil then
			sx = sx .. "魔法 +" .. 魔法 .. " "
		end
		if 命中 ~= 0 and 命中 ~= nil then
			sx = sx .. "命中 +" .. 命中 .. " "
		end
		if 伤害 ~= 0 and 伤害 ~= nil then
			sx = sx .. "伤害 +" .. 伤害 .. " "
		end
		if 防御 ~= 0 and 防御 ~= nil then
			sx = sx .. "防御 +" .. 防御 .. " "
		end
		if 速度 ~= 0 and 速度 ~= nil then
			sx = sx .. "速度 +" .. 速度 .. " "
		end
		if 躲避 ~= 0 and 躲避 ~= nil then
			sx = sx .. "躲避 +" .. 躲避 .. " "
		end
		if 灵力 ~= 0 and 灵力 ~= nil then
			sx = sx .. "灵力 +" .. 灵力 .. " "
		end
		if 体质 ~= 0 and 体质 ~= nil then
			sx = sx .. "体质 +" .. 体质 .. " "
		end
		if 魔力 ~= 0 and 魔力 ~= nil then
			sx = sx .. "魔力 +" .. 魔力 .. " "
		end
		if 力量 ~= 0 and 力量 ~= nil then
			sx = sx .. "力量 +" .. 力量 .. " "
		end
		if 耐力 ~= 0 and 耐力 ~= nil then
			sx = sx .. "耐力 +" .. 耐力 .. " "
		end
		if 敏捷 ~= 0 and 敏捷 ~= nil then
			sx = sx .. "敏捷 +" .. 敏捷 .. " "
		end
		if 法术伤害 ~= 0 and 法术伤害 ~= nil then
			sx = sx .. "法术伤害 +" .. 法术伤害 .. " "
		end
		if 法术防御 ~= 0 and 法术防御 ~= nil then
			sx = sx .. "法术防御 +" .. 法术防御 .. " "
		end
		if 固定伤害 ~= 0 and 固定伤害 ~= nil then
			sx = sx .. "固定伤害 +" .. 固定伤害 .. " "
		end
		if sx ~= "" then
			文本:置文本("#Y" .. sx)
		end
	elseif zls == 99 then
		文本:置文本("#Y/使用次数："..(item.次数 or "永久"))
	elseif zls == 100 then
	elseif zls == 101 then
		if item.技能=="龙附" or item.技能=="轻如鸿毛" or item.技能=="魔王护持" or item.技能=="盘丝舞" or item.技能=="元阳护体" then
			文本:置文本(string.format("#Y以%s级的%s法术效果在一定时间内强化一件%s", item.等级, item.技能, "武器"))
		elseif item.技能=="嗜血" or item.技能=="莲华妙法" or item.技能=="担山赶月" then --
			文本:置文本(string.format("#Y以%s级的%s法术效果在一定时间内强化一件%s", item.等级, item.技能, "项链"))
		elseif item.技能=="神兵护法" or item.技能=="尸气漫天" then
			文本:置文本(string.format("#Y以%s级的%s法术效果在一定时间内强化一件%s", item.等级, item.技能, "帽子"))
		elseif item.技能=="拈花妙指" or item.技能=="神木呓语" then
			文本:置文本(string.format("#Y以%s级的%s法术效果在一定时间内强化一件%s", item.等级, item.技能, "鞋子"))
		elseif item.技能=="浩然正气" or item.技能=="一气化三清" then
			文本:置文本(string.format("#Y以%s级的%s法术效果在一定时间内强化一件%s", item.等级, item.技能, "衣服"))
		elseif item.技能=="穿云破空" or item.技能=="神力无穷" then
			文本:置文本(string.format("#Y以%s级的%s法术效果在一定时间内强化一件%s", item.等级, item.技能, "腰带"))
		end
	elseif zls == 103 then
		if item.灵气 ~= nil then
			文本:置文本("#Y灵性: " .. item.灵气)
		elseif item.附加参数 ~= nil then
			文本:置文本("#Y灵性: " .. item.附加参数)
		end
	elseif zls == 104 then
		if item.属性 ~= nil then
			文本:置文本("#Y/临时属性: #R"..item.属性)
		else
			文本:置文本("#Y/当前状态: #R未激活")
		end
	elseif zls == 105 then
		if item.特效 then
			local desc="属性随机"
			if item.特效=="躲避" then
				desc="增加20点躲避"
			elseif item.特效=="速度" then
				desc="增加6点速度"
			elseif item.特效=="伤害" then
				desc="增加10点伤害"
			elseif item.特效=="灵力" then
				desc="增加4点灵力"
			elseif item.特效=="防御" then
				desc="增加8点防御"
			elseif item.特效=="气血" then
				desc="增加30点气血"
			end
			if item.子类<=2 then
				文本:置文本("#W/【镶嵌装备】项圈")
				文本:置文本("#Y/等级:"..item.等级..","..desc)
			elseif item.子类==3 or item.子类==4 then
				文本:置文本("#W/【镶嵌装备】护腕")
				文本:置文本("#Y/等级:"..item.等级..","..desc)
			else
				文本:置文本("#W/【镶嵌装备】铠甲")
				文本:置文本("#Y/等级:"..item.等级..","..desc)
			end
		else
			if lv then
				文本:置文本(format("#Y/等级 %s",lv))
			else
				文本:置文本("#Y/（购买后随机生成。)")
			end
		end
	elseif zls == 106 then
		if item.附加参数3 ~= nil then
			文本:置文本("#Y" .. item.附加参数3)
		end
	elseif zls == 107 then
		文本:置文本("#Y/等级："..item.子类)
		文本:置文本("#Y/【可以用于修复神器】")
		if item.特性~="无" then
			local 组合语句="#S/"
			if item.特性=="蔓延" then
				组合语句=组合语句..item.特性.."：放置于上下位置插槽时，额外提升相邻插槽的效果。"
			elseif item.特性=="天平" then
				组合语句=组合语句..item.特性.."：放置于左右位置插槽时，额外提升左右插槽的效果。"
			elseif item.特性=="相生" then
				组合语句=组合语句..item.特性.."：提升相邻相生插槽的效果。"
			elseif item.特性=="相克" then
				组合语句=组合语句..item.特性.."：提升相邻相克插槽的效果。"
			elseif item.特性=="聚气" then
				组合语句=组合语句..item.特性.."：本区域所有特性带来的加成效果将集中在该插槽。"
			elseif item.特性=="金耀" then
				组合语句=组合语句..item.特性.."：提升区域中每个金属性插槽的效果。"
			elseif item.特性=="木耀" then
				组合语句=组合语句..item.特性.."：提升区域中每个木属性插槽的效果。"
			elseif item.特性=="水耀" then
				组合语句=组合语句..item.特性.."：提升区域中每个水属性插槽的效果。"
			elseif item.特性=="火耀" then
				组合语句=组合语句..item.特性.."：提升区域中每个火属性插槽的效果。"
			elseif item.特性=="土耀" then
				组合语句=组合语句..item.特性.."：提升区域中每个土属性插槽的效果。"
			elseif item.特性=="利金" then
				组合语句=组合语句..item.特性.."：放置于金属性插槽时，提升其效果。"
			elseif item.特性=="利木" then
				组合语句=组合语句..item.特性.."：放置于木属性插槽时，提升其效果。"
			elseif item.特性=="利水" then
				组合语句=组合语句..item.特性.."：放置于水属性插槽时，提升其效果。"
			elseif item.特性=="利火" then
				组合语句=组合语句..item.特性.."：放置于火属性插槽时，提升其效果。"
			elseif item.特性=="利土" then
				组合语句=组合语句..item.特性.."：放置于土属性插槽时，提升其效果。"
			end
			文本:置文本(组合语句)
		end
	elseif zls == 111 or zls == 8 then
		if item.名称 == "珍珠" then
			文本:置文本("#Y/等级:" .. item.等级)
		elseif item.名称 == "神兵图鉴" then
			文本:置文本("#W/【功效】" .. "使用可以鉴定等级≤图鉴等级的武器和铠甲")
			if item.等级 then
				文本:置文本("#Y/等级：" .. item.等级)
			end
		elseif item.名称 == "灵宝图鉴" then
			文本:置文本("#W/【功效】" .. "使用可以鉴定等级≤图鉴等级的头盔、腰带、饰品和靴子")
			if item.等级 then
				文本:置文本("#Y/等级：" .. item.等级)
			end
		elseif item.名称 == "灵饰图鉴" then
			文本:置文本("#W/【功效】" .. "使用可以鉴定等级≤图鉴等级的戒指、手镯、耳饰和佩饰")
			if item.等级 then
				文本:置文本("#Y/等级：" .. item.等级)
			end
		end
	elseif zls == 112 and item.装备坐骑 ~= nil then
		文本:置文本("#W【类型】坐骑装饰品")
		文本:置文本("#W【装备坐骑】" .. item.装备坐骑)
		文本:置文本(string.format("#Y境界%s，耐久%s，战斗中增加统驭召唤兽的%s，需要等级%s", item.气血, item.耐久, item.特技, item.等级))
	elseif zls == 115 then
	elseif zls == 154 then
		文本:置文本(string.format("#Y祖传特制超神秘的#R%s#Y的烹饪方法", 秘制食谱子类()[item.子类]))
	elseif zls == 160 then
		文本:置文本("#Y礼包内有" .. item.子类 .. "#Y个" .. item.特效 .. "#Y。打开礼包身上需要保留" .. item.子类 .. "#Y个空位。")
	elseif zls == 163 then
		文本:置文本("#Y/还可以抵御"..item.次数.."次勾魂索PK。")
		文本:置文本(format("#Y/过期时间：%s",os.date("%Y-%m-%d %H:%M:%S",item.限时)))

	elseif zls == 197 then --玄灵珠
			if item.等级==nil then
				item.等级=1
			end
            if item.分类==8  then
                文本["置文本"](文本, ("#S/“召唤”召唤兽或孩子时，恢复回春等级*168气血和6点愤怒。"))
                文本["置文本"](文本, string.format("#Y/等级 " ..item.等级))
            elseif item.分类==9  then
                文本["置文本"](文本, ("#S/“召唤”召唤兽或孩子时，\n#S/有" ..item.等级*10 .."%几率使自身造成的伤害提升" ..item.等级 .."%，持续到战斗结束。"))
                文本["置文本"](文本, string.format("#Y/等级 " ..item.等级))
            elseif item.分类==6  then --空灵
                文本["置文本"](文本, ("#S/佩戴后战斗中生效，\n#S/增加" ..item.等级*1 .."%法伤，持续到战斗结束。"))
                文本["置文本"](文本, string.format("#Y/等级 " ..item.等级))
            elseif item.分类==7  then
                文本["置文本"](文本, ("#S/佩戴后战斗中生效，\n#S/增加" ..item.等级*1 .."%固伤伤害，持续到战斗结束。"))
                文本["置文本"](文本, string.format("#Y/等级 " ..item.等级))
            end

	elseif zls == 203 then
		if item.特效 == nil then
			文本:置文本("#Y随机生成内丹")
		else
			文本:置文本("#Y所带内丹技能:" .. item.特效)
		end
	elseif zls == 204 then
		文本:置文本("#Y等级 " .. item.等级)
		local sx = ""
		local 气血 = item.幻化元身属性.气血
		local 魔法 = item.幻化元身属性.魔法
		local 命中 = item.幻化元身属性.命中
		local 伤害 = item.幻化元身属性.伤害
		local 防御 = item.幻化元身属性.防御
		local 速度 = item.幻化元身属性.速度
		local 躲避 = item.幻化元身属性.躲避
		local 灵力 = item.幻化元身属性.灵力
		local 体质 = item.幻化元身属性.体质
		local 魔力 = item.幻化元身属性.魔力
		local 力量 = item.幻化元身属性.力量
		local 耐力 = item.幻化元身属性.耐力
		local 敏捷 = item.幻化元身属性.敏捷
		if 气血 ~= 0 and 气血 ~= nil and item.分类 ~= 4 then
			sx = sx .. "气血 +" .. 气血 .. " "
		end
		if 魔法 ~= 0 and 魔法 ~= nil then
			sx = sx .. "魔法 +" .. 魔法 .. " "
		end
		if 命中 ~= 0 and 命中 ~= nil and item.分类 ~= 1 then
			sx = sx .. "命中 +" .. 命中 .. " "
		end
		if 伤害 ~= 0 and 伤害 ~= nil and item.分类 ~= 1 then
			sx = sx .. "伤害 +" .. 伤害 .. " "
		end
		if 防御 ~= 0 and 防御 ~= nil then
			sx = sx .. "防御 +" .. 防御 .. " "
		end
		if 速度 ~= 0 and 速度 ~= nil  then
			sx = sx.."速度 +"..速度.." "
		end
		--		if 躲避 ~= 0 and 躲避 ~= nil  then
		--			sx = sx.."躲避 +"..躲避.." "
		--		end
		if 灵力 ~= 0 and 灵力 ~= nil then
			sx = sx .. "灵力 +" .. 灵力 .. " "
		end
		if 敏捷 ~= 0 and 敏捷 ~= nil and item.分类 == 6 then
			sx = sx .. "敏捷 +" .. 敏捷 .. " "
		end
		if sx ~= "" then
			文本:置文本("#Y" .. sx)
		end
		local ds = ""
		if 体质 ~= nil and 体质 ~= 0 then
			ds = ds ..体质
		end
		if 魔力 ~= nil and 魔力 ~= 0 then
			ds = ds ..魔力 
		end
		if 力量 ~= nil and 力量 ~= 0 then
			ds = ds ..力量 
		end
		if 耐力 ~= nil and 耐力 ~= 0 then
			ds = ds ..耐力 
		end
		if 敏捷 ~= nil and 敏捷 ~= 0 then
			ds = ds ..敏捷 
		end
		if ds ~= "" and item.分类 ~= 6 then
			文本:置文本("#G" .. ds)
		end
		if item.特技 ~= nil then
			文本:置文本("#S特技：携带特效")
		end
		if item.特效 ~= nil then
			文本:置文本("#S特效：携带特效")
		end
		if item.幻化次数 ~= nil then
			文本:置文本("#Y幻化次数 " .. item.幻化次数)
		end
	elseif zls == 889 then
		if item.名称=="未激活的符石" then
			文本:置文本("【激活方式】鼠标右键点击使用激活")
			文本:置文本("#Y/当前状态: #R/未激活")
			文本:置文本("#Y/等级 "..item.子类.." "..item.颜色)
			local 组合语句="#Y/"
			for k,v in pairs(item.符石属性) do
				组合语句 = 组合语句..k.." +"..v.."  "
			end
			文本:置文本(组合语句)
		elseif item.名称=="未激活的星石" then
			文本:置文本("#Y/镶嵌部位: "..取星石部位(item.子类))
			文本:置文本("#R/激活后为专用，无法转移给他人。")
			文本:置文本("【激活方式】鼠标右键点击使用激活")
			文本:置文本("#Y/当前状态:#R/未激活")
			文本:置文本("#Y/等级 4")
			文本:置文本("#G/镶嵌在星位后，激活属性")
		elseif item.分类 == 91 and item.类型==nil then
			文本:置文本("#Y/等级 4")
			local ys = 取星位颜色(item.子类)
			文本:置文本("#Y/正面颜色: "..ys[1].." 反面颜色: "..ys[2])
			文本:置文本("#Y/镶嵌部位: "..取星石部位(item.子类))
			文本:置文本("#G/镶嵌于开运装备的星位，穿戴整套镶有星石的装备可触发符石套装效果")
			文本:置文本("#Y/耐久 150")
		elseif item.分类 == 91 and item.类型~=nil then
			文本:置文本("#Y/等级 4")
			local ys = 取星位颜色(item.子类)
			文本:置文本("#Y/颜色: "..ys[item.类型])
			文本:置文本("#Y/镶嵌部位: "..取星石部位(item.子类))
			文本:置文本("#G/镶嵌于开运装备的星位，左键点击翻转")
			文本:置文本("#G/星位: "..item.sx)
			文本:置文本("#Y/耐久 150")
		elseif item.名称=="符石卷轴" then
			文本:置文本("#w/【说明】需要加入此卷轴才可以合成三级符石，在合成过程中会被消耗。")
		else
			文本:置文本("【用途】可镶嵌有开孔数的装备上")
			local 组合语句="#Y/"
			for k,v in pairs(item.符石属性) do
				组合语句 = 组合语句..k.." +"..v.."  "
			end
			文本:置文本("#Y/等级 "..item.子类.."  "..item.颜色)
			文本:置文本(组合语句)
			文本:置文本("#Y/耐久 150")
		end
	elseif zls == 1000 then
		文本:置文本(string.format("【法宝类型】：%s", 取法宝类型(item.子类)))
		文本:置文本(string.format("【法宝等级】：%s级", 数字转大写(item.分类)))
		if item.特技 then
			文本:置文本(string.format("【等级限制】：%s级", item.特技))
			if item.门派限制 then
				文本:置文本(string.format("【限制门派】：%s", item.门派限制))
			end
			文本:置文本(string.format("#Y灵气:#G%d #Y五行:#G%s", item.魔法, item.五行))
			文本:置文本(string.format("#G#Y修炼境界：第#G%d#Y层 %s", item.气血, 取境界(item.气血, item.分类)))
			local xz = ""
			if item.名称 == "月光宝盒" and item.地图 ~= nil then
				xz = string.format("#Y传送至%s(%s,%s),", 取地图名称(item.地图), item.x, item.y)
			end
			if item.使用 == 0 then
				xz = xz .. "需要佩戴才可在战斗中发挥效用"
			elseif item.使用 == 2 then
				xz = xz .. "无需佩戴,非战斗中选择使用"
			else
				xz = xz .. string.format("无需佩戴，在战斗中选择使用，使用回合限制：#G%d#Y", item.角色限制)
			end
			文本:置文本(string.format("#Y%s", xz))
			if item.附灵 then
				local xxx = 取附灵说明(item.附灵,item.附灵等级)
				if xxx then
					文本:置文本(format("#F/%s：%s",item.附灵,xxx))
				end
				if item.附灵等级 then
					文本:置文本(format("#F/灵韵等级：%s",item.附灵等级))
				end
			end
		end
	elseif zls == 193 then
		if item.名称=="本命法宝门派秘籍" then
			if not item.技能  then
                文本["置文本"](文本,"#Y/未鉴定\n#Y/适用门派：#R/"..item.门派)
			else
                文本["置文本"](文本,"#Y/当前效果：#R/"..item.技能)
				if item.数值 then
                    文本:置文本("#Y/具体数值：#R/"..item.数值)	
                end
                文本["置文本"](文本,"#Y/适用门派：#R/"..item.门派)

			end
		end  	
	elseif zls == 1002 then
		local 消耗 = ""
		if item.使用 == 1 then
			消耗 = "1/3/7"
		elseif item.使用 == 2 then
			消耗 = "1"
		elseif item.使用 == 3 then
			消耗 = "全部"
		end
		文本:置文本("#W【使用条件】")
		文本:置文本(string.format("#W%s门派专用，消耗#G%s#W点灵元", item.特技, 消耗))
		文本:置文本("#F【战斗效果】")
		文本:置文本(string.format("#F%s", item.效果))
		文本:置文本(string.format("#Y灵气：#G%s", item.魔法))
		文本:置文本(string.format("#Y修炼境界：第#G%d#Y层 %s", item.气血, 取境界(item.气血, item.分类)))
	elseif zls == 1003 then
		文本:置文本(string.format("#Y五行:#G%s", item.五行))

	elseif zls == "玉魄镶嵌" then
        if item.特技 then
            文本:置文本(format("#S/奇袭特技:%s",item.特技))
        end
        if item.三药 then
            文本:置文本(format("#S/奇袭道具:%s",item.三药))
        end
    elseif zls == "五色灵尘" then
        if item.等级 then
            文本:置文本(format("#Y/等级 %s",item.等级))
        end
    elseif zls == "上古玉魄" then
		if item.特殊属性 then
			local 激活状态 = "#R(未激活)"
			for i = 1, 3 do
				if item[i] and item[i].类型 == item.特殊属性 then
					激活状态 = "#P(已激活)"
					break
				end
			end
			文本:置文本(format("#Y/%s +%s%% %s", item.特殊属性, item.特殊属性值, 激活状态))
        end

        if item[1] then
            文本:置文本(format("#Y/%s +%s",item[1].类型,item[1].数值))
        end
        if item.等级 then
            local sss = item.等级
            文本:置文本(format("#Y/奇袭法术 +%s%%",sss))
        end
        if item.耐久 then
            文本:置文本(format("#Y/耐久度 %s",item.耐久))
        end
        if item.等级 then
            文本:置文本(format("#Y/灵尘等级 %s",item.等级))
        end
        for n=2,3 do
            local x宝石 = ""
            if item.宝石 and item.宝石[n-1] then
                x宝石 = "#F[+" ..item.宝石[n-1] .."]"
            end
            if item[n] then
                文本:置文本(format("#G/%s +%s " ..x宝石,item[n].类型,item[n].数值))
            end
        end
        if item.特技 then
            for n=1,3 do
                if item.特技[n] then
                    文本:置文本(format("#S/奇袭特技:%s",item.特技[n]))
                end
            end
        end
        if item.三药 then
            for n=1,3 do
                if item.三药[n] then
                    文本:置文本(format("#S/奇袭道具:%s",item.三药[n]))
                end
            end
        end
        if item.特效 then
            文本:置文本(format("#S/%s +%s%%",item.特效,item.特效值))
        end

	elseif zls == 2000 then
		文本:置文本(string.format("#Y【基本伤害】:#G%s", item.分类))
		if item.追加状态 then 文本:置文本(string.format("#Y%s", item.追加状态)) end
		if item.追加伤害 then 文本:置文本(string.format("#Y追加伤害%s", item.追加伤害)) end
		if item.耐久度 then 文本:置文本(string.format("#Y耐久度：%s", item.耐久度)) end
	elseif zls == "耻辱函" then
		if item.名称 == "耻辱函" then
			文本:置文本(string.format("#R【时间】:#Y%s", 时间转换3(item.时间)))
			文本:置文本(string.format("#R【仇人】:#Y%s", item.杀人名称))
			文本:置文本(string.format("#R【ID】:#Y%s", item.id))
		end
	elseif zls == "装备礼包" then
		if item.等级 then
			文本:置文本("#Y/等级:" .. item.等级)
		end
		if item.等级 and item.名称 == "装备礼包" then
			文本:置文本("#Y" .. item.等级 .. "级全套无级别")
		end
	elseif zls == "银票" then
		if item.银子 then
			文本:置文本("#Y/可获得" .. (item.银子 / 100000000) .. "E银子")
		end
	elseif zls == "拓本" then
		if item.造型 then
			文本:置文本(string.format("#R【已拓印】:#Y%s", item.造型))
		else
			文本:置文本(string.format("#R【未拓印】"))
		end
	elseif zls == "神形" then
		if item.神形 then
			文本:置文本(string.format("#R【已拓印】:#Y%s", item.神形[1]))
			if item.神形[1] == "伤害" then
				文本:置文本(string.format("#R【使用种类】: #Y 武器"))
				文本:置文本(string.format("#G伤害增加: #R%s", item.神形[2]))
			elseif item.神形[1] == "灵力" then
				文本:置文本(string.format("#R【使用种类】: #Y 项链"))
				文本:置文本(string.format("#G:灵力增加 #R%s", item.神形[2]))
			elseif item.神形[1] == "气血" then
				文本:置文本(string.format("#R【使用种类】: #Y 腰带"))
				文本:置文本(string.format("#G:气血增加 #R%s", item.神形[2]))
			elseif item.神形[1] == "速度" then
				文本:置文本(string.format("#R【使用种类】: #Y 鞋子"))
				文本:置文本(string.format("#G:速度增加 #R%s", item.神形[2]))
			elseif item.神形[1] == "防御" then
				文本:置文本(string.format("#R【使用种类】: #Y 衣服"))
				文本:置文本(string.format("#G:防御增加 #R%s", item.神形[2]))
			elseif item.神形[1] == "法术暴击率" then
				文本:置文本(string.format("#R【使用种类】: #Y 头盔"))
				文本:置文本(string.format("#G:法术暴击率增加 #R%s%s", item.神形[2], "%"))
			elseif item.神形[1] == "物理暴击率" then
				文本:置文本(string.format("#R【使用种类】: #Y 头盔"))
				文本:置文本(string.format("#G:物理暴击率增加 #R%s%s", item.神形[2], "%"))
			else
				文本:置文本(string.format("#R【使用种类】: #Y 武器"))
				if item.神形[1] == "狮驼岭" then
					文本:置文本("#G使用鹰击技能时有 #R" .. item.神形[2] .. "% #G概率目标+1")
				elseif item.神形[1] == "大唐官府" then
					文本:置文本("#G使用横扫技能时有 #R" .. item.神形[2] .. "% #G概率回合无需休息，且血量限制由50%降低到30%")
				elseif item.神形[1] == "化生寺" then
					文本:置文本("#G使用加血技能时有 #R" .. item.神形[2] .. "% #G概率使恢复量提高50%")
				elseif item.神形[1] == "女儿村" then
					文本:置文本("#G封印命中率提升 #R" .. item.神形[2] .. "% #G、封印技能发送时增加#R" .. item.神形[3] .. "% #G愤怒")
				elseif item.神形[1] == "方寸山" then
					文本:置文本("#G使用封印技能时有 #R" .. item.神形[2] .. "% #G概率目前+1")
				elseif item.神形[1] == "普陀山" then
					文本:置文本("#G普渡众生额外增加1个目标，回血量提升50%，并有#R" .. item.神形[2] .. "% #G概率提高目标造成伤害的10%")
				elseif item.神形[1] == "魔王寨" then
					文本:置文本("#G使用飞砂走石技能时有#R" .. item.神形[2] .. "% #G概率触发三昧真火，但只有正常伤害结果的70%")
				elseif item.神形[1] == "龙宫" then
					文本:置文本("#G使用龙卷雨击技能时有#R" .. item.神形[2] .. "% #G概率触发法术连接，但是只有正常伤害值的50%")
				elseif item.神形[1] == "阴曹地府" then
					文本:置文本("#G每回合#R" .. item.神形[2] .. "% #G概率免疫首次伤害，且物理攻击必中")
				elseif item.神形[1] == "盘丝洞" then
					文本:置文本("#G使用魔音摄魂技能时必中，且有#R" .. item.神形[2] .. "% #G概率封印法术，且技能无法被解开")
				elseif item.神形[1] == "五庄观" then
					文本:置文本("#G使用生命之泉技能时#R" .. item.神形[2] .. "% #G概率持续恢复量加倍")
				elseif item.神形[1] == "天宫" then
					文本:置文本("#G解开天雷斩PVP秒1的限制，并且有#R" .. item.神形[2] .. "% #G概率提高10%伤害")
				elseif item.神形[1] == "神木林" then
					文本:置文本("#G施放法攻技能时有#R" .. item.神形[2] .. "% #G概率忽视目标20%法术防御")
				elseif item.神形[1] == "凌波城" then
					文本:置文本("#G释放技能时有#R" .. item.神形[2] .. "% #G概率不消耗战意")
				elseif item.神形[1] == "无底洞" then
					文本:置文本("#G地涌金莲额外添加2个目标，并且有#R" .. item.神形[2] .. "% #G概率无视盘丝禁回血效果")
				end
			end
		else
			文本:置文本(string.format("#R【未拓印】"))
		end
	elseif zls == "装备礼包" then
		if item.等级 then
			文本:置文本(string.format("#Y等级：" .. item.等级))
		end
	elseif zls == "附魔宝珠" then
		if item.类型 then
			文本:置文本(string.format("#Y附加类型：" .. item.类型))
		end
	end
	if item.限时时间 then
		文本:置文本("#Y/有效期至：%s",os.date("%Y-%m-%d %H:%M:%S",item.限时时间))
		if os.time() - item.限时时间 >= 0 then
			文本:置文本("#R/已过期")
		end
	end

	if 资质道具[item.名称] then
		local 资质=资质道具[item.名称].资质
		local 加成=资质道具[item.名称].加成
		  if 资质=="成长" then
		  	加成="随机增加0.001--"..(加成/500)
		  else
		  	加成="随机增加1--"..加成
			end
		文本:置文本(资质..":"..加成)
		文本:置文本("#R最高:"..资质道具[item.名称].上限)
	
	end
	if item.限时 and zls ~= 163 then
		文本:置文本("#R/限时"..item.限时.."天")
	end
end

function __每日提示(lshs, 名称)
	lshs:置文本("")
	if 名称 == "如梦奇谭之五更寒" then
		lshs:置文本("#Y五更寒".."（".."如梦奇谭".."）")
		lshs:置文本("等级限制：角色等级".."≥".."30".."级")
		lshs:置文本("副本人数：".."5".."人")
		lshs:置文本("难度：".."★★★")
		lshs:置文本("传送人：".."建邺城(16,18)癫散班主（需要在建邺城（47,12）购买戏票）")
	elseif 名称 == "天命乌鸡" then
		lshs:置文本("#Y".."天命乌鸡".."（".."天命副本".."）")
		lshs:置文本("等级限制：角色等级".."≥".."60".."级")
		lshs:置文本("副本人数：".."5".."人")
		lshs:置文本("难度：".."★★")
		lshs:置文本("传送人：".."长安城副本官员")
	elseif 名称 == "天命石猴" then
		lshs:置文本("#Y".."天命石猴".."（".."天命副本".."）")
		lshs:置文本("等级限制：角色等级".."≥".."60".."级")
		lshs:置文本("副本人数：".."5".."人")
		lshs:置文本("难度：".."★★")
		lshs:置文本("传送人：".."长安城副本官员")
	elseif 名称 == "天命通天" then
		lshs:置文本("#Y".."天命通天".."（".."天命副本".."）")
		lshs:置文本("等级限制：角色等级".."≥".."60".."级")
		lshs:置文本("副本人数：".."5".."人")
		lshs:置文本("难度：".."★★")
		lshs:置文本("传送人：".."长安城副本官员")
	elseif 名称 == "天命金兜洞" then
		lshs:置文本("#Y".."天命金兜洞".."（".."天命副本".."）")
		lshs:置文本("等级限制：角色等级".."≥".."60".."级")
		lshs:置文本("副本人数：".."5".."人")
		lshs:置文本("难度：".."★★")
		lshs:置文本("传送人：".."长安城副本官员")
	elseif 名称 == "天命大闹" then
		lshs:置文本("#Y".."天命大闹".."（".."天命副本".."）")
		lshs:置文本("等级限制：角色等级".."≥".."60".."级")
		lshs:置文本("副本人数：".."5".."人")
		lshs:置文本("难度：".."★★")
		lshs:置文本("传送人：".."长安城副本官员")
	elseif 名称 == "天命水陆" then
		lshs:置文本("#Y".."天命水陆".."（".."天命副本".."）")
		lshs:置文本("等级限制：角色等级".."≥".."60".."级")
		lshs:置文本("副本人数：".."5".."人")
		lshs:置文本("难度：".."★★")
		lshs:置文本("传送人：".."长安城副本官员")
	elseif 名称 == "天命红孩儿" then
		lshs:置文本("#Y".."天命红孩儿".."（".."天命副本".."）")
		lshs:置文本("等级限制：角色等级".."≥".."60".."级")
		lshs:置文本("副本人数：".."5".."人")
		lshs:置文本("难度：".."★★")
		lshs:置文本("传送人：".."长安城副本官员")
	elseif 名称 == "天命秘境" then
		lshs:置文本("#Y".."天命秘境".."（".."天命副本".."）")
		lshs:置文本("等级限制：角色等级".."≥".."60".."级")
		lshs:置文本("副本人数：".."5".."人")
		lshs:置文本("难度：".."★★")
		lshs:置文本("传送人：".."长安城副本官员")
	elseif 名称 == "如梦奇谭之双城记" then
		lshs:置文本("#Y双城记".."（".."如梦奇谭".."）")
		lshs:置文本("等级限制：角色等级".."≥".."30".."级")
		lshs:置文本("副本人数：".."5".."人")
		lshs:置文本("难度：".."★★★")
		lshs:置文本("传送人：".."建邺城(16,18)癫散班主（需要在建邺城（47,12）购买戏票）")
	elseif 名称 == "如梦奇谭之一斛珠" then
		lshs:置文本("#Y一斛珠".."（".."如梦奇谭".."）")
		lshs:置文本("等级限制：角色等级".."≥".."30".."级")
		lshs:置文本("副本人数：".."5".."人")
		lshs:置文本("难度：".."★★★")
		lshs:置文本("传送人：".."建邺城(16,18)癫散班主（需要在建邺城（47,12）购买戏票）")
	elseif 名称 == "泾河龙王2" then
		lshs:置文本("#Y泾河龙王2" .. "（" .. "普通副本" .. "）")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "70" .. "级")
		lshs:置文本("副本人数：" .. "5" .. "人")
		lshs:置文本("难度：" .. "★")
		lshs:置文本("传送人：" .. "金銮殿(70,40)魏征")
	elseif 名称 == "初出茅庐" then
		lshs:置文本("#Y初出茅庐" .. "（" .. "新手副本" .. "）")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "30" .. "级")
		lshs:置文本("副本人数：" .. "5" .. "人")
		lshs:置文本("难度：" .. "☆")
		lshs:置文本("传送人：" .. "长安城(391,48)王夫人")
	elseif 名称 == "车迟斗法" then
		lshs:置文本("#Y初出茅庐" .. "（" .. "新手副本" .. "）")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "70" .. "级")
		lshs:置文本("副本人数：" .. "5" .. "人")
		lshs:置文本("难度：" .. "★")
		lshs:置文本("传送人：" .. "长寿村(132,67)慧觉和尚")
	elseif 名称 == "四季" then
		lshs:置文本("#Y四级" .. "（" .. "特殊副本" .. "）")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "60" .. "级")
		lshs:置文本("副本人数：" .. "5" .. "人")
		lshs:置文本("难度：" .. "★")
		lshs:置文本("传送人：" .. "朱紫国(150,6)豆蔻囤文")
	elseif 名称 == "五庄观" then
		lshs:置文本("#Y五庄观" .. "（" .. "普通副本" .. "）")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "70" .. "级")
		lshs:置文本("副本人数：" .. "5" .. "人")
		lshs:置文本("难度：" .. "★")
		lshs:置文本("传送人：" .. "五庄观(63,32)明月")
	elseif 名称 == "水陆大会" then
		lshs:置文本("#Y水陆大会" .. "（" .. "普通副本" .. "）")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "50" .. "级")
		lshs:置文本("副本人数：" .. "5" .. "人")
		lshs:置文本("难度：" .. "★")
		lshs:置文本("传送人：" .. "化生寺(32,15疥癞和尚")
	elseif 名称 == "乌鸡国" then
		lshs:置文本("#Y" .. "乌鸡国" .. "（" .. "普通副本" .. "）")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "50" .. "级")
		lshs:置文本("副本人数：" .. "5" .. "人")
		lshs:置文本("难度：" .. "★")
		lshs:置文本("传送人：" .. "国子监书库(27.34)美举人")
	elseif 名称 == "石猴授徒" then
		lshs:置文本("#Y" .. "石猴授徒" .. "（" .. "普通副本" .. "）")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "60" .. "级")
		lshs:置文本("副本人数：" .. "5" .. "人")
		lshs:置文本("难度：" .. "★☆")
		lshs:置文本("传送人：" .. "大唐境外(94,90山贼头子")
	elseif 名称 == "猴王出世" then
		lshs:置文本("#Y" .. "猴王出世" .. "（" .. "普通副本" .. "）")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "50" .. "级")
		lshs:置文本("副本人数：" .. "5" .. "人")
		lshs:置文本("难度：" .. "★★")
		lshs:置文本("传送人：" .. "傲来国(193,131)金毛猿")
	elseif 名称 == "平顶山" then
		lshs:置文本("#Y" .. "平顶山" .. "（" .. "普通副本" .. "）")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "70" .. "级")
		lshs:置文本("副本人数：" .. "5" .. "人")
		lshs:置文本("难度：" .. "★★")
		lshs:置文本("传送人：" .. "长寿郊外(44,130路人甲")
	elseif 名称 == "前世今生2" then
		lshs:置文本("#Y" .. "前世今生2" .. "（" .. "普通副本" .. "）")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "70" .. "级")
		lshs:置文本("副本人数：" .. "5" .. "人")
		lshs:置文本("难度：" .. "★★")
		lshs:置文本("传送人：" .. "地府(100,24)孟婆")
	elseif 名称 == "齐天大圣" then
		lshs:置文本("#Y" .. "齐天大圣" .. "（" .. "普通副本" .. "）")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "80" .. "级")
		lshs:置文本("副本人数：" .. "5" .. "人")
		lshs:置文本("难度：" .. "★★")
		lshs:置文本("传送人：" .. "傲来国(193,131金毛猿")
	elseif 名称 == "金兜洞兕大王" then
		lshs:置文本("#Y" .. "金兜洞兕大王" .. "（" .. "普通副本" .. "）")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "80" .. "级")
		lshs:置文本("副本人数：" .. "5" .. "人")
		lshs:置文本("难度：" .. "★★☆")
		lshs:置文本("传送人：" .. "西梁女国(38,97)西门将军")
	elseif 名称 == "七绝山" then
		lshs:置文本("#Y" .. "七绝山" .. "（" .. "普通副本" .. "）")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "80" .. "级")
		lshs:置文本("副本人数：" .. "5" .. "人")
		lshs:置文本("难度：" .. "★★☆")
		lshs:置文本("传送人：" .. "大唐境外(86,75牛将军")
	elseif 名称 == "天火之殇上部" then
		lshs:置文本("#Y" .. "天火之殇上部" .. "（" .. "普通副本" .. "）")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "100" .. "级")
		lshs:置文本("副本人数：" .. "5" .. "人")
		lshs:置文本("难度：" .. "★★☆")
		lshs:置文本("传送人：" .. "傲来国民居(15,14文老伯")
	elseif 名称 == "黑风山" then
		lshs:置文本("#Y" .. "黑风山" .. "（" .. "侠士副本" .. "）")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "60" .. "级")
		lshs:置文本("副本人数：" .. "5" .. "人")
		lshs:置文本("难度：" .. "★★★")
		lshs:置文本("传送人：" .. "大唐国境(64.67小二")
	elseif 名称 == "无底洞" then
		lshs:置文本("#Y" .. "无底洞" .. "（" .. "侠士副本" .. "）")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "90" .. "级")
		lshs:置文本("副本人数：" .. "5" .. "人")
		lshs:置文本("难度：" .. "★★★")
		lshs:置文本("传送人：" .. "西梁女国(82,88)慕容婆婆")
	elseif 名称 == "通天河" then
		lshs:置文本("#Y" .. "通天河" .. "（" .. "侠士副本" .. "）")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "80" .. "级")
		lshs:置文本("副本人数：" .. "5" .. "人")
		lshs:置文本("难度：" .. "★★★")
		lshs:置文本("传送人：" .. "长寿村(50,135蝴蝶女")
	elseif 名称 == "敦煌夜谭上部" then
		lshs:置文本("#Y" .. "敦煌夜谭上部" .. "（" .. "侠士副本" .. "）")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "50" .. "级")
		lshs:置文本("副本人数：" .. "5" .. "人")
		lshs:置文本("难度：" .. "★★★")
		lshs:置文本("传送人：" .. "丝绸之路(160.9)佛窟传送人")
	elseif 名称 == "西域宝藏" then
		lshs:置文本("#Y" .. "西域宝藏" .. "（" .. "特殊副本" .. "）")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "50" .. "级")
		lshs:置文本("副本人数：" .. "5" .. "人")
		lshs:置文本("难度：" .. "★★★")
		lshs:置文本("传送人：" .. "长安城(150,189)琵琶胡姬")
	elseif 名称 == "（侠）水陆大会" then
		lshs:置文本("#Y" .. "（侠）水陆大会" .. "（" .. "侠士副本" .. "）")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "60" .. "级")
		lshs:置文本("副本人数：" .. "5" .. "人")
		lshs:置文本("难度：" .. "★★★")
		lshs:置文本("传送人：" .. "化生寺(32,15)疥癞和尚")
	elseif 名称 == "红孩儿" then
		lshs:置文本("#Y" .. "红孩儿" .. "（" .. "侠士副本" .. "）")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "80" .. "级")
		lshs:置文本("副本人数：" .. "5" .. "人")
		lshs:置文本("难度：" .. "★★★")
		lshs:置文本("传送人：" .. "麒麟山(177,36红孩儿")
	elseif 名称 == "大闹天宫" then
		lshs:置文本("#Y" .. "大闹天宫" .. "（" .. "侠士副本" .. "）")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "100" .. "级")
		lshs:置文本("副本人数：" .. "5" .. "人")
		lshs:置文本("难度：" .. "★★★")
		lshs:置文本("传送人：" .. "长寿村(53,18太白金星")
	elseif 名称 == "后裔陵墓上部" then
		lshs:置文本("#Y" .. "" .. "（" .. "侠士副本" .. "）")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "50" .. "级")
		lshs:置文本("副本人数：" .. "5" .. "人")
		lshs:置文本("难度：" .. "★★★☆")
		lshs:置文本("传送人：" .. "长寿郊外(182,14)鬼谷道士")
	elseif 名称 == "秘境降妖" then
		lshs:置文本("#Y" .. "秘境降妖" .. "（" .. "侠士副本" .. "）")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "50" .. "级")
		lshs:置文本("副本人数：" .. "5" .. "人")
		lshs:置文本("难度：" .. "★★★☆")
		lshs:置文本("传送人：" .. "长安城(102.227御林军左统领")
	elseif 名称 == "天火之殇下部" then
		lshs:置文本("#Y" .. "" .. "（" .. "侠士副本" .. "）")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "100" .. "级")
		lshs:置文本("副本人数：" .. "5" .. "人")
		lshs:置文本("难度：" .. "★★★☆")
		lshs:置文本("传送人：" .. "天宫(26,24)太上老君")
	elseif 名称 == "敦煌夜谭下部" then
		lshs:置文本("#Y" .. "敦煌夜谭下部" .. "（" .. "侠士副本" .. "）")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "50" .. "级")
		lshs:置文本("副本人数：" .. "5" .. "人")
		lshs:置文本("难度：" .. "★★★")
		lshs:置文本("传送人：" .. "丝绸之路(160.9)佛窟传送人")
	elseif 名称 == "后羿陵墓下部" then
		lshs:置文本("#Y" .. "后羿陵墓下部" .. "（" .. "侠士副本" .. "）")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "50" .. "级")
		lshs:置文本("副本人数：" .. "5" .. "人")
		lshs:置文本("难度：" .. "★★★★")
		lshs:置文本("传送人：" .. "长寿郊外(182,14)鬼谷道士")
	elseif 名称 == "轮回镜" then
		lshs:置文本("#Y" .. "轮回镜" .. "（" .. "侠士副本" .. "）")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "170" .. "级")
		lshs:置文本("副本人数：" .. "5" .. "人")
		lshs:置文本("难度：" .. "★★★★")
		lshs:置文本("传送人：" .. "小雷音寺曾书生")
	elseif 名称 == "调皮的泡泡" then
		lshs:置文本("#Y" .. "调皮的泡泡")
		lshs:置文本("活动时间：" .. "全天")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "10" .. "级")
		lshs:置文本("是否组队：" .. "组队活动")
		lshs:置文本("难度：" .. "★")
	elseif 名称 == "四圣兽" then
		lshs:置文本("#Y" .. "四圣兽")
		lshs:置文本("活动时间：" .. "全天")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "30" .. "级")
		lshs:置文本("是否组队：" .. "组队活动")
		lshs:置文本("难度：" .. "★★")
	elseif 名称 == "天庭叛逆" then
		lshs:置文本("#Y" .. "天庭叛逆")
		lshs:置文本("活动时间：" .. "全天")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "80" .. "级")
		lshs:置文本("是否组队：" .. "组队活动")
		lshs:置文本("难度：" .. "★★★")
	elseif 名称 == "天界叛仙" then
		lshs:置文本("#Y" .. "天界叛仙")
		lshs:置文本("活动时间：" .. "全天")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "80" .. "级")
		lshs:置文本("是否组队：" .. "组队活动")
		lshs:置文本("难度：" .. "★★★")
	elseif 名称 == "后天神祇" then
		lshs:置文本("#Y" .. "后天神祇")
		lshs:置文本("活动时间：" .. "全天")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "100" .. "级")
		lshs:置文本("是否组队：" .. "组队活动")
		lshs:置文本("难度：" .. "★★★")
	elseif 名称 == "烛龙之子" then
		lshs:置文本("#Y" .. "烛龙之子")
		lshs:置文本("活动时间：" .. "全天")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "155" .. "级")
		lshs:置文本("是否组队：" .. "组队活动")
		lshs:置文本("难度：" .. "★★★★")
	elseif 名称 == "蚩尤部下" then
		lshs:置文本("#Y" .. "蚩尤部下")
		lshs:置文本("活动时间：" .. "全天")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "80" .. "级")
		lshs:置文本("是否组队：" .. "组队活动")
		lshs:置文本("难度：" .. "★★★★")
	elseif 名称 == "年兽" then
		lshs:置文本("#Y" .. "年兽")
		lshs:置文本("活动时间：" .. "全天")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "50" .. "级")
		lshs:置文本("是否组队：" .. "组队活动")
		lshs:置文本("难度：" .. "★★")
	elseif 名称 == "福禄仙人" then
		lshs:置文本("#Y" .. "福禄仙人")
		lshs:置文本("活动时间：" .. "全天")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "50" .. "级")
		lshs:置文本("是否组队：" .. "组队活动")
		lshs:置文本("难度：" .. "★★")
	elseif 名称 == "师门任务" then
		lshs:置文本("#Y" .. "师门任务")
		lshs:置文本("活动时间：" .. "全天")
		lshs:置文本("活动NPC：" .. "门派师父")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "20" .. "级")
		lshs:置文本("是否组队：" .. "单人活动")
		lshs:置文本("难度：" .. "★")
	elseif 名称 == "钟馗捉鬼" then
		lshs:置文本("#Y" .. "钟馗捉鬼")
		lshs:置文本("活动时间：" .. "全天")
		lshs:置文本("活动NPC：" .. "地府(44,56)钟道")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "40" .. "级")
		lshs:置文本("是否组队：" .. "组队活动")
		lshs:置文本("难度：" .. "★")
	elseif 名称 == "七色玲珑石" then
		lshs:置文本("#Y" .. "七色玲珑石")
		lshs:置文本("活动时间：" .. "全天")
		lshs:置文本("活动NPC：" .. "宝象国(102,79北斗星君")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "30" .. "级")
		lshs:置文本("是否组队：" .. "单人活动")
		lshs:置文本("难度：" .. "★★")
	elseif 名称 == "运镖任务" then
		lshs:置文本("#Y" .. "运镖活动")
		lshs:置文本("活动时间：" .. "全天")
		lshs:置文本("活动NPC：" .. "长风镖局内郑镖头")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "30" .. "级")
		lshs:置文本("是否组队：" .. "组队活动")
		lshs:置文本("难度：" .. "★★")
	elseif 名称 == "黑无常抓鬼" then
		lshs:置文本("#Y" .. "黑无常抓鬼")
		lshs:置文本("活动时间：" .. "全天")
		lshs:置文本("活动NPC：" .. "轮回司(36,15)黑无常")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "100" .. "级")
		lshs:置文本("是否组队：" .. "组队活动")
		lshs:置文本("难度：" .. "★")
	elseif 名称 == "封妖任务" then
		lshs:置文本("#Y" .. "封妖任务")
		lshs:置文本("活动时间：" .. "全天")
		lshs:置文本("活动NPC：" .. "长风镖局内郑镖头")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "20" .. "级")
		lshs:置文本("是否组队：" .. "组队活动")
		lshs:置文本("难度：" .. "★★")
	elseif 名称 == "江湖任务" then
		lshs:置文本("#Y" .. "江湖任务")
		lshs:置文本("活动时间：" .. "全天")
		lshs:置文本("活动NPC：" .. "长安城杜少海(405,211)")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "25" .. "级")
		lshs:置文本("是否组队：" .. "组队活动")
		lshs:置文本("难度：" .. "★")
	elseif 名称 == "香飘飘任务" then
		lshs:置文本("#Y" .. "香飘飘任务")
		lshs:置文本("活动时间：" .. "全天")
		lshs:置文本("活动NPC：" .. "朱紫国酒店老板")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "25" .. "级")
		lshs:置文本("是否组队：" .. "单人活动")
		lshs:置文本("难度：" .. "★")
	elseif 名称 == "赏金任务" then
		lshs:置文本("#Y" .. "赏金任务")
		lshs:置文本("活动时间：" .. "全天")
		lshs:置文本("活动NPC：" .. "建业城赵捕头")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "10" .. "级")
		lshs:置文本("是否组队：" .. "组队活动")
		lshs:置文本("难度：" .. "★")
	elseif 名称 == "门派闯关" then
		lshs:置文本("#Y" .. "门派闯关")
		lshs:置文本("活动时间：" .. "20：00~22：00")
		lshs:置文本("活动NPC：" .. "长安城门派闯关活动使者")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "50" .. "级")
		lshs:置文本("是否组队：" .. "组队活动")
		lshs:置文本("难度：" .. "★")
	elseif 名称 == "皇宫飞贼" then
		lshs:置文本("#Y" .. "皇宫飞贼")
		lshs:置文本("活动时间：" .. "12：00~14：00")
		lshs:置文本("活动NPC：" .. "长安城御林军左统领")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "50" .. "级")
		lshs:置文本("是否组队：" .. "组队活动")
		lshs:置文本("难度：" .. "★")
	elseif 名称 == "游泳比赛" then
		lshs:置文本("#Y" .. "游泳比赛")
		lshs:置文本("活动时间：" .. "10：00~20：00")
		lshs:置文本("活动NPC：" .. "傲来国报名官")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "50" .. "级")
		lshs:置文本("是否组队：" .. "组队活动")
		lshs:置文本("难度：" .. "★")
	elseif 名称 == "宝藏山" then
		lshs:置文本("#Y" .. "宝藏山")
		lshs:置文本("活动时间：" .. "20：00~21：00")
		lshs:置文本("活动NPC：" .. "宝象国土地")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "50" .. "级")
		lshs:置文本("是否组队：" .. "单人活动")
		lshs:置文本("难度：" .. "★")
	elseif 名称 == "长风镖王" then
		lshs:置文本("#Y" .. "长风镖王")
		lshs:置文本("活动时间：" .. "20：00~21：00")
		lshs:置文本("活动NPC：" .. "长风镖局郑镖头")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "50" .. "级")
		lshs:置文本("是否组队：" .. "组队活动")
		lshs:置文本("难度：" .. "★")
	elseif 名称 == "科举" then
		lshs:置文本("#Y" .. "科举")
		lshs:置文本("活动时间：" .. "10：00~20：00")
		lshs:置文本("活动NPC：" .. "长安城礼部侍郎")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "50" .. "级")
		lshs:置文本("是否组队：" .. "单人活动")
		lshs:置文本("难度：" .. "★")
	elseif 名称 == "军阵威仪" then
		lshs:置文本("#Y" .. "军阵威仪")
		lshs:置文本("活动时间：" .. "10：00~20：00")
		lshs:置文本("活动NPC：" .. "长安城礼部尚书")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "50" .. "级")
		lshs:置文本("是否组队：" .. "组队活动")
		lshs:置文本("难度：" .. "★")
	elseif 名称 == "月影觅仙踪（奔月）" then
		lshs:置文本("#Y" .. "月影觅仙踪（奔月）")
		lshs:置文本("活动时间：" .. "10：00~20：00")
		lshs:置文本("活动NPC：" .. "长安城婵娟")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "50" .. "级")
		lshs:置文本("是否组队：" .. "组队活动")
		lshs:置文本("难度：" .. "★")
	elseif 名称 == "幻域迷宫" then
		lshs:置文本("#Y" .. "幻域迷宫")
		lshs:置文本("活动时间：" .. "20：00~22：00")
		lshs:置文本("活动NPC：" .. "傲来国金毛猿")
		lshs:置文本("等级限制：角色等级" .. "≥" .. "50" .. "级")
		lshs:置文本("是否组队：" .. "组队活动")
		lshs:置文本("难度：" .. "★")

	elseif 名称 == "天降辰星" then
		lshs:置文本("#Y".."天降辰星")
		lshs:置文本("活动时间：".."10：00~11：30")
		lshs:置文本("活动NPC：".."长安城(130,96)")
		lshs:置文本("等级限制：角色等级".."≥".."50".."级")
		lshs:置文本("是否组队：".."组队活动")
		lshs:置文本("难度：".."★★")
	elseif 名称 == "文韵墨香" then
		lshs:置文本("#Y".."文韵墨香")
		lshs:置文本("活动时间：".."15：00~16：30")
		lshs:置文本("活动NPC：".."长安城(232,167)")
		lshs:置文本("等级限制：角色等级".."≥".."50".."级")
		lshs:置文本("是否组队：".."组队活动")
		lshs:置文本("难度：".."★★")
	elseif 名称 == "彩虹争霸" then
		lshs:置文本("#Y".."彩虹争霸")
		lshs:置文本("活动时间：".."周135/20：00~21：30")
		lshs:置文本("活动NPC：".."朱紫国(103,45)")
		lshs:置文本("等级限制：角色等级".."≥".."50".."级")
		lshs:置文本("是否组队：".."组队活动")
		lshs:置文本("难度：".."★★")
	elseif 名称 == "降妖伏魔" then
		lshs:置文本("#Y".."降妖伏魔")
		lshs:置文本("活动时间：".."周246/20：00~21：30")
		lshs:置文本("等级限制：角色等级".."≥".."50".."级")
		lshs:置文本("是否组队：".."组队活动")
		lshs:置文本("难度：".."★★")
	elseif 名称 == "帮派迷宫" then
		lshs:置文本("#Y".."帮派迷宫")
		lshs:置文本("活动时间：".."19：00~20：30")
		lshs:置文本("活动NPC：".."帮派土地公公")
		lshs:置文本("等级限制：角色等级".."≥".."50".."级")
		lshs:置文本("是否组队：".."组队活动")
		lshs:置文本("难度：".."★")
	elseif 名称 == "长安保卫战" then
		lshs:置文本("#Y".."长安保卫战")
		lshs:置文本("活动时间：".."17：00~18：30")
		lshs:置文本("等级限制：角色等级".."≥".."50".."级")
		lshs:置文本("是否组队：".."组队活动")
		lshs:置文本("难度：".."★★")
	elseif 名称 == "比武大会" then
		lshs:置文本("#Y".."比武大会")
		lshs:置文本("活动时间：".."周六/21：00~22：30")
		lshs:置文本("活动NPC：".."长安城(113,169)")
		lshs:置文本("等级限制：角色等级".."≥".."50".."级")
		lshs:置文本("是否组队：".."组队活动")
		lshs:置文本("难度：".."★★★★★")
	elseif 名称 == "剑会" then
		lshs:置文本("#Y".."剑会")
		lshs:置文本("活动时间：".."周日/21：00~22：30")
		lshs:置文本("活动NPC：".."长安城(145,177)")
		lshs:置文本("等级限制：角色等级".."≥".."50".."级")
		lshs:置文本("是否组队：".."组队活动")
		lshs:置文本("难度：".."★★★★★")
	elseif 名称 == "帮战" then
		lshs:置文本("#Y".."帮战")
		lshs:置文本("活动时间：".."周五/21：00~22：30")
		lshs:置文本("活动NPC：".."长安城(367,159)")
		lshs:置文本("等级限制：角色等级".."≥".."50".."级")
		lshs:置文本("是否组队：".."组队活动")
		lshs:置文本("难度：".."★★★★★")
	elseif 名称 == "地煞星" then
		lshs:置文本("#Y".."地煞星")
		lshs:置文本("活动时间：".."全天")
		lshs:置文本("等级限制：角色等级".."≥".."60".."级")
	    	lshs:置文本("人数：".."5".."人")
		lshs:置文本("难度：".."★★★★★")
		lshs:置文本("刷新时间：".."整点")
	elseif 名称 == "天罡星" then
		lshs:置文本("#Y".."天罡星")
		lshs:置文本("活动时间：".."全天")
		lshs:置文本("等级限制：角色等级".."≥".."60".."级")
	    	lshs:置文本("人数：".."5".."人")
		lshs:置文本("难度：".."★★★★★")
		lshs:置文本("刷新时间：".."半点")
	elseif 名称 == "十二生肖" then
		lshs:置文本("#Y".."十二生肖")
		lshs:置文本("活动时间：".."全天")
		lshs:置文本("等级限制：角色等级".."≥".."60".."级")
	    	lshs:置文本("人数：".."5".."人")
		lshs:置文本("难度：".."★★★★★")
		lshs:置文本("刷新时间：".."10分")
	elseif 名称 == "夏日炎炎" then
		lshs:置文本("#Y".."夏日炎炎")
		lshs:置文本("活动时间：".."全天")
		lshs:置文本("等级限制：角色等级".."≥".."60".."级")
	    	lshs:置文本("人数：".."5".."人")
		lshs:置文本("难度：".."★")
		lshs:置文本("刷新时间：".."20分")
	elseif 名称 == "魂殿使者" then
		lshs:置文本("#Y".."魂殿使者")
		lshs:置文本("活动时间：".."全天")
		lshs:置文本("等级限制：角色等级".."≥".."60".."级")
	    	lshs:置文本("人数：".."5".."人")
		lshs:置文本("难度：".."★★★")
		lshs:置文本("刷新时间：".."10分")
	elseif 名称 == "魂殿殿主" then
		lshs:置文本("#Y".."魂殿殿主")
		lshs:置文本("活动时间：".."全天")
		lshs:置文本("等级限制：角色等级".."≥".."60".."级")
	    	lshs:置文本("人数：".."5".."人")
		lshs:置文本("难度：".."★★★")
		lshs:置文本("刷新时间：".."20分")
	elseif 名称 == "新春快乐" then
		lshs:置文本("#Y".."新春快乐")
		lshs:置文本("活动时间：".."全天")
		lshs:置文本("等级限制：角色等级".."≥".."60".."级")
	    	lshs:置文本("人数：".."5".."人")
		lshs:置文本("难度：".."★★")
		lshs:置文本("刷新时间：".."10分")
	elseif 名称 == "新年快乐" then
		lshs:置文本("#Y".."新年快乐")
		lshs:置文本("活动时间：".."全天")
		lshs:置文本("等级限制：角色等级".."≥".."60".."级")
	    	lshs:置文本("人数：".."5".."人")
		lshs:置文本("难度：".."★★")
		lshs:置文本("刷新时间：".."15分")
	elseif 名称 == "龙神" then
		lshs:置文本("#Y".."龙神")
		lshs:置文本("活动时间：".."全天")
		lshs:置文本("等级限制：角色等级".."≥".."60".."级")
	    	lshs:置文本("人数：".."5".."人")
		lshs:置文本("难度：".."★★")
		lshs:置文本("刷新时间：".."20分")
	elseif 名称 == "仙气十足" then
		lshs:置文本("#Y".."仙气十足")
		lshs:置文本("活动时间：".."全天")
		lshs:置文本("等级限制：角色等级".."≥".."60".."级")
	    	lshs:置文本("人数：".."5".."人")
		lshs:置文本("难度：".."★★")
		lshs:置文本("刷新时间：".."25分")
	elseif 名称 == "武神坛服战8强" then
		lshs:置文本("#Y".."武神坛服战8强")
		lshs:置文本("活动时间：".."全天")
		lshs:置文本("等级限制：角色等级".."≥".."60".."级")
	    	lshs:置文本("人数：".."5".."人")
		lshs:置文本("难度：".."★★★★")
		lshs:置文本("刷新时间：".."10")
	elseif 名称 == "武神坛服战4强" then
		lshs:置文本("#Y".."武神坛服战8强")
		lshs:置文本("活动时间：".."全天")
		lshs:置文本("等级限制：角色等级".."≥".."60".."级")
	    	lshs:置文本("人数：".."5".."人")
		lshs:置文本("难度：".."★★★★")
		lshs:置文本("刷新时间：".."20")
	elseif 名称 == "武神坛服战季军" then
		lshs:置文本("#Y".."武神坛服战季军")
		lshs:置文本("活动时间：".."全天")
		lshs:置文本("等级限制：角色等级".."≥".."60".."级")
	    	lshs:置文本("人数：".."5".."人")
		lshs:置文本("难度：".."★★★★★")
		lshs:置文本("刷新时间：".."30")
	elseif 名称 == "武神坛服战亚军" then
		lshs:置文本("#Y".."武神坛服战亚军")
		lshs:置文本("活动时间：".."全天")
		lshs:置文本("等级限制：角色等级".."≥".."60".."级")
	    	lshs:置文本("人数：".."5".."人")
		lshs:置文本("难度：".."★★★★★")
		lshs:置文本("刷新时间：".."40")
	elseif 名称 == "武神坛服战冠军" then
		lshs:置文本("#Y".."武神坛服战冠军")
		lshs:置文本("活动时间：".."全天")
		lshs:置文本("等级限制：角色等级".."≥".."60".."级")
	    	lshs:置文本("人数：".."5".."人")
		lshs:置文本("难度：".."★★★★★")
		lshs:置文本("刷新时间：".."50")
	elseif 名称 == "客服小二" then
		lshs:置文本("#Y".."客服小二")
		lshs:置文本("活动时间：".."全天")
		lshs:置文本("等级限制：角色等级".."≥".."60".."级")
	    	lshs:置文本("人数：".."5".."人")
		lshs:置文本("难度：".."★★★★★")
		lshs:置文本("刷新时间：".."50")
	elseif 名称 == "下凡的灵猴" then
		lshs:置文本("#Y".."下凡的灵猴")
		lshs:置文本("活动时间：".."全天")
		lshs:置文本("等级限制：角色等级".."≥".."60".."级")
	    	lshs:置文本("人数：".."5".."人")
		lshs:置文本("难度：".."★")
		lshs:置文本("刷新时间：".."30")
	elseif 名称 == "三界财神爷" then
		lshs:置文本("#Y".."三界财神爷")
		lshs:置文本("活动时间：".."全天")
		lshs:置文本("等级限制：角色等级".."≥".."60".."级")
	    	lshs:置文本("人数：".."5".."人")
		lshs:置文本("难度：".."★")
		lshs:置文本("刷新时间：".."15")
	elseif 名称 == "远古妖魔领主" then
		lshs:置文本("#Y".."远古妖魔领主")
		lshs:置文本("活动时间：".."全天")
		lshs:置文本("等级限制：角色等级".."≥".."60".."级")
	    	lshs:置文本("人数：".."5".."人")
		lshs:置文本("难度：".."★")
		lshs:置文本("刷新时间：".."50")
	elseif 名称 == "远古妖魔尊主" then
		lshs:置文本("#Y".."远古妖魔尊主")
		lshs:置文本("活动时间：".."全天")
		lshs:置文本("等级限制：角色等级".."≥".."60".."级")
	    	lshs:置文本("人数：".."5".."人")
		lshs:置文本("难度：".."★")
		lshs:置文本("刷新时间：".."50")
	elseif 名称 == "远古妖魔头目" then
		lshs:置文本("#Y".."远古妖魔头目")
		lshs:置文本("活动时间：".."全天")
		lshs:置文本("等级限制：角色等级".."≥".."60".."级")
	    	lshs:置文本("人数：".."5".."人")
		lshs:置文本("难度：".."★")
		lshs:置文本("刷新时间：".."50")

	end
end

function 分割字符(str, tv)
	local t = tv or {}
	local i = 1
	local ascii = 0
	while true do
		ascii = string.byte(str, i)
		if ascii then
			if ascii < 127 then
				table.insert(t, string.sub(str, i, i))
				i = i + 1
			else
				table.insert(t, string.sub(str, i, i + 1))
				i = i + 2
			end
		else
			break
		end
	end
	return t
end

function 取站立坐骑(名称)
	if 名称 == "山河画卷" then
		return { 0x0FF3F9E2, 0x2D6915E1, "goods.wdf" }
	elseif 名称 == "凌霄飞剑" then --
		return { 0x4931C9EC, 0xEEB83B53, "goods.wdf" }
	elseif 名称 == "瑞彩祥云" then --
		return { 0x089A78C7, 0x43FB6660, "goods.wdf" }
	elseif 名称 == "风火飞轮" then --
		return { 0x3815C169, 0x3815C169, "goods.wdf" }
	elseif 名称 == "落英纷飞" then --
		return { 0x32BE003F, 0x32BE003F, "goods.wdf" }
	elseif 名称 == "凤舞灵蝶" then --
		return { 0xF809B4D1, 0x6D33C1DB, "goods.wdf" }
	elseif 名称 == "七彩祥云" then --
		return { 0xD4CED8F7, 0x4391944D, "goods.wdf" }
	elseif 名称 == "齐天小轿" then --
		return { 0xD81F56A7, 0x6ED61C4C, "goods.wdf" }
	elseif 名称 == "流云玉佩" then --
		return { 0xF92EAB94, 0x40DBF469, "goods.wdf" }
	end
end

function 坐骑补差(fx, zq, 角色)
	local zqs = { x = 0, y = 0 }
	if zq == "暗影战豹" then
		zqs.x, zqs.y = 0, -5
		return zqs.x, zqs.y
	elseif zq == "九尾神狐" then
		if fx == 5 then
			zqs.x, zqs.y = -15, 0 --正左侧画面
		elseif fx == 7 then
			zqs.x, zqs.y = 25, 0 --正右侧画面
		elseif fx == 2 then
			zqs.x, zqs.y = -4, 4 --左上侧画面
		elseif fx == 3 then
			zqs.x, zqs.y = 15, -4 --右上侧画面
		elseif fx == 1 then
			zqs.x, zqs.y = 0, 5 --左下侧画面
		elseif fx == 0 then
			zqs.x, zqs.y = 15, 10 --右下侧画面
		elseif fx == 6 then ---正上方画面
			zqs.x, zqs.y = 5, 0
		elseif fx == 4 then
			zqs.x, zqs.y = 5, 0 ---正下方画面
		end
		return zqs.x, zqs.y
	elseif zq == "战火穷奇" or zq == "战火穷奇(银)" then
		if fx == 5 then
			zqs.x, zqs.y = 0, 18 --正左侧画面
		elseif fx == 7 then
			zqs.x, zqs.y = 0, 18 --正右侧画面
		elseif fx == 2 then
			zqs.x, zqs.y = 0, 15 --左上侧画面
		elseif fx == 3 then
			zqs.x, zqs.y = -5, 15 --右上侧画面
		elseif fx == 1 then
			zqs.x, zqs.y = 0, 15 --左下侧画面
		elseif fx == 0 then
			zqs.x, zqs.y = 0, 15 --右下侧画面
		elseif fx == 6 then ---正上方画面
			zqs.x, zqs.y = 0, 15
		elseif fx == 4 then
			zqs.x, zqs.y = 0, 10 ---正下方画面
		end
		return zqs.x, zqs.y
	elseif zq == "御风灵貂" then
		if fx == 5 then
			zqs.x, zqs.y = -10, 0
		elseif fx == 7 then
			zqs.x, zqs.y = 10, 0
		elseif fx == 2 then
			zqs.x, zqs.y = -8, -5
		elseif fx == 6 then
			zqs.x, zqs.y = 0, -5
		elseif fx == 3 then
			zqs.x, zqs.y = 5, -5
		elseif fx == 1 then
			zqs.x, zqs.y = -8, 8
		elseif fx == 4 then
			zqs.x, zqs.y = -2, 0
		elseif fx == 0 then
			zqs.x, zqs.y = 8, 8
		end
		return zqs.x, zqs.y
	elseif zq == "妙缘暖犀" then
		if fx == 5 then
			zqs.x, zqs.y = 0, -10 --FX 方向 zqs.x左右，y调上下
		elseif fx == 7 then
			zqs.x, zqs.y = 0, -10
		elseif fx == 2 then
			zqs.x, zqs.y = -6, -10
		elseif fx == 3 then
			zqs.x, zqs.y = 6, -10
		elseif fx == 0 then
			zqs.x, zqs.y = 0, -5
		elseif fx == 1 then
			zqs.x, zqs.y = -0, -5
		elseif fx == 6 then ---正上方画面
			zqs.x, zqs.y = 0, -10
		elseif fx == 4 then
			zqs.x, zqs.y = 0, -5
		end
		return zqs.x, zqs.y
	elseif zq == "七彩神驴" or zq == "七彩小驴" or zq == "神行小驴" or zq == "粉红小驴" then
		if fx == 5 then
			zqs.x, zqs.y = 0, -10 --FX 方向 zqs.x左右，y调上下
		elseif fx == 7 then
			zqs.x, zqs.y = 0, -10
		elseif fx == 2 then
			zqs.x, zqs.y = -6, -10
		elseif fx == 3 then
			zqs.x, zqs.y = 6, -10
		elseif fx == 0 then
			zqs.x, zqs.y = 0, -5
		elseif fx == 1 then
			zqs.x, zqs.y = -0, -5
		elseif fx == 6 then ---正上方画面
			zqs.x, zqs.y = 0, -10
		elseif fx == 4 then
			zqs.x, zqs.y = 0, -5
		end
		return zqs.x, zqs.y
	elseif zq == "怒雷狂狮" then
		if fx == 4 then
			zqs.x, zqs.y = 0, -5
		elseif fx == 6 then
			zqs.x, zqs.y = 0, -10
		end
		return zqs.x, zqs.y
	elseif zq == "齐天小轿" then
		if fx == 5 then
			zqs.x, zqs.y = 0, -60 --正左侧画面
		elseif fx == 7 then
			zqs.x, zqs.y = 0, -60 --正右侧画面
		elseif fx == 2 then
			zqs.x, zqs.y = 0, -60 --左上侧画面
		elseif fx == 3 then
			zqs.x, zqs.y = 0, -60 --右上侧画面
		elseif fx == 1 then
			zqs.x, zqs.y = 0, -60 --左下侧画面
		elseif fx == 0 then
			zqs.x, zqs.y = 0, -60 --右下侧画面
		elseif fx == 6 then ---正上方画面
			zqs.x, zqs.y = -5, -65
		elseif fx == 4 then
			zqs.x, zqs.y = 5, -65 ---正下方画面
		end
		return zqs.x, zqs.y
	elseif zq == "风火飞轮" then
		if fx == 5 then
			zqs.x, zqs.y = 0, -60 --正左侧画面
		elseif fx == 7 then
			zqs.x, zqs.y = 0, -60 --正右侧画面
		elseif fx == 2 then
			zqs.x, zqs.y = -10, -60 --左上侧画面
		elseif fx == 3 then
			zqs.x, zqs.y = 0, -60 --右上侧画面
		elseif fx == 1 then
			zqs.x, zqs.y = 0, -65 --左下侧画面
		elseif fx == 0 then
			zqs.x, zqs.y = 0, -65 --右下侧画面
		elseif fx == 6 then ---正上方画面
			zqs.x, zqs.y = -5, -65
		elseif fx == 4 then
			zqs.x, zqs.y = 5, -65 ---正下方画面
		end
		return zqs.x, zqs.y
	elseif zq == "落英纷飞" then
		if fx == 5 then
			zqs.x, zqs.y = 0, -50 --正左侧画面
		elseif fx == 7 then
			zqs.x, zqs.y = 0, -50 --正右侧画面
		elseif fx == 2 then
			zqs.x, zqs.y = 0, -50 --左上侧画面
		elseif fx == 3 then
			zqs.x, zqs.y = 0, -50 --右上侧画面
		elseif fx == 1 then
			zqs.x, zqs.y = 0, -50 --左下侧画面
		elseif fx == 0 then
			zqs.x, zqs.y = 0, -50 --右下侧画面
		elseif fx == 6 then ---正上方画面
			zqs.x, zqs.y = -2, -50
		elseif fx == 4 then
			zqs.x, zqs.y = 2, -50 ---正下方画面
		end
		return zqs.x, zqs.y
	elseif zq == "凌霄飞剑" then
		if fx == 5 then
			zqs.x, zqs.y = -10, -80 --正左侧画面
		elseif fx == 7 then
			zqs.x, zqs.y = 10, -80 --正右侧画面
		elseif fx == 2 then
			zqs.x, zqs.y = 0, -80 --左上侧画面
		elseif fx == 3 then
			zqs.x, zqs.y = 0, -80 --右上侧画面
		elseif fx == 1 then
			zqs.x, zqs.y = 0, -75 --左下侧画面
		elseif fx == 0 then
			zqs.x, zqs.y = 0, -75 --右下侧画面
		elseif fx == 6 then ---正上方画面
			zqs.x, zqs.y = -2, -80
		elseif fx == 4 then
			zqs.x, zqs.y = 2, -80 ---正下方画面
		end
		return zqs.x, zqs.y
	elseif zq == "山河画卷" or zq == "凤舞灵蝶" then
		if fx == 6 then
			zqs.x, zqs.y = 0, -70 --正左侧画面
		elseif fx == 8 then
			zqs.x, zqs.y = 0, -70 --正右侧画面
		elseif fx == 3 then
			zqs.x, zqs.y = 0, -70 --左上侧画面
		elseif fx == 4 then
			zqs.x, zqs.y = 0, -70 --右上侧画面
		elseif fx == 2 then
			zqs.x, zqs.y = 0, -70 --左下侧画面
		elseif fx == 1 then
			zqs.x, zqs.y = 0, -70 --右下侧画面
		elseif fx == 7 then ---正上方画面
			zqs.x, zqs.y = -3, -70
		elseif fx == 5 then
			zqs.x, zqs.y = 3, -70 ---正下方画面
		end
		return zqs.x, zqs.y
	elseif zq == "瑞彩祥云" or zq == "七彩祥云" then
		if fx == 5 then
			zqs.x, zqs.y = 0, -35 --正左侧画面
		elseif fx == 7 then
			zqs.x, zqs.y = 0, -35 --正右侧画面
		elseif fx == 2 then
			zqs.x, zqs.y = -6, -35 --左上侧画面
		elseif fx == 3 then
			zqs.x, zqs.y = 0, -35 --右上侧画面
		elseif fx == 1 then
			zqs.x, zqs.y = 0, -35 --左下侧画面
		elseif fx == 0 then
			zqs.x, zqs.y = 0, -35 --右下侧画面
		elseif fx == 6 then ---正上方画面
			zqs.x, zqs.y = -3, -35
		elseif fx == 4 then
			zqs.x, zqs.y = 3, -35 ---正下方画面
		end
		return zqs.x, zqs.y
	elseif zq == "流云玉佩" then
		if fx == 5 then
			zqs.x, zqs.y = -10, -70 --正左侧画面
		elseif fx == 7 then
			zqs.x, zqs.y = 10, -70 --正右侧画面
		elseif fx == 2 then
			zqs.x, zqs.y = -6, -75 --左上侧画面
		elseif fx == 3 then
			zqs.x, zqs.y = 6, -75 --右上侧画面
		elseif fx == 1 then
			zqs.x, zqs.y = -5, -70 --左下侧画面
		elseif fx == 0 then
			zqs.x, zqs.y = 5, -70 --右下侧画面
		elseif fx == 6 then ---正上方画面
			zqs.x, zqs.y = -3, -80
		elseif fx == 4 then
			zqs.x, zqs.y = 3, -70 ---正下方画面
		end
		return zqs.x, zqs.y
	end
	return zqs.x, zqs.y
end

function __变身卡()
end

local pi = math.pi
local pi2 = pi * 2
local abs = math.abs
local atan = math.atan
local deg = math.deg
function 取两点角度(src, dst)
	return deg(取两点孤度(src, dst))
end

function 取两点孤度(src,dst)
	if dst == nil then return 0 end
	if(dst.y ==src.y and dst.x==src.x)then
		return 0
	elseif(dst.y >=src.y and dst.x<=src.x)then
		return pi-abs(atan((dst.y-src.y)/(dst.x-src.x)))
	elseif(dst.y <=src.y and dst.x>=src.x)then
		return pi2-abs(atan((dst.y-src.y)/(dst.x-src.x)))
	elseif(dst.y <=src.y and dst.x<=src.x)then
		return atan((dst.y-src.y)/(dst.x-src.x))+pi

	elseif(dst.y >=src.y and dst.x>=src.x)then
		return atan((dst.y-src.y)/(dst.x-src.x))
	end
end

local sqrt = math.sqrt
local pow = math.pow
function 取两点距离(src, dst)
	if src.x == nil then
		src.x = 1
	end
	if src.y == nil then
		src.y = 1
	end
	if dst.x == nil then
		dst.x = 1
	end
	if dst.y == nil then
		dst.y = 1
	end
	return sqrt(pow(src.x - dst.x, 2) + pow(src.y - dst.y, 2))
end

function 取可否进阶(模型)
	local 信息 = 取战斗模型("进阶" .. 模型)
	if #信息 == 0 then
		return false
	else
		return true
	end
end

function contains(array, element)
    for _, value in ipairs(array) do
        if value == element then
            return true
        end
    end
    return false
end

__jingmaimiaoshu={}
__jingmaimiaoshu["大唐官府"]="dt"
__jingmaimiaoshu["方寸山"]="fcs"
__jingmaimiaoshu["花果山"]="hgs"
__jingmaimiaoshu["化生寺"]="hss"
__jingmaimiaoshu["凌波城"]="lbc"
__jingmaimiaoshu["龙宫"]="lg"
__jingmaimiaoshu["魔王寨"]="mwz"
__jingmaimiaoshu["女儿村"]="nrc"
__jingmaimiaoshu["盘丝洞"]="psd"
__jingmaimiaoshu["普陀山"]="pts"
__jingmaimiaoshu["神木林"]="sml"
__jingmaimiaoshu["狮驼岭"]="stl"
__jingmaimiaoshu["天宫"]="tg"
__jingmaimiaoshu["无底洞"]="wdd"
__jingmaimiaoshu["五庄观"]="wzg"
__jingmaimiaoshu["阴曹地府"]="ycdf"




__jingmaimiaoshu["昂扬"]="angyang"
__jingmaimiaoshu["暴突"]="baotu"
__jingmaimiaoshu["催迫"]="cuipo"
__jingmaimiaoshu["摧枯拉朽"]="cuigulaxiu"
__jingmaimiaoshu["幸运一击"]="xingyunyiji"
__jingmaimiaoshu["笃志"]="duzhu"
__jingmaimiaoshu["奋战"]="fz"
__jingmaimiaoshu["奉还"]="fenghuan"
__jingmaimiaoshu["攻伐"]="gongfa"
__jingmaimiaoshu["孤勇"]="guyong"
__jingmaimiaoshu["惊天动地"]="jingtiandongdi"
__jingmaimiaoshu["亢强"]="kangqiang"
__jingmaimiaoshu["历战"]="lizhan"
__jingmaimiaoshu["厉兵"]="libing"
__jingmaimiaoshu["烈光"]="lieguang"
__jingmaimiaoshu["灵能"]="lingneng" --lingnneg
__jingmaimiaoshu["怒伤"]="nushang"
__jingmaimiaoshu["披挂上阵"]="piguashangzhen"
__jingmaimiaoshu["破刃"]="poren"
__jingmaimiaoshu["破势"]="poshi"
__jingmaimiaoshu["潜心"]="qianxin"
__jingmaimiaoshu["熟练"]="shulian"
__jingmaimiaoshu["肃杀"]="susha"
__jingmaimiaoshu["突刺"]="tuci"
__jingmaimiaoshu["效法"]="xiaofa"
__jingmaimiaoshu["勇进"]="yongjing"
__jingmaimiaoshu["诛伤"]="zhushang"
__jingmaimiaoshu["追戮"]="zhuinu"






__jingmaimiaoshu["宝诀"]="baojue"
__jingmaimiaoshu["必果"]="biguo"
__jingmaimiaoshu["策电"]="cedian"
__jingmaimiaoshu["穿透"]="chuantou"
__jingmaimiaoshu["符威"]="fuwei"
__jingmaimiaoshu["幻变"]="huanbian"
__jingmaimiaoshu["精炼"]="jinglian"
__jingmaimiaoshu["雷法·倒海"]="leifadaohai"
__jingmaimiaoshu["雷法·翻天"]="leihaifantian"
__jingmaimiaoshu["炼魂"]="jinghun"----------------丢失
__jingmaimiaoshu["咒诀"]="zoujue"
__jingmaimiaoshu["天篆"]="tianzhuan"
__jingmaimiaoshu["震怒"]="zhennu"
__jingmaimiaoshu["吞雷"]="tunlei"
__jingmaimiaoshu["神机"]="shengji"
__jingmaimiaoshu["造化"]="zaohua"
__jingmaimiaoshu["五雷·挪移"]="5leinuoyi"
__jingmaimiaoshu["制约"]="zhiyue"
__jingmaimiaoshu["灵咒"]="lingzhou"
__jingmaimiaoshu["专神"]="zhuansheng"
__jingmaimiaoshu["灵威"]="linggan"
__jingmaimiaoshu["驱雷"]="qulei"
__jingmaimiaoshu["余悸"]="yuji"
__jingmaimiaoshu["妙用"]="miaoyong"
__jingmaimiaoshu["怒霆"]="nuting"
__jingmaimiaoshu["顺势"]="shunshi"
__jingmaimiaoshu["灵能"]="lingnneg"


__jingmaimiaoshu["棒打雄风"]="bangdaxiongf"
__jingmaimiaoshu["变通"]="biantong"
__jingmaimiaoshu["朝拜"]="chaobai"
__jingmaimiaoshu["逞胜"]="chensheng"
__jingmaimiaoshu["冲霄"]="chongxiao"
__jingmaimiaoshu["大圣"]="dasheng"
__jingmaimiaoshu["荡魔"]="dangmo"
__jingmaimiaoshu["得意"]="deyi"
__jingmaimiaoshu["斗战"]="douzhan"
__jingmaimiaoshu["斗志"]="douzhi"
__jingmaimiaoshu["锻炼"]="duanlian"
__jingmaimiaoshu["翻天"]="fantian"
__jingmaimiaoshu["伏妖"]="fuyao"
__jingmaimiaoshu["豪胆"]="haodan"
__jingmaimiaoshu["火眼"]="huoyan"
__jingmaimiaoshu["金睛"]="jingjing"
__jingmaimiaoshu["闹海"]="naohai"
__jingmaimiaoshu["闹天"]="naotian"
__jingmaimiaoshu["齐天神通"]="qitianst"
__jingmaimiaoshu["圈养"]="quanyang"
__jingmaimiaoshu["胜意"]="shengyi"
__jingmaimiaoshu["贪天"]="tantian"
__jingmaimiaoshu["添威"]="tianwei"
__jingmaimiaoshu["填海"]="tianhai"
__jingmaimiaoshu["铁骨"]="tiegu"
__jingmaimiaoshu["通天"]="tongtian"
__jingmaimiaoshu["顽心"]="wanxin"
__jingmaimiaoshu["顽性"]="wanxing"
__jingmaimiaoshu["忘形"]="wangxing"
__jingmaimiaoshu["威仪"]="weiyi"
__jingmaimiaoshu["威震"]="weizhen"
__jingmaimiaoshu["显圣"]="xiansheng"
__jingmaimiaoshu["压邪"]="yaxie"
__jingmaimiaoshu["愈勇"]="yuyong"
__jingmaimiaoshu["战神"]="zhansheng"
__jingmaimiaoshu["逐胜"]="zhuoshen"
__jingmaimiaoshu["自在"]="zizai"



__jingmaimiaoshu["磅礴"]="pangpo"
__jingmaimiaoshu["悲悯"]="beimin"
__jingmaimiaoshu["持戒"]="chijie"
__jingmaimiaoshu["达摩"]="damo"
__jingmaimiaoshu["佛法"]="fofa"
__jingmaimiaoshu["佛佑"]="foyou"
__jingmaimiaoshu["佛缘"]="foyuan"
__jingmaimiaoshu["抚琴"]="fuqin"
__jingmaimiaoshu["化瘀"]="huayu"
__jingmaimiaoshu["慧定"]="huiding"
__jingmaimiaoshu["解惑"]="jiehuo"
__jingmaimiaoshu["金刚"]="jinggang"
__jingmaimiaoshu["静气"]="jingqi"
__jingmaimiaoshu["聚念"]="qunian"
__jingmaimiaoshu["妙手"]="miaoshou"
__jingmaimiaoshu["虔诚"]="qiancheng"
__jingmaimiaoshu["舍利"]="sheli"
__jingmaimiaoshu["生花"]="shenghua"
__jingmaimiaoshu["圣手"]="shengshou1"
__jingmaimiaoshu["施他"]="shita"
__jingmaimiaoshu["授业"]="shouye"
__jingmaimiaoshu["诵经"]="songjing"
__jingmaimiaoshu["诵律"]="songlv"
__jingmaimiaoshu["韦陀"]="weituo"
__jingmaimiaoshu["无碍"]="wuai"
__jingmaimiaoshu["无量"]="wuliang"
__jingmaimiaoshu["悟彻"]="wuche"
__jingmaimiaoshu["修习"]="xiuxi"
__jingmaimiaoshu["自在"]="zizai2"
__jingmaimiaoshu["坐禅"]="zuochan"


__jingmaimiaoshu["乘势"]="chengshi"
__jingmaimiaoshu["耳目一新"]="ermuyixin"
__jingmaimiaoshu["贯通"]="guantong"
__jingmaimiaoshu["混元"]="hunyuan"
__jingmaimiaoshu["惊涛"]="jingtao"
__jingmaimiaoshu["妙得"]="miaoai"
__jingmaimiaoshu["凝息"]="ningxi"
__jingmaimiaoshu["巧变"]="qiaobian"
__jingmaimiaoshu["杀罚"]="shafa"
__jingmaimiaoshu["闪雷"]="shanlei"
__jingmaimiaoshu["盛势"]="shengshi"
__jingmaimiaoshu["石摧"]="shicui"
__jingmaimiaoshu["天眼"]="tianyan"
__jingmaimiaoshu["天泽"]="tianze"
__jingmaimiaoshu["威震"]="weizhen"
__jingmaimiaoshu["无双"]="wushuang"
__jingmaimiaoshu["蓄势"]="xushi"
__jingmaimiaoshu["追袭"]="zhuixi"








__jingmaimiaoshu["傲岸"]="aoan"
__jingmaimiaoshu["叱咤"]="chicha"
__jingmaimiaoshu["骇浪"]="hailang"
__jingmaimiaoshu["呼风"]="hufeng"
__jingmaimiaoshu["唤雨"]="huanyu"
__jingmaimiaoshu["惊鸿"]="jinghong"
__jingmaimiaoshu["狂浪"]="kuanglang"
__jingmaimiaoshu["凛然"]="lingran"
__jingmaimiaoshu["龙钩"]="longgou"
__jingmaimiaoshu["龙息"]="longxi"
__jingmaimiaoshu["龙啸"]="longxiao"
__jingmaimiaoshu["沐雨"]="muyu"
__jingmaimiaoshu["盘龙"]="panlong"
__jingmaimiaoshu["睥睨"]="pini"
__jingmaimiaoshu["潜龙在渊"]="qianlongzy"
__jingmaimiaoshu["雨魄"]="yupo"
__jingmaimiaoshu["云变"]="yunbian"
__jingmaimiaoshu["云魂"]="yunhun"
__jingmaimiaoshu["斩浪"]="zhanlang"





__jingmaimiaoshu["不忿"]="bufen"
__jingmaimiaoshu["摧山"]="cuishan"
__jingmaimiaoshu["焚尽"]="fengjin"
__jingmaimiaoshu["风火燎原"]="fenghuoly"
__jingmaimiaoshu["固基"]="guji"
__jingmaimiaoshu["激怒"]="jinu"
__jingmaimiaoshu["极炙"]="jizhi"
__jingmaimiaoshu["焦土"]="jiaotu"
__jingmaimiaoshu["烬藏"]="zhicang"
__jingmaimiaoshu["惊悟"]="jingyu"
__jingmaimiaoshu["狂劲"]="kuangjin"
__jingmaimiaoshu["烈火真言"]="leihuozheny"
__jingmaimiaoshu["烈焰"]="lieyan"
__jingmaimiaoshu["漫卷狂沙"]="manjuanks"
__jingmaimiaoshu["魔焱"]="moyan"
__jingmaimiaoshu["咆哮"]="paoxiao"
__jingmaimiaoshu["融骨"]="ronggu"
__jingmaimiaoshu["升温"]="shenwen"
__jingmaimiaoshu["五蕴神焰"]="5yunsheny"
__jingmaimiaoshu["邪火"]="xiehuo"
__jingmaimiaoshu["旋阳"]="xuanyang"
__jingmaimiaoshu["焰威"]="yanwei"
__jingmaimiaoshu["焰星"]="yanxing"
__jingmaimiaoshu["折服"]="zhefu"
__jingmaimiaoshu["真炎"]="zhenyan"
__jingmaimiaoshu["炙烤"]="zhikao"
__jingmaimiaoshu["咒言"]="zhouyan"

__jingmaimiaoshu["暗刃"]="1"
__jingmaimiaoshu["百花"]="2"
__jingmaimiaoshu["乘胜"]="3"
__jingmaimiaoshu["痴念"]="4"
__jingmaimiaoshu["毒芒"]="5"
__jingmaimiaoshu["毒雾"]="6"
__jingmaimiaoshu["飞花"]="7"
__jingmaimiaoshu["风行"]="8"
__jingmaimiaoshu["花刺"]="9"
__jingmaimiaoshu["花骨"]="10"
__jingmaimiaoshu["花开"]="11"
__jingmaimiaoshu["花落"]="12"
__jingmaimiaoshu["花谢花飞"]="13"
__jingmaimiaoshu["花雨"]="14"
__jingmaimiaoshu["空灵"]="15"
__jingmaimiaoshu["曼珠"]="16"
__jingmaimiaoshu["怒放"]="17"
__jingmaimiaoshu["轻刃"]="18"
__jingmaimiaoshu["清澈"]="19"
__jingmaimiaoshu["涂毒"]="20"
__jingmaimiaoshu["汹涌"]="21"
__jingmaimiaoshu["训宠"]="22"
__jingmaimiaoshu["驯宠"]="23"
__jingmaimiaoshu["叶护"]="24"
__jingmaimiaoshu["抑怒"]="25"
__jingmaimiaoshu["重明"]="26"
__jingmaimiaoshu["追毒"]="27"


__jingmaimiaoshu["丹香"]="1"
__jingmaimiaoshu["附骨"]="2"
__jingmaimiaoshu["幻镜"]="3"
__jingmaimiaoshu["结阵"]="4"
__jingmaimiaoshu["绝媚"]="5"
__jingmaimiaoshu["绝命毒牙"]="6"
__jingmaimiaoshu["狂击"]="7"
__jingmaimiaoshu["连绵"]="8"
__jingmaimiaoshu["玲珑"]="9"
__jingmaimiaoshu["凌弱"]="10"
__jingmaimiaoshu["罗刹"]="11"
__jingmaimiaoshu["罗网"]="12"
__jingmaimiaoshu["媚态"]="13"
__jingmaimiaoshu["魔音"]="14"
__jingmaimiaoshu["魔瘴"]="15"
__jingmaimiaoshu["扑袭"]="16"
__jingmaimiaoshu["千蛛"]="17"
__jingmaimiaoshu["牵魂蛛丝"]="18"
__jingmaimiaoshu["杀戮"]="19"
__jingmaimiaoshu["天网"]="20"
__jingmaimiaoshu["亡缚"]="21"
__jingmaimiaoshu["忘忧"]="22"
__jingmaimiaoshu["意乱"]="23"
__jingmaimiaoshu["引诛"]="24"
__jingmaimiaoshu["粘附"]="25"
__jingmaimiaoshu["障眼"]="26"
__jingmaimiaoshu["制怒"]="27"


__jingmaimiaoshu["安忍"]="1"
__jingmaimiaoshu["慈佑"]="2"
__jingmaimiaoshu["赐咒"]="3"
__jingmaimiaoshu["低眉"]="4"
__jingmaimiaoshu["抖擞"]="5"
__jingmaimiaoshu["度厄"]="6"
__jingmaimiaoshu["顿悟"]="7"
__jingmaimiaoshu["法华"]="8"
__jingmaimiaoshu["感念"]="9"
__jingmaimiaoshu["慧眼"]="10"
__jingmaimiaoshu["静心"]="11"
__jingmaimiaoshu["困兽"]="12"
__jingmaimiaoshu["莲动"]="13"
__jingmaimiaoshu["莲华"]="14"
__jingmaimiaoshu["莲音"]="15"
__jingmaimiaoshu["怒目"]="16"
__jingmaimiaoshu["普照"]="17"
__jingmaimiaoshu["清净"]="18"
__jingmaimiaoshu["万象"]="19"
__jingmaimiaoshu["无怖"]="20"
__jingmaimiaoshu["无尽"]="21"
__jingmaimiaoshu["相生"]="22"
__jingmaimiaoshu["业障"]="23"
__jingmaimiaoshu["因缘"]="24"
__jingmaimiaoshu["馀威"]="25"
__jingmaimiaoshu["缘起"]="26"
__jingmaimiaoshu["湛然"]="27"
__jingmaimiaoshu["执念"]="28"
__jingmaimiaoshu["智念"]="29"
__jingmaimiaoshu["庄严"]="30"


__jingmaimiaoshu["苍埃"]="1"
__jingmaimiaoshu["苍风"]="2"
__jingmaimiaoshu["毒萃"]="3"
__jingmaimiaoshu["奉愿"]="4"
__jingmaimiaoshu["伏毒"]="5"
__jingmaimiaoshu["归原"]="6"
__jingmaimiaoshu["焕新"]="7"
__jingmaimiaoshu["激活"]="8"
__jingmaimiaoshu["寄生"]="9"
__jingmaimiaoshu["绞藤"]="10"
__jingmaimiaoshu["劲草"]="11"
__jingmaimiaoshu["枯木逢春"]="12"
__jingmaimiaoshu["狂叶"]="13"
__jingmaimiaoshu["凉秋"]="14"
__jingmaimiaoshu["灵归"]="15"
__jingmaimiaoshu["灵精"]="16"
__jingmaimiaoshu["灵木"]="17"
__jingmaimiaoshu["灵秀"]="18"
__jingmaimiaoshu["灵佑"]="19"
__jingmaimiaoshu["迷缚"]="20"
__jingmaimiaoshu["碾杀"]="21"
__jingmaimiaoshu["薪火"]="22"
__jingmaimiaoshu["秀木"]="23"
__jingmaimiaoshu["萦风"]="24"
__jingmaimiaoshu["追击"]="25"
__jingmaimiaoshu["滋养"]="26"


__jingmaimiaoshu["不羁"]="1"
__jingmaimiaoshu["逞凶"]="2"
__jingmaimiaoshu["癫狂"]="3"
__jingmaimiaoshu["钢牙"]="4"
__jingmaimiaoshu["功勋"]="5"
__jingmaimiaoshu["健壮"]="6"
__jingmaimiaoshu["矫健"]="7"
__jingmaimiaoshu["九天"]="8"
__jingmaimiaoshu["攫取"]="9"
__jingmaimiaoshu["狂化"]="10"
__jingmaimiaoshu["狂乱"]="11"
__jingmaimiaoshu["狂啸"]="12"
__jingmaimiaoshu["狂血"]="13"
__jingmaimiaoshu["狂躁"]="14"
__jingmaimiaoshu["困兽之斗"]="15"
__jingmaimiaoshu["拟形"]="16"
__jingmaimiaoshu["念主"]="17"
__jingmaimiaoshu["怒火"]="18"
__jingmaimiaoshu["屏息"]="19"
__jingmaimiaoshu["狮噬"]="20"
__jingmaimiaoshu["守势"]="21"
__jingmaimiaoshu["狩猎"]="22"
__jingmaimiaoshu["威压"]="23"
__jingmaimiaoshu["象踏"]="24"
__jingmaimiaoshu["协同"]="25"
__jingmaimiaoshu["协战"]="26"
__jingmaimiaoshu["雄风"]="27"
__jingmaimiaoshu["夜视"]="28"
__jingmaimiaoshu["饮血"]="29"
__jingmaimiaoshu["长啸"]="30"
__jingmaimiaoshu["争宠"]="31"
__jingmaimiaoshu["追逐"]="32"


__jingmaimiaoshu["藏招"]="1"
__jingmaimiaoshu["存雄"]="2"
__jingmaimiaoshu["电掣"]="3"
__jingmaimiaoshu["电光火石"]="4"
__jingmaimiaoshu["共鸣"]="5"
__jingmaimiaoshu["轰鸣"]="6"
__jingmaimiaoshu["激越"]="7"
__jingmaimiaoshu["疾雷"]="8"
__jingmaimiaoshu["坚壁"]="9"
__jingmaimiaoshu["劲健"]="10"
__jingmaimiaoshu["惊霆"]="11"
__jingmaimiaoshu["惊曜"]="12"
__jingmaimiaoshu["慨叹"]="13"
__jingmaimiaoshu["雷霆汹涌"]="14"
__jingmaimiaoshu["缭乱"]="15"
__jingmaimiaoshu["怒电"]="16"
__jingmaimiaoshu["频变"]="17"
__jingmaimiaoshu["气势"]="18"
__jingmaimiaoshu["神采"]="19"
__jingmaimiaoshu["神尊"]="20"
__jingmaimiaoshu["套索"]="21"
__jingmaimiaoshu["霆震"]="22"
__jingmaimiaoshu["威吓"]="23"
__jingmaimiaoshu["威仪九霄"]="24"
__jingmaimiaoshu["仙音"]="25"
__jingmaimiaoshu["啸傲"]="26"
__jingmaimiaoshu["震荡"]="27"

__jingmaimiaoshu["秉幽"]="1"
__jingmaimiaoshu["刺骨"]="2"
__jingmaimiaoshu["独一"]="3"
__jingmaimiaoshu["夺血"]="4"
__jingmaimiaoshu["分魄"]="5"
__jingmaimiaoshu["诡印"]="6"
__jingmaimiaoshu["鬼袭"]="7"
__jingmaimiaoshu["护法"]="8"
__jingmaimiaoshu["华光"]="9"
__jingmaimiaoshu["魂守"]="10"
__jingmaimiaoshu["纠缠"]="11"
__jingmaimiaoshu["聚魂"]="12"
__jingmaimiaoshu["烈煞"]="13"
__jingmaimiaoshu["灵变"]="14"
__jingmaimiaoshu["灵通"]="15"
__jingmaimiaoshu["灵照"]="16"
__jingmaimiaoshu["罗汉"]="17"
__jingmaimiaoshu["弥愤"]="18"
__jingmaimiaoshu["冥煞"]="19"
__jingmaimiaoshu["牵动"]="20"
__jingmaimiaoshu["深刻"]="21"
__jingmaimiaoshu["盛怒"]="22"
__jingmaimiaoshu["踏魂"]="23"
__jingmaimiaoshu["踏魄"]="24"
__jingmaimiaoshu["血潮"]="25"
__jingmaimiaoshu["阴魅"]="26"
__jingmaimiaoshu["萦魄"]="27"
__jingmaimiaoshu["涌泉"]="28"
__jingmaimiaoshu["余咒"]="29"
__jingmaimiaoshu["羽裂"]="30"
__jingmaimiaoshu["烛照"]="31"
__jingmaimiaoshu["椎骨"]="32"











__jingmaimiaoshu["刺果"]="1"
__jingmaimiaoshu["存神"]="2"
__jingmaimiaoshu["存思"]="3"
__jingmaimiaoshu["道果"]="4"
__jingmaimiaoshu["还元"]="5"
__jingmaimiaoshu["剑气"]="6"
__jingmaimiaoshu["剑势"]="7"
__jingmaimiaoshu["聚力"]="8"
__jingmaimiaoshu["炼果"]="9"
__jingmaimiaoshu["落土止息"]="10"
__jingmaimiaoshu["木摧"]="11"
__jingmaimiaoshu["纳气"]="12"
__jingmaimiaoshu["凝神"]="13"
__jingmaimiaoshu["滂沱"]="14"
__jingmaimiaoshu["起雨"]="15"
__jingmaimiaoshu["气盛"]="16"
__jingmaimiaoshu["强击"]="17"
__jingmaimiaoshu["三元"]="18"
__jingmaimiaoshu["守中"]="19"
__jingmaimiaoshu["无极"]="20"
__jingmaimiaoshu["行气"]="21"
__jingmaimiaoshu["蓄志"]="22"
__jingmaimiaoshu["玄机"]="23"
__jingmaimiaoshu["饮露"]="24"
__jingmaimiaoshu["运转"]="25"







__jingmaimiaoshu["毒炽"]="1"
__jingmaimiaoshu["毒慑"]="2"
__jingmaimiaoshu["扼命"]="3"
__jingmaimiaoshu["恶焰"]="4"
__jingmaimiaoshu["拘魄"]="5"
__jingmaimiaoshu["狂宴"]="6"
__jingmaimiaoshu["六道"]="7"
__jingmaimiaoshu["轮回"]="8"
__jingmaimiaoshu["冥视"]="9"
__jingmaimiaoshu["破印"]="10"
__jingmaimiaoshu["入魂"]="11"
__jingmaimiaoshu["生杀予夺"]="12"
__jingmaimiaoshu["蚀骨"]="13"
__jingmaimiaoshu["噬毒"]="14"
__jingmaimiaoshu["通瞑"]="15"
__jingmaimiaoshu["无赦咒令"]="16"
__jingmaimiaoshu["阴翳"]="17"
__jingmaimiaoshu["幽冥"]="18"
__jingmaimiaoshu["狱火"]="19"
__jingmaimiaoshu["瘴幕"]="20"
__jingmaimiaoshu["咒令"]="21"