function 取内丹数据(wd, s, dj, tz, fl, ll)
    local wds = {}
    if wd == "迅敏" then
        wds.说明 = "提升召唤兽伤害力与速度，提升效果受召唤兽自身等级影响。"
        wds.效果 = "增加" .. math.floor(dj * 0.05 * (1 + s * 0.2)) ..
        "点伤害与" .. math.floor(dj * 0.08 * (1 + s * 0.2)) .. "点速度，随内丹等级提升而增加。"
        wds.资源 = "item.wdf"
        wds.模型 = 0x6FA0B3A8
    elseif wd == "狂怒" then
        wds.说明 = "提升必杀/高级必杀技能触发时造成的伤害，但是受到水、土二系法术攻击时将承受额外的伤害。"
        wds.效果 = "必杀时增加" .. math.floor(80 * (1 + s * 0.2)) .. "点伤害，但是额外受到15%水、土系法术伤害。"
        wds.资源 = "item.wdf"
        wds.模型 = 0x956BD457
    elseif wd == "阴伤" then
        wds.说明 = "提升连击/高级连击技能第二次攻击造成的伤害，但是受到火、雷二系法术攻击时将承受额外的伤害。"
        wds.效果 = "连击时增加" .. math.floor(50 * (1 + s * 0.2)) .. "点伤害，但是额外受到15%火、雷系法术伤害。"
        wds.资源 = "item.wdf"
        wds.模型 = 0x3EF0A9BF
    elseif wd == "静岳" then
        wds.说明 = "提升召唤兽灵力与气血，提升效果受召唤兽自身等级影响。"
        wds.效果 = "增加" .. math.floor(dj * 0.04 * (1 + s * 0.2)) .. "点灵力与" ..
        math.floor(dj * 0.4 * (1 + s * 0.2)) .. "点气血，随内丹等级提升而增加。"
        wds.资源 = "item.wdf"
        wds.模型 = 0xF58C6B1D
    elseif wd == "擅咒" then
        wds.说明 = "你对目标的法术伤害得到提升。"
        wds.效果 = "法术伤害结果增加" .. math.floor(12 * (1 + s * 0.2)) .. "点。"
        wds.资源 = "item.wdf"
        wds.模型 = 0x4D74B795
    elseif wd == "灵身" then
        wds.说明 = "提升法术爆击/高级法术爆击触发时的伤害，但是受到携带强力与高级强力技能召唤兽物理攻击时，承受额外的伤害。"
        wds.效果 = "法术暴击伤害增加" .. math.floor(7 * (1 + s * 0.2)) .. "%，但是受到强力、高强力技能额外伤害。"
        wds.资源 = "item.wdf"
        wds.模型 = 0x55124270
    elseif wd == "矫健" then
        wds.说明 = "提升召唤兽气血与速度，提升效果受召唤兽自身等级影响。"
        wds.效果 = "增加" .. math.floor(dj * 0.4 * (1 + s * 0.2)) ..
        "点气血与" .. math.floor(dj * 0.05 * (1 + s * 0.2)) .. "点速度，随召唤兽等级提升而增加。"
        wds.资源 = "item.wdf"
        wds.模型 = 0x3877515B
    elseif wd == "深思" then
        wds.说明 = "提升高冥思技能效果。"
        wds.效果 = "当前魔法小于最大魔法20%时,高冥思效果增加" .. math.floor(20 * (1 + s * 0.2)) .. "%"
        wds.资源 = "item.wdf"
        wds.模型 = 0x9912B979
    elseif wd == "钢化" then
        wds.说明 = "拥有防御或高级防御技能的召唤兽能提升防御效果，但在受到除固定伤害外的其他法术攻击时，受到的伤害增加。"
        wds.效果 = "防御、高级防御效果增加" .. math.floor(dj * 0.2 * (1 + s * 0.2)) .. "点，随召唤兽等级提升而增加，所受法术伤害增加10%。"
        wds.资源 = "item.wdf"
        wds.模型 = 0x89C1F027
    elseif wd == "坚甲" then
        wds.说明 = "拥有反震或高级反震技能的召唤兽能提升对敌人造成的反震伤害。"
        wds.效果 = "对敌人所造成的反震伤害增加" .. math.floor(100 * (1 + s * 0.2)) .. "点。"
        wds.资源 = "item.wdf"
        wds.模型 = 0x2788B6E8
    elseif wd == "慧心" then
        wds.说明 = "提升召唤兽抵抗封印几率。"
        wds.效果 = "增加" .. math.floor(6 * (1 + s * 0.2)) .. "%的抗封印几率。"
        wds.资源 = "item.wdf"
        wds.模型 = 0xB6A27748
    elseif wd == "撞击" then
        wds.说明 = "提升召唤兽物理攻击命中几率，提升效果受召唤兽体质点影响，同时提升一定的伤害结果。"
        wds.效果 = "物理攻击时增加" ..
        math.floor((tz / dj + 1) * (1 + s * 0.2)) .. "%命中几率，效果与召唤兽体质点相关，同时增加" .. math.floor(5 * (1 + s * 0.2)) ..
        "点伤害结果。"
        wds.资源 = "item.wdf"
        wds.模型 = 0xE837F9B1
    elseif wd == "无畏" then
        wds.说明 = "提升对拥有反震/高级反震技能目标的物理伤害。"
        wds.效果 = "对待有反震、高级反震技能的目标造成的物理伤害增加" .. math.floor(2 * (1 + s * 0.2)) .. "%。"
        wds.资源 = "item.wdf"
        wds.模型 = 0xE8FDD3F4
    elseif wd == "愤恨" then
        wds.说明 = "提升召唤兽对拥有幸运/高级幸运技能目标的物理伤害。"
        wds.效果 = "对待有幸运、高级幸运技能的目标造成的物理伤害增加" .. math.floor(2 * (1 + s * 0.1)) .. "%。"
        wds.资源 = "item.wdf"
        wds.模型 = 0x9F97DB7F
    elseif wd == "淬毒" then
        wds.说明 = "提升毒/高级毒技能的中毒触发几率。"
        wds.效果 = "命中目标后致毒的几率增加" .. math.floor(5 * (1 + s * 0.2)) .. "%。"
        wds.资源 = "item.wdf"
        wds.模型 = 0x4A491950
    elseif wd == "狙刺" then
        wds.说明 = "提升召唤兽对施法选定目标的法术伤害，提升效果受召唤兽等级影响"
        wds.效果 = "对施法选定目标法术伤害增加" .. math.floor(dj * 0.15 * (1 + s * 0.2)) .. "点，效果随召唤兽等级提升而增加。"
        wds.资源 = "item.wdf"
        wds.模型 = 0x9762CCF9
    elseif wd == "连环" then
        wds.说明 = "提升连击/高级连击技能触发连击的几率。"
        wds.效果 = "连击的几率增加" .. math.floor(2 * (1 + s * 0.2)) .. "%。"
        wds.资源 = "item.wdf"
        wds.模型 = 0xE2D19F8F
    elseif wd == "圣洁" then
        wds.说明 = "提升驱鬼/高级驱鬼技对于鬼魂/高级鬼魂技能召唤兽的法术伤害"
        wds.效果 = "驱鬼的效果在原基础上增加" .. math.floor(10 * (1 + s * 0.2)) .. "%。"
        wds.资源 = "item.wdf"
        wds.模型 = 0x809E53A3
    elseif wd == "灵光" then
        wds.说明 = "提升召唤兽法术伤害，提升效果受召唤兽自身法力点数影响。"
        wds.效果 = "增加" .. math.floor(fl * 0.02 * (1 + s * 0.2)) .. "点法术伤害，效果受自身法力点数影响。"
        wds.资源 = "item.wdf"
        wds.模型 = 0xC0EAFCA3
    elseif wd == "神机步" then
        wds.说明 = "被召唤或进入战斗时,三回合内提升召唤兽躲避力。"
        wds.效果 = "进入战斗时，3回合内的躲避值增加" .. math.floor(100 * (1 + s * 0.2)) .. "%,最高不超过召唤兽等级*10。"
        wds.资源 = "item.wdf"
        wds.模型 = 0x19D18973
    elseif wd == "腾挪劲" then
        wds.说明 = "召唤兽受到物理攻击时，有一定几率化解部分伤害。"
        wds.效果 = "受到物理攻击时有" .. math.floor(4 * (1 + s * 0.2)) .. "%的几率抵挡50%的伤害。"
        wds.资源 = "item.wdf"
        wds.模型 = 0x06EF9E7B
    elseif wd == "玄武躯" then
        wds.说明 = "提升召唤兽气血，提升效果受召唤兽等级影响，但是将减少召唤兽所有攻击方式造成的伤害。"
        wds.效果 = "增加" .. math.floor(dj * 2 * (1 + s * 0.2)) .. "点气血，随召唤兽等级提升而增加，对目标造成伤害减少50%。"
        wds.资源 = "item.wdf"
        wds.模型 = 0xC842B66C
    elseif wd == "龙胄铠" then
        wds.说明 = "提升召唤兽防御，提升效果受召唤兽等级影响，但是将减少召唤兽所有攻击方式造成的伤害。"
        wds.效果 = "增加" .. math.floor(dj / 2 * (1 + s * 0.2)) .. "点防御，随召唤兽等级提升而增加，对目标造成伤害减少50%。"
        wds.资源 = "item.wdf"
        wds.模型 = 0x4E9FBEE0
    elseif wd == "玉砥柱" then
        wds.说明 = "降低召唤兽受到壁垒击破、力劈华山、善恶有报、死亡召唤、惊心一剑技能攻击时所承受的伤害，但是将减少召唤兽所有攻击方式造成的伤害。"
        wds.效果 = "受到壁垒击破、力劈华山、善恶有报、死亡召唤、惊心一剑技能伤害减少" .. math.floor(7 * (1 + s * 0.2)) .. "%；但是对其他目标造成的伤害减少20%。"
        wds.资源 = "item.wdf"
        wds.模型 = 0x5DAD21DF
    elseif wd == "碎甲刃" then
        wds.说明 = "召唤兽普通物理攻击时将有一定几率降低攻击目标的物理防御，效果持续两回合。"
        wds.效果 = "普通物理攻击后减低目标后有30%几率降低目标" .. math.floor(((ll - dj) * 0.15 + 5) * (1 + s * 0.2)) ..
        "点防御值，最低为1点,持续2回合，效果受自身力量点影响。"
        wds.资源 = "item.wdf"
        wds.模型 = 0xCDDAE9FF
    elseif wd == "阴阳护" then
        wds.说明 = "降低召唤兽保护其他目标时所承受的伤害。"
        wds.效果 = "保护目标时承受的伤害减少" .. math.floor(10 * (1 + s * 0.2)) .. "%。"
        wds.资源 = "item.wdf"
        wds.模型 = 0x9041DD3F
    elseif wd == "凛冽气" then
        wds.说明 = "携带此内丹的召唤兽在战斗中降低本方包含其在内所有召唤兽的逃跑几率。"
        wds.效果 = "本方所有召唤兽逃跑的几率减少" .. math.floor(10 * (1 + s * 0.2)) .. "%。"
        wds.资源 = "item.wdf"
        wds.模型 = 0x38808205
    elseif wd == "舍身击" then
        wds.说明 = "提升物理攻击造成的伤害，提升效果受召唤兽自身力量点数影响。"
        wds.效果 = "物理攻击伤害结果增加" .. math.floor((ll - dj) * 0.1 * (1 + s * 0.2)) .. "点，效果受自身力量点影响。"
        wds.资源 = "item.wdf"
        wds.模型 = 0x10E2B4A7
    elseif wd == "电魂闪" then
        wds.说明 = "使用单体法术命中目标时将有一定几率驱散目标的某种增益状态。"
        wds.效果 = "单体法术命中目标时有" .. math.floor(10 + s * 4) .. "%几率驱散目标随机一种状态。"
        wds.资源 = "item.wdf"
        wds.模型 = 0x624D3F68
    elseif wd == "通灵法" then
        wds.说明 = "提升召唤兽忽视目标法术减免效果的能力。"
        wds.效果 = "忽视" .. math.floor(3 + s) .. "%的法术伤害减免能力。"
        wds.资源 = "item.wdf"
        wds.模型 = 0xBD739B98
    elseif wd == "双星爆" then
        wds.说明 = "提升法术连击/高级法术连击技能触发第二次法术攻击造成的伤害。"
        wds.效果 = "法术连击第二下伤害增加" .. math.floor(16 * (1 + s * 0.2)) .. "%。"
        wds.资源 = "item.wdf"
        wds.模型 = 0x8AD71FAF
    elseif wd == "催心浪" then
        wds.说明 = "提升法术波动/高级法术波动技能触发时的伤害波动下限。"
        wds.效果 = "法术波动下限提升了" .. math.floor(16 * (1 + s * 0.2)) .. "%。"
        wds.资源 = "item.wdf"
        wds.模型 = 0x5CEDA8EC
    elseif wd == "隐匿击" then
        wds.说明 = "降低拥有隐身/高级隐身技能的召唤兽在隐身状态下减少的伤害值，但隐身结束后将消耗额外的魔法。"
        wds.效果 = "隐身状态下降低的伤害降低" .. math.floor(2 * (1 + s * 0.2)) .. "%，同时隐身结束后额外消耗100%的魔法值。"
        wds.资源 = "item.wdf"
        wds.模型 = 0x0A21302B
    elseif wd == "生死决" then
        wds.说明 = "提升召唤兽将自身防御的一部分转化为伤害力的几率，提升效果持续到本回合结束。"
        wds.效果 = "增加" .. math.floor(3 * (1 + s * 0.2)) .. "%的狂暴几率。"
        wds.资源 = "item.wdf"
        wds.模型 = 0x2AA03A67
    elseif wd == "血债偿" then
        wds.说明 = "本方不带本技能召唤兽每被击飞一次，提升一次拥有本技能召唤兽对目标造成的法术伤害，持续到战斗结束。提升效果最多叠加5次，且受召唤兽自身魔力点数影响，不能与鬼魂和高级鬼魂技能共存。"
        wds.效果 = "本方每被击飞一个不带有此技能的召唤兽，自身对目标造成的法术伤害增加" ..
        math.floor((fl - dj) * 0.06 * (1 + s * 0.2)) .. "点。持续到战斗结束，最多可叠加5次，此技能与鬼魂、高鬼魂冲突，效果受自身魔力点数影响。"
        wds.资源 = "item.wdf"
        wds.模型 = 0x97117DEE
    end
    return wds
end
