取场景特效表 = function(地图ID)
  local 特效表 = {}
  if 1003 == 地图ID then
    特效表[1] = {
      x = 93,
      y = 83,
      ["切换"] = 137212032,
      ["资源"] = "mapani.wdf"
    }
    特效表[2] = {
      x = 25,
      y = 87,
      ["切换"] = 87442414,
      ["资源"] = "mapani.wdf"
    }
    特效表[3] = {
      x = 70,
      y = 40,
      ["切换"] = 4151610643,
      ["资源"] = "mapani.wdf"
    }
    特效表[4] = {
      x = 133,
      y = 88,
      ["切换"] = 4177302544,
      ["资源"] = "mapani.wdf"
    }
    特效表[5] = {
      x = 125,
      y = 90,
      ["切换"] = 4177302544,
      ["资源"] = "mapani.wdf"
    }
    特效表[6] = {
      x = 115,
      y = 94,
      ["切换"] = 4177302544,
      ["资源"] = "mapani.wdf"
    }
    特效表[7] = {
      x = 54,
      y = 21,
      ["切换"] = 4177302544,
      ["资源"] = "mapani.wdf"
    }
    特效表[8] = {
      x = 50,
      y = 35,
      ["切换"] = 4126063706,
      ["资源"] = "mapani.wdf"
    }
    特效表[9] = {
      x = 128,
      y = 100,
      ["切换"] = 4126063706,
      ["资源"] = "mapani.wdf"
    }
    特效表[10] = {
      x = 120,
      y = 105,
      ["切换"] = 4126063706,
      ["资源"] = "mapani.wdf"
    }
    特效表[11] = {
      x = 94,
      y = 24,
      ["切换"] = 4098882521,
      ["资源"] = "mapani.wdf"
    }
    特效表[12] = {
      x = 117,
      y = 36,
      ["切换"] = 4098882521,
      ["资源"] = "mapani.wdf"
    }
    特效表[13] = {
      x = 144,
      y = 57,
      ["切换"] = 4098882521,
      ["资源"] = "mapani.wdf"
    }
    特效表[14] = {
      x = 55,
      y = 76,
      ["切换"] = 4098882521,
      ["资源"] = "mapani.wdf"
    }
    特效表[15] = {
      x = 14,
      y = 75,
      ["切换"] = 4098882521,
      ["资源"] = "mapani.wdf"
    }
    特效表[16] = {
      x = 3,
      y = 85,
      ["切换"] = 4098882521,
      ["资源"] = "mapani.wdf"
    }
    特效表[17] = {
      x = 34,
      y = 93,
      ["切换"] = 4098882521,
      ["资源"] = "mapani.wdf"
    }
    特效表[18] = {
      x = 62,
      y = 96,
      ["切换"] = 4098882521,
      ["资源"] = "mapani.wdf"
    }
    特效表[19] = {
      x = 4,
      y = 37,
      ["切换"] = 4098882521,
      ["资源"] = "mapani.wdf"
    }
    特效表[20] = {
      x = 3,
      y = 24,
      ["切换"] = 4098882521,
      ["资源"] = "mapani.wdf"
    }
    特效表[21] = {
      x = 4,
      y = 11,
      ["切换"] = 4098882521,
      ["资源"] = "mapani.wdf"
    }
    特效表[22] = {
      x = 4,
      y = 12,
      ["切换"] = 4098882521,
      ["资源"] = "mapani.wdf"
    }
    特效表[23] = {
      x = 150,
      y = 29,
      ["切换"] = 4098882521,
      ["资源"] = "mapani.wdf"
    }
    特效表[24] = {
      x = 78,
      y = 43,
      ["切换"] = 4086948565,
      ["资源"] = "mapani.wdf"
    }
    特效表[25] = {
      x = 95,
      y = 67,
      ["切换"] = 4046268095,
      ["资源"] = "mapani.wdf"
    }
    特效表[26] = {
      x = 38,
      y = 37,
      ["切换"] = 4046268095,
      ["资源"] = "mapani.wdf"
    }
    特效表[27] = {
      x = 20,
      y = 3,
      ["切换"] = 4046268095,
      ["资源"] = "mapani.wdf"
    }
    特效表[28] = {
      x = 61,
      y = -5,
      ["切换"] = 4177302544,
      ["资源"] = "mapani.wdf"
    }
    特效表[29] = {
      x = 100,
      y = 60,
      ["切换"] = 3871988291,
      ["资源"] = "mapani.wdf"
    }
    特效表[30] = {
      x = 128,
      y = 79,
      ["切换"] = 3841344173,
      ["资源"] = "mapani.wdf"
    }
    特效表[31] = {
      x = 105,
      y = 75,
      ["切换"] = 3841344173,
      ["资源"] = "mapani.wdf"
    }
    特效表[32] = {
      x = 105,
      y = 95,
      ["切换"] = 3841344173,
      ["资源"] = "mapani.wdf"
    }
    特效表[33] = {
      x = 52,
      y = 13,
      ["切换"] = 3841344173,
      ["资源"] = "mapani.wdf"
    }
    特效表[34] = {
      x = 37,
      y = 5,
      ["切换"] = 3841344173,
      ["资源"] = "mapani.wdf"
    }
    特效表[35] = {
      x = 65,
      y = 4,
      ["切换"] = 3841344173,
      ["资源"] = "mapani.wdf"
    }
    特效表[36] = {
      x = 88,
      y = 81,
      ["切换"] = 3836865264,
      ["资源"] = "mapani.wdf"
    }
    特效表[37] = {
      x = 100,
      y = 55,
      ["切换"] = 3739782984,
      ["资源"] = "mapani.wdf"
    }
    特效表[38] = {
      x = 100,
      y = 70,
      ["切换"] = 3159867265,
      ["资源"] = "mapani.wdf"
    }
    特效表[39] = {
      x = 34,
      y = 53,
      ["切换"] = 3159867265,
      ["资源"] = "mapani.wdf"
    }
    特效表[40] = {
      x = 26,
      y = 73,
      ["切换"] = 3159867265,
      ["资源"] = "mapani.wdf"
    }
    特效表[41] = {
      x = 33,
      y = 77,
      ["切换"] = 3159867265,
      ["资源"] = "mapani.wdf"
    }
    特效表[42] = {
      x = 71,
      y = 80,
      ["切换"] = 3159867265,
      ["资源"] = "mapani.wdf"
    }
    特效表[43] = {
      x = 78,
      y = 83,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[44] = {
      x = 34,
      y = 77,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[45] = {
      x = 39,
      y = 45,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[46] = {
      x = 100,
      y = 79,
      ["切换"] = 1971977060,
      ["资源"] = "mapani.wdf"
    }
    特效表[47] = {
      x = 106,
      y = 79,
      ["切换"] = 1971977060,
      ["资源"] = "mapani.wdf"
    }
    特效表[48] = {
      x = 106,
      y = 75,
      ["切换"] = 1971977060,
      ["资源"] = "mapani.wdf"
    }
    特效表[49] = {
      x = 103,
      y = 73,
      ["切换"] = 1971977060,
      ["资源"] = "mapani.wdf"
    }
    特效表[50] = {
      x = 34,
      y = 8,
      ["切换"] = 2173222531,
      ["资源"] = "mapani.wdf"
    }
    特效表[51] = {
      x = 35,
      y = 11,
      ["切换"] = 2173222531,
      ["资源"] = "mapani.wdf"
    }
    特效表[52] = {
      x = 54,
      y = 32,
      ["切换"] = 2204294324,
      ["资源"] = "mapani.wdf"
    }
    特效表[53] = {
      x = 60,
      y = 30,
      ["切换"] = 2204294324,
      ["资源"] = "mapani.wdf"
    }
    特效表[54] = {
      x = 8,
      y = 8,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[55] = {
      x = 2,
      y = 12,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[56] = {
      x = 83,
      y = 6,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[57] = {
      x = 91,
      y = 29,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[58] = {
      x = 148,
      y = 31,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[59] = {
      x = 154,
      y = 26,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[60] = {
      x = 166,
      y = 3,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[61] = {
      x = 181,
      y = 4,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[62] = {
      x = 184,
      y = 10,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[63] = {
      x = 143,
      y = 59,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[64] = {
      x = 159,
      y = 91,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[65] = {
      x = 145,
      y = 92,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[66] = {
      x = 54,
      y = 79,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[67] = {
      x = 14,
      y = 74,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[68] = {
      x = 1,
      y = 36,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[69] = {
      x = 4,
      y = 86,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[70] = {
      x = 1,
      y = 61,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[71] = {
      x = 35,
      y = 94,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[72] = {
      x = 49,
      y = 95,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[73] = {
      x = 62,
      y = 95,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[74] = {
      x = 114,
      y = 41,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[75] = {
      x = 177,
      y = 80,
      ["切换"] = 848685902,
      ["资源"] = "mapani.wdf"
    }
    特效表[76] = {
      x = 184,
      y = 48,
      ["切换"] = 848685902,
      ["资源"] = "mapani.wdf"
    }
    特效表[77] = {
      x = 180,
      y = 20,
      ["切换"] = 848685902,
      ["资源"] = "mapani.wdf"
    }
  elseif 1506 == 地图ID then
    特效表[1] = {
      x = 61,
      y = 6,
      ["切换"] = 214940485,
      ["资源"] = "mapani.wdf"
    }
    特效表[2] = {
      x = 45,
      y = 49,
      ["切换"] = 252816892,
      ["资源"] = "mapani.wdf"
    }
    特效表[3] = {
      x = 40,
      y = 90,
      ["切换"] = 252816892,
      ["资源"] = "mapani.wdf"
    }
    特效表[4] = {
      x = 43,
      y = 100,
      ["切换"] = 361948205,
      ["资源"] = "mapani.wdf"
    }
    特效表[5] = {
      x = 25,
      y = 115,
      ["切换"] = 361948205,
      ["资源"] = "mapani.wdf"
    }
    特效表[6] = {
      x = 40,
      y = 40,
      ["切换"] = 1942218751,
      ["资源"] = "mapani.wdf"
    }
    特效表[7] = {
      x = 43,
      y = 40,
      ["切换"] = 1942218751,
      ["资源"] = "mapani.wdf"
    }
    特效表[8] = {
      x = 33,
      y = 53,
      ["切换"] = 2350967246,
      ["资源"] = "mapani.wdf"
    }
    特效表[9] = {
      x = 33,
      y = 73,
      ["切换"] = 252816892,
      ["资源"] = "mapani.wdf"
    }
    特效表[10] = {
      x = 30,
      y = 73,
      ["切换"] = 252816892,
      ["资源"] = "mapani.wdf"
    }
    特效表[11] = {
      x = 38,
      y = 76,
      ["切换"] = 4047511852,
      ["资源"] = "mapani.wdf"
    }
    特效表[12] = {
      x = 102,
      y = 110,
      ["切换"] = 3841344173,
      ["资源"] = "mapani.wdf"
    }
    特效表[13] = {
      x = 105,
      y = 53,
      ["切换"] = 3841344173,
      ["资源"] = "mapani.wdf"
    }
  elseif 1507 == 地图ID then
    特效表[1] = {
      x = 44,
      y = 35,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[2] = {
      x = 15,
      y = 34,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[3] = {
      x = 47,
      y = 14,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[4] = {
      x = 29,
      y = 8,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[5] = {
      x = 10,
      y = 14,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[6] = {
      x = 48,
      y = 39,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[7] = {
      x = 22,
      y = 21,
      ["切换"] = 2762740114,
      ["资源"] = "mapani.wdf"
    }
    特效表[8] = {
      x = 46,
      y = 20,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[9] = {
      x = 33,
      y = 42,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[10] = {
      x = 56,
      y = 34,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[11] = {
      x = 6,
      y = 35,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[12] = {
      x = 145,
      y = 61,
      ["切换"] = 2762740114,
      ["资源"] = "mapani.wdf"
    }
    特效表[13] = {
      x = 111,
      y = 61,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[14] = {
      x = 72,
      y = 42,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[15] = {
      x = 18,
      y = 63,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[16] = {
      x = 29,
      y = 48,
      ["切换"] = 2762740114,
      ["资源"] = "mapani.wdf"
    }
    特效表[17] = {
      x = 82,
      y = 46,
      ["切换"] = 2762740114,
      ["资源"] = "mapani.wdf"
    }
    特效表[18] = {
      x = 11,
      y = 65,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[19] = {
      x = 19,
      y = 57,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[20] = {
      x = 35,
      y = 67,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[21] = {
      x = 57,
      y = 64,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[22] = {
      x = 7,
      y = 43,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[23] = {
      x = 29,
      y = 37,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[24] = {
      x = 10,
      y = 19,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[25] = {
      x = 65,
      y = 42,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[26] = {
      x = 76,
      y = 51,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[27] = {
      x = 93,
      y = 55,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[28] = {
      x = 120,
      y = 61,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[29] = {
      x = 136,
      y = 58,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[30] = {
      x = 81,
      y = 20,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[31] = {
      x = 93,
      y = 26,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[32] = {
      x = 132,
      y = 12,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[33] = {
      x = 121,
      y = 30,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[34] = {
      x = 109,
      y = 27,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[35] = {
      x = 114,
      y = 35,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[36] = {
      x = 83,
      y = 39,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[37] = {
      x = 103,
      y = 57,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[38] = {
      x = 139,
      y = 63,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[39] = {
      x = 14,
      y = 48,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[40] = {
      x = 103,
      y = 15,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[41] = {
      x = 119,
      y = 16,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[42] = {
      x = 53,
      y = 48,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[43] = {
      x = 93,
      y = 8,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[44] = {
      x = 111,
      y = 5,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[45] = {
      x = 94,
      y = 7,
      ["切换"] = 2762740114,
      ["资源"] = "mapani.wdf"
    }
    特效表[46] = {
      x = 129,
      y = 24,
      ["切换"] = 2762740114,
      ["资源"] = "mapani.wdf"
    }
    特效表[47] = {
      x = 116,
      y = 29,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[48] = {
      x = 107,
      y = 37,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[49] = {
      x = 128,
      y = 35,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[50] = {
      x = 124,
      y = 16,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[51] = {
      x = 72,
      y = 23,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[52] = {
      x = 113,
      y = 21,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[53] = {
      x = 122,
      y = 4,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[54] = {
      x = 145,
      y = 35,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[55] = {
      x = 118,
      y = 29,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[56] = {
      x = 90,
      y = 17,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[57] = {
      x = 93,
      y = 16,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
  elseif 1508 == 地图ID then
    特效表[1] = {
      x = 44,
      y = 35,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[2] = {
      x = 15,
      y = 34,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[3] = {
      x = 47,
      y = 14,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[4] = {
      x = 29,
      y = 8,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[5] = {
      x = 10,
      y = 14,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[6] = {
      x = 48,
      y = 39,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[7] = {
      x = 22,
      y = 21,
      ["切换"] = 2762740114,
      ["资源"] = "mapani.wdf"
    }
    特效表[8] = {
      x = 46,
      y = 20,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[9] = {
      x = 33,
      y = 42,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[10] = {
      x = 56,
      y = 34,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[11] = {
      x = 6,
      y = 35,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[12] = {
      x = 42,
      y = 68,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[13] = {
      x = 24,
      y = 64,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[14] = {
      x = 69,
      y = 49,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[15] = {
      x = 61,
      y = 62,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[16] = {
      x = 47,
      y = 47,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[17] = {
      x = 56,
      y = 54,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[18] = {
      x = 71,
      y = 61,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[19] = {
      x = 64,
      y = 43,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[20] = {
      x = 9,
      y = 60,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[21] = {
      x = 27,
      y = 67,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[22] = {
      x = 34,
      y = 22,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[23] = {
      x = 29,
      y = 14,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[24] = {
      x = 62,
      y = 64,
      ["切换"] = 2762740114,
      ["资源"] = "mapani.wdf"
    }
  elseif 1509 == 地图ID then
    特效表[1] = {
      x = 14,
      y = 22,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[2] = {
      x = 10,
      y = 14,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[3] = {
      x = 22,
      y = 21,
      ["切换"] = 2762740114,
      ["资源"] = "mapani.wdf"
    }
    特效表[4] = {
      x = 46,
      y = 20,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[5] = {
      x = 33,
      y = 42,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[6] = {
      x = 56,
      y = 34,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[7] = {
      x = 23,
      y = 30,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[8] = {
      x = 29,
      y = 21,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[9] = {
      x = 24,
      y = 29,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[10] = {
      x = 12,
      y = 20,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
  elseif 1501 == 地图ID then
    特效表[1] = {
      x = 144,
      y = 115,
      ["切换"] = 1877129024,
      ["资源"] = "mapani.wdf"
    }
    特效表[2] = {
      x = 149,
      y = 110,
      ["切换"] = 4098882521,
      ["资源"] = "mapani.wdf"
    }
    特效表[3] = {
      x = 149,
      y = 115,
      ["切换"] = 1984568886,
      ["资源"] = "mapani.wdf"
    }
    特效表[4] = {
      x = 150,
      y = 126,
      ["切换"] = 4098882521,
      ["资源"] = "mapani.wdf"
    }
    特效表[5] = {
      x = 79,
      y = 83,
      ["切换"] = 4098882521,
      ["资源"] = "mapani.wdf"
    }
    特效表[6] = {
      x = 68,
      y = 77,
      ["切换"] = 1877129024,
      ["资源"] = "mapani.wdf"
    }
    特效表[7] = {
      x = 68,
      y = 67,
      ["切换"] = 1984568886,
      ["资源"] = "mapani.wdf"
    }
    特效表[8] = {
      x = 94,
      y = 28,
      ["切换"] = 1877129024,
      ["资源"] = "mapani.wdf"
    }
    特效表[9] = {
      x = 98,
      y = 19,
      ["切换"] = 1984568886,
      ["资源"] = "mapani.wdf"
    }
    特效表[10] = {
      x = 2,
      y = 5,
      ["切换"] = 1877129024,
      ["资源"] = "mapani.wdf"
    }
    特效表[11] = {
      x = 9,
      y = 46,
      ["切换"] = 1877129024,
      ["资源"] = "mapani.wdf"
    }
    特效表[12] = {
      x = 55,
      y = 135,
      ["切换"] = 1877129024,
      ["资源"] = "mapani.wdf"
    }
    特效表[13] = {
      x = 55,
      y = 127,
      ["切换"] = 1984568886,
      ["资源"] = "mapani.wdf"
    }
    特效表[14] = {
      x = 107,
      y = 140,
      ["切换"] = 1877129024,
      ["资源"] = "mapani.wdf"
    }
    特效表[15] = {
      x = 162,
      y = 105,
      ["切换"] = 1877129024,
      ["资源"] = "mapani.wdf"
    }
    特效表[16] = {
      x = 287,
      y = 95,
      ["切换"] = 1877129024,
      ["资源"] = "mapani.wdf"
    }
    特效表[17] = {
      x = 245,
      y = 55,
      ["切换"] = 1877129024,
      ["资源"] = "mapani.wdf"
    }
    特效表[18] = {
      x = 243,
      y = 40,
      ["切换"] = 1984568886,
      ["资源"] = "mapani.wdf"
    }
    特效表[19] = {
      x = 179,
      y = 55,
      ["切换"] = 1877129024,
      ["资源"] = "mapani.wdf"
    }
    特效表[20] = {
      x = 183,
      y = 47,
      ["切换"] = 1984568886,
      ["资源"] = "mapani.wdf"
    }
    特效表[21] = {
      x = 218,
      y = 52,
      ["切换"] = 1877129024,
      ["资源"] = "mapani.wdf"
    }
    特效表[22] = {
      x = 186,
      y = 53,
      ["切换"] = 1984568886,
      ["资源"] = "mapani.wdf"
    }
    特效表[23] = {
      x = 216,
      y = 2,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[24] = {
      x = 136,
      y = 42,
      ["切换"] = 1877129024,
      ["资源"] = "mapani.wdf"
    }
    特效表[25] = {
      x = 141,
      y = 38,
      ["切换"] = 1984568886,
      ["资源"] = "mapani.wdf"
    }
    特效表[26] = {
      x = 190,
      y = 49,
      ["切换"] = 137212032,
      ["资源"] = "mapani.wdf"
    }
    特效表[27] = {
      x = 208,
      y = 65,
      ["切换"] = 1971977060,
      ["资源"] = "mapani.wdf"
    }
    特效表[28] = {
      x = 211,
      y = 70,
      ["切换"] = 137212032,
      ["资源"] = "mapani.wdf"
    }
    特效表[29] = {
      x = 159,
      y = 137,
      ["切换"] = 137212032,
      ["资源"] = "mapani.wdf"
    }
    特效表[30] = {
      x = 155,
      y = 140,
      ["切换"] = 137212032,
      ["资源"] = "mapani.wdf"
    }
    特效表[31] = {
      x = 156,
      y = 142,
      ["切换"] = 137212032,
      ["资源"] = "mapani.wdf"
    }
    特效表[32] = {
      x = 152,
      y = 144,
      ["切换"] = 137212032,
      ["资源"] = "mapani.wdf"
    }
    特效表[33] = {
      x = 150,
      y = 140,
      ["切换"] = 1971977060,
      ["资源"] = "mapani.wdf"
    }
    特效表[34] = {
      x = 130,
      y = 127,
      ["切换"] = 137212032,
      ["资源"] = "mapani.wdf"
    }
    特效表[35] = {
      x = 132,
      y = 118,
      ["切换"] = 137212032,
      ["资源"] = "mapani.wdf"
    }
    特效表[36] = {
      x = 132,
      y = 123,
      ["切换"] = 1971977060,
      ["资源"] = "mapani.wdf"
    }
    特效表[36] = {
      x = 158,
      y = 24,
      ["切换"] = 1971977060,
      ["资源"] = "mapani.wdf"
    }
    特效表[37] = {
      x = 162,
      y = 27,
      ["切换"] = 1971977060,
      ["资源"] = "mapani.wdf"
    }
    特效表[38] = {
      x = 127,
      y = 37,
      ["切换"] = 137212032,
      ["资源"] = "mapani.wdf"
    }
    特效表[39] = {
      x = 93,
      y = 63,
      ["切换"] = 1971977060,
      ["资源"] = "mapani.wdf"
    }
    特效表[40] = {
      x = 79,
      y = 72,
      ["切换"] = 1971977060,
      ["资源"] = "mapani.wdf"
    }
    特效表[41] = {
      x = 76,
      y = 75,
      ["切换"] = 137212032,
      ["资源"] = "mapani.wdf"
    }
    特效表[42] = {
      x = 124,
      y = 142,
      ["切换"] = 1971977060,
      ["资源"] = "mapani.wdf"
    }
    特效表[43] = {
      x = 259,
      y = 84,
      ["切换"] = 1971977060,
      ["资源"] = "mapani.wdf"
    }
    特效表[44] = {
      x = 259,
      y = 87,
      ["切换"] = 1971977060,
      ["资源"] = "mapani.wdf"
    }
    特效表[45] = {
      x = 263,
      y = 87,
      ["切换"] = 1971977060,
      ["资源"] = "mapani.wdf"
    }
    特效表[46] = {
      x = 265,
      y = 90,
      ["切换"] = 137212032,
      ["资源"] = "mapani.wdf"
    }
    特效表[47] = {
      x = 218,
      y = 79,
      ["切换"] = 137212032,
      ["资源"] = "mapani.wdf"
    }
  elseif 1001 == 地图ID then
    特效表[1] = {
      x = 322,
      y = 160,
      ["切换"] = 137212032,
      ["资源"] = "mapani.wdf"
    }
    特效表[2] = {
      x = 325,
      y = 165,
      ["切换"] = 137212032,
      ["资源"] = "mapani.wdf"
    }
    特效表[3] = {
      x = 319,
      y = 163,
      ["切换"] = 137212032,
      ["资源"] = "mapani.wdf"
    }
    特效表[4] = {
      x = 330,
      y = 160,
      ["切换"] = 137212032,
      ["资源"] = "mapani.wdf"
    }
    特效表[5] = {
      x = 440,
      y = 98,
      ["切换"] = 137212032,
      ["资源"] = "mapani.wdf"
    }
    特效表[6] = {
      x = 438,
      y = 102,
      ["切换"] = 137212032,
      ["资源"] = "mapani.wdf"
    }
    特效表[7] = {
      x = 443,
      y = 107,
      ["切换"] = 137212032,
      ["资源"] = "mapani.wdf"
    }
  elseif 1070 == 地图ID then
    特效表[1] = {
      x = 74,
      y = 15,
      ["切换"] = 4046268095,
      ["资源"] = "mapani.wdf"
    }
    特效表[2] = {
      x = 84,
      y = 2,
      ["切换"] = 4126063706,
      ["资源"] = "mapani.wdf"
    }
    特效表[3] = {
      x = 90,
      y = 9,
      ["切换"] = 214940485,
      ["资源"] = "mapani.wdf"
    }
    特效表[4] = {
      x = 92,
      y = 29,
      ["切换"] = 376423128,
      ["资源"] = "mapani.wdf"
    }
    特效表[5] = {
      x = 117,
      y = 23,
      ["切换"] = 100549779,
      ["资源"] = "mapani.wdf"
    }
    特效表[6] = {
      x = 141.5,
      y = 30,
      ["切换"] = 100549779,
      ["资源"] = "mapani.wdf"
    }
    特效表[7] = {
      x = 31,
      y = 76,
      ["切换"] = 3159867265,
      ["资源"] = "mapani.wdf"
    }
  elseif 1142 == 地图ID then
    特效表[1] = {
      x = 2,
      y = 44,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[2] = {
      x = 47,
      y = 7,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[3] = {
      x = 90,
      y = 13,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[4] = {
      x = 86,
      y = 56,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[5] = {
      x = 119,
      y = 40,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[6] = {
      x = 102,
      y = 76,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[7] = {
      x = 55,
      y = 61,
      ["切换"] = 334624651,
      ["资源"] = "mapani.wdf"
    }
    特效表[8] = {
      x = 48,
      y = 66,
      ["切换"] = 334624651,
      ["资源"] = "mapani.wdf"
    }
    特效表[9] = {
      x = 67,
      y = 62,
      ["切换"] = 334624651,
      ["资源"] = "mapani.wdf"
    }
    特效表[10] = {
      x = 76,
      y = 59,
      ["切换"] = 334624651,
      ["资源"] = "mapani.wdf"
    }
    特效表[11] = {
      x = 59,
      y = 46,
      ["切换"] = 334624651,
      ["资源"] = "mapani.wdf"
    }
  elseif 1231 == 地图ID then
    特效表[1] = {
      x = 92,
      y = 92,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[2] = {
      x = 71,
      y = 93,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[3] = {
      x = 55,
      y = 92,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[4] = {
      x = 42,
      y = 92,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[5] = {
      x = 20,
      y = 92,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[6] = {
      x = 5,
      y = 88,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[7] = {
      x = 8,
      y = 63,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[8] = {
      x = 7,
      y = 48,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[9] = {
      x = 11,
      y = 34,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[10] = {
      x = 14,
      y = 23,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[11] = {
      x = 50,
      y = 31,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[12] = {
      x = 35,
      y = 44,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[13] = {
      x = 38,
      y = 54,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[14] = {
      x = 56,
      y = 68,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[15] = {
      x = 72,
      y = 72,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[16] = {
      x = 104,
      y = 58,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[17] = {
      x = 63,
      y = 14,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[18] = {
      x = 83,
      y = 12,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[19] = {
      x = 94,
      y = 40,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[20] = {
      x = 62,
      y = 40,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
  elseif 1513 == 地图ID then
    特效表[1] = {
      x = 151,
      y = 16,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[2] = {
      x = 173,
      y = 6,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[3] = {
      x = 195,
      y = 16,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[4] = {
      x = 156,
      y = 35,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[5] = {
      x = 180,
      y = 45,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[6] = {
      x = 151,
      y = 16,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[7] = {
      x = 193,
      y = 34,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[8] = {
      x = 140,
      y = 53,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[9] = {
      x = 142,
      y = 68,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[10] = {
      x = 48,
      y = 58,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[11] = {
      x = 68,
      y = 58,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[12] = {
      x = 88,
      y = 78,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[13] = {
      x = 48,
      y = 95,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[14] = {
      x = 77,
      y = 99,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[15] = {
      x = 109,
      y = 60,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[16] = {
      x = 108,
      y = 40,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
    特效表[17] = {
      x = 129,
      y = 10,
      ["切换"] = 2786219496,
      ["资源"] = "mapani.wdf"
    }
  elseif 1186 == 地图ID then
    特效表[1] = {
      x = 55,
      y = 81,
      ["切换"] = 983990561,
      ["资源"] = "mapani.wdf"
    }
    特效表[2] = {
      x = 55,
      y = 81,
      ["切换"] = 1166467677,
      ["资源"] = "mapani.wdf"
    }
  elseif 1187 == 地图ID then
    特效表[1] = {
      x = 10,
      y = 20,
      ["切换"] = 1166467677,
      ["资源"] = "mapani.wdf"
    }
  elseif 1188 == 地图ID then
    特效表[1] = {
      x = 10,
      y = 20,
      ["切换"] = 1166467677,
      ["资源"] = "mapani.wdf"
    }
  elseif 1189 == 地图ID then
    特效表[1] = {
      x = 10,
      y = 20,
      ["切换"] = 1166467677,
      ["资源"] = "mapani.wdf"
    }
  elseif 1190 == 地图ID then
    特效表[1] = {
      x = 10,
      y = 20,
      ["切换"] = 1166467677,
      ["资源"] = "mapani.wdf"
    }
  elseif 1191 == 地图ID then
    特效表[1] = {
      x = 10,
      y = 20,
      ["切换"] = 1166467677,
      ["资源"] = "mapani.wdf"
    }
    特效表[2] = {
      x = 16,
      y = 18,
      ["切换"] = 1166467677,
      ["资源"] = "mapani.wdf"
    }
    特效表[3] = {
      x = 72,
      y = 47,
      ["切换"] = 1166467677,
      ["资源"] = "mapani.wdf"
    }
    特效表[4] = {
      x = 78,
      y = 41,
      ["切换"] = 1166467677,
      ["资源"] = "mapani.wdf"
    }
    特效表[5] = {
      x = 56,
      y = 53,
      ["切换"] = 1166467677,
      ["资源"] = "mapani.wdf"
    }
    特效表[6] = {
      x = 46,
      y = 51,
      ["切换"] = 1166467677,
      ["资源"] = "mapani.wdf"
    }
    特效表[7] = {
      x = 55,
      y = 47,
      ["切换"] = 1166467677,
      ["资源"] = "mapani.wdf"
    }
    特效表[8] = {
      x = 47,
      y = 45,
      ["切换"] = 1166467677,
      ["资源"] = "mapani.wdf"
    }
    特效表[9] = {
      x = 44,
      y = 3,
      ["切换"] = 1166467677,
      ["资源"] = "mapani.wdf"
    }
    特效表[10] = {
      x = 62,
      y = 3,
      ["切换"] = 1166467677,
      ["资源"] = "mapani.wdf"
    }
    特效表[11] = {
      x = 57,
      y = 4,
      ["切换"] = 1166467677,
      ["资源"] = "mapani.wdf"
    }
    特效表[12] = {
      x = 50,
      y = 3,
      ["切换"] = 1166467677,
      ["资源"] = "mapani.wdf"
    }
    特效表[13] = {
      x = 77,
      y = 2,
      ["切换"] = 1166467677,
      ["资源"] = "mapani.wdf"
    }
    特效表[14] = {
      x = 100,
      y = 1,
      ["切换"] = 1166467677,
      ["资源"] = "mapani.wdf"
    }
    特效表[15] = {
      x = 84,
      y = 2,
      ["切换"] = 1166467677,
      ["资源"] = "mapani.wdf"
    }
  elseif 1192 == 地图ID then
    特效表[1] = {
      x = 91,
      y = 6,
      ["切换"] = 1166467677,
      ["资源"] = "mapani.wdf"
    }
    特效表[2] = {
      x = 90,
      y = 16,
      ["切换"] = 1166467677,
      ["资源"] = "mapani.wdf"
    }
    特效表[3] = {
      x = 93,
      y = 13,
      ["切换"] = 1166467677,
      ["资源"] = "mapani.wdf"
    }
    特效表[4] = {
      x = 53,
      y = 44,
      ["切换"] = 1166467677,
      ["资源"] = "mapani.wdf"
    }
    特效表[5] = {
      x = 48,
      y = 39,
      ["切换"] = 1166467677,
      ["资源"] = "mapani.wdf"
    }
    特效表[6] = {
      x = 110,
      y = 44,
      ["切换"] = 1166467677,
      ["资源"] = "mapani.wdf"
    }
    特效表[7] = {
      x = 117,
      y = 54,
      ["切换"] = 1166467677,
      ["资源"] = "mapani.wdf"
    }
    特效表[8] = {
      x = 113,
      y = 51,
      ["切换"] = 1166467677,
      ["资源"] = "mapani.wdf"
    }
    特效表[9] = {
      x = 99,
      y = 47,
      ["切换"] = 1166467677,
      ["资源"] = "mapani.wdf"
    }
    特效表[10] = {
      x = 34,
      y = 36,
      ["切换"] = 1166467677,
      ["资源"] = "mapani.wdf"
    }
    特效表[11] = {
      x = 24,
      y = 29,
      ["切换"] = 1166467677,
      ["资源"] = "mapani.wdf"
    }
    特效表[12] = {
      x = 16,
      y = 37,
      ["切换"] = 1166467677,
      ["资源"] = "mapani.wdf"
    }
    特效表[13] = {
      x = 38,
      y = 22,
      ["切换"] = 1166467677,
      ["资源"] = "mapani.wdf"
    }
    特效表[14] = {
      x = 45,
      y = 13,
      ["切换"] = 1166467677,
      ["资源"] = "mapani.wdf"
    }
    特效表[15] = {
      x = 38,
      y = 16,
      ["切换"] = 1166467677,
      ["资源"] = "mapani.wdf"
    }
    特效表[16] = {
      x = 107,
      y = 52,
      ["切换"] = 1166467677,
      ["资源"] = "mapani.wdf"
    }
    特效表[17] = {
      x = 88,
      y = 13,
      ["切换"] = 1166467677,
      ["资源"] = "mapani.wdf"
    }
    特效表[18] = {
      x = 44,
      y = 18,
      ["切换"] = 1166467677,
      ["资源"] = "mapani.wdf"
    }
    特效表[19] = {
      x = 28,
      y = 36,
      ["切换"] = 1166467677,
      ["资源"] = "mapani.wdf"
    }
    特效表[20] = {
      x = 22,
      y = 34,
      ["切换"] = 1166467677,
      ["资源"] = "mapani.wdf"
    }
  elseif 1116 == 地图ID then
    特效表[1] = {
      x = 89,
      y = 58,
      ["切换"] = 74589077,
      ["资源"] = "mapani.wdf"
    }
    特效表[2] = {
      x = 100,
      y = 64,
      ["切换"] = 2762740114,
      ["资源"] = "mapani.wdf"
    }
    特效表[3] = {
      x = 77,
      y = 53,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[4] = {
      x = 136,
      y = 84,
      ["切换"] = 74589077,
      ["资源"] = "mapani.wdf"
    }
    特效表[5] = {
      x = 66,
      y = 45,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[6] = {
      x = 13,
      y = 51,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[7] = {
      x = 36,
      y = 75,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[8] = {
      x = 14,
      y = 104,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[9] = {
      x = 78,
      y = 98,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[10] = {
      x = 108,
      y = 101,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[11] = {
      x = 110,
      y = 78,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[12] = {
      x = 151,
      y = 94,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[13] = {
      x = 198,
      y = 99,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[14] = {
      x = 199,
      y = 62,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[15] = {
      x = 165,
      y = 43,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[16] = {
      x = 191,
      y = 38,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[17] = {
      x = 165,
      y = 13,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[18] = {
      x = 142,
      y = 18,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[19] = {
      x = 104,
      y = 17,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[20] = {
      x = 84,
      y = 16,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[21] = {
      x = 36,
      y = 8,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[22] = {
      x = 62,
      y = 66,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[23] = {
      x = 152,
      y = 51,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[24] = {
      x = 13,
      y = 90,
      ["切换"] = 2762740114,
      ["资源"] = "mapani.wdf"
    }
    特效表[25] = {
      x = 55,
      y = 102,
      ["切换"] = 2762740114,
      ["资源"] = "mapani.wdf"
    }
    特效表[26] = {
      x = 174,
      y = 111,
      ["切换"] = 2762740114,
      ["资源"] = "mapani.wdf"
    }
    特效表[27] = {
      x = 124,
      y = 94,
      ["切换"] = 2762740114,
      ["资源"] = "mapani.wdf"
    }
    特效表[28] = {
      x = 62,
      y = 54,
      ["切换"] = 2762740114,
      ["资源"] = "mapani.wdf"
    }
    特效表[29] = {
      x = 12,
      y = 39,
      ["切换"] = 2762740114,
      ["资源"] = "mapani.wdf"
    }
    特效表[30] = {
      x = 120,
      y = 9,
      ["切换"] = 2762740114,
      ["资源"] = "mapani.wdf"
    }
    特效表[31] = {
      x = 24,
      y = 16,
      ["切换"] = 2762740114,
      ["资源"] = "mapani.wdf"
    }
    特效表[32] = {
      x = 33,
      y = 61,
      ["切换"] = 2762740114,
      ["资源"] = "mapani.wdf"
    }
    特效表[33] = {
      x = 55,
      y = 28,
      ["切换"] = 2762740114,
      ["资源"] = "mapani.wdf"
    }
    特效表[34] = {
      x = 206,
      y = 37,
      ["切换"] = 2762740114,
      ["资源"] = "mapani.wdf"
    }
    特效表[35] = {
      x = 175,
      y = 51,
      ["切换"] = 2762740114,
      ["资源"] = "mapani.wdf"
    }
    特效表[36] = {
      x = 152,
      y = 81,
      ["切换"] = 2762740114,
      ["资源"] = "mapani.wdf"
    }
    特效表[37] = {
      x = 121,
      y = 113,
      ["切换"] = 2762740114,
      ["资源"] = "mapani.wdf"
    }
    特效表[38] = {
      x = 179,
      y = 11,
      ["切换"] = 2762740114,
      ["资源"] = "mapani.wdf"
    }
    特效表[39] = {
      x = 123,
      y = 20,
      ["切换"] = 1817206946,
      ["资源"] = "mapani.wdf"
    }
    特效表[40] = {
      x = 64.5,
      y = 69,
      ["切换"] = 1817206946,
      ["资源"] = "mapani.wdf"
    }
    特效表[41] = {
      x = 79.5,
      y = 76,
      ["切换"] = 1817206946,
      ["资源"] = "mapani.wdf"
    }
    特效表[42] = {
      x = 96.5,
      y = 83,
      ["切换"] = 1817206946,
      ["资源"] = "mapani.wdf"
    }
    特效表[43] = {
      x = 50.5,
      y = 59,
      ["切换"] = 1817206946,
      ["资源"] = "mapani.wdf"
    }
    特效表[44] = {
      x = 90,
      y = 79,
      ["切换"] = 1817206946,
      ["资源"] = "mapani.wdf"
    }
    特效表[45] = {
      x = 44,
      y = 55,
      ["切换"] = 1817206946,
      ["资源"] = "mapani.wdf"
    }
    特效表[46] = {
      x = 63,
      y = 27,
      ["切换"] = 1817206946,
      ["资源"] = "mapani.wdf"
    }
    特效表[47] = {
      x = 77,
      y = 20,
      ["切换"] = 1817206946,
      ["资源"] = "mapani.wdf"
    }
    特效表[48] = {
      x = 166,
      y = 19,
      ["切换"] = 1817206946,
      ["资源"] = "mapani.wdf"
    }
    特效表[49] = {
      x = 180,
      y = 26,
      ["切换"] = 1817206946,
      ["资源"] = "mapani.wdf"
    }
    特效表[50] = {
      x = 187,
      y = 47,
      ["切换"] = 2762740114,
      ["资源"] = "mapani.wdf"
    }
    特效表[51] = {
      x = 165.7,
      y = 75.5,
      ["切换"] = 1817206946,
      ["资源"] = "mapani.wdf"
    }
    特效表[52] = {
      x = 180,
      y = 69,
      ["切换"] = 1817206946,
      ["资源"] = "mapani.wdf"
    }
    特效表[53] = {
      x = 59,
      y = 71,
      ["切换"] = 2165955982,
      ["资源"] = "mapani.wdf"
    }
    特效表[54] = {
      x = 81,
      y = 109,
      ["切换"] = 2165955982,
      ["资源"] = "mapani.wdf"
    }
    特效表[55] = {
      x = 104,
      y = 88,
      ["切换"] = 2165955982,
      ["资源"] = "mapani.wdf"
    }
    特效表[56] = {
      x = 132,
      y = 13,
      ["切换"] = 2165955982,
      ["资源"] = "mapani.wdf"
    }
    特效表[57] = {
      x = 87,
      y = 88,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[58] = {
      x = 110,
      y = 70,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[59] = {
      x = 129,
      y = 61,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[60] = {
      x = 170,
      y = 52,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[61] = {
      x = 157,
      y = 23,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[62] = {
      x = 74,
      y = 31,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[63] = {
      x = 34,
      y = 48,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[64] = {
      x = 67,
      y = 81,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[65] = {
      x = 32,
      y = 101,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[66] = {
      x = 168,
      y = 31,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[67] = {
      x = 107,
      y = 60,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[68] = {
      x = 193,
      y = 62,
      ["切换"] = 1817206946,
      ["资源"] = "mapani.wdf"
    }
    特效表[69] = {
      x = 35,
      y = 73,
      ["切换"] = 1817206946,
      ["资源"] = "mapani.wdf"
    }
  elseif 地图ID == 1117 then
    特效表[1] = {
      x = 27,
      y = 23,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[2] = {
      x = 27,
      y = 31,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[3] = {
      x = 33,
      y = 36,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[4] = {
      x = 11,
      y = 29,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[5] = {
      x = 34,
      y = 16,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[6] = {
      x = 50,
      y = 23,
      ["切换"] = 2762740114,
      ["资源"] = "mapani.wdf"
    }
    特效表[7] = {
      x = 26,
      y = 33,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[8] = {
      x = 44,
      y = 33,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[9] = {
      x = 35,
      y = 25,
      ["切换"] = 1817206946,
      ["资源"] = "mapani.wdf"
    }
  elseif 地图ID == 1118 then
    特效表[1] = {
      x = 44,
      y = 35,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[2] = {
      x = 15,
      y = 34,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[3] = {
      x = 47,
      y = 14,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[4] = {
      x = 29,
      y = 8,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[5] = {
      x = 10,
      y = 14,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[6] = {
      x = 48,
      y = 39,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[7] = {
      x = 22,
      y = 21,
      ["切换"] = 2762740114,
      ["资源"] = "mapani.wdf"
    }
    特效表[8] = {
      x = 46,
      y = 20,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[9] = {
      x = 33,
      y = 42,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[10] = {
      x = 56,
      y = 34,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[11] = {
      x = 6,
      y = 35,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
  elseif 地图ID == 1119 then
    特效表[1] = {
      x = 29,
      y = 35,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[2] = {
      x = 18,
      y = 38,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[3] = {
      x = 33,
      y = 14,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[4] = {
      x = 14,
      y = 8,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[5] = {
      x = 39,
      y = 39,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[6] = {
      x = 53,
      y = 26,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[7] = {
      x = 34,
      y = 42,
      ["切换"] = 2762740114,
      ["资源"] = "mapani.wdf"
    }
    特效表[8] = {
      x = 26,
      y = 24,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[9] = {
      x = 49,
      y = 35,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[10] = {
      x = 42,
      y = 20,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
  elseif 地图ID == 1120 then
    特效表[1] = {
      x = 29,
      y = 35,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[2] = {
      x = 18,
      y = 38,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[3] = {
      x = 33,
      y = 14,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[4] = {
      x = 14,
      y = 8,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[5] = {
      x = 39,
      y = 39,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[6] = {
      x = 53,
      y = 26,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[7] = {
      x = 60,
      y = 40,
      ["切换"] = 2762740114,
      ["资源"] = "mapani.wdf"
    }
    特效表[8] = {
      x = 42,
      y = 30,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[9] = {
      x = 30,
      y = 42,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[10] = {
      x = 43,
      y = 20,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[11] = {
      x = 15,
      y = 23,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[12] = {
      x = 53,
      y = 17,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[13] = {
      x = 7,
      y = 25,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
  elseif 地图ID == 1121 then
    特效表[1] = {
      x = 29,
      y = 35,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[2] = {
      x = 18,
      y = 38,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[3] = {
      x = 33,
      y = 14,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[4] = {
      x = 14,
      y = 8,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[5] = {
      x = 39,
      y = 39,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[6] = {
      x = 53,
      y = 26,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[7] = {
      x = 27,
      y = 30,
      ["切换"] = 2762740114,
      ["资源"] = "mapani.wdf"
    }
    特效表[8] = {
      x = 48,
      y = 30,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[9] = {
      x = 53,
      y = 19,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[10] = {
      x = 5,
      y = 24,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[11] = {
      x = 25,
      y = 14,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[12] = {
      x = 30,
      y = 33,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
  elseif 地图ID == 1532 then
    特效表[1] = {
      x = 29,
      y = 35,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[2] = {
      x = 18,
      y = 38,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[3] = {
      x = 33,
      y = 14,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[4] = {
      x = 14,
      y = 8,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[5] = {
      x = 39,
      y = 39,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[6] = {
      x = 53,
      y = 26,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[7] = {
      x = 11,
      y = 19,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[8] = {
      x = 49,
      y = 14,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[9] = {
      x = 37,
      y = 31,
      ["切换"] = 2762740114,
      ["资源"] = "mapani.wdf"
    }
    特效表[10] = {
      x = 7,
      y = 16,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[11] = {
      x = 39,
      y = 14,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[12] = {
      x = 58,
      y = 22,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[13] = {
      x = 18,
      y = 21,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
  elseif 地图ID == 1040 then
    特效表[1] = {
      x = 150,
      y = 117,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[2] = {
      x = 70.2,
      y = 62,
      ["切换"] = 1597265941,
      ["资源"] = "mapani.wdf"
    }
  elseif 地图ID == 1041 then
    特效表[1] = {
      x = 29,
      y = 35,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[2] = {
      x = 18,
      y = 38,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[3] = {
      x = 33,
      y = 14,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[4] = {
      x = 14,
      y = 8,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[5] = {
      x = 39,
      y = 39,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[6] = {
      x = 53,
      y = 26,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[7] = {
      x = 90,
      y = 64,
      ["切换"] = 2762740114,
      ["资源"] = "mapani.wdf"
    }
    特效表[8] = {
      x = 51,
      y = 16,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[9] = {
      x = 28,
      y = 73,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[10] = {
      x = 47,
      y = 81,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[11] = {
      x = 83,
      y = 79,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[12] = {
      x = 123,
      y = 75,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[13] = {
      x = 108,
      y = 70,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[14] = {
      x = 96,
      y = 46,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[15] = {
      x = 72,
      y = 45,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[16] = {
      x = 43,
      y = 63,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[17] = {
      x = 21,
      y = 60,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[18] = {
      x = 111,
      y = 28,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[19] = {
      x = 123,
      y = 36,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[20] = {
      x = 120,
      y = 53,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[21] = {
      x = 108,
      y = 9,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[22] = {
      x = 99,
      y = 13,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[23] = {
      x = 79,
      y = 6,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[24] = {
      x = 33,
      y = 40,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[25] = {
      x = 15,
      y = 49,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[26] = {
      x = 3,
      y = 37,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[27] = {
      x = 8,
      y = 87,
      ["切换"] = 533678777,
      ["资源"] = "mapani.wdf"
    }
    特效表[28] = {
      x = 24,
      y = 83,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[29] = {
      x = 55,
      y = 69,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[30] = {
      x = 62,
      y = 73,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[31] = {
      x = 13,
      y = 64,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[32] = {
      x = 11,
      y = 49,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[33] = {
      x = 42,
      y = 27,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[34] = {
      x = 26,
      y = 20,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[35] = {
      x = 16,
      y = 16,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[36] = {
      x = 67,
      y = 17,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[37] = {
      x = 107,
      y = 12,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[38] = {
      x = 98,
      y = 30,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[39] = {
      x = 81,
      y = 33,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[40] = {
      x = 73,
      y = 50,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[41] = {
      x = 61,
      y = 53,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[42] = {
      x = 101,
      y = 89,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[43] = {
      x = 109,
      y = 80,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[44] = {
      x = 103,
      y = 51,
      ["切换"] = 1986204323,
      ["资源"] = "mapani.wdf"
    }
    特效表[45] = {
      x = 33,
      y = 63,
      ["切换"] = 1019790024,
      ["资源"] = "mapani.wdf"
    }
    特效表[46] = {
      x = 69,
      y = 65,
      ["切换"] = 1019790024,
      ["资源"] = "mapani.wdf"
    }
    特效表[47] = {
      x = 51,
      y = 11,
      ["切换"] = 1019790024,
      ["资源"] = "mapani.wdf"
    }
    特效表[48] = {
      x = 109,
      y = 5,
      ["切换"] = 1019790024,
      ["资源"] = "mapani.wdf"
    }
    特效表[49] = {
      x = 34,
      y = 34,
      ["切换"] = 1019790024,
      ["资源"] = "mapani.wdf"
    }
  elseif 地图ID == 1131 then
    特效表[1] = {
      x = 53,
      y = 47,
      ["切换"] = 2547803150,
      ["资源"] = "mapani.wdf"
    }
    特效表[2] = {
      x = 47,
      y = 70,
      ["切换"] = 3436878157,
      ["资源"] = "mapani.wdf"
    }
    特效表[3] = {
      x = 52,
      y = 75,
      ["切换"] = 4046268095,
      ["资源"] = "mapani.wdf"
    }
    特效表[4] = {
      x = 52,
      y = 92,
      ["切换"] = 4046268095,
      ["资源"] = "mapani.wdf"
    }
    特效表[5] = {
      x = 72,
      y = 92,
      ["切换"] = 4046268095,
      ["资源"] = "mapani.wdf"
    }
    特效表[6] = {
      x = 92,
      y = 92,
      ["切换"] = 4046268095,
      ["资源"] = "mapani.wdf"
    }
    特效表[7] = {
      x = 108,
      y = 88,
      ["切换"] = 4046268095,
      ["资源"] = "mapani.wdf"
    }
    特效表[8] = {
      x = 51,
      y = 75,
      ["切换"] = 1942218751,
      ["资源"] = "mapani.wdf"
    }
    特效表[9] = {
      x = 40,
      y = 63,
      ["切换"] = 4046268095,
      ["资源"] = "mapani.wdf"
    }
    特效表[10] = {
      x = 105,
      y = 85,
      ["切换"] = 231324641,
      ["资源"] = "mapani.wdf"
    }
  elseif 地图ID == 1091 then
    特效表[1] = {
      x = 64,
      y = 93,
      ["切换"] = 4037405110,
      ["资源"] = "magic.wdf"
    }
  elseif 地图ID == 1111 then
    特效表[1] = {
      x = 219,
      y = 19,
      ["切换"] = 4037405110,
      ["资源"] = "magic.wdf"
    }
    特效表[2] = {
      x = 136,
      y = 53,
      ["切换"] = 2478994955,
      ["资源"] = "magic.wdf"
    }
    特效表[3] = {
      x = 219,
      y = 5,
      ["切换"] = 2272115910,
      ["资源"] = "magic.wdf"
    }
    特效表[4] = {
      x = 239,
      y = 15,
      ["切换"] = 2272115910,
      ["资源"] = "magic.wdf"
    }
    特效表[5] = {
      x = 220,
      y = 23,
      ["切换"] = 2272115910,
      ["资源"] = "magic.wdf"
    }
    特效表[6] = {
      x = 199,
      y = 14,
      ["切换"] = 2272115910,
      ["资源"] = "magic.wdf"
    }
    特效表[7] = {
      x = 207,
      y = 12,
      ["切换"] = 714700376,
      ["资源"] = "magic.wdf"
    }
    特效表[8] = {
      x = 234,
      y = 52,
      ["切换"] = 664467571,
      ["资源"] = "magic.wdf"
    }
    特效表[9] = {
      x = 234,
      y = 55,
      ["切换"] = 664467571,
      ["资源"] = "magic.wdf"
    }
    特效表[10] = {
      x = 222,
      y = 55,
      ["切换"] = 664467571,
      ["资源"] = "magic.wdf"
    }
    特效表[11] = {
      x = 200,
      y = 43,
      ["切换"] = 664467571,
      ["资源"] = "magic.wdf"
    }
    特效表[12] = {
      x = 210,
      y = 40,
      ["切换"] = 664467571,
      ["资源"] = "magic.wdf"
    }
    特效表[13] = {
      x = 248,
      y = 70,
      ["切换"] = 4059195682,
      ["资源"] = "magic.wdf"
    }
    特效表[14] = {
      x = 240,
      y = 70,
      ["切换"] = 714700376,
      ["资源"] = "magic.wdf"
    }
    特效表[15] = {
      x = 228,
      y = 12,
      ["切换"] = 3911640280,
      ["资源"] = "magic.wdf"
    }
    特效表[16] = {
      x = 219,
      y = 19,
      ["切换"] = 543663475,
      ["资源"] = "magic.wd1"
    }
    特效表[17] = {
      x = 214,
      y = 99,
      ["切换"] = 475286040,
      ["资源"] = "mapani.wdf"
    }
    特效表[18] = {
      x = 244,
      y = 159,
      ["切换"] = 475286040,
      ["资源"] = "mapani.wdf"
    }
    特效表[19] = {
      x = 240,
      y = 155,
      ["切换"] = 475286040,
      ["资源"] = "mapani.wdf"
    }
    特效表[20] = {
      x = 211,
      y = 155,
      ["切换"] = 492944219,
      ["资源"] = "mapani.wdf"
    }
    特效表[21] = {
      x = 185,
      y = 110,
      ["切换"] = 137212032,
      ["资源"] = "mapani.wdf"
    }
    特效表[22] = {
      x = 197,
      y = 120,
      ["切换"] = 475286040,
      ["资源"] = "mapani.wdf"
    }
    特效表[23] = {
      x = 146,
      y = 130,
      ["切换"] = 137212032,
      ["资源"] = "mapani.wdf"
    }
    特效表[24] = {
      x = 157,
      y = 128,
      ["切换"] = 1971977060,
      ["资源"] = "mapani.wdf"
    }
    特效表[25] = {
      x = 156,
      y = 133,
      ["切换"] = 137212032,
      ["资源"] = "mapani.wdf"
    }
    特效表[26] = {
      x = 160,
      y = 148,
      ["切换"] = 475286040,
      ["资源"] = "mapani.wdf"
    }
    特效表[27] = {
      x = 170,
      y = 140,
      ["切换"] = 475286040,
      ["资源"] = "mapani.wdf"
    }
    特效表[28] = {
      x = 117,
      y = 137,
      ["切换"] = 231324641,
      ["资源"] = "mapani.wdf"
    }
    特效表[29] = {
      x = 200,
      y = 158,
      ["切换"] = 4126063706,
      ["资源"] = "mapani.wdf"
    }
    特效表[30] = {
      x = 121,
      y = 140,
      ["切换"] = 4126063706,
      ["资源"] = "mapani.wdf"
    }
    特效表[31] = {
      x = 127,
      y = 145,
      ["切换"] = 4126063706,
      ["资源"] = "mapani.wdf"
    }
    特效表[32] = {
      x = 135,
      y = 150,
      ["切换"] = 4126063706,
      ["资源"] = "mapani.wdf"
    }
    特效表[33] = {
      x = 81,
      y = 165,
      ["切换"] = 4126063706,
      ["资源"] = "mapani.wdf"
    }
    特效表[34] = {
      x = 90,
      y = 168,
      ["切换"] = 475286040,
      ["资源"] = "mapani.wdf"
    }
    特效表[35] = {
      x = 51,
      y = 160,
      ["切换"] = 475286040,
      ["资源"] = "mapani.wdf"
    }
    特效表[36] = {
      x = 65,
      y = 160,
      ["切换"] = 475286040,
      ["资源"] = "mapani.wdf"
    }
    特效表[37] = {
      x = 60,
      y = 114,
      ["切换"] = 475286040,
      ["资源"] = "mapani.wdf"
    }
    特效表[38] = {
      x = 81,
      y = 111,
      ["切换"] = 4126063706,
      ["资源"] = "mapani.wdf"
    }
    特效表[39] = {
      x = 89,
      y = 111,
      ["切换"] = 4126063706,
      ["资源"] = "mapani.wdf"
    }
    特效表[40] = {
      x = 79,
      y = 125,
      ["切换"] = 475286040,
      ["资源"] = "mapani.wdf"
    }
    特效表[41] = {
      x = 91,
      y = 111,
      ["切换"] = 137212032,
      ["资源"] = "mapani.wdf"
    }
    特效表[42] = {
      x = 100,
      y = 113,
      ["切换"] = 137212032,
      ["资源"] = "mapani.wdf"
    }
    特效表[43] = {
      x = 98,
      y = 114,
      ["切换"] = 137212032,
      ["资源"] = "mapani.wdf"
    }
    特效表[44] = {
      x = 93,
      y = 113,
      ["切换"] = 1971977060,
      ["资源"] = "mapani.wdf"
    }
    特效表[45] = {
      x = 91,
      y = 103.5,
      ["切换"] = 1971977060,
      ["资源"] = "mapani.wdf"
    }
    特效表[46] = {
      x = 150,
      y = 129,
      ["切换"] = 4098882521,
      ["资源"] = "mapani.wdf"
    }
    特效表[47] = {
      x = 181,
      y = 107,
      ["切换"] = 4098882521,
      ["资源"] = "mapani.wdf"
    }
    特效表[48] = {
      x = 138,
      y = 134,
      ["切换"] = 4098882521,
      ["资源"] = "mapani.wdf"
    }
    特效表[49] = {
      x = 202,
      y = 141,
      ["切换"] = 3406680166,
      ["资源"] = "mapani.wdf"
    }
    特效表[50] = {
      x = 84,
      y = 146,
      ["切换"] = 3406680166,
      ["资源"] = "mapani.wdf"
    }
    特效表[51] = {
      x = 110,
      y = 135,
      ["切换"] = 3406680166,
      ["资源"] = "mapani.wdf"
    }
    特效表[52] = {
      x = 81,
      y = 84,
      ["切换"] = 3406680166,
      ["资源"] = "mapani.wdf"
    }
    特效表[53] = {
      x = 139,
      y = 134,
      ["切换"] = 3406680166,
      ["资源"] = "mapani.wdf"
    }
    特效表[54] = {
      x = 186,
      y = 146,
      ["切换"] = 3406680166,
      ["资源"] = "mapani.wdf"
    }
    特效表[55] = {
      x = 221,
      y = 96,
      ["切换"] = 3406680166,
      ["资源"] = "mapani.wdf"
    }
    特效表[56] = {
      x = 252,
      y = 93,
      ["切换"] = 3406680166,
      ["资源"] = "mapani.wdf"
    }
    特效表[57] = {
      x = 8,
      y = 84,
      ["切换"] = 3406680166,
      ["资源"] = "mapani.wdf"
    }
  elseif 地图ID == 1112 then
    特效表[1] = {
      x = 63,
      y = 50,
      ["切换"] = 475286040,
      ["资源"] = "mapani.wdf"
    }
    特效表[2] = {
      x = 45,
      y = 35,
      ["切换"] = 2781265403,
      ["资源"] = "magic.wdf"
    }
    特效表[3] = {
      x = 30,
      y = 55,
      ["切换"] = 4046268095,
      ["资源"] = "mapani.wdf"
    }
    特效表[4] = {
      x = 58,
      y = 72,
      ["切换"] = 475286040,
      ["资源"] = "mapani.wdf"
    }
    特效表[5] = {
      x = 20,
      y = 52,
      ["切换"] = 475286040,
      ["资源"] = "mapani.wdf"
    }
    特效表[6] = {
      x = 20,
      y = 66,
      ["切换"] = 475286040,
      ["资源"] = "mapani.wdf"
    }
    特效表[7] = {
      x = 7,
      y = 30,
      ["切换"] = 4046268095,
      ["资源"] = "mapani.wdf"
    }
    特效表[8] = {
      x = 7,
      y = 30,
      ["切换"] = 475286040,
      ["资源"] = "mapani.wdf"
    }
    特效表[9] = {
      x = 80,
      y = 20,
      ["切换"] = 475286040,
      ["资源"] = "mapani.wdf"
    }
    特效表[10] = {
      x = 90,
      y = 20,
      ["切换"] = 475286040,
      ["资源"] = "mapani.wdf"
    }
    特效表[11] = {
      x = 90,
      y = 35,
      ["切换"] = 475286040,
      ["资源"] = "mapani.wdf"
    }
    特效表[12] = {
      x = 100,
      y = 65,
      ["切换"] = 475286040,
      ["资源"] = "mapani.wdf"
    }
    特效表[13] = {
      x = 90,
      y = 75,
      ["切换"] = 475286040,
      ["资源"] = "mapani.wdf"
    }
  elseif 地图ID == 1113 then
    特效表[1] = {
      x = 28.9,
      y = 20,
      ["切换"] = 2272115910,
      ["资源"] = "magic.wdf"
    }
    特效表[2] = {
      x = 18,
      y = 17,
      ["切换"] = 231324641,
      ["资源"] = "mapani.wdf"
    }
  elseif 地图ID == 1114 then
    特效表[1] = {
      x = 58,
      y = 48,
      ["切换"] = 2478994955,
      ["资源"] = "magic.wdf"
    }
  elseif 地图ID == 1140 then
    特效表[1] = {
      x = 49,
      y = 60,
      ["切换"] = 231324641,
      ["资源"] = "mapani.wdf"
    }
    特效表[2] = {
      x = 37,
      y = 25,
      ["切换"] = 231324641,
      ["资源"] = "mapani.wdf"
    }
    特效表[3] = {
      x = 2,
      y = 40,
      ["切换"] = 4126063706,
      ["资源"] = "mapani.wdf"
    }
  elseif 地图ID == 1141 then
    特效表[1] = {
      x = 48,
      y = 28,
      ["切换"] = 3159867265,
      ["资源"] = "mapani.wdf"
    }
    特效表[2] = {
      x = 56,
      y = 28,
      ["切换"] = 4177302544,
      ["资源"] = "mapani.wdf"
    }
    特效表[3] = {
      x = 46,
      y = 13,
      ["切换"] = 137212032,
      ["资源"] = "mapani.wdf"
    }
    特效表[4] = {
      x = 47,
      y = 15,
      ["切换"] = 1971977060,
      ["资源"] = "mapani.wdf"
    }
    特效表[5] = {
      x = 49,
      y = 18,
      ["切换"] = 1971977060,
      ["资源"] = "mapani.wdf"
    }
    特效表[6] = {
      x = 7,
      y = 22,
      ["切换"] = 3841344173,
      ["资源"] = "mapani.wdf"
    }
    特效表[7] = {
      x = 10,
      y = 25,
      ["切换"] = 137212032,
      ["资源"] = "mapani.wdf"
    }
    特效表[8] = {
      x = 10,
      y = 24,
      ["切换"] = 1971977060,
      ["资源"] = "mapani.wdf"
    }
    特效表[9] = {
      x = 55,
      y = 15,
      ["切换"] = 137212032,
      ["资源"] = "mapani.wdf"
    }
    特效表[10] = {
      x = 55,
      y = 17,
      ["切换"] = 1971977060,
      ["资源"] = "mapani.wdf"
    }
    特效表[11] = {
      x = 53,
      y = 19,
      ["切换"] = 137212032,
      ["资源"] = "mapani.wdf"
    }
    特效表[12] = {
      x = 53,
      y = 21,
      ["切换"] = 1971977060,
      ["资源"] = "mapani.wdf"
    }
    特效表[13] = {
      x = 12,
      y = 28,
      ["切换"] = 137212032,
      ["资源"] = "mapani.wdf"
    }
    特效表[14] = {
      x = 7,
      y = 28,
      ["切换"] = 1971977060,
      ["资源"] = "mapani.wdf"
    }
    特效表[15] = {
      x = 5,
      y = 33,
      ["切换"] = 2547803150,
      ["资源"] = "mapani.wdf"
    }
    特效表[16] = {
      x = 22,
      y = 33,
      ["切换"] = 2350967246,
      ["资源"] = "mapani.wdf"
    }
    特效表[17] = {
      x = 18,
      y = 43,
      ["切换"] = 2350967246,
      ["资源"] = "mapani.wdf"
    }
    特效表[18] = {
      x = 28,
      y = 38,
      ["切换"] = 231324641,
      ["资源"] = "mapani.wdf"
    }
    特效表[19] = {
      x = 5,
      y = 35,
      ["切换"] = 231324641,
      ["资源"] = "mapani.wdf"
    }
    特效表[20] = {
      x = 12,
      y = 12,
      ["切换"] = 231324641,
      ["资源"] = "mapani.wdf"
    }
    特效表[21] = {
      x = 43,
      y = 22,
      ["切换"] = 231324641,
      ["资源"] = "mapani.wdf"
    }
  elseif 地图ID == 1122 then
    特效表[1] = {
      x = 63.8,
      y = 38,
      ["切换"] = 1139617174,
      ["资源"] = "mapani.wdf"
    }
    特效表[2] = {
      x = 151.7,
      y = 38,
      ["切换"] = 1444900256,
      ["资源"] = "mapani.wdf"
    }
    特效表[3] = {
      x = 79,
      y = 26.5,
      ["切换"] = 493196333,
      ["资源"] = "mapani.wdf"
    }
    特效表[4] = {
      x = 145.8,
      y = 35,
      ["切换"] = 808355354,
      ["资源"] = "mapani.wdf"
    }
    特效表[5] = {
      x = 138.2,
      y = 22.6,
      ["切换"] = 1087317876,
      ["资源"] = "mapani.wdf"
    }
    特效表[6] = {
      x = 157.5,
      y = 25,
      ["切换"] = 3662474731,
      ["资源"] = "mapani.wdf"
    }
    特效表[7] = {
      x = 79.5,
      y = 41.7,
      ["切换"] = 4207693249,
      ["资源"] = "mapani.wdf"
    }
    特效表[8] = {
      x = 99,
      y = 30,
      ["切换"] = 2186494977,
      ["资源"] = "mapani.wdf"
    }
    特效表[9] = {
      x = 110,
      y = 36.9,
      ["切换"] = 3551166327,
      ["资源"] = "mapani.wdf"
    }
    特效表[10] = {
      x = 138.8,
      y = 31.5,
      ["切换"] = 3724291896,
      ["资源"] = "mapani.wdf"
    }
    特效表[11] = {
      x = 28,
      y = 8,
      ["切换"] = 2000809510,
      ["资源"] = "mapani.wdf"
    }
    特效表[12] = {
      x = 43.5,
      y = 11.5,
      ["切换"] = 2000809510,
      ["资源"] = "mapani.wdf"
    }
    特效表[13] = {
      x = 92,
      y = 105,
      ["切换"] = 2000809510,
      ["资源"] = "mapani.wdf"
    }
    特效表[14] = {
      x = 53,
      y = 83.5,
      ["切换"] = 3749190063,
      ["资源"] = "mapani.wdf"
    }
    特效表[15] = {
      x = 77,
      y = 72,
      ["切换"] = 3749190063,
      ["资源"] = "mapani.wdf"
    }
    特效表[16] = {
      x = 16.5,
      y = 84,
      ["切换"] = 946057054,
      ["资源"] = "mapani.wdf"
    }
    特效表[17] = {
      x = 34,
      y = 95,
      ["切换"] = 946057054,
      ["资源"] = "mapani.wdf"
    }
    特效表[18] = {
      x = 2,
      y = 106.5,
      ["切换"] = 946057054,
      ["资源"] = "mapani.wdf"
    }
    特效表[19] = {
      x = 15.5,
      y = 113,
      ["切换"] = 946057054,
      ["资源"] = "mapani.wdf"
    }
  elseif 地图ID == 1123 then
    特效表[1] = {
      x = 30,
      y = 26.5,
      ["切换"] = 2000809510,
      ["资源"] = "mapani.wdf"
    }
    特效表[2] = {
      x = 9.5,
      y = 30.5,
      ["切换"] = 3749190063,
      ["资源"] = "mapani.wdf"
    }
    特效表[3] = {
      x = 36,
      y = 18.5,
      ["切换"] = 3749190063,
      ["资源"] = "mapani.wdf"
    }
  elseif 地图ID == 1156 then
    特效表[1] = {
      x = 35.8,
      y = 28,
      ["切换"] = 3133631247,
      ["资源"] = "mapani.wdf"
    }
    特效表[2] = {
      x = 45,
      y = 35,
      ["切换"] = 3988657021,
      ["资源"] = "mapani.wdf"
    }
    特效表[3] = {
      x = 25.5,
      y = 35.5,
      ["切换"] = 3988657021,
      ["资源"] = "mapani.wdf"
    }
    特效表[4] = {
      x = 35.5,
      y = 40,
      ["切换"] = 3988657021,
      ["资源"] = "mapani.wdf"
    }
  elseif 地图ID == 1082 then
    特效表[1] = {
      x = 18.2,
      y = 14,
      ["切换"] = 584239168,
      ["资源"] = "mapani.wdf"
    }
  elseif 地图ID == 1205 then
    特效表[1] = {
      x = 55,
      y = 68,
      ["切换"] = 946057054,
      ["资源"] = "mapani.wdf"
    }
    特效表[2] = {
      x = 74,
      y = 64,
      ["切换"] = 946057054,
      ["资源"] = "mapani.wdf"
    }
    特效表[3] = {
      x = 86,
      y = 52.5,
      ["切换"] = 946057054,
      ["资源"] = "mapani.wdf"
    }
    特效表[4] = {
      x = 88.5,
      y = 44,
      ["切换"] = 946057054,
      ["资源"] = "mapani.wdf"
    }
  end
  return 特效表
end
取房屋特效表 = function(mc)
  local tx = {}
  if "蝴蝶兰1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 1961848158,
      ["资源"] = "atom.wdf"
    }
  elseif "桦木圆桌1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 35363774,
      ["资源"] = "atom.wdf"
    }
  elseif "窗帘1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 2540841126,
      ["资源"] = "atom.wdf"
    }
  elseif "窗帘2" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 2875004739,
      ["资源"] = "atom.wdf"
    }
  elseif "草编地毯1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 1586865778,
      ["资源"] = "atom.wdf"
    }
  elseif "草编地毯2" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 1623887697,
      ["资源"] = "atom.wdf"
    }
  elseif "黑麻垂曼帘1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 2629893271,
      ["资源"] = "atom.wdf"
    }
  elseif "黑麻垂曼帘2" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 3975322555,
      ["资源"] = "atom.wdf"
    }
  elseif "君子兰1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 764032275,
      ["资源"] = "atom.wdf"
    }
  elseif "漆花竹凳1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 1471348531,
      ["资源"] = "atom.wdf"
    }
  elseif "漆花竹凳2" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 1837939482,
      ["资源"] = "atom.wdf"
    }
  elseif "水仙1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 1782111267,
      ["资源"] = "atom.wdf"
    }
  elseif "踏春图1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 2122383920,
      ["资源"] = "atom.wdf"
    }
  elseif "踏春图2" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 3326694696,
      ["资源"] = "atom.wdf"
    }
  elseif "文竹1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 4268914011,
      ["资源"] = "atom.wdf"
    }
  elseif "仙人掌1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 2780857406,
      ["资源"] = "atom.wdf"
    }
  elseif "银烛台1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 2307310264,
      ["资源"] = "atom.wdf"
    }
  elseif "印花屏风1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 500314949,
      ["资源"] = "atom.wdf"
    }
  elseif "印花屏风2" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 1213446394,
      ["资源"] = "atom.wdf"
    }
  elseif "玉瓷画瓶1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 4144755757,
      ["资源"] = "atom.wdf"
    }
  elseif "桦木立柜1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 1397631943,
      ["资源"] = "atom.wdf"
    }
  elseif "桦木立柜2" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 4180585364,
      ["资源"] = "atom.wdf"
    }
  elseif "榛木床1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 1835022080,
      ["资源"] = "atom.wdf"
    }
  elseif "榛木床2" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 3016048442,
      ["资源"] = "atom.wdf"
    }
  elseif "八卦镇邪塌1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 630419086,
      ["资源"] = "atom.wdf"
    }
  elseif "八卦镇邪塌2" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 1213168260,
      ["资源"] = "atom.wdf"
    }
  elseif "白鹤展翅帘1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 3376245571,
      ["资源"] = "atom.wdf"
    }
  elseif "白鹤展翅帘2" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 3683954962,
      ["资源"] = "atom.wdf"
    }
  elseif "彩绘花瓶1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 1997579060,
      ["资源"] = "atom.wdf"
    }
  elseif "彩绘立柜1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 1824100180,
      ["资源"] = "atom.wdf"
    }
  elseif "彩绘立柜2" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 4053255843,
      ["资源"] = "atom.wdf"
    }
  elseif "长信宫灯1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 572789530,
      ["资源"] = "atom.wdf"
    }
  elseif "长信宫灯2" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 761347623,
      ["资源"] = "atom.wdf"
    }
  elseif "长信宫灯3" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 2087458930,
      ["资源"] = "atom.wdf"
    }
  elseif "长信宫灯4" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 3615852497,
      ["资源"] = "atom.wdf"
    }
  elseif "雕花马桶1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 1298086680,
      ["资源"] = "atom.wdf"
    }
  elseif "雕花马桶2" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 3148359750,
      ["资源"] = "atom.wdf"
    }
  elseif "长信宫灯4" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 3615852497,
      ["资源"] = "atom.wdf"
    }
  elseif "龟鹤延年灯1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 2628916192,
      ["资源"] = "atom.wdf"
    }
  elseif "龟鹤延年灯2" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 4065005937,
      ["资源"] = "atom.wdf"
    }
  elseif "红木八仙桌" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 615570251,
      ["资源"] = "atom.wdf"
    }
  elseif "花鸟图屏风1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 3145908604,
      ["资源"] = "atom.wdf"
    }
  elseif "花鸟图屏风2" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 3243628723,
      ["资源"] = "atom.wdf"
    }
  elseif "蓝绸绣花帘1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 3445265807,
      ["资源"] = "atom.wdf"
    }
  elseif "蓝绸绣花帘2" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 3853977523,
      ["资源"] = "atom.wdf"
    }
  elseif "麻布地毯1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 152545904,
      ["资源"] = "atom.wdf"
    }
  elseif "麻布地毯2" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 3964203228,
      ["资源"] = "atom.wdf"
    }
  elseif "猛虎坐山图1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 371881137,
      ["资源"] = "atom.wdf"
    }
  elseif "猛虎坐山图2" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 2506226856,
      ["资源"] = "atom.wdf"
    }
  elseif "嵌玉虎纹桌1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 3974550624,
      ["资源"] = "atom.wdf"
    }
  elseif "神仙帐1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 1020633537,
      ["资源"] = "atom.wdf"
    }
  elseif "神仙帐2" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 1564047051,
      ["资源"] = "atom.wdf"
    }
  elseif "狮子图屏风1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 2843637332,
      ["资源"] = "atom.wdf"
    }
  elseif "狮子图屏风2" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 4021082293,
      ["资源"] = "atom.wdf"
    }
  elseif "兽皮地毯1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 2131773911,
      ["资源"] = "atom.wdf"
    }
  elseif "兽皮地毯2" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 3462358300,
      ["资源"] = "atom.wdf"
    }
  elseif "双鱼吉庆柜1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 3556776584,
      ["资源"] = "atom.wdf"
    }
  elseif "双鱼吉庆柜2" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 4012963300,
      ["资源"] = "atom.wdf"
    }
  elseif "天山云雪1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 1768149349,
      ["资源"] = "atom.wdf"
    }
  elseif "夕阳山水图1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 2808057101,
      ["资源"] = "atom.wdf"
    }
  elseif "夕阳山水图2" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 3375795177,
      ["资源"] = "atom.wdf"
    }
  elseif "月牙凳1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 1132804655,
      ["资源"] = "atom.wdf"
    }
  elseif "月牙凳2" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 4003754607,
      ["资源"] = "atom.wdf"
    }
  elseif "桦木靠背椅1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 689902336,
      ["资源"] = "atom.wdf"
    }
  elseif "桦木靠背椅2" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 953750063,
      ["资源"] = "atom.wdf"
    }
  elseif "桦木靠背椅3" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 3562548828,
      ["资源"] = "atom.wdf"
    }
  elseif "桦木靠背椅4" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 4013831606,
      ["资源"] = "atom.wdf"
    }
  elseif "白虎皮毯1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 907143012,
      ["资源"] = "atom.wdf"
    }
  elseif "白虎皮毯2" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 3046164710,
      ["资源"] = "atom.wdf"
    }
  elseif "白虎皮毯3" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 3229344891,
      ["资源"] = "atom.wdf"
    }
  elseif "白虎皮毯4" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 4174860651,
      ["资源"] = "atom.wdf"
    }
  elseif "百兽镇邪桌1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 978302182,
      ["资源"] = "atom.wdf"
    }
  elseif "波斯地毯1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 1000719606,
      ["资源"] = "atom.wdf"
    }
  elseif "波斯地毯2" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 2715497543,
      ["资源"] = "atom.wdf"
    }
  elseif "凤凰傲意图1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 426150969,
      ["资源"] = "atom.wdf"
    }
  elseif "凤凰傲意图2" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 2919089274,
      ["资源"] = "atom.wdf"
    }
  elseif "虎威太师椅1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 314046081,
      ["资源"] = "atom.wdf"
    }
  elseif "虎威太师椅2" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 3037515018,
      ["资源"] = "atom.wdf"
    }
  elseif "虎威太师椅3" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 3450807718,
      ["资源"] = "atom.wdf"
    }
  elseif "虎威太师椅4" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 4008922645,
      ["资源"] = "atom.wdf"
    }
  elseif "黄缎锦边帘1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 1301177247,
      ["资源"] = "atom.wdf"
    }
  elseif "黄缎锦边帘2" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 3863601386,
      ["资源"] = "atom.wdf"
    }
  elseif "金座雕龙屏风1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 298170701,
      ["资源"] = "atom.wdf"
    }
  elseif "金座雕龙屏风2" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 427926680,
      ["资源"] = "atom.wdf"
    }
  elseif "金座雕龙屏风3" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 1883610958,
      ["资源"] = "atom.wdf"
    }
  elseif "金座雕龙屏风4" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 3433251841,
      ["资源"] = "atom.wdf"
    }
  elseif "龙凤呈祥1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 848422290,
      ["资源"] = "atom.wdf"
    }
  elseif "龙凤呈祥2" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 915252320,
      ["资源"] = "atom.wdf"
    }
  elseif "千佛图1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 1334298644,
      ["资源"] = "atom.wdf"
    }
  elseif "千佛图2" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 2674842715,
      ["资源"] = "atom.wdf"
    }
  elseif "壮丽河山1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 861092261,
      ["资源"] = "atom.wdf"
    }
  elseif "壮丽河山2" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 2765714626,
      ["资源"] = "atom.wdf"
    }
  elseif "紫檀雕花柜1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 2791767315,
      ["资源"] = "atom.wdf"
    }
  elseif "紫檀雕花柜2" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 3968081083,
      ["资源"] = "atom.wdf"
    }
  elseif "紫檀雕花椅1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 998064841,
      ["资源"] = "atom.wdf"
    }
  elseif "紫檀雕花椅2" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 3615852497,
      ["资源"] = "atom.wdf"
    }
  elseif "紫檀雕花椅3" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 2032458849,
      ["资源"] = "atom.wdf"
    }
  elseif "紫檀雕花椅4" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 4149426318,
      ["资源"] = "atom.wdf"
    }
  elseif "紫檀马桶1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 720310052,
      ["资源"] = "atom.wdf"
    }
  elseif "紫檀马桶2" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 2534385460,
      ["资源"] = "atom.wdf"
    }
  elseif "紫檀马桶3" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 3721108903,
      ["资源"] = "atom.wdf"
    }
  elseif "紫檀马桶4" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 3615852497,
      ["资源"] = "atom.wdf"
    }
  elseif "八宝呈祥桌1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 496312657,
      ["资源"] = "atom.wdf"
    }
  elseif "红杏闹春帘1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 1760614947,
      ["资源"] = "atom.wdf"
    }
  elseif "红杏闹春帘2" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 2776112985,
      ["资源"] = "atom.wdf"
    }
  elseif "宁夜安梦1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 430945021,
      ["资源"] = "atom.wdf"
    }
  elseif "宁夜安梦2" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 2022269115,
      ["资源"] = "atom.wdf"
    }
  elseif "五谷轮回桶1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 523803996,
      ["资源"] = "atom.wdf"
    }
  elseif "五谷轮回桶2" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 534947671,
      ["资源"] = "atom.wdf"
    }
  elseif "五谷轮回桶3" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 1649894772,
      ["资源"] = "atom.wdf"
    }
  elseif "五谷轮回桶4" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 3907242256,
      ["资源"] = "atom.wdf"
    }
  elseif "招财聚宝柜1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 1579009517,
      ["资源"] = "atom.wdf"
    }
  elseif "招财聚宝柜2" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 2608184609,
      ["资源"] = "atom.wdf"
    }
  elseif "豪宅房子1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 1040358628,
      ["资源"] = "atom.wdf"
    }
  elseif "白栅绿竹门1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 3472677715,
      ["资源"] = "atom.wdf"
    }
  elseif "篱笆花圃1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 2751378381,
      ["资源"] = "atom.wdf"
    }
  elseif "篱笆花圃2" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 3233732963,
      ["资源"] = "atom.wdf"
    }
  elseif "篱笆花圃3" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 3437459996,
      ["资源"] = "atom.wdf"
    }
  elseif "篱笆花圃4" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 347476766,
      ["资源"] = "atom.wdf"
    }
  elseif "篱笆院墙1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 1499675392,
      ["资源"] = "atom.wdf"
    }
  elseif "篱笆院墙2" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 2348977861,
      ["资源"] = "atom.wdf"
    }
  elseif "篱笆院墙3" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 4129831516,
      ["资源"] = "atom.wdf"
    }
  elseif "篱笆院墙4" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 4133293352,
      ["资源"] = "atom.wdf"
    }
  elseif "篱笆院墙5" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 4188939002,
      ["资源"] = "atom.wdf"
    }
  elseif "篱笆院墙6" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 733523078,
      ["资源"] = "atom.wdf"
    }
  elseif "石凳1" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 180361413,
      ["资源"] = "atom.wdf"
    }
  elseif "石制宫灯" == mc then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 2902627466,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "石制影壁1" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 2081680572,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "石制影壁2" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 2257877016,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "石桌1" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 2065463398,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "大理石凳1" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 1062503600,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "大理石花圃1" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 721210682,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "大理石花圃2" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 2065791317,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "大理石花圃3" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 2237670802,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "大理石花圃4" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 127630770,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "大理石影壁1" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 2425103953,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "大理石影壁2" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 404959552,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "大理石桌1" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 455922595,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "红漆雕花门1" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 750481614,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "青瓷花盆1" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 256996472,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "青瓷花盆2" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 3617437370,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "青石路砖1" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 3806412332,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "青石路砖2" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 3427084974,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "青石路砖3" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 1954838750,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "青铜鼎1" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 231416475,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "青铜鼎2" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 1246061539,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "石制院墙1" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 1540519257,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "石制院墙2" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 2177869594,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "石制院墙3" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 3521235810,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "石制院墙4" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 3821745803,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "石制院墙5" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 1292731309,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "白玉花圃1" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 3264031955,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "白玉花圃2" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 3793486481,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "白玉花圃3" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 3591039090,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "白玉花圃4" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 1601588931,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "白玉狮子1" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 369642850,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "白玉狮子2" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 3297598349,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "白玉石凳1" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 1042031706,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "白玉影壁1" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 3042163837,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "白玉石桌1" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 3042163837,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "白玉影壁1" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 1122506304,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "白玉影壁2" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 2431796883,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "花岗石路砖1" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 535328707,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "花岗石路砖2" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 2558628776,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "花岗石路砖3" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 1488986448,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "混土砖石院墙1" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 1441521675,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "混土砖石院墙2" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 159839793,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "混土砖石院墙3" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 1152062470,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "混土砖石院墙4" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 1766281611,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "混土砖石院墙5" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 1877548480,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "混土砖石院墙6" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 2452716190,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "混土砖石院墙7" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 2681875566,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "混土砖石院墙8" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 3584529371,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "金丝楠木门1" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 3591973460,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "山水盆景1" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 565789733,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "山水盆景2" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 830963784,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "四圣兽之白虎1" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 509035303,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "四圣兽之青龙1" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 3710416787,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "四圣兽之玄武1" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 2809097059,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "四圣兽之朱雀" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 3963729089,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "物品柜1" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 1198365182,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "物品柜2" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 4241291603,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "对联1" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 669303330,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "对联2" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 3439796427,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "福" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 2156330295,
      ["资源"] = "atom.wdf"
    }
  elseif mc == "横批" then
    tx = {
      x = 62,
      y = 64,
      ["切换"] = 2369169665,
      ["资源"] = "atom.wdf"
    }
  end
  return tx
end
