

function 取动态技能信息(jn)
	local jns = {}
	if string.find(jn,"超级") and jn ~= "超级三昧真火" and jn ~= "超级战意" and jn ~= "超级神柚复生" then
		if jn == "超级泰山压顶" or jn == "超级奔雷咒" or jn == "超级奔雷咒" or  jn == "超级水漫金山" or jn == "超级壁垒击破" then
			local str = 分割文本(jn,"超级")
			jn = str[2]
		else
			jn = string.gsub(jn,"高级","超级")
		end
		if skill取动态超级技能[jn] then
			for i=1,12 do
				if skill取动态超级技能[jn]["jns_"..i] then
					jns[i]=skill取动态超级技能[jn]["jns_"..i]
				end
			end
		end
	else
		if skill取动态超级技能[jn] then
			for i=1,12 do
				if skill取动态超级技能[jn]["jns_"..i] then
					jns[i]=skill取动态超级技能[jn]["jns_"..i]
				end
			end
		end
	end
	return jns
end


skill取动态超级技能={}
skill取动态超级技能["超级魔之心"]={ --完成
	jns_1 = "法术伤害效果提高25%；\n#W/————纳浩瀚魔息入心，施天下无双之法。"
	,jns_3 = 7
	,jns_6 = "dtnn.npk"
	,jns_7 = 0x594DDA74
	,jns_8 = 0x594DDA74
	}
skill取动态超级技能["超级奔雷咒"]={ --完成
	jns_1 = "发动超级雷属性法术攻击多个敌人；\n#G/对主选中目标造成伤害提高10%；\n#G/并有25%几率附加弱点雷两回合；\n#G/攻击人数=自身等级/30+1，最多3人；\n#W/————九天落雷，万马齐喑。"
	,jns_3 = 4
	,jns_6 = "dtnn.npk"
	,jns_7 = 0x5B1513AA
	,jns_8 = 0x5B1513AA
	}
	skill取动态超级技能["超级地狱烈火"]={ --完成
	jns_1 = "发动超级火属性法术攻击多个敌人；\n#G/对主选中目标造成伤害提高10%；\n#G/并有25%几率附加弱点火两回合；\n#G/攻击人数=自身等级/30+1，最多3人；\n#W/————熊熊烈火，明明如光。"
	,jns_3 = 4
	,jns_6 = "dtnn.npk"
	,jns_7 = 0xF351BDF4
	,jns_8 = 0xF351BDF4
	}
	skill取动态超级技能["超级泰山压顶"]={ --完成
	jns_1 = "发动超级土属性法术攻击多个敌人；\n#G/对主选中目标造成伤害提高10%；\n#G/并有25%几率附加弱点土两回合；\n#G/攻击人数=自身等级/30+1，最多3人；\n#W/————地崩山摧，厚土重压。"
	,jns_3 = 4
	,jns_6 = "dtnn.npk"
	,jns_7 = 0xE886B878
	,jns_8 = 0xE886B878
	}
	skill取动态超级技能["超级水漫金山"]={ --完成
	jns_1 = "发动超级水属性法术攻击多个敌人；\n#G/对主选中目标造成伤害提高10%；\n#G/并有25%几率附加弱点水两回合；\n#G/攻击人数=自身等级/30+1，最多3人；\n#W/————雨落横流，席卷八方。"
	,jns_3 = 4
	,jns_6 = "dtnn.npk"
	,jns_7 = 0x16BD0300
	,jns_8 = 0x16BD0300
	}
	skill取动态超级技能["超级夜战"]={ --完成
	jns_1 = "造成物理伤害提高10%；\n#G/夜间物理伤害效果不会减少，物理躲避能力增加20%，且在攻击时显示目标的气血条；\n#W/————夜黑风高夜，杀人放火天。"
	,jns_3 = 7
	,jns_6 = "dtnn.npk"
	,jns_7 = 0xCBC8931F
	,jns_8 = 0xCBC8931F
	}
	skill取动态超级技能["超级反击"]={ --完成
	jns_1 = "受到普通物理攻击后；\n#G/30%几率用物理攻击反击；\n#G/在场时主人首次被敌方物理攻击时；\n#G/必定用物理攻击进行反击；\n#W/————犯吾主者，绝不姑息。"
	,jns_3 = 7
	,jns_6 = "dtnn.npk"
	,jns_7 = 0xAB25FAF6
	,jns_8 = 0xAB25FAF6
	}
	skill取动态超级技能["超级反震"]={ --完成
	jns_1 = "受到物理攻击时30%反震对方；\n#G/反震伤害为你所受伤害的60%；\n#G/避免被敌人连击；\n#W/————站如松，坐如钟"
	,jns_3 = 7
	,jns_6 = "dtnn.npk"
	,jns_7 = 0x44626190
	,jns_8 = 0x44626190
	}
	skill取动态超级技能["超级吸血"]={ --完成
	jns_1 = "物理攻击时获得对方损失气血的30%；\n#G/并将获得的溢出气血50%转化为护盾；\n#G/(攻击有鬼魂术的敌人无法吸血)\n#W/————以敌之血，尝吾之志。"
	,jns_3 = 7
	,jns_6 = "dtnn.npk"
	,jns_7 = 0xAB8870CB
	,jns_8 = 0xAB8870CB
	}
	skill取动态超级技能["超级连击"]={ --完成
	jns_1 = "普通攻击时55%几率攻击2次；\n#G/触发连击时有15%几率额外攻击1次；\n#G/物理伤害效果降低20%；\n#W/————黎魂澎湃，击如怒涛。"
	,jns_3 = 7
	,jns_6 = "dtnn.npk"
	,jns_7 = 0x8CA05F9A
	,jns_8 = 0x8CA05F9A
	}
	skill取动态超级技能["超级飞行"]={ --完成
	jns_1 = "物理攻击命中几率增加20%；\n#G/物理躲避能力提高30%；\n#G/物理躲避率提高10%；\n#G/天气为“风”时造成的物理伤害提升20%\n#W/————凭风而起，欲与天齐。"
	,jns_3 = 7
	,jns_6 = "dtnn.npk"
	,jns_7 = 0x72548180
	,jns_8 = 0x72548180
	}
	skill取动态超级技能["超级隐身"]={ --完成
	jns_1 = "进入战斗后获得修罗隐身状态3~5回合；\n#G/隐身时不会被攻击；\n#G/物理攻击能力降低10%；\n#G/受到的伤害也降低10%；\n#G/隐身时不能施法；\n#W/————不可说、不可视、不可触。"
	,jns_3 = 7
	,jns_6 = "dtnn.npk"
	,jns_7 = 0xC471475B
	,jns_8 = 0xC471475B
	}
	skill取动态超级技能["超级感知"]={ --完成
	jns_1 = "可攻击修罗隐身、楚楚可怜状态之敌；\n#G/物理躲避能力提高10%；\n#G/在场时主人也获得“感知”；\n#G/最多持续5回合；\n#W/————目光所至，无可遁形。"
	,jns_3 = 7
	,jns_6 = "dtnn.npk"
	,jns_7 = 0x8E05D1BA
	,jns_8 = 0x8E05D1BA
	}
	skill取动态超级技能["超级再生"]={ --完成
	jns_1 = "每回合恢复自身等级X1的气血；\n#G/有10%几率回复自身等级X12的气血；\n#W/————天地之息皆入我窍，皆化骨血。"
	,jns_3 = 7
	,jns_6 = "dtnn.npk"
	,jns_7 = 0x06FA4E62
	,jns_8 = 0x06FA4E62
	}
	skill取动态超级技能["超级冥思"]={ --完成
	jns_1 = "每回合恢复自身等级/2的魔法；\n#G/在场时主人时获得“冥思”；\n#G/最多持续5回合；\n#W/————心若明镜，映照你我。"
	,jns_3 = 7
	,jns_6 = "dtnn.npk"
	,jns_7 = 0x24D6F342
	,jns_8 = 0x24D6F342
	}
	skill取动态超级技能["超级慧根"]={ --完成
	jns_1 = "使用法术时所消耗的魔法降低为正常的50%；\n#G/且有15%的几率不消耗魔法；\n#W/————意心如鉴，是为天地所钟。"
	,jns_3 = 7
	,jns_6 = "dtnn.npk"
	,jns_7 = 0x41DCAE3F
	,jns_8 = 0x41DCAE3F
	}

	skill取动态超级技能["超级驱鬼"]={ --完成
	jns_1 = "对有鬼魂术之敌；\n#G/物理及法术伤害效果增加100%；\n#G/可将鬼魂术之敌击飞，使其不能复活；\n#G/双方场上带有鬼魂术单位的伤害降低20%；\n#G/自身的鬼魂术将无效化；\n#W/————上古魔息，小鬼勿近。"
	,jns_3 = 7
	,jns_6 = "dtnn.npk"
	,jns_7 = 0x794DC2D2
	,jns_8 = 0x794DC2D2
	}
	skill取动态超级技能["超级毒"]={ --完成
	jns_1 = "自身对毒免疫物理攻击后；\n#G/20%几率使敌人中毒；\n#G/且随机降低中毒目标的攻击、防御、法伤或法防；\n#W/————毒入七窍，无药可医。"
	,jns_3 = 7
	,jns_6 = "dtnn.npk"
	,jns_7 = 0x0996D17C
	,jns_8 = 0x0996D17C
	}
	skill取动态超级技能["超级必杀"]={ --完成
	jns_1 = "物理攻击的必杀几率增加20%；\n#G/必杀时有25%的几率造成3-4倍的伤害；\n#W/————山川踏碎魔息涌，一击搏尽日月光。"
	,jns_3 = 7
	,jns_6 = "dtnn.npk"
	,jns_7 = 0x19C48F4A
	,jns_8 = 0x19C48F4A
	}
	skill取动态超级技能["超级幸运"]={ --完成
	jns_1 = "受到的物理/法术伤害暴击倍率降低50%；\n#G/有5%的概率免疫受到的攻击；\n#W/————气运非凡，傲立乱世。"
	,jns_3 = 7
	,jns_6 = "dtnn.npk"
	,jns_7 = 0x96C51102
	,jns_8 = 0x96C51102
	}
	skill取动态超级技能["超级精神集中"]={ --完成
	jns_1 = "可以抵御封类异常状态，躲避力提高10%，但物理攻击能力会降低20%；\n#G/受到的伤害随机降低1% ~ 10%；\n#W/————身似菩提心如镜。"
	,jns_3 = 7
	,jns_6 = "dtnn.npk"
	,jns_7 = 0xEA9D1BB0
	,jns_8 = 0xEA9D1BB0
	}
	skill取动态超级技能["超级神迹"]={ --完成 超级技能2.5 改介绍
	jns_1 = "不受除日月乾坤外的所有异常状态影响；回合结束时若主人倒地，尝试复活并解除其封印，恢复其自身等级x20的血后和伤势后自己离场；\n#W/————以身祭主，魔域不朽。"
	,jns_3 = 7
	,jns_6 = "dtnn.npk"
	,jns_7 = 0x872503C8
	,jns_8 = 0x872503C8
	}
	skill取动态超级技能["超级招架"]={ --完成
	jns_1 = "每回合受到的第1次物理伤害结果减免20%；\n#G/且进战斗时获得一层“金身”；\n#G/若被召唤成幻魔,“金身”会再次触发；\n#W/————钢筋铁骨，金身难撼。"
	,jns_3 = 7
	,jns_6 = "dtnn.npk"
	,jns_7 = 0xB6C0A38E
	,jns_8 = 0xB6C0A38E
	}
	skill取动态超级技能["超级永恒"]={ --完成 增加100%持续回合数 那就是剩余翻倍？就先按翻倍写，不对叫我改
	jns_1 = "主动法术，回合结束时；\n#G/自身的气血、魔法将回复至使用此技能前的状态，冷却150回合；\n#G/受到辅助类法术时增加100%持续回合数；\n#G/且增加的回合数不会超过6回合；\n#W/————孤舟一叶身不灭，百世轮回心永恒。"
	,jns_3 = 2 --超级技能2.6 改
	,jns_4 = "无消耗"
	,jns_6 = "dtnn.npk"
	,jns_7 = 0xD23FA1E7
	,jns_8 = 0xD23FA1E7
	}
	skill取动态超级技能["超级敏捷"]={  --完成 服务端无须添加技能属性了，因为敏捷已在战斗外生效
	jns_1 = "“速度增加20%”；\n#G/5%概率额外行动一次；\n#W/————其势如火，其疾如风。"
	,jns_3 = 7
	,jns_6 = "dtnn.npk"
	,jns_7 = 0x310D26A9
	,jns_8 = 0x310D26A9
	}
	skill取动态超级技能["超级否定信仰"]={ --完成
	jns_1 = "不受一切异常和增益影响；其它超级技能失效，且每个拥有的超级技能提高20%最大气血、提高15%所有伤害、降低5%防御和法防；攻击时敌人的信仰类技能失效；\n#R/不能同时拥有信仰类技能\n#W/————天上地下，神魔无忌。"
	,jns_3 = 7
	,jns_6 = "dtnn.npk"
	,jns_7 = 0x347CFE9B
	,jns_8 = 0x347CFE9B
	}
	skill取动态超级技能["超级偷袭"]={ --完成
	jns_1 = "避免被敌人反击；\n#G/避免被敌人反震；\n#G/物理伤害效果提升15%；\n#G/物理普通攻击将无视防御指令；\n#W/————兵者，诡道也。"
	,jns_3 = 7
	,jns_6 = "dtnn.npk"
	,jns_7 = 0x56DFA03E
	,jns_8 = 0x56DFA03E
	}
	skill取动态超级技能["超级雷属性吸收"]={ --完成
	jns_1 = "必定免受雷属性法术伤害；\n#G/并按应受伤害的大小恢复气血；\n#W/————雷锻吾主六感。"
	,jns_3 = 7
	,jns_6 = "dtnn.npk"
	,jns_7 = 0xB595FB65
	,jns_8 = 0xB595FB65
	}
	skill取动态超级技能["超级土属性吸收"]={ --完成
	jns_1 = "必定免受土属性法术伤害；\n#G/并按应受伤害的大小恢复气血；\n#W/————土造吾主筋骨。"
	,jns_3 = 7
	,jns_6 = "dtnn.npk"
	,jns_7 = 0x5627B12C
	,jns_8 = 0x5627B12C
	}
	skill取动态超级技能["超级火属性吸收"]={ --完成
	jns_1 = "必定免受火属性法术伤害；\n#G/并按应受伤害的大小恢复气血；\n#W/————火炼吾主荒魂。"
	,jns_3 = 7
	,jns_6 = "dtnn.npk"
	,jns_7 = 0x9CEF1545
	,jns_8 = 0x9CEF1545
	}
	skill取动态超级技能["超级水属性吸收"]={ --完成
	jns_1 = "必定免受水属性法术伤害；\n#G/并按应受伤害的大小恢复气血；\n#W/————水塑吾主血肉。"
	,jns_3 = 7
	,jns_6 = "dtnn.npk"
	,jns_7 = 0x2AB76B38
	,jns_8 = 0x2AB76B38
	}
	skill取动态超级技能["超级强力"]={ --完成
	jns_1 = "物理攻击能力增加自己等级X0.7;\n#G/攻击有招架类技能的敌人时不会减少伤害结果;有10%几率使敌人旋转并头晕：2回合内造成的伤害降低；\n#R/对有超级防御者，伤害结果减少20%。\n#W/————力势磅礴，威慑九霄。"
	,jns_3 = 7
	,jns_6 = "dtnn.npk"
	,jns_7 = 0xF0B18900
	,jns_8 = 0xF0B18900
	}
	skill取动态超级技能["超级防御"]={ --完成
	-- jns_1 = "提高自身等级X 1的防御；\n#G/战斗中，防御时可减免75%物理伤害；\n#R/法术伤害能力降低10%；\n#W/————不可胜者，守也。"
	jns_1 = "提高自身等级X 1的防御；\n#W/————不可胜者，守也。" --官方改了
	,jns_3 = 7
	,jns_6 = "dtnn.npk"
	,jns_7 = 0xABFD293F
	,jns_8 = 0xABFD293F
	}
	skill取动态超级技能["超级进击必杀"]={ --完成
	jns_1 = "第2回合及以后进入战斗时；\n#G/提升30%的必杀几率并增加50%必杀伤害倍率；\n#G/持续5回合，且逐回合减少20%效果；\n#W/————后发先至，锋芒毕露。"
	,jns_3 = 7
	,jns_6 = "dtnn.npk"
	,jns_7 = 0x9BD90717
	,jns_8 = 0x9BD90717
	}
	skill取动态超级技能["超级进击法暴"]={ --完成
	jns_1 = "第2回合及以后进入战斗时；\n#G/提升20%的法术暴击几率并增加50%法暴伤害倍率；\n#G/持续5回合，且逐回合减少20%效果；\n#W/————一鼓作气，再而衰，三而竭。"
	,jns_3 = 7
	,jns_6 = "dtnn.npk"
	,jns_7 = 0x2BDE4555
	,jns_8 = 0x2BDE4555
	}
	skill取动态超级技能["超级遗志"]={ --完成
	jns_1 = "替代原召唤兽进入战斗时获得“遗志”；\n#G/造成伤害提升15%；\n#G/并获得原召唤兽的“遗志”（最多两层）\n#W/————山不改其坚，水不改其流。"
	,jns_3 = 7
	,jns_6 = "dtnn.npk"
	,jns_7 = 0xAAF98D30
	,jns_8 = 0xAAF98D30
	}
	skill取动态超级技能["超级法术连击"]={ --完成
	jns_1 = "法术攻击时30%几率攻击2次；\n#G/（第二次伤害效果降低25%）\n#W/————浪奔浪涌，潮起潮落。"
	,jns_3 = 7
	,jns_6 = "dtnn.npk"
	,jns_7 = 0xFDBFBAA0
	,jns_8 = 0xFDBFBAA0
	}
	skill取动态超级技能["超级法术暴击"]={ --完成
	jns_1 = "法术攻击时20%几率出现暴击，且暴击时有10%的几率造成3~4倍的暴击伤害。\n#W/————三分天注定，七分靠打拼。"
	,jns_3 = 7
	,jns_6 = "dtnn.npk"
	,jns_7 = 0x935AC32B
	,jns_8 = 0x935AC32B
	}
	skill取动态超级技能["超级法术波动"]={ --完成
	jns_1 = "法术伤害效果巨幅波动；\n#G/避免被敌人法术反震；\n#W/————三界因界，命数无常。"
	,jns_3 = 7
	,jns_6 = "dtnn.npk"
	,jns_7 = 0xC56ED72D
	,jns_8 = 0xC56ED72D
	}
	skill取动态超级技能["超级壁垒击破"]={ --完成
	jns_1 = "发动物理攻击敌人，并略提高伤害；\n#G/若敌人防御，则伤害巨幅提高；\n#G/忽视等级*1.2的防御；\n#W/————魔息灌注，利刃出鞘。"
	,jns_3 = 4
	,jns_6 = "dtnn.npk"
	,jns_7 = 0x27B54077
	,jns_8 = 0x27B54077
	}
	skill取动态超级技能["超级盾气"]={ --完成
	jns_1 = "第2回合及以后进入战斗时，增加等级X2的防御持续5回合，且逐回合减少20%效果。\n#G/在场时主人获得“盾气”最多持续5回合；\n#G/隐身时不触发本效果；\n#W/————有正气护体，可力挽狂势。"
	,jns_3 = 7
	,jns_6 = "dtnn.npk"
	,jns_7 = 0x4F35478A
	,jns_8 = 0x4F35478A
	}
	skill取动态超级技能["超级合纵"]={ --完成
	jns_1 = "当本方有1/2/3/4种与其不同的召唤兽；\n#G/则提高其2%/8%/18%/32%的物理伤害；\n#G/并增加等级X0.25/0.5/0.75/1的伤害结果；\n#R/被封印几率+10%；\n#W/————合纵连横，兵法大成。"
	,jns_3 = 7
	,jns_6 = "dtnn.npk"
	,jns_7 = 0x131757C4
	,jns_8 = 0x131757C4
	}
	skill取动态超级技能["超级法术抵抗"]={ --完成
	jns_1 = "减少10%所受到的法术伤害；\n#G/且进场时额外减少50%所受到的法术伤害，持续两回合；\n#W/————道法自然，心志自清。"
	,jns_3 = 7
	,jns_6 = "dtnn.npk"
	,jns_7 = 0xBEF93081
	,jns_8 = 0xBEF93081
	}

function 取技能信息(jn)
	local jns = {}
	if string.find(jn,"超级") and jn ~= "超级三昧真火" and jn ~= "超级战意" and jn ~= "超级神柚复生" then
		if jn == "超级泰山压顶" or jn == "超级奔雷咒" or jn == "超级奔雷咒" or  jn == "超级水漫金山" or jn == "超级壁垒击破" then
			local str = 分割文本(jn,"超级")
			jn = str[2]
		else
			jn = string.gsub(jn,"高级","超级")
		end
		if skill取技能[jn] then
			for i=1,12 do
				if skill取技能[jn]["jns_"..i] then
					jns[i]=skill取技能[jn]["jns_"..i]
				end
			end
		end
	else
		if skill取技能[jn] then
			for i=1,12 do
				if skill取技能[jn]["jns_"..i] then
					jns[i]=skill取技能[jn]["jns_"..i]
				end
			end
		end
	end
	return jns
end


skill取技能={}
skill取技能["163"]={
	jns_1 = "拥有特性的灵石，可点化灵饰，获得指定类型的特性效果。"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 0x01000001
	,jns_8 = 1282412196
	}
skill取技能["心源"]={
	jns_1 = "拥有特性的灵石，可点化灵饰，获得指定类型的特性效果。"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 0x01000001
	,jns_8 = 1282412196
	}
skill取技能["自我陶醉"]={
	jns_1 = "拥有特性的灵石，可点化灵饰，获得指定类型的特性效果。"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 0x01000001
	,jns_8 = 1282412196
	}


skill取技能["九黎战歌"] = {
    jns_1 = "战鼓铿锵，战魂不息，九黎之歌荡涤天地，激昂族人之志。#R其他派技能的等级不能高于本技能。\n#P【学习效果】无效果",
    jns_3 = 8,
    jns_6 = "jmtb.wdf",
    jns_7 = 20000001,
    jns_8 = 20000002,
    jns_11 = "被动"
}

skill取技能["魂枫战舞"] = {
    jns_1 = "魂枫蹁跹，奕奕如战，英气磅礴，永不止息。\n#P【学习效果】按技能等级提高伤害",
    jns_3 = 8,
    jns_6 = "jmtb.wdf",
    jns_7 = 268435459,
    jns_8 = 268435460,
    jns_11 = "被动"
}

skill取技能["兵铸乾坤"] = {
    jns_1 = "九黎魔息，燎天之焰，铸魂成兵，乾坤在握。\n#P【学习效果】按技能等级提高法伤和法防",
    jns_3 = 8,
    jns_6 = "jmtb.wdf",
    jns_7 = 268435461,
    jns_8 = 268435462,
    jns_11 = "被动"
}

skill取技能["燃铁飞花"] = {
    jns_1 = "战意如火，叱咤生花，九黎之子，铁士无畏。\n#P【学习效果】按技能等级提高命中",
    jns_3 = 8,
    jns_6 = "jmtb.wdf",
    jns_7 = 268435463,
    jns_8 = 268435464,
    jns_11 = "被动"
}

skill取技能["战火雄魂"] = {
    jns_1 = "九黎之魂，犹燎原之火，燃万丈烈焰，指胜利之巅。\n#P【学习效果】按技能等级提高防御",
    jns_3 = 8,
    jns_6 = "jmtb.wdf",
    jns_7 = 268435465,
    jns_8 = 268435472,
    jns_11 = "被动"
}

skill取技能["魔神降世"] = {
    jns_1 = "聆听兵主密命，得赐魔神之力，战无不胜，天地可征。\n#P【学习效果】无效果",
    jns_3 = 8,
    jns_6 = "jmtb.wdf",
    jns_7 = 268435473,
    jns_8 = 268435474,
    jns_11 = "被动"
}

skill取技能["风行九黎"] = {
    jns_1 = "风所行处，九黎无阻，越古穿今，无迹不至。\n#P【学习效果】按技能等级提高躲避",
    jns_3 = 8,
    jns_6 = "jmtb.wdf",
    jns_7 = 268435475,
    jns_8 = 268435476,
    jns_11 = "被动"
}

skill取技能["黎魂"] = {
    jns_1 = "每回合可以释放2-3个师门技能。",
    jns_3 = 8,
    jns_5 = "九黎战歌技能达到1级",
    jns_6 = "jmtb.wdf",
    jns_7 = 268435477,
    jns_8 = 268435478,
    jns_11 = "被动"
}

skill取技能["战鼓"] = {
    jns_1 = "使用师门技能攻击敌人时会累加连击值，连击值越大，下回合“黎魂”触发3个技能概率越高。",
    jns_3 = 8,
    jns_5 = "九黎战歌技能达到1级",
    jns_6 = "jmtb.wdf",
    jns_7 = 268435479,
    jns_8 = 268435480,
    jns_11 = "被动"
}

skill取技能["怒哮"] = {
    jns_1 = "使用一斧开天后如果目标没有处于浮空状态，45%概率获得“怒哮”：下一次使用一斧开天和三荒尽灭令目标进入浮空成功率大幅度增加。当使用一斧开天或三荒尽灭令目标成功浮空时，移除该效果。",
    jns_3 = 8,
    jns_5 = "九黎战歌技能达到1级",
    jns_6 = "jmtb.wdf",
    jns_7 = 268435481,
    jns_8 = 268435488,
    jns_66 = "下一次使用‘一斧开天’和‘三荒尽灭’令目标进入浮空成功率大幅度增加",
    jns_11 = "被动"
}

skill取技能["炎魂"] = {
    jns_1 = "全部种族的属性点加成属性统一按照魔族成长。每回合首次使用师门技能前会临时将自身防御的5%-10%转为伤害力。",
    jns_3 = 8,
    jns_5 = "九黎战歌技能达到1级",
    jns_6 = "jmtb.wdf",
    jns_7 = 268435489,
    jns_8 = 268435490,
    jns_11 = "被动"
}

skill取技能["枫影二刃"] = {
    jns_1 = "战歌鸣，怒啸起，枫林迎战舞，英魂影重重。\n#G【功效】对敌方单个目标连续发动2次物理攻击，使用后有概率令自己获得“怒哮”"
    ,jns_3 = 4
    ,jns_4 = "20点魔法"
    ,jns_5 = "魂枫战舞技能达到1级"
    ,jns_6 = "jmtb.wdf"
    ,jns_7 = 268435491
    ,jns_8 = 268435492
}
skill取技能["枫魂汲魄"]={
	jns_1 = "魂枫轻转，魄如云散，万物无声，归默于林。【功效】吸收敌方5个目标的气血。"
	,jns_3 = 4
	,jns_4 = "20点魔法"
	--,jns_5 = "消耗一个金鸦火羽"
	,jns_6 = "jlc.wdf"
	,jns_7 = 0x00000030
	,jns_8 = 0x00000034
	}

skill取技能["一斧开天"] = {
    jns_1 = "一斧开天，气破乾坤，以往昔之魂，凝今时之志。\n#G【功效】对敌方目标连续发动2次物理攻击，使用后有概率令目标进入“浮空”状态，持续到你的行动结束。"
    ,jns_3 = 4
    ,jns_4 = "20点魔法"
    ,jns_5 = "兵铸乾坤技能达到30级"
    ,jns_6 = "jmtb.wdf"
    ,jns_7 = 268435495
    ,jns_8 = 268435496
}

skill取技能["三荒尽灭"] = {
    jns_1 = "横空霹雳，惊三荒， 煞四野，昭吾九黎之威。\n#G【功效】对敌方3个目标发动物理攻击，并令所有目标有概率进入“浮空”状态，持续到你的行动结束。"
    ,jns_3 = 4
    ,jns_4 = "20点魔法"
    ,jns_5 = "燃铁飞花技能达到30级"
    ,jns_6 = "jmtb.wdf"
    ,jns_7 = 268435493
    ,jns_8 = 268435494
}

skill取技能["铁火双杨"] = {
    jns_1 = "炼铁之势，破云千里，战魂凌空，独步天下。\n#G【功效】令敌方2个目标“浮空”。"
    ,jns_3 = 4
    ,jns_4 = "20点魔法"
    ,jns_5 = "燃铁飞花技能达到30级"
    ,jns_6 = "jmtb.wdf"
    ,jns_7 = 0x10000045
    ,jns_8 = 0x10000046
}

skill取技能["铁血生风"] = {
    jns_1 = "铁血凝矣，挟风而起，敌逢吾威，食尘饮悔。\n#G【功效】对敌方单个目标连续物理攻击，如果目标处于“浮空”状态，额外发动1-2次物理攻击。"
    ,jns_3 = 4
    ,jns_4 = "20点魔法"
    ,jns_5 = "战火雄魂技能达到30级"
    ,jns_6 = "jmtb.wdf"
    ,jns_7 = 268435497
    ,jns_8 = 268435504
}

skill取技能["力辟苍穹"] = {
    jns_1 = "魔神垂祉，上古魔息浩若狂澜。兵主赐威，穹顶之下为吾独行。\n#G【功效】对敌方全部“浮空”目标连续发动2-3次物理攻击，然后取消全部目标的“浮空”状态。"
    ,jns_3 = 4
    ,jns_4 = "20点魔法"
    ,jns_5 = "魔神降世技能达到30级"
    ,jns_6 = "jmtb.wdf"
    ,jns_7 = 268435505
    ,jns_8 = 268435506
}

skill取技能["故壤归心"] = {
    jns_1 = "疾风骤起，寻归故里，不问天涯，九黎归心。\n#G【功效】平常状态下使用，可以瞬间回到自己的门派，成功率受技能等级影响。"
    ,jns_3 = 0
    ,jns_4 = "10点气血、10点魔法"
    ,jns_5 = "风行九黎技能达到1级"
    ,jns_6 = "jmtb.wdf"
    ,jns_7 = 268435507
    ,jns_8 = 268435508
}
skill取技能["牛刀小试"]={
	jns_1 = "初入江湖必备技能，可对对方全体造成物理伤害。该技能仅限等级＜50级的角色使用"
	,jns_3 = 4
	,jns_4 = "无消耗"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3416022732
	,jns_8 = 3416022732
	}

skill取技能["子母神针"]={
	jns_1 = "固定伤害攻击2个目标\n#Y固伤伤害数值加成:\n#Y技能等级*2+自身伤害的20%\n#Y暗器技巧等级*2\n#Y固定伤害=(敏捷*0.7+武器伤害*0.46)"
	,jns_3 = 4
	,jns_4 = "35点魔法、30点愤怒"
	,jns_5 = "沉鱼落雁技能达到20级"
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xF0000403
	,jns_8 = 0xF0000404
	}
skill取技能["龙魂"]={
	jns_1 = "每成功使用3次法术，都可以临时增加自身法术伤害（效果可持续2回合，成功使用法术后状态消失）"
	,jns_3 = 7
	,jns_6 = "goods.wdf"
	,jns_7 = 588049499
	,jns_8 = 588049499
	}
skill取技能["移形换影-特"]={
	jns_1 = "和对方交换状态，HP、MP、异常状态、辅助状态等，只能对玩家使用，使用时有一定几率失败。使用后需要休息1回合。自身气血低于20%，或对方气血在80%以上时不能使用"
	,jns_3 = 4
	,jns_4 = "150点愤怒"
	,jns_6 = "goods.wdf"
	,jns_7 = 0XA0000017
	,jns_8 = 0XA0000017
	}
skill取技能["诅咒之伤"]={
	jns_1 = "40消耗、减少敌方单人当前20%的HP"
	,jns_3 = 4
	,jns_4 = "40点愤怒"
	,jns_6 = "goods.wdf"
	,jns_7 = 0XA0000024
	,jns_8 = 0XA0000024
	}
skill取技能["诅咒之亡"]={
	jns_1 = "40消耗、减少敌方单人当前20%的MP"
	,jns_3 = 4
	,jns_4 = "40点愤怒"
	,jns_6 = "goods.wdf"
	,jns_7 = 0XA0000002
	,jns_8 = 0XA0000002
	}
skill取技能["修罗咒"]={
	jns_1 = "受到伤害时，将伤害的一半反作用给对方（作用于多人的法术除外），效果为5回合(每次反弹伤害不超过人物等级×8)"
	,jns_3 = 3
	,jns_4 = "120点愤怒"
	,jns_6 = "goods.wdf"
	,jns_7 = 0XA0000003
	,jns_8 = 0XA0000003
	}
skill取技能["天衣无缝"]={
	jns_1 = "5回合内敌人对自己使用的法术有一定几率失效"
	,jns_3 = 5
	,jns_4 = "80点愤怒"
	,jns_6 = "goods.wdf"
	,jns_7 = 0XA0000004
	,jns_8 = 0XA0000004
	}
skill取技能["凝滞术"]={
	jns_1 = "降低单个敌人10%的速度，效果持续到战斗结束"
	,jns_3 = 4
	,jns_4 = "35点愤怒"
	,jns_6 = "goods.wdf"
	,jns_7 = 0XA0000005
	,jns_8 = 0XA0000005
	}
skill取技能["停陷术"]={
	jns_1 = "降低敌方全体成员5%的速度，效果持续到战斗结束"
	,jns_3 = 4
	,jns_4 = "80点愤怒"
	,jns_6 = "goods.wdf"
	,jns_7 = 0XA0000006
	,jns_8 = 0XA0000006
	}
skill取技能["吸血-特"]={
	jns_1 = "战斗中使用，可吸取目标当前气血的20%转化为自己气血，“吸血”最多使敌方下降“使用者等级*40”的气血,最多回复“使用者等级*12”的气血"
	,jns_3 = 4
	,jns_4 = "70点愤怒"
	,jns_6 = "goods.wdf"
	,jns_7 = 0XA0000007
	,jns_8 = 0XA0000007
	}
skill取技能["残月"]={
	jns_1 = "吸取对方当前30%的MP，不能对怪物BOSS使用，可以对玩家使用,最多使敌方下降使用者等级*40的魔法,最多回复使用者等级*12的魔法"
	,jns_3 = 4
	,jns_4 = "100点愤怒"
	,jns_6 = "goods.wdf"
	,jns_7 = 0XA0000008
	,jns_8 = 0XA0000008
	}
skill取技能["乾坤斩"]={
	jns_1 = "减少敌人HP，伤害=目标人物等级×5+100-施法者敏捷点数/1.5，最小伤害为50，最大伤害为敌人人物等级×3"
	,jns_3 = 4
	,jns_4 = "100点愤怒"
	,jns_6 = "goods.wdf"
	,jns_7 = 0XA0000009
	,jns_8 = 0XA0000009
	}
skill取技能["帝释无双"]={
	jns_1 = "减少对方一定量的HP及MP，效果受对方魔法属性影响,对方最大魔法值30%的伤害"
	,jns_3 = 4
	,jns_4 = "70点愤怒"
	,jns_6 = "goods.wdf"
	,jns_7 = 0XA0000010
	,jns_8 = 0XA0000010
	}
skill取技能["伽罗无双"]={
	jns_1 = "减少对方全体一定量的HP及MP，效果受对方魔法属性影响,对方最大魔法值20%的伤害"
	,jns_3 = 4
	,jns_4 = "100点愤怒"
	,jns_6 = "goods.wdf"
	,jns_7 = 0XA0000011
	,jns_8 = 0XA0000011
	}
skill取技能["虚空之刃"]={
	jns_1 = "减少对方一定量的HP及MP，效果受自己力量属性影响"
	,jns_3 = 4
	,jns_4 = "80点愤怒"
	,jns_6 = "goods.wdf"
	,jns_7 = 0XA0000012
	,jns_8 = 0XA0000012
	}
skill取技能["亡灵之刃"]={
	jns_1 = "减少对方全体一定量的HP及MP，效果受对方力量属性影响"
	,jns_3 = 4
	,jns_4 = "110点愤怒"
	,jns_6 = "goods.wdf"
	,jns_7 = 0XA0000013
	,jns_8 = 0XA0000013
	}
skill取技能["死亡之音"]={
	jns_1 = "令敌全体队员各有一定几率处于某种异常状态"
	,jns_3 = 4
	,jns_4 = "90点愤怒"
	,jns_6 = "goods.wdf"
	,jns_7 = 0XA0000014
	,jns_8 = 0XA0000014
	}
skill取技能["身似菩提"]={
	jns_1 = "将自己受到的法术反作用给施法者(包括固定、法术伤害和法术封印，针对某些特殊情况下无效)，效果持续两回合"
	,jns_3 = 5
	,jns_4 = "130点愤怒"
	,jns_6 = "goods.wdf"
	,jns_7 = 0XA0000015
	,jns_8 = 0XA0000015
	}
skill取技能["琴音三叠"]={
	jns_1 = "对一个目标使用，造成3次法术伤害"
	,jns_3 = 4
	,jns_4 = "80点愤怒"
	,jns_6 = "goods.wdf"
	,jns_7 = 0XA0000021
	,jns_8 = 0XA0000021
	}
skill取技能["心如明镜"]={
	jns_1 = "抵御一切异常类、辅助类附加效果(包括化生的加血和孩子的加血)，效果持续四回合"
	,jns_3 = 4
	,jns_4 = "100点愤怒"
	,jns_6 = "goods.wdf"
	,jns_7 = 0XA0000016
	,jns_8 = 0XA0000016
	}
skill取技能["乾坤挪移"]={
	jns_1 = "驱散目标所有增益、清除目标所有异常、移除目标的太极护法、罗汉金钟、死亡禁锢效果"
	,jns_3 = 4
	,jns_4 = "135点愤怒"
	,jns_6 = "goods.wdf"
	,jns_7 = 0XA0000022
	,jns_8 = 0XA0000022
	}
skill取技能["金刚怒目"]={
	jns_1 = "对一个目标使用，使目标获得80点愤怒。不可对自己用"
	,jns_3 = 3
	,jns_4 = "80点愤怒"
	,jns_6 = "goods.wdf"
	,jns_7 = 0XA0000020
	,jns_8 = 0XA0000020
	}
skill取技能["金刚不坏"]={
	jns_1 = "给己方指定目标增加等级×11的护盾值"
	,jns_3 = 3
	,jns_4 = "90点愤怒"
	,jns_6 = "goods.wdf"
	,jns_7 = 0XA0000023
	,jns_8 = 0XA0000023
	}
skill取技能["燃烧之光"]={
	jns_1 = "减少敌方单体同等于自己“魔力”属性的HP及MP"
	,jns_3 = 4
	,jns_4 = "80点愤怒"
	,jns_6 = "goods.wdf"
	,jns_7 = 0XA0000019
	,jns_8 = 0XA0000019
	}
skill取技能["毁灭之光-"]={
	jns_1 = "减少敌方全体等同于自己“魔力”属性÷3的HP及MP"
	,jns_3 = 4
	,jns_4 = "120点愤怒"
	,jns_6 = "goods.wdf"
	,jns_7 = 0XA0000018
	,jns_8 = 0XA0000018
	}
skill取技能["普通攻击"]={
	jns_1 = "使用普通攻击！"
	,jns_3 = 5
	,jns_4 = "无消耗"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3789166294
	,jns_8 = 1107454372
	}
skill取技能["暗器"]={
	jns_1 = "暗器名家的家传秘笈，学习后可以提高自身使用暗器的伤害力"
	,jns_3 = 4
	,jns_6 = "wzife.wdf"
	,jns_7 = 2101102727
	,jns_8 = 1473796032
	}
skill取技能["战斗防御"]={
	jns_1 = "战斗中防御操作！"
	,jns_3 = 5
	,jns_6 = "wzife.wdf"
	,jns_7 = 91393867
	,jns_8 = 4101692183
	}
skill取技能["横扫千军"]={
	jns_1 = "连续攻击对方3次。但使用后需休息一回合，休息时不能使用战斗指令，也不会受封类法术影响。"
	,jns_3 = 4
	,jns_4 = "消耗10%最大气血"
	,jns_5 = "十方无敌技能达到30级以上"
	,jns_6 = "wzife.wdf"
	,jns_7 = 151046561
	,jns_8 = 2967724427
	}
skill取技能["幸运一击"]={
	jns_1 = "发动一次可触发所有追加法术的物理攻击，随后进入休息状态(休息一回合)"
	,jns_3 = 4
	,jns_4 = "100点魔法"
	-- ,jns_6 = "wzife.wd2"
	-- ,jns_7 = 0xA0000212
	-- ,jns_8 = 0xA0000212
	,jns_10 = "png"
	}
skill取技能["后发制人"]={
	jns_1 = "休息一回合后临时提高伤害力、命中和速度，自动攻击目标"
	,jns_3 = 4
	,jns_4 = "最大气血的5%"
	,jns_5 = "无双一击技能达到25级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3809037555
	,jns_8 = 1112380505
	}
skill取技能["破釜沉舟"]={
	jns_1 = "同时攻击对方三个目标"
	,jns_3 = 4
	,jns_4 = "消耗上限气血的10%"
	,jns_5 = "人物飞升且“十方无敌”技能达到120级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1580308746
	,jns_8 = 619017033
	}
skill取技能["满天花雨"]={
	jns_1 = "使用后增加自己10%的攻击力，并可能使对手中毒，效果不可累加,持续到战斗结束"
	,jns_3 = 4
	,jns_4 = "40点魔法"
	,jns_5 = "沉鱼落雁技能达到25级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2270504354
	,jns_8 = 1714354841
	}
skill取技能["天雷斩"]={
	jns_1 = "使用后可以给予敌人重击，并降低灵力（PVP战斗），但自己也会减少物理防御力（PVP战斗）。"
	,jns_3 = 4
	,jns_4 = "30点魔法"
	,jns_5 = "傲世诀技能达到25级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 315619009
	,jns_8 = 958381035
	}
skill取技能["烟雨剑法"]={
	jns_1 = "使用后可以连续攻击对手两次"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "潇湘仙雨技能达到25级，当前气血高于上限的60%"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3124546025
	,jns_8 = 3643055813
	}
skill取技能["飘渺式"]={
	jns_1 = "作用为当目标为怪物时，通过法术启动物理攻击对方多个目标(PVP中伤害为1)"
	,jns_3 = 4
	,jns_4 = "30点魔法+作用人数*30点魔法"
	,jns_5 = "潇湘仙雨技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3268745174
	,jns_8 = 3398385178
	}
skill取技能["狮搏"]={
	jns_1 = "以高于平时的伤害力攻击对方单人"
	,jns_3 = 4
	,jns_4 = "30点魔法"
	,jns_5 = "生死搏技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3700481839
	,jns_8 = 1627374280
	}
skill取技能["象形"]={
	jns_1 = "攻击敌人并令其下回合无法行动，但使用后下回无法使用法术且取消变身状态"
	,jns_3 = 4
	,jns_4 = "80魔法"
	,jns_5 = "生死搏技能达到20级。"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3175084157
	,jns_8 = 108912467
	}
skill取技能["连环击"]={
	jns_1 = "疯狂地连续的攻击敌人"
	,jns_3 = 4
	,jns_4 = "可连击次数×30点魔法"
	,jns_5 = "狂兽诀技能达到30级，使用后解除当前所有增益状态"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3608703815
	,jns_8 = 673541382
	}
skill取技能["鹰击"]={
	jns_1 = "攻击对方多人，使用后需要休息1回合"
	,jns_3 = 4
	,jns_4 = "30点魔法，攻击多人时消耗增加"
	,jns_5 = "生死搏技能达到30级，不允许连续两回合使用"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3219722580
	,jns_8 = 1443303401
	}
skill取技能["惊心一剑"]={
	jns_1 = "发动物理攻击攻击敌人，并按伤害HP的程度损害其MP。（物理伤害效果将略为降低）命中后，将在下一回合对敌人造成MP持续伤害。(持续效果不可叠加)"
	,jns_3 = 4
	,jns_4 = "等级/2+10魔法"
	,jns_6 = "wzife.wdf"
	,jns_7 = 472040976
	,jns_8 = 376561149
	}
skill取技能["死亡召唤"]={
	jns_1 = "攻击的同时有一定几率降低对手的气血上限；另有10%使敌人附加死亡禁锢效果，效果持续10回合，状态附加的角色在回合内无法被复活。"
	,jns_3 = 4
	,jns_4 = "等级+10魔法"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1218594609
	,jns_8 = 4279125360
	}
skill取技能["善恶有报"]={
	jns_1 = "攻击时有一定几率给予对手造成双倍的伤害，也有可能为对方恢复一定气血"
	,jns_3 = 4
	,jns_4 = "等级+10魔法"
	,jns_6 = "wzife.wdf"
	,jns_7 = 641427651
	,jns_8 = 1898344999
	}
skill取技能["力劈华山"]={
	jns_1 = "发动物理攻击单个敌人，并且攻击时命中临时提高LV(等级)×2+10"
	,jns_3 = 4
	,jns_4 = "等级+20魔法"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3633016146
	,jns_8 = 2223068576
	}
skill取技能["壁垒击破"]={
	jns_1 = "忽视防御的攻击。攻击的目标防御，则会受到更大伤害。用此技能攻击时，会忽视“高级防御”和“防御”这两个召唤兽技能产生的技能效果。"
	,jns_3 = 4
	,jns_4 = "等级+10魔法"
	,jns_6 = "wzife.wdf"
	,jns_7 = 0xF1D5925A
	,jns_8 = 0xF1D5925A
	}
skill取技能["剑荡四方"]={
	jns_1 = "使用时可攻击多人。指定的目标受到一定伤害，其他任意两个目标受到少量伤害。"
	,jns_3 = 4
	,jns_4 = "当前气血的百分之十"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1668746823
	,jns_8 = 1668746823
	}
	skill取技能["超级神柚复生"]={
		jns_1 = "战斗阵亡时40%几率复活，恢复到100%的气血同时获得一个40%生命值上限的护盾；(若鬼魂术，超级神柚复生将失效；当超级神柚复生和超级神佑复生同时存在，只有超级神柚复生生效）。\n#Y/——毕竟是天命之选，也可以叫我“超级神佑复生”。"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 2040400078
	,jns_8 = 3049938323
		}	
skill取技能["迅风出击"]={
		jns_1 = "迅风出击施展高速攻击111，额外释放等同迅风数的风暴攻击。迅风:每次使用此技能后,将随机额外攻击1-3下。\n#Y/——无惧风暴,本少主就是风暴!"
		,jns_3 = 4
		,jns_4 = "40点魔法"
		,jns_6 = "wzife.wdf"
		,jns_7 = 0XA0000013
		,jns_8 = 0XA0000013
		}	
skill取技能["破血狂攻"]={
	jns_1 = "狂性大发，可以连续攻击两次"
	,jns_3 = 4
	,jns_4 = "80点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 4254723553
	,jns_8 = 326320655
	}
skill取技能["吸血特技"]={
	jns_1 = "吸取对方当前20%的HP，不能对怪物BOSS使用"
	,jns_3 = 4
	,jns_4 = "70点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1507579696
	,jns_8 = 2305470189
	}
skill取技能["破碎无双"]={
	jns_1 = "物理攻击敌人，并减少对方和HP损失相同的MP"
	,jns_3 = 4
	,jns_4 = "80点愤怒"
	,jns_6 = "Newsmap.wdf"
	,jns_7 = 4254723553
	,jns_8 = 326320655
	}
skill取技能["弱点击破"]={
	jns_1 = "以临时提高伤害力攻击对手,适于对付防御高者"
	,jns_3 = 4
	,jns_4 = "50点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 4136547665
	,jns_8 = 2136234800
	}
skill取技能["杀气诀"]={
	jns_1 = "战斗中临时提高自己或队友的命中"
	,jns_3 = 3
	,jns_4 = "40点魔法"
	,jns_5 = "为官之道技能达到15级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1673396685
	,jns_8 = 1326507976
	}
skill取技能["安神诀"]={
	jns_1 = "一定回合内临时提升自身灵力"
	,jns_3 = 5
	,jns_4 = "30点魔法"
	,jns_5 = "人物飞升且“文韬武略”技能达到120级 "
	,jns_6 = "wzife.wdf"
	,jns_7 = 3150617611
	,jns_8 = 2204689180
	}
skill取技能["凝神术"]={
	jns_1 = "固定10回合内增加10%自身的封系命中与上限。不受修炼效果影响。"
	,jns_3 = 5
	,jns_4 = "50点魔法"
	,jns_5 = "归元心法技能达到100级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3869803971
	,jns_8 = 3077203266
	}
skill取技能["兵解符"]={
	jns_1 = "在战斗中逃离战场回到自己门派"
	,jns_3 = 5
	,jns_4 = "当前所有魔法、90%当前气血，使用失败无消耗"
	,jns_5 = "符之术技能等级达到10级以上、MP≥10"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1268134129
	,jns_8 = 2026082073
	}
skill取技能["碎甲符"]={
	jns_1 = "降低对方多人物理防御力及法防"
	,jns_3 = 4
	,jns_4 = "50点魔法*目标数"
	,jns_5 = "人物飞升且“符之术”技能达到120级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 417555669
	,jns_8 = 3175526110
	}
skill取技能["分身术"]={
	jns_1 = "一定回合里躲避每回合的首次攻击"
	,jns_3 = 5
	,jns_4 = "80点魔法"
	,jns_5 = "人物飞升且“神道无念”技能达到120级 "
	,jns_6 = "wzife.wdf"
	,jns_7 = 2099222596
	,jns_8 = 1436233235
	}
skill取技能["达摩护体"]={
	jns_1 = "战斗中临时提高自己或队友的气血上限"
	,jns_3 = 3
	,jns_4 = "30点魔法"
	,jns_5 = "佛光普照技能达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1415107827
	,jns_8 = 3131800459
	}
skill取技能["金刚护法"]={
	jns_1 = "战斗中临时提高自己或队友的伤害力，技能等级较高后可作用于多人"
	,jns_3 = 3
	,jns_4 = "40点魔法"
	,jns_5 = "佛光普照技能达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 479962043
	,jns_8 = 3700736796
	}
skill取技能["金刚护体"]={
	jns_1 = "战斗中临时提高自己或队友的防御力，技能达到一定等级后可用于多人"
	,jns_3 = 3
	,jns_4 = "30点魔法"
	,jns_5 = "佛光普照技能等级达到35级以上"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1377178114
	,jns_8 = 3453377621
	}
skill取技能["韦陀护法"]={
	jns_1 = "战斗中临时提高自己或队友的攻击力，技能达到一定等级后可用于多人"
	,jns_3 = 3
	,jns_4 = "35点魔法"
	,jns_5 = "佛光普照技能等级达到20级以上"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2121060262
	,jns_8 = 2888289425
	}
skill取技能["一苇渡江"]={
	jns_1 = "战斗中临时提高自己或队友的速度，技能达到一定等级后可用于多人"
	,jns_3 = 3
	,jns_4 = "30点魔法"
	,jns_5 = "佛光普照技能等级达到30级以上"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2822966564
	,jns_8 = 1136663058
	}
skill取技能["佛法无边"]={
	jns_1 = "令同伴施展某些攻击性法术时一定几率出现连续两次攻击（不包括需停回合的法术及群体攻击性法术，如横扫千军、鹰击、后发制人、连环击）"
	,jns_3 = 2
	,jns_4 = "150点魔法"
	,jns_5 = "人物飞升且“金刚伏魔”技能达到120级 "
	,jns_6 = "wzife.wdf"
	,jns_7 = 2286663605
	,jns_8 = 3100187427
	}
skill取技能["红袖添香"]={
	jns_1 = "战斗中提升自己和队友的速度"
	,jns_3 = 3
	,jns_4 = "30点魔法"
	,jns_5 = "倾国倾城技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 547746768
	,jns_8 = 1757842178
	}
skill取技能["楚楚可怜"]={
	jns_1 = "停止行动并保护自己免受伤害"
	,jns_3 = 5
	,jns_4 = "30点魔法"
	,jns_5 = "倾国倾城技能达到10级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3842255938
	,jns_8 = 952615752
	}
skill取技能["百毒不侵"]={
	jns_1 = "解毒并在一定回合内避免中毒"
	,jns_3 = 5
	,jns_4 = "30点魔法"
	,jns_5 = "玉质冰肌技能达到10级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 45388430
	,jns_8 = 938983833
	}
skill取技能["天神护体"]={
	jns_1 = "战斗中提升自己的灵力"
	,jns_3 = 5
	,jns_4 = "50点魔法"
	,jns_5 = "天罡气技能达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2173852985
	,jns_8 = 4200916921
	}
skill取技能["天神护法"]={
	jns_1 = "在战斗中自动保护指定的队友"
	,jns_3 =3
	,jns_4 = "30点魔法"
	,jns_5 = "天罡气技能等级达到40级以上"
	,jns_6 = "wzife.wdf"
	,jns_7 = 4053425914
	,jns_8 = 3750198819
	}
skill取技能["金刚镯"]={
	jns_1 = "一定回合内降对方的伤害"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "人物飞升且“混天术”技能达到120级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 4185507078
	,jns_8 = 1737815847
	}
skill取技能["天雷灌注"]={
	jns_1 = "强化你的下一个雷霆万钧，以自身被五雷轰击为代价，你的下一个雷霆万钧作用人数增加3个"
	,jns_3 = 5
	,jns_4 = "100点魔法，当前气血*25%"
	,jns_5 = "人物飞升且“混天术”技能达到120级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1493556934
	,jns_8 = 3804853170
	}
skill取技能["普渡众生"]={
	jns_1 = "恢复队友的气血并治疗伤势"
	,jns_3 = 3
	,jns_4 = "50点魔法"
	,jns_5 = "金刚经技能达到15级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 688650727
	,jns_8 = 3407231441
	}
skill取技能["宁心"]={
	jns_1 = "解除并避免女儿村封类法术的影响"
	,jns_3 = 3
	,jns_4 = "30点魔法"
	,jns_5 = "宁气诀技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2585090388
	,jns_8 = 1957863037
	}
skill取技能["清心"]={
	jns_1 = "使用后可以解除中毒的状态"
	,jns_3 = 3
	,jns_4 = "30点魔法"
	,jns_5 = "九龙诀技能达到15级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 22613468
	,jns_8 = 3563353856
	}
skill取技能["解毒"]={
	jns_1 = "使用后可以解除中毒的状态"
	,jns_3 = 3
	,jns_4 = "40点魔法"
	,jns_5 = "岐黄之术技能达到15级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1966642136
	,jns_8 = 546423120
	}
skill取技能["驱尸"]={
	jns_1 = "解除各类中毒状态"
	,jns_3 = 3
	,jns_4 = "40点魔法"
	,jns_5 = "周易学技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1226417381
	,jns_8 = 546827248
	}
skill取技能["解封"]={
	jns_1 = "单次解除女儿村封类法术的影响"
	,jns_3 = 3
	,jns_4 = "60点魔法"
	,jns_5 = "九龙诀技能达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2555181368
	,jns_8 = 1807191850
	}
skill取技能["驱魔"]={
	jns_1 = "解除并避免方寸山封类法术的影响"
	,jns_3 = 3
	,jns_4 = "45点魔法"
	,jns_5 = "周易学技能达到25级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1284415330
	,jns_8 = 656352481
	}
skill取技能["逆鳞"]={
	jns_1 = "战斗中增加自己的伤害力"
	,jns_3 = 5
	,jns_4 = "40点魔法"
	,jns_5 = "逆鳞技能达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1493556934
	,jns_8 = 3804853170
	}
skill取技能["乘风破浪"]={
	jns_1 = "战斗中增加自己或队友的躲避力"
	,jns_3 = 3
	,jns_4 = "40点魔法"
	,jns_5 = "游龙术技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 90073709
	,jns_8 = 3228417140
	}
skill取技能["神龙摆尾"]={
	jns_1 = "持续一定回合的防御性法术，拥有该效果时施法者减少20%所承受的物理伤害。"
	,jns_3 = 5
	,jns_4 = "100点魔法"
	,jns_5 = "人物飞升且“破浪诀”技能达到120级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1562612473
	,jns_8 = 2539345287
	}
skill取技能["生命之泉"]={
	jns_1 = "一定回合内补充自己和队友的气血"
	,jns_3 = 3
	,jns_4 = "作用人数*30点魔法"
	,jns_5 = "修仙术技能达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1093047199
	,jns_8 = 2757069702
	}
skill取技能["炼气化神"]={
	jns_1 = "一定回合内补充自己或队友的魔法"
	,jns_3 = 3
	,jns_4 = "30点气血"
	,jns_5 = "修仙术技能达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2394667501
	,jns_8 = 1686425132
	}
skill取技能["天地同寿"]={
	jns_1 = "为目标临时加上一个防御护罩，吸收全部法术伤害，降低目标50%防御效果，且所受物理伤害会加倍"
	,jns_3 = 3
	,jns_4 = "50点魔法"
	,jns_5 = "人物飞升且“乾坤袖”技能达到120级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 4224047219
	,jns_8 = 3294906395
	}
skill取技能["乾坤妙法"]={
	jns_1 = "令目标无法受负面状态影响（已生效的除外），同时目标也将无法行动。持续两回合。"
	,jns_3 = 1
	,jns_4 = "50点魔法"
	,jns_5 = "人物飞升且“乾坤袖”技能达到120级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1736041428
	,jns_8 = 3294906395
	}
skill取技能["灵动九天"]={
	jns_1 = "为队友临时增加灵力"
	,jns_3 = 3
	,jns_4 = "30点魔法"
	,jns_5 = "人物飞升且“金刚经”技能达到120级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2299324564
	,jns_8 = 1921901005
	}
skill取技能["颠倒五行"]={
	jns_1 = "为队友临时增加四系法术吸收率及法术闪避率"
	,jns_3 = 3
	,jns_4 = "80点魔法"
	,jns_5 = "“五行扭转”技能达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1849998950
	,jns_8 = 3616521026
	}
skill取技能["自在心法"]={
	jns_1 = "清除己方队员身上普渡众生效果，同时将该回合剩余回合可增加的当前气血与气血上限结算进行回复。"
	,jns_3 = 3
	,jns_4 = "30点魔法"
	,jns_5 = "灵性技能达到60级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1199130784
	,jns_8 = 3420028880
	}
skill取技能["幽冥鬼眼"]={
	jns_1 = "使用后可以看到隐身的目标并增加10%的抗封效果。"
	,jns_3 = 3
	,jns_4 = "20点魔法"
	,jns_5 = "九幽阴魂技能达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1975607386
	,jns_8 = 2807639015
	}
skill取技能["修罗隐身"]={
	jns_1 = "战斗中隐藏自己或队友的身形，令对手无法攻击，隐身状态下不能施展法术。"
	,jns_3 = 2
	,jns_4 = "150点魔法，对自己使用每回合消耗施法者15点魔法，对队友使用每回合消耗施法者10点魔法。"
	,jns_5 = "尸腐恶技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 557290721
	,jns_8 = 3076118166
	}
skill取技能["牛劲"]={
	jns_1 = "战斗中暂时提高自己的法术伤害力"
	,jns_3 = 5
	,jns_4 = "20点魔法"
	,jns_5 = "火牛阵技能达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3521936089
	,jns_8 = 1080213476
	}
skill取技能["魔王回首"]={
	jns_1 = "使用后可以在受到物理攻击的时候自动反击"
	,jns_3 = 5
	,jns_4 = "30点魔法"
	,jns_5 = "回身击技能达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 995890213
	,jns_8 = 3043919056
	}
skill取技能["火甲术"]={
	jns_1 = "此状态维持期间遭受普通物理攻击、法术时将自动使用三味真火进行反击。"
	,jns_3 = 5
	,jns_4 = "60点魔法"
	,jns_5 = "人物飞升且“火云术”技能达到120级 "
	,jns_6 = "wzife.wdf"
	,jns_7 = 2418820008
	,jns_8 = 3223806685
	}
skill取技能["魔火焚世"]={
	jns_1 = "自身气血≥50%方可使用，临时提高自身法伤使用一次飞砂走石。"
	,jns_3 = 4
	,jns_4 = "400点魔法，消耗一个金鸦火羽"
	,jns_6 = "wzife.wd3"
	,jns_7 = 3167155447
	,jns_8 = 0x82933a2e
	}
skill取技能["定心术"]={
	jns_1 = "战斗中临时提高自己的灵力"
	,jns_3 = 5
	,jns_4 = "40点魔法"
	,jns_5 = "阴阳二气诀技能达到40级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3988224797
	,jns_8 = 99592343
	}
skill取技能["变身"]={
	jns_1 = "临时提高伤害力，是使用象形、鹰击、狮搏和连环击的前提"
	,jns_3 = 5
	,jns_4 = "20点魔法"
	,jns_5 = "魔兽神功技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 4282403049
	,jns_8 = 3667711762
}
skill取技能["驯兽·幼狮"]={
	jns_1 = "驯服幼兽,为己所用。【功效】召唤你的驯兽·幼狮。"
	,jns_3 = 2
	,jns_4 = "150点魔法"
	,jns_5 = "狂兽诀技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 363599535
	,jns_8 = 2884919862
}
skill取技能["幼狮之搏"]={
	jns_1 = "幼狮侍主,随主人心念而动,对敌人发起进攻。"
	,jns_3 = 8
	,jns_5 = "狂兽诀技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 363599535
	,jns_8 = 2884919862
}
skill取技能["极度疯狂"]={
	jns_1 = "受到物理攻击时会自动反击敌人"
	,jns_3 = 5
	,jns_4 = "30点魔法"
	,jns_5 = "魔兽反噬技能达到20级 "
	,jns_6 = "wzife.wdf"
	,jns_7 = 363599535
	,jns_8 = 2884919862
	}
skill取技能["魔息术"]={
	jns_1 = "一定回合内恢复自身的魔法 "
	,jns_3 = 5
	,jns_4 = "30点魔法"
	,jns_5 = "人物飞升且“阴阳二气诀”技能达到120级 "
	,jns_6 = "wzife.wdf"
	,jns_7 = 3643037170
	,jns_8 = 787252900
	}
skill取技能["天魔解体"]={
	jns_1 = "使用后持续一定回合数将自身的物理防御降低50%，防御值的10%转化为临时伤害，死亡后效果清除"
	,jns_3 = 5
	,jns_4 = "50点魔法，复活后的当前回合无法使用"
	,jns_5 = "人物飞升且“生死搏”技能达到120级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2713209956
	,jns_8 = 2477360209
	}
skill取技能["盘丝阵"]={
	jns_1 = "提升自身的防御力"
	,jns_3 = 5
	,jns_4 = "40点魔法"
	,jns_5 = "盘丝大法技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2395356970
	,jns_8 = 1769215086
	}
skill取技能["复苏"]={
	jns_1 = "解除并避免天宫封类法术的影响"
	,jns_3 = 5
	,jns_4 = "60点魔法"
	,jns_5 = "盘丝大法技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 141266175
	,jns_8 = 2870523056
	}
skill取技能["瘴气"]={
	jns_1 = "临时降低对手接受治疗的效果"
	,jns_3 = 4
	,jns_4 = "30点魔法×作用人数"
	,jns_5 = "人物飞升且“迷情大法”技能达到120级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3039047760
	,jns_8 = 3862934535
	}
skill取技能["幻镜术"]={
	jns_1 = "持续状态时会将一些法术攻击转移至对方随机队员"
	,jns_3 = 5
	,jns_4 = "50点魔法"
	,jns_5 = "人物飞升且“移形换影”技能达到120级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1134668132
	,jns_8 = 605963427
	}
skill取技能["太极护法"]={
	jns_1 = "受到的法术伤害减半，效果为3回合 "
	,jns_3 = 3
	,jns_4 = "90点愤怒"
	,jns_6 = "wzife.wd1"
	,jns_7 = 0x00000009
	,jns_8 = 0x00000010
	}
skill取技能["野兽之力"]={
	jns_1 = "提升队友的伤害力，效果持续到战斗结束 "
	,jns_3 = 3
	,jns_4 = "70点愤怒"
	,jns_6 = "wzife.wd1"
	,jns_7 = 0x00000011
	,jns_8 = 0x00000012
	}
skill取技能["罗汉金钟"]={
	jns_1 = "全体队友受到的法术伤害减半，效果为4回合"
	,jns_3 = 5
	,jns_4 = "150点愤怒"
	,jns_6 = "wzife.wd1"
	,jns_7 = 0x00000001
	,jns_8 = 0x00000002
	}
skill取技能["圣灵之甲"]={
	jns_1 = "提升我方全体的防御，效果持续到战斗结束"
	,jns_3 = 5
	,jns_4 = "80点愤怒"
	,jns_6 = "wzife.wd1"
	,jns_7 = 0x00000003
	,jns_8 = 0x00000004
	}
skill取技能["魔兽之印"]={
	jns_1 = "提升我方全体的伤害力，效果持续到战斗结束 "
	,jns_3 = 5
	,jns_4 = "70点愤怒"
	,jns_6 = "wzife.wd1"
	,jns_7 = 0x00000005
	,jns_8 = 0x00000006
	}
skill取技能["光辉之甲"]={
	jns_1 = "提升队友的防御，效果持续到战斗结束"
	,jns_3 = 3
	,jns_4 = "40点愤怒"
	,jns_6 = "wzife.wd1"
	,jns_7 = 0x00000007
	,jns_8 = 0x00000008
	}
skill取技能["流云诀"]={
	jns_1 = "提升某个队友10%的速度，效果持续到战斗结束(每个目标只能增加一次)"
	,jns_3 = 3
	,jns_4 = "40点愤怒"
	,jns_6 = "wzife.wd1"
	,jns_7 = 0x00000007
	,jns_8 = 0x00000008
	}
skill取技能["啸风诀"]={
	jns_1 = "提升全体队友5%的速度，效果持续到战斗结束(每个目标只能增加一次)"
	,jns_3 = 3
	,jns_4 = "40点愤怒"
	,jns_6 = "wzife.wd1"
	,jns_7 = 0x00000007
	,jns_8 = 0x00000008
	}
skill取技能["尸腐毒"]={
	jns_1 = "令对手中“尸毒”。"
	,jns_3 = 4
	,jns_4 = "40点魔法"
	,jns_5 = "尸腐恶技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 49094427
	,jns_8 = 2328293467
	}
skill取技能["寡欲令"]={
	jns_1 = "解除并避免盘丝洞封类法术的影响。"
	,jns_3 = 3
	,jns_4 = "50点魔法"
	,jns_5 = "灵通术技能达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 653757983
	,jns_8 = 482656655
	}
skill取技能["魂飞魄散"]={
	jns_1 = "使用后驱散目标因门派法术获得的所有良性状态（变身除外）。 "
	,jns_3 = 4
	,jns_4 = "40点魔法"
	,jns_5 = "“六道轮回”技能达到50级 "
	,jns_6 = "wzife.wdf"
	,jns_7 = 1594584941
	,jns_8 = 2719875429
}
skill取技能["百鬼噬魂"]={
	jns_1 = "【功效】对敌方4个目标造成物理伤害,攻击时有概率附加“尸腐毒”状态。"
	,jns_3 = 4
	,jns_4 = "(35*作用目标数)点魔法"
	,jns_5 = "尸腐恶技能达到20级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 285212672
	,jns_8 = 285212672
}
skill取技能["血影蚀心"]={
	jns_1 = "【功效】对敌方单个目标造成物理伤害,攻击时有概率附加“尸腐毒”状态。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "尸腐恶技能达到20级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 1409286144
	,jns_8 = 1409286144
}
skill取技能["紧箍咒"]={
	jns_1 = "一定回合内减少对方的气血和气血上限"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "观音咒技能达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1573115441
	,jns_8 = 956876360
	}
skill取技能["破甲术"]={
	jns_1 = "降低敌人的物理防御力，效果持续到战斗结束"
	,jns_3 = 4
	,jns_4 = "35点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1415639395
	,jns_8 = 752055472
	}
skill取技能["碎甲术"]={
	jns_1 = "降低敌方全体的物理防御力，效果持续到战斗结束"
	,jns_3 = 4
	,jns_4 = "80点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1415639395
	,jns_8 = 752055472
	}
skill取技能["放下屠刀"]={
	jns_1 = "降低敌人的物理攻击力，效果持续到战斗结束"
	,jns_3 = 4
	,jns_4 = "30点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3659778884
	,jns_8 = 441260658
	}
skill取技能["笑里藏刀"]={
	jns_1 = "减少敌方单体目标70点愤怒"
	,jns_3 = 4
	,jns_4 = "40点愤怒"
	,jns_6 = "Newsmap.wdf"
	,jns_7 = 3659778884
	,jns_8 = 441260658
	}
skill取技能["河东狮吼"]={
	jns_1 = "降低敌方全体的物理攻击力，效果持续到战斗结束"
	,jns_3 = 4
	,jns_4 = "100点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 4154480125
	,jns_8 = 1389260370
	}
skill取技能["反间之计"]={
	jns_1 = "令怪物处于混乱状态，不能用于玩家对战"
	,jns_3 = 4
	,jns_4 = "30点魔法"
	,jns_5 = "文韬武略技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 146786390
	,jns_8 = 841319996
	}
skill取技能["催眠符"]={
	jns_1 = "令对手在受到伤害前无法行动"
	,jns_3 = 4
	,jns_4 = "45点魔法"
	,jns_5 = "符之术技能达到10级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3523869082
	,jns_8 = 104771547
	}
skill取技能["失心符"]={
	jns_1 = "令对手一定回合内无法使用法术，并降低灵力"
	,jns_3 = 4
	,jns_4 = "60点魔法"
	,jns_5 = "符之术技能达到40级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1506622772
	,jns_8 = 3407760722
	}
skill取技能["定身符"]={
	jns_1 = "概率令对手一定回合停止行动，并降低法术防御力"
	,jns_3 = 4
	,jns_4 = "60点魔法"
	,jns_5 = "符之术技能达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 170590832
	,jns_8 = 2539497909
	}
skill取技能["落魄符"]={
	jns_1 = "令对手一定回合内无法使用法术，并出现攻击偏差"
	,jns_3 = 4
	,jns_4 = "40点魔法"
	,jns_5 = "符之术技能达到15级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1553239295
	,jns_8 = 2036240644
	}
skill取技能["失忆符"]={
	jns_1 = "令对手一定回合无法使用特技"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "符之术技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1562829683
	,jns_8 = 2704552245
	}
skill取技能["追魂符"]={
	jns_1 = "令对手一定回合无法使用物理攻击，并降低物理防御力"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "符之术技能达到25级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1021060099
	,jns_8 = 2404071232
	}
skill取技能["失魂符"]={
	jns_1 = "令对手一定回合无法使用法术攻击，并降低物理防御力"
	,jns_3 = 4
	,jns_4 = "60点魔法"
	,jns_5 = "符之术技能达到25级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2029120895
	,jns_8 = 2414938178
	}
skill取技能["一笑倾城"]={
	jns_1 = "封印对方多个目标的法术释放权"
	,jns_3 = 4
	,jns_4 = "60点魔法"
	,jns_5 = "人物飞升且“倾国倾城”技能达到120级 "
	,jns_6 = "wzife.wdf"
	,jns_7 = 3266381545
	,jns_8 = 522280593
	}
skill取技能["莲步轻舞"]={
	jns_1 = "令对手一定回合无法使用法术"
	,jns_3 = 4
	,jns_4 = "40点魔法"
	,jns_5 = "闭月羞花技能达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3508375370
	,jns_8 = 4243867972
	}
skill取技能["如花解语"]={
	jns_1 = "令对手一定回合无法使用物理攻击"
	,jns_3 = 4
	,jns_4 = "35点魔法"
	,jns_5 = "闭月羞花技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1912374008
	,jns_8 = 1283470548
	}
skill取技能["似玉生香"]={
	jns_1 = "令对手一定回合无法使用法术和物理攻击"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "闭月羞花技能等级达到40级以上"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2732466496
	,jns_8 = 3524410344
	}
skill取技能["娉婷嬝娜"]={
	jns_1 = "使对手一定回合无法使用装备特技，且被动法宝将不会触发效果。"
	,jns_3 = 4
	,jns_4 = "40点魔法"
	,jns_5 = "闭月羞花技能达到25级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 768000231
	,jns_8 = 1404049159
	}
skill取技能["错乱"]={
	jns_1 = "令对手无法使用法术，并在物理攻击时出现目标偏差"
	,jns_3 = 4
	,jns_4 = "60点魔法"
	,jns_5 = "乾坤塔技能达到50级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3622268205
	,jns_8 = 4290077259
	}
skill取技能["镇妖"]={
	jns_1 = "令对手一定回合内无法使用特技，可与其他封印效果叠加"
	,jns_3 = 4
	,jns_4 = "45点魔法"
	,jns_5 = "乾坤塔技能达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2821624851
	,jns_8 = 251203682
	}
skill取技能["掌心雷"]={
	jns_1 = "使用它后可以使对手不能使用主动法宝。效果可与其他封系效果叠加。成功几率等同封印成功率，受法术攻击修炼影响"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "乾坤塔技能达到50级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 763772202
	,jns_8 = 1576485465
	}
skill取技能["百万神兵"]={
	jns_1 = "令对方无法使用物理攻击"
	,jns_3 = 4
	,jns_4 = "60点魔法"
	,jns_5 = "混天术技能达到40级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3140668291
	,jns_8 = 4284468319
	}
skill取技能["日月乾坤"]={
	jns_1 = "令对手一定回合内无法行动，与怪物战斗中若对方均中此法术则战斗胜利，与玩家对战时类似普通封类法术。"
	,jns_3 = 4
	,jns_4 = "35点魔法 使用失败消耗：10点魔法"
	,jns_5 = "乾坤袖技能达到20级，不能用在某些特殊任务的战斗中使用成功"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3902929414
	,jns_8 = 3489253938
	}
skill取技能["威慑"]={
	jns_1 = "令怪物或玩家召唤兽无法行动，不能对玩家使用"
	,jns_3 = 4
	,jns_4 = "20点魔法"
	,jns_5 = "训兽诀技能达到15级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 81423983
	,jns_8 = 894640149
	}
skill取技能["含情脉脉"]={
	jns_1 = "令对手一定回合内概率无法使用物理攻击和法术"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "魔兽神功技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 4111305818
	,jns_8 = 2589491420
	}
skill取技能["魔音摄魂"]={
	jns_1 = "令对手一定回合内无法恢复气血"
	,jns_3 = 4
	,jns_4 = "40点魔法"
	,jns_5 = "天外魔音技能达到45级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 32064057
	,jns_8 = 1554838399
	}
skill取技能["绝幻魔音"]={
	jns_1 = "使用成功后，使对手在5回合内使用法术消耗翻倍，特技消耗增加50%(成功率非100%)。"
	,jns_3 = 4
	,jns_4 = "60点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 0xF7A055FD
	,jns_8 = 0xF7A055FD
	}
skill取技能["森罗迷瘴"]={
	jns_1 = "【功效】使你门派法术附加尸腐毒”的几率提高,持续10回合。"
	,jns_3 = 2
	,jns_4 = "100点魔法"
	,jns_5 = "尸腐恶技能达到20级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 2432696320
	,jns_8 = 2432696320
	}
skill取技能["锢魂术"]={
	jns_1 = "使用成功后可使目标5个回合内在死亡状态下无法被复活。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "幽冥术技能达到75级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1727365486
	,jns_8 = 784403165
	}
skill取技能["无间地狱"]={
	jns_1 = "(场地法术)提高双方所有单位受到的伤害，所有阵亡的单位会被附加2回合的“死亡禁锢”，持续3回合。"
	,jns_3 = 2
	,jns_4 = "100点魔法"
	,jns_6 = "wzife.wd3"
	,jns_7 = 4045502576
	,jns_8 = 3388648357
	,jns_12 = "10回合"
	}
skill取技能["归元咒"]={
	jns_1 = "消耗魔法值来补充自己的气血"
	,jns_3 = 5
	,jns_4 = "20点魔法"
	,jns_5 = "归元心法技能达到1级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2473529751
	,jns_8 = 3090930843
	}
skill取技能["乾天罡气"]={
	jns_1 = "消耗气血来补充自己的魔法值"
	,jns_3 = 5
	,jns_4 = "20点气血"
	,jns_5 = "神道无念技能达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3309202999
	,jns_8 = 2018341630
	}
skill取技能["我佛慈悲"]={
	jns_1 = "战斗中使用，可以复活死亡的队友"
	,jns_3 = 3
	,jns_4 = "150点魔法"
	,jns_5 = "大慈大悲技能达到40级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1545297145
	,jns_8 = 266298194
	}
skill取技能["推拿"]={
	jns_1 = "使用后可以恢复自身的气血和气血上限"
	,jns_3 = 5
	,jns_4 = "50点魔法，非战斗时减半"
	,jns_5 = "岐黄之术技能达到10级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 404486915
	,jns_8 = 4289032145
	}
skill取技能["活血"]={
	jns_1 = "使用后可以恢复队友的气血和气血上限"
	,jns_3 = 3
	,jns_4 = "70点魔法，非战斗时减半"
	,jns_5 = "岐黄之术技能达到25级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2432822176
	,jns_8 = 2865439591
	}
skill取技能["推气过宫"]={
	jns_1 = "战斗中恢复多人气血"
	,jns_3 = 3
	,jns_4 = "100点魔法"
	,jns_5 = "岐黄之术技能达到35级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 971215069
	,jns_8 = 2227035198
	}
skill取技能["醍醐灌顶"]={
	jns_1 = "恢复友方目标的气血、气血上限，解除一个封印效果，增加少量愤怒并移除药性。"
	,jns_3 = 4
	,jns_4 = "400点魔法，消耗一个金鸦火羽"
	,jns_6 = "wzife.wd3"
	,jns_7 = 220585988
	,jns_8 = 47783851
	,jns_12 = "12回合"
	}
skill取技能["妙手回春"]={
	jns_1 = "使用后可以恢复多人的气血上限"
	,jns_3 = 3
	,jns_4 = "80点魔法"
	,jns_5 = "岐黄之术技能达到40级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 416089174
	,jns_8 = 2939581056
	}
skill取技能["救死扶伤"]={
	jns_1 = "使用后可以恢复多人的气血和气血上限"
	,jns_3 = 3
	,jns_4 = "150点魔法"
	,jns_5 = "岐黄之术技能达到50级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2043895215
	,jns_8 = 4157454265
	}
skill取技能["舍生取义"]={
	jns_1 = "将目标当前气血恢复到满"
	,jns_3 = 3
	,jns_4 = "150点魔法，且每次使用时会降低自身5%物理防御及3%灵力"
	,jns_5 = "人物飞升且“岐黄之术”技能达到120级 "
	,jns_6 = "wzife.wdf"
	,jns_7 = 1135928864
	,jns_8 = 1707332905
	}
skill取技能["三花聚顶"]={
	jns_1 = "消耗一定的气血来补充魔法，非战斗时每2分钟使用一次"
	,jns_3 = 5
	,jns_4 = "30点气血"
	,jns_5 = "明性修身技能达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3813527840
	,jns_8 = 3150915326
	}
skill取技能["杨柳甘露"]={
	jns_1 = "使用后可以复活已经死亡的队友，可以复活处在“锢魂术”或者“死亡召唤”状态下剩余回合小于等于2的队友。"
	,jns_3 = 3
	,jns_4 = "150点魔法"
	,jns_5 = "观音咒技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3757213330
	,jns_8 = 794491517
	}
skill取技能["还阳术"]={
	jns_1 = "复活倒地的队友，提高攻击力，降低防御力"
	,jns_3 = 3
	,jns_4 = "150点魔法"
	,jns_5 = "“拘魂诀”技能达到30级 "
	,jns_6 = "wzife.wdf"
	,jns_7 = 2874709055
	,jns_8 = 485361049
	}
skill取技能["慈航普度"]={
	jns_1 = "复活我方全体队友。"
	,jns_3 = 3
	,jns_4 = "150点愤怒"
	,jns_6 = "wzife.wd1"
	,jns_7 = 0x00000013
	,jns_8 = 0x00000014
	}
skill取技能["回魂咒"]={
	jns_1 = "单体复活"
	,jns_3 = 3
	,jns_4 = "100点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3815030652
	,jns_8 = 2541979797
	}
skill取技能["起死回生"]={
	jns_1 = "单体复活并恢复二分之一的气血"
	,jns_3 = 3
	,jns_4 = "120点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2205777788
	,jns_8 = 3279499363
	}
skill取技能["水清诀"]={
	jns_1 = "单体解除异常状态"
	,jns_3 = 3
	,jns_4 = "50点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1988393110
	,jns_8 = 2231990553
	}
skill取技能["冰清诀"]={
	jns_1 = "单体解除异常状态并恢复四分之一的气血"
	,jns_3 = 3
	,jns_4 = "100点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 4269368884
	,jns_8 = 994373130
	}
skill取技能["玉清诀"]={
	jns_1 = "全体解除异常状态"
	,jns_3 = 3
	,jns_4 = "125点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2317466220
	,jns_8 = 1064948127
	}
skill取技能["晶清诀"]={
	jns_1 = "全体解除异常状态并恢复15%的气血"
	,jns_3 = 5
	,jns_4 = "150点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 4162645482
	,jns_8 = 2183757094
	}
skill取技能["气归术"]={
	jns_1 = "自身恢复四分之一的气血"
	,jns_3 = 5
	,jns_4 = "30点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1743955726
	,jns_8 = 1501636093
	}
skill取技能["命归术"]={
	jns_1 = "自身恢复二分之一的气血"
	,jns_3 = 5
	,jns_4 = "60点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2585363944
	,jns_8 = 1305176222
	}
skill取技能["四海升平"]={
	jns_1 = "全体恢复四分之一的气血"
	,jns_3 = 3
	,jns_4 = "135点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2015850288
	,jns_8 = 2239024625
	}
skill取技能["气疗术"]={
	jns_1 = "恢复（上限3%+200）的气血，对单人使用"
	,jns_3 = 3
	,jns_4 = "30点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 175234791
	,jns_8 = 2394534448
	}
skill取技能["心疗术"]={
	jns_1 = "恢复（上限6%+400）的气血，对单人使用"
	,jns_3 = 3
	,jns_4 = "60点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1936940204
	,jns_8 = 4247881671
	}
skill取技能["命疗术"]={
	jns_1 = "恢复（上限9%+600）的气血，对单人使用"
	,jns_3 = 3
	,jns_4 = "90点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2327070966
	,jns_8 = 1214582243
	}
skill取技能["凝气诀"]={
	jns_1 = "恢复上限（15%+200）的魔法，对单人使用"
	,jns_3 = 5
	,jns_4 = "60点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2234398453
	,jns_8 = 4231419592
	}
skill取技能["凝神诀"]={
	jns_1 = "恢复上限（15%+400）的魔法，对单人使用"
	,jns_3 = 5
	,jns_4 = "90点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3010398248
	,jns_8 = 3594183195
	}
skill取技能["五雷咒"]={
	jns_1 = "施展法术攻击对方单人"
	,jns_3 = 4
	,jns_4 = "30点魔法"
	,jns_5 = "霹雳咒技能达到1级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3103307429
	,jns_8 = 1116134864
	}
skill取技能["落雷符"]={
	jns_1 = "作用为当目标为怪物时攻击对方多个目标，作用人数公式为技能等级/30+1，最多3个。受法术攻击修炼影响，随着作用人数增加降低伤害效果，魔法消耗随着作用人数增加而增加。"
	,jns_3 = 4
	,jns_4 = "作用人数*30点魔法"
	,jns_5 = "“符之术”技能达到20级 "
	,jns_6 = "wzife.wdf"
	,jns_7 = 3476452217
	,jns_8 = 3226830020
	}
skill取技能["唧唧歪歪"]={
	jns_1 = "攻击性法术，达到一定等级后可以对多人使用"
	,jns_3 = 4
	,jns_4 = "5点气血，20点魔法，作用于多人时消耗魔法增加"
	,jns_5 = "诵经技能达到1级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1856916618
	,jns_8 = 2374732908
	}
skill取技能["飞花摘叶"]={
	jns_1 = "吸取对方多人魔法为我方队员所使用"
	,jns_3 = 4
	,jns_4 = "60点魔法"
	,jns_5 = "人物飞升且“清歌妙舞”技能达到120级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 4065673057
	,jns_8 = 1962869359
	}
skill取技能["雷霆万钧"]={
	jns_1 = "攻击性法术，使用后攻击对方多个目标"
	,jns_3 = 4
	,jns_4 = "35点魔法×作用人数"
	,jns_5 = "人物飞升且“天罡气”技能达到120级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1167105764
	,jns_8 = 2063612274
	}
skill取技能["龙腾"]={
	jns_1 = "施展法术攻击对方单人"
	,jns_3 = 4
	,jns_4 = "30点魔法"
	,jns_5 = "龙腾术技能达到50级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2093346600
	,jns_8 = 3650312562
	}
skill取技能["龙卷雨击"]={
	jns_1 = "施展法术攻击对方，技能达到一定等级后可攻击多人"
	,jns_3 = 4
	,jns_4 = "20点魔法，攻击多人时消耗增加"
	,jns_5 = "呼风唤雨技能达到15级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 201672841
	,jns_8 = 842454497
	}
skill取技能["龙战于野"]={
	jns_1 = "降低自身法防并提高法伤，使用龙卷雨击、龙腾、亢龙归海时额外消耗350点魔法并提高16%伤害结果。"
	,jns_3 = 2
	,jns_4 = "100点魔法，消耗一个金鸦火羽"
	,jns_6 = "wzife.wd3"
	,jns_7 = 830551480
	,jns_8 = 3422758826
	,jns_12 = "16回合"
	}
skill取技能["二龙戏珠"]={
	jns_1 = "施展法术攻击对方两个目标"
	,jns_3 = 4
	,jns_4 = "70点魔法"
	,jns_5 = "人物飞升且“九龙诀”技能达到120级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1266218218
	,jns_8 = 630766288
	}
skill取技能["飞砂走石"]={
	jns_1 = "使用后可以攻击对方多个对象"
	,jns_3 = 4
	,jns_4 = "30点魔法，攻击多人时消耗增加"
	,jns_5 = "火云术技能达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 706133968
	,jns_8 = 746568918
}
skill取技能["秘传飞砂走石"]={
	jns_1 = "牛魔王的秘传法术之一，可以卷起狂风砂石，甚至可以摧毁山峰。施放一次强力的飞砂走石。"
	,jns_3 = 4
	,jns_4 = "(60×作用人数)点魔法、20点愤怒"
	,jns_6 = "jntb.wdf"
	,jns_7 = 905969664
	,jns_8 = 905969664
	,jns_12="20回合，战斗开始时冷却10回合"
}
skill取技能["风云变色"]={
	jns_1 = "释放一次强力的飞砂走石,额外作用1个敌方单位,冷却8回合,进入战斗有4回合冷却时间"
	,jns_3 = 4
	,jns_4 = "30点魔法，攻击多人时消耗增加"
	,jns_5 = "经脉技能"
	,jns_6 = "wzife.wdf"
	,jns_7 = 706133968
	,jns_8 = 746568918
	}
skill取技能["三昧真火"]={
	jns_1 = "使用后可以攻击对方单个对象"
	,jns_3 = 4
	,jns_4 = "30点魔法"
	,jns_5 = "火云术技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 626159438
	,jns_8 = 290397996
	}
skill取技能["摇头摆尾"]={
	jns_1 = "攻击目标时随机触发三昧真火或者飞砂走石，随后施放一个持续燃烧的火焰，一定回合内造成伤害"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "人物飞升且“牛虱阵”技能达到120级 "
	,jns_6 = "wzife.wdf"
	,jns_7 = 3051115375
	,jns_8 = 1777991632
	}
skill取技能["勾魂"]={
	jns_1 = "恢复自身气血，减少对方一定的气血"
	,jns_3 = 4
	,jns_4 = "40点魔法"
	,jns_5 = "秋波暗送技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3333121941
	,jns_8 = 802455732
	}
skill取技能["摄魄"]={
	jns_1 = "恢复自身魔法，减少对方一定的魔法"
	,jns_3 = 4
	,jns_4 = "35点魔法"
	,jns_5 = "秋波暗送技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3333121941
	,jns_8 = 103370656
	}
skill取技能["姐妹同心"]={
	jns_1 = "战斗中使用，可以减少对手的魔法值"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "姊妹相随技能达到20级 "
	,jns_6 = "wzife.wdf"
	,jns_7 = 42398851
	,jns_8 = 502149406
	}
skill取技能["雷击"]={
	jns_1 = "雷属性的攻击法术，按召唤兽等级附加一定的法术伤害"
	,jns_3 = 4
	,jns_4 = "30点魔法"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3336994935
	,jns_8 = 2495588313
	}
skill取技能["落岩"]={
	jns_1 = "土属性的攻击法术，按召唤兽等级附加一定的法术伤害"
	,jns_3 = 4
	,jns_4 = "30点魔法"
	,jns_6 = "wzife.wdf"
	,jns_7 = 4226735508
	,jns_8 = 300977089
	}
skill取技能["水攻"]={
	jns_1 = "水属性的攻击法术，按召唤兽等级附加一定的法术伤害"
	,jns_3 = 4
	,jns_4 = "30点魔法"
	,jns_6 = "wzife.wdf"
	,jns_7 = 85059369
	,jns_8 = 2415441344
	}
skill取技能["烈火"]={
	jns_1 = "火属性的攻击法术，按召唤兽等级附加一定的法术伤害"
	,jns_3 = 4
	,jns_4 = "30点魔法"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2966154175
	,jns_8 = 1668132272
	}
skill取技能["奔雷咒"]={
	jns_1 = "雷属性的攻击法术，按召唤兽等级附加一定的法术伤害，攻击人数为(自身等级除以30+1)，最多为3人"
	,jns_3 = 4
	,jns_4 = "作用目标*30点魔法"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2858620755
	,jns_8 = 3666293224
	}
skill取技能["泰山压顶"]={
	jns_1 = "土属性的攻击法术，按召唤兽等级附加一定的法术伤害，攻击人数为(自身等级除以30+1)，最多为3人"
	,jns_3 = 4
	,jns_4 = "作用目标*30点魔法"
	,jns_6 = "wzife.wdf"
	,jns_7 = 463605150
	,jns_8 = 463605150
	}
skill取技能["水漫金山"]={
	jns_1 = "水属性的攻击法术，按召唤兽等级附加一定的法术伤害，攻击人数为(自身等级除以30+1)，最多为3人"
	,jns_3 = 4
	,jns_4 = "作用目标*30点魔法"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2637597442
	,jns_8 = 3867686033
	}
skill取技能["地狱烈火"]={
	jns_1 = "火属性的攻击法术，按召唤兽等级附加一定的法术伤害，攻击人数为(自身等级除以15+1)，最多为3人"
	,jns_3 = 4
	,jns_4 = "作用目标*30点魔法"
	,jns_6 = "wzife.wdf"
	,jns_7 = 4223394612
	,jns_8 = 3042874244
	}
skill取技能["上古灵符"]={
	jns_1 = "给予对手巨大的法术波动伤害"
	,jns_3 = 4
	,jns_4 = "100点魔法"
	,jns_6 = "wzife.wdf"
	,jns_7 = 0xAA1341AF
	,jns_8 = 0xAA1341AF
	}
skill取技能["夜舞倾城"]={
	jns_1 = "按自身力量点*1.5+自己速度/3对对方造成伤害(攻击目标为人物时效果减半)。"
	,jns_3 = 4
	,jns_4 = "100点魔法"
	,jns_6 = "wzife.wdf"
	,jns_7 = 387579012
	,jns_8 = 1832394806
	}
skill取技能["五雷轰顶"]={
	jns_1 = "减少敌人25%当前气血及魔法，但最高不会超过自己等级×50，失败只减少5%的当前气血"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "天罡气技能达到35级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 4236045895
	,jns_8 = 1825724039
	}
skill取技能["斩龙诀"]={
	jns_1 = "克制龙宫弟子的必杀技"
	,jns_3 = 4
	,jns_4 = "150点愤怒值"
	,jns_5 = "紫薇之术技能达到25级，人物等级达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 40028053
	,jns_8 = 1152390271
	}
skill取技能["三星灭魔"]={
	jns_1 = "克制魔王寨弟子的必杀技"
	,jns_3 = 4
	,jns_4 = "150点愤怒值"
	,jns_5 = "黄庭经技能达到25级，人物等级达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1209970630
	,jns_8 = 84450076
	}
skill取技能["紫气东来"]={
	jns_1 = "克制普陀山弟子的必杀技"
	,jns_3 = 4
	,jns_4 = "150点愤怒值"
	,jns_5 = "小乘佛法技能达到25级，人物等级达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3576748561
	,jns_8 = 3918273363
	}
skill取技能["情天恨海"]={
	jns_1 = "克制五庄观弟子的必杀技"
	,jns_3 = 4
	,jns_4 = "150点愤怒值"
	,jns_5 = "沉鱼落雁技能达到25级，人物等级达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1898550998
	,jns_8 = 2472450541
	}
skill取技能["天诛地灭"]={
	jns_1 = "克制地府弟子的必杀技"
	,jns_3 = 4
	,jns_4 = "150点愤怒值"
	,jns_5 = "天罡气技能达到25级，人物等级达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 4053425914
	,jns_8 = 3701201548
	}
skill取技能["龙啸九天"]={
	jns_1 = "克制盘丝洞弟子的必杀技"
	,jns_3 = 4
	,jns_4 = "150点愤怒值"
	,jns_5 = "龙附技能达到25级，人物等级达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3644673853
	,jns_8 = 2124753589
	}
skill取技能["太极生化"]={
	jns_1 = "克制狮驼岭弟子的必杀技"
	,jns_3 = 4
	,jns_4 = "150点愤怒值"
	,jns_5 = "修仙术技能达到25级，人物等级达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1665649019
	,jns_8 = 1661704448
	}
skill取技能["五行错位"]={
	jns_1 = "克制女儿村弟子的必杀技"
	,jns_3 = 4
	,jns_4 = "150点愤怒值"
	,jns_5 = "五行扭转技能达到25级，人物等级达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 322760356
	,jns_8 = 3739244200
	}
skill取技能["冤魂不散"]={
	jns_1 = "克制大唐官府弟子的必杀技。"
	,jns_3 = 4
	,jns_4 = "150点愤怒值"
	,jns_5 = "九幽阴魂技能达到25级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3587078621
	,jns_8 = 376661686
	}
skill取技能["踏山裂石"]={
	jns_1 = "克制化生寺弟子的必杀技"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "火牛阵技能达到120级，且人物飞升"
	,jns_6 = "wzife.wdf"
	,jns_7 = 4060498152
	,jns_8 = 2813097952
	}
skill取技能["魔兽啸天"]={
	jns_1 = "克制天宫弟子的必杀技"
	,jns_3 = 4
	,jns_4 = "150点愤怒值"
	,jns_5 = "魔兽神功技能达到25级，人物等级达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 950759216
	,jns_8 = 1124928283
	}
skill取技能["夺命蛛丝"]={
	jns_1 = "克制方寸山弟子的必杀技"
	,jns_3 = 4
	,jns_4 = "150点愤怒值"
	,jns_5 = "蛛丝阵法技能达到25级，人物等级达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 227632678
	,jns_8 = 3268216546
	}
skill取技能["雨落寒沙"]={
	jns_1 = "消耗一定魔法对目标造成暗器伤害。有一定几率使目标中毒，损失目标当前10%气血。(最高为目标等级*10)"
	,jns_3 = 4
	,jns_4 = "作用人数*20点魔法"
	,jns_5 = "沉鱼落雁技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2465624576
	,jns_8 = 562574867
	}
skill取技能["龙吟"]={
	jns_1 = "使用后可以减少对方全体队员一定的气血和魔法值"
	,jns_3 = 4
	,jns_4 = "30点魔法"
	,jns_5 = "龙附技能达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1318499395
	,jns_8 = 2137943042
	}
skill取技能["日光华"]={
	jns_1 = "施展法术攻击多人，并附加固定伤害"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "五行学技能达到10级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2064123225
	,jns_8 = 877019458
	}
skill取技能["靛沧海"]={
	jns_1 = "施展法术攻击多人，并附加固定伤害"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "五行学技能达到11级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2679663466
	,jns_8 = 1783445565
	}
skill取技能["巨岩破"]={
	jns_1 = "施展法术攻击多人，并附加固定伤害"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "五行学技能达到12级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3218559640
	,jns_8 = 3817801025
	}
skill取技能["苍茫树"]={
	jns_1 = "施展法术攻击多人，并附加固定伤害"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "五行学技能达到13级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1228860567
	,jns_8 = 2355974251
	}
skill取技能["地裂火"]={
	jns_1 = "施展法术攻击多人，并附加固定伤害"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "五行学技能达到14级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 4132171079
	,jns_8 = 75104423
	}
skill取技能["阎罗令"]={
	jns_1 = "可攻击多人，减少对手的气血和气血上限，对鬼魂类怪物使用时，伤害效果额外提高100%"
	,jns_3 = 4
	,jns_4 = "20点魔法，作用于多人时消耗增加"
	,jns_5 = "幽冥术技能达到25级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2806354228
	,jns_8 = 3446923388
	}
skill取技能["判官令"]={
	jns_1 = "攻击对方单人，减少对手的气血和魔法，效果由技能等级决定，不受双方灵力影响。对鬼魂类怪物使用时，伤害提高150%"
	,jns_3 = 4
	,jns_4 = "20点魔法"
	,jns_5 = "拘魂诀技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1671969153
	,jns_8 = 3702239149
	}
skill取技能["黄泉之息"]={
	jns_1 = "攻击对方单人，并减少其一定的速度，夜间使用效果调整为白天的130%。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "人物飞升且“幽冥术”技能达到120级 "
	,jns_6 = "wzife.wdf"
	,jns_7 = 3536984715
	,jns_8 = 1893059881
	}
skill取技能["天罗地网"]={
	jns_1 = "每次攻击时有一定几率令对手在一定回合内无法使用物理攻击,"
	,jns_3 = 4
	,jns_4 = "30点魔法，攻击多人时消耗增加"
	,jns_5 = "移形换影技能达到15级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1653509465
	,jns_8 = 1457394081
	}
skill取技能["冥王暴杀"]={
	jns_1 = "减少对方气血，最小伤害为50"
	,jns_3 = 4
	,jns_4 = "60点愤怒"
	,jns_6 = "wzife.wdf"
	,jns_7 = 0x59DBD730
	,jns_8 = 0x59DBD730
	}
skill取技能["反击"]={
	jns_1 = "受到物理攻击时有30%几率自动反击，反击伤害为正常伤害的50%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 2574462722
	,jns_8 = 326702364
	}
skill取技能["高级反击"]={
	jns_1 = "受到物理攻击时有30%几率自动反击，反击的伤害与正常攻击相同"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 3922527672
	,jns_8 = 3922527672
	}
skill取技能["反震"]={
	jns_1 = "受到物理攻击时有30%几率给予对方反震，反震伤害为所受伤害的25%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 3941065708
	,jns_8 = 3754360316
	}
skill取技能["高级反震"]={
	jns_1 = "受到物理攻击时有30%几率给予对方反震，反震伤害为所受伤害的50%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 1907422702
	,jns_8 = 511662384
	}
skill取技能["连击"]={
	jns_1 = "45%的几率连续两次物理攻击，拥有此技能物理攻击效果会降低25%，如果对方有反震技能，只能攻击一次"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 1161065019
	,jns_8 = 834880568
	}
skill取技能["高级连击"]={
	jns_1 = "55%的几率连续两次物理攻击，拥有此技能物理攻击效果会降低20%，如果对方有反震技能，只能攻击一次"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 1321871887
	,jns_8 = 3016140514
	}
skill取技能["高级飞行"]={
	jns_1 = "	躲避能力增加30%、躲避率增加10%，物理攻击命中几率增加20%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 4277341965
	,jns_8 = 3853120636
	}
skill取技能["飞行"]={
	jns_1 = "躲避能力增加20%，躲避率增加5%，物理攻击命中增加20%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 813574344
	,jns_8 = 1190813269
	}

skill取技能["夜战"]={
	jns_1 = "具备夜战能力，不受夜间攻防能力下降的影响。"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 0xDD5CEE60
	,jns_8 = 0xDD5CEE60
	}
skill取技能["高级夜战"]={
	jns_1 = "具备夜战能力，不受夜间攻防能力下降的影响，夜间躲避能力提高20%。"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 0x3E81ECFB
	,jns_8 = 0x3E81ECFB
	}
skill取技能["隐身"]={
	jns_1 = "自动附加地府修罗隐身法术2～3回合，拥有此技能物理攻击能力会降低20%，隐身状态下无法使用法术"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 1508147758
	,jns_8 = 3007875758
	}
skill取技能["高级隐身"]={
	jns_1 = "自动附加地府修罗隐身法术3～5回合，拥有此技能物理攻击能力会降低15%，隐身状态下无法使用法术"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 2491734238
	,jns_8 = 2948130962
	}
skill取技能["感知"]={
	jns_1 = "可以破解地府的修罗隐身、女儿村的楚楚可怜法术效果"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 3677043818
	,jns_8 = 4012137980
	}
skill取技能["高级感知"]={
	jns_1 = "破解地府的修罗隐身、女儿村的楚楚可怜法术效果，躲避能力提高10%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 675296013
	,jns_8 = 1822711583
	}
skill取技能["再生"]={
	jns_1 = "战斗中每回合自动恢复(自身等级一半)的气血"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 3287776911
	,jns_8 = 2264480315
	}
skill取技能["高级再生"]={
	jns_1 = "战斗中每回合自动恢复气血，恢复数值与自身等级相同"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 468221024
	,jns_8 = 3809634425
	}
skill取技能["冥思"]={
	jns_1 = "战斗中每回合自动恢复(自身等级四分之一)的魔法"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 622128415
	,jns_8 = 3554832714
	}
skill取技能["高级冥思"]={
	jns_1 = "战斗中每回合自动恢复(自身等级三分之一)的魔法"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 1718714912
	,jns_8 = 2174943999
	}
skill取技能["慧根"]={
	jns_1 = "使用法术时所消耗的魔法降低为正常的75%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 1457451798
	,jns_8 = 3365576412
	}
skill取技能["高级慧根"]={
	jns_1 = "使用法术时所消耗的魔法降低为正常的50%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 242180125
	,jns_8 = 4174265955
	}
skill取技能["必杀"]={
	jns_1 = "物理攻击时的必杀几率增加10%，出现必杀时伤害结果会加倍"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 3789166294
	,jns_8 = 1107454372
	}
skill取技能["高级必杀"]={
	jns_1 = "物理攻击时的必杀几率增加20%，出现必杀时伤害结果会加倍"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 1672890477
	,jns_8 = 1282412196
	}
skill取技能["虎虎生风"]={
	jns_1 = "大幅提升必杀伤害结果。----威风凛凛，虎虎生风！"
	,jns_3 = 7
	,jns_6 = "jntb.wdf"
	,jns_7 = 0XABAB0007
	,jns_8 = 0XABAB0007
}
skill取技能["无上正真"]={
	jns_1 = "增加力量*0.4的物理伤害力"
	,jns_3 = 7
	,jns_7 = 0xABAB0015
	,jns_8 = 0xABAB0015
	}
 skill取技能["诸天正法"]={
 	jns_1 = "增加自身力量*成长*0.2的物理攻击力，降低自身力量*0.2的防御。\n——诸法实像，力破万障。"
 	,jns_3 = 7
 	,jns_6 = "xz.wdf"
	,jns_7 = 0x00000020
	,jns_8 = 0x00000020
 	}
skill取技能["狂莽一击"]={
	jns_1 = "物理攻击造成的伤害结果提升25%，不会失败！"
	,jns_3 = 7
	,jns_6 = "xinui.wdf"
	,jns_7 = 0xE1D7DBA7
	,jns_8 = 0xE1D7DBA7
	}
skill取技能["出奇制胜"]={
	jns_1 = "第二回合及以后。所造成的伤害提高25%"
	,jns_3 = 7
	,jns_6 = "xinui.wdf"
	,jns_7 = 0xa6462644
	,jns_8 = 0xa6462644
	}
skill取技能["好梦连连"]={
	jns_1 = "整天梦游状态，百分之20几率增加未知神秘法术伤害"
	,jns_3 = 7
	,jns_6 = "xinui.wdf"
	,jns_7 = 0x63FEBCBC
	,jns_8 = 0x63FEBCBC
	}

skill取技能["柳暗花明"]={
	jns_1 = "每次没有触发法术连击的施法，提升法术连击时50%伤害结果。（最多2层，在触发法术连击时清空）"
	,jns_3 = 7
	,jns_7 = 0xABAB0014
	,jns_8 = 0xABAB0014
	}

skill取技能["克敌五行"]={
	jns_1 = "对于五行克制的目标，造成的伤害大幅度增加。\n#R/仅五行山神可拥有此技能\n#W/————如果五行相克，我会让你知道什么是残忍。"
	,jns_3 = 7
	,jns_6 = "xz.wdf"
	,jns_7 = 0xBB20C5D0
	,jns_8 = 0xBB20C5D0
	}
skill取技能["真灵（金）"]={
	jns_1 = "自身受到的法术伤害降低5%，五行为金时生效。"
	,jns_3= 7
	,jns_6= "xz.wdf"
	,jns_7= 0x36F94409
	,jns_8= 0x36F94409
	}
skill取技能["真灵（木）"]={
	jns_1 = "自身受到的法术伤害降低5%，五行为木时生效。"
	,jns_3= 7
	,jns_6= "xz.wdf"
	,jns_7= 0x36F93D29
	,jns_8= 0x36F93D29
	}
skill取技能["真灵（水）"]={
	jns_1 = "自身受到的法术伤害降低5%，五行为水时生效。"
	,jns_3= 7
	,jns_6= "xz.wdf"
	,jns_7= 0x36F94B09
	,jns_8= 0x36F94B09
	}
skill取技能["真灵（火）"]={
	jns_1 = "自身受到的法术伤害降低5%，五行为火时生效。"
	,jns_3= 7
	,jns_6= "xz.wdf"
	,jns_7= 0x36F93B29
	,jns_8=0x36F93B29
	}
skill取技能["真灵（土）"]={
	jns_1 = "自身受到的法术伤害降低5%，五行为土时生效。"
	,jns_3= 7
	,jns_6= "xz.wdf"
	,jns_7= 0x36F94D39
	,jns_8= 0x36F94D39
	}

skill取技能["健壮（金）"]={
	jns_1 = "自身受到的物理伤害降低5%，五行为金时生效。"
	,jns_3= 7
	,jns_6= "xz.wdf"
	,jns_7= 0x71234409
	,jns_8= 0x71234409
	}
skill取技能["健壮（木）"]={
	jns_1 = "自身受到的物理伤害降低5%，五行为木时生效。"
	,jns_3= 7
	,jns_6= "xz.wdf"
	,jns_7= 0x71233D29
	,jns_8= 0x71233D29
	}
skill取技能["健壮（水）"]={
	jns_1 = "自身受到的物理伤害降低5%，五行为水时生效。"
	,jns_3= 7
	,jns_6= "xz.wdf"
	,jns_7= 0x71234B09
	,jns_8=0x71234B09
	}
skill取技能["健壮（火）"]={
	jns_1 = "自身受到的物理伤害降低5%，五行为火时生效。"
	,jns_3= 7
	,jns_6= "xz.wdf"
	,jns_7= 0x71233B29
	,jns_8= 0x71233B29
	}
skill取技能["健壮（土）"]={
	jns_1 = "自身受到的物理伤害降低5%，五行为土时生效。"
	,jns_3= 7
	,jns_6= "xz.wdf"
	,jns_7= 0x71234D39
	,jns_8= 0x71234D39
	}
skill取技能["天狐之舞"]={
	jns_1 = "阵亡后进入天狐状态：恢复（20%*气血上限）的气血值，主动技能造成的伤害提升10%，回合结束阵亡。（天狐状态不会受到任何加成，与出其不意、信仰类技能互斥）只有觉醒涂山雪可以拥有此技能。\n#Y/——为祖先所庇佑。"
	,jns_3 = 7
	,jns_6 = "xz.wdf"
	,jns_7 = 0xAC9C0EC8
	,jns_8 = 0xAC9C0EC8
	}

skill取技能["雨露之泽"]={
	jns_1 = "天气为雨时，受到的伤害降低10%，造成的伤害提升20%。\n#P——雨露风雪均为恩泽。#S【司雨专属技能】"
	,jns_3 = 7
	,jns_6 = "xz.wdf"
	,jns_7 = 0x1AD60E33
	,jns_8 = 0x1AD60E33
			}
skill取技能["清风之华"]={
	jns_1 = "天气为风时，受到的伤害降低20%，造成的伤害提升10%。\n#P——清风雪雨均为恩泽。#S【司风专属技能】"
	,jns_3 = 7
	,jns_6 = "xz.wdf"
	,jns_7 = 0x55570E5A
	,jns_8 = 0x55570E5A
			}
skill取技能["映雪棱镜"]={
	jns_1 = "#S司雪携带时法术伤害额外提升17%。\n#Y天气为‘雪’时，地狱烈火、水漫金山、泰山压顶、奔雷咒以及对应超级技能将会额外增加一个目标。\n#P——雪雨清风均为恩泽。"
	,jns_3 = 7
	,jns_6 = "xz.wdf"
	,jns_7 = 0x57430E3C
	,jns_8 = 0x57430E3C
			}
skill取技能["风之沙盾"]={
	jns_1 = "入场后，获得风之障壁，在“风”天气受到的物理和法术伤害降低40%，持续6回合。#S【沙暴专属技能】\n#P——风扬，沙起。"
	,jns_3 = 7
	,jns_6 = "xz.wdf"
	,jns_7 = 0xE3B9E295
	,jns_8 = 0xE3B9E295
	,jns_66 = "“风”天气时受到的物理和法术伤害降低40%"
			}
skill取技能["节节高升"]={
	jns_1 = "每回合结束时造成的物理伤害提高10%,且有5%几率进入点燃装态。点燃状态:普通攻击将改为烟花绽放造成大量伤害。而后离场。(伤害与力量相关)"
	,jns_3 = 7
	,jns_6 = "xz.wdf"
	,jns_7 = 0xE3B9E295
	,jns_8 = 0xE3B9E295
			}

skill取技能["移花接木"]={
	jns_1 = "可以躲避暗器伤害，并按应受伤害的30%恢复HP"
	,jns_3 = 7
	,jns_6 = "wzife.wd1"
	,jns_7 = 0x5886F7D3
	,jns_8 = 0x5886F7D3
	}
skill取技能["无畏布施"]={
	jns_1 = "减少自身防御、法防并为目标增加防御、法防。"
	,jns_3 = 7
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 902068984
	,jns_8 = 3212547894
	}
skill取技能["势如破竹"]={
	jns_1 = "物理攻击时，保护的单位分担伤害减少30%"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 16777589
	,jns_8 = 16777589
	}
skill取技能["顾盼生姿"]={
	jns_1 = "每次使用主动技能，提升主人0.5等级的封印命中等级。(最多4层，在主人封印成功时清空)"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 16777586
	,jns_8 = 16777586
	}
skill取技能["拘魂索命"]={
	jns_1 = "使用法术或法术连击达到4次时，对气血百分比最低的数人额外释放1次法术(额外皮法术的伤害结果隆低20%)"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 16777585
	,jns_8 = 16777585
	}
skill取技能["气贯长虹"]={
	jns_1 = "触发连击/高级连击时，伤害提高25%/50%"
	,jns_3 = 7
	,jns_7 = 0xABAB0016
	,jns_8 = 0xABAB0016
	}
skill取技能["义薄云天"]={
	jns_1 = "施法时增加自身等级*0.55的法术伤害力；战斗中不会触发自动逃跑。"
	,jns_3 = 7
	,jns_7 = 0xABAB0017
	,jns_8 = 0xABAB0017
	}
skill取技能["与生俱来"]={
	jns_1 = "进入战斗时，自动获得自身血量*30%的护盾。"
	,jns_3 = 7
	,jns_7 = 0xABAB0018
	,jns_8 = 0xABAB0018
	}
skill取技能["幸运"]={
	jns_1 = "不会受到必杀攻击"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 3640080474
	,jns_8 = 1085801234
	}
	skill取技能["命中修炼"]={
		jns_1 = "增加人物命中"
		,jns_3 = 108
		,jns_6 = "org.rpk"
		,jns_7 = 16777620
		,jns_8 = 16777620
	}
	skill取技能["伤害修炼"]={
		jns_1 = "增加人物伤害"
		,jns_3 = 108
		,jns_6 = "org.rpk"
		,jns_7 = 16777620
		,jns_8 = 16777620
	}
	skill取技能["防御修炼"]={
		jns_1 = "增加人物防御"
		,jns_3 = 108
		,jns_6 = "org.rpk"
		,jns_7 = 16777620
		,jns_8 = 16777620
	}
	skill取技能["速度修炼"]={
		jns_1 = "增加人物速度"
		,jns_3 = 108
		,jns_6 = "org.rpk"
		,jns_7 = 16777620
		,jns_8 = 16777620
	}
	skill取技能["法伤修炼"]={
		jns_1 = "增加人物法伤"
		,jns_3 = 108
		,jns_6 = "org.rpk"
		,jns_7 = 16777620
		,jns_8 = 16777620
	}
	skill取技能["法防修炼"]={
		jns_1 = "增加人物法防"
		,jns_3 = 108
		,jns_6 = "org.rpk"
		,jns_7 = 16777620
		,jns_8 = 16777620
	}
	skill取技能["固伤修炼"]={
		jns_1 = "增加人物固伤"
		,jns_3 = 108
		,jns_6 = "org.rpk"
		,jns_7 = 16777620
		,jns_8 = 16777620
	}
skill取技能["高级幸运"]={
	jns_1 = "不会受到必杀攻击，并有5%几率躲避敌人的法术攻击"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 1781077356
	,jns_8 = 481753720
	}
skill取技能["神迹"]={
	jns_1 = "每回合结束时自动解除一切异常状态"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 1245429649
	,jns_8 = 1198707975
	}
skill取技能["高级神迹"]={
	jns_1 = "不受除日月乾坤外的所有异常状态影响"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 705701591
	,jns_8 = 4235295997
	}
skill取技能["永恒"]={
	jns_1 = "受到的辅助类法术效果持续回合加倍，如恢复气血、提升速度等"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 1988160424
	,jns_8 = 1508625069
	}
skill取技能["高级永恒"]={
	jns_1 = "受到的辅助类法术效果持续到战斗结束"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 4168001168
	,jns_8 = 3963828674
	}
skill取技能["高级招架"]={
	jns_1 = "20%的几率完全躲过敌人的物理攻击"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 450878763
	,jns_8 = 1018872745
	}
skill取技能["招架"]={
	jns_1 = "15%的几率完全躲过敌人的物理攻击"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 2387844026
	,jns_8 = 3512730332
	}
skill取技能["高级驱鬼"]={
	jns_1 = "对鬼魂类怪物的物理、法术伤害效果加倍，如果将鬼魂类怪物打死，对方将飞出场外而不能复活"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 72429538
	,jns_8 = 72429538
	}
skill取技能["驱鬼"]={
	jns_1 = "对鬼魂类怪物的物理、法术伤害效果增加50%，如果将鬼魂类怪物打死，对方将飞出场外而不能复活"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 416049958
	,jns_8 = 2077703648
	}
skill取技能["高级鬼魂术"]={
	jns_1 = "死亡5回合后自动复活，不受异常状态影响"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 2436724533
	,jns_8 = 3547941491
	}
skill取技能["鬼魂术"]={
	jns_1 = "死亡5回合后自动复活，不受异常状态影响，但也不能使用药品和食物恢复气血（可以食用包子）"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 813494718
	,jns_8 = 4276424619
	}
skill取技能["高级魔之心"]={
	jns_1 = "对敌人的法术伤害效果提高20%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 2586072698
	,jns_8 = 2875710379
	}
skill取技能["魔之心"]={
	jns_1 = "对敌人的法术伤害效果提高10%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 718604442
	,jns_8 = 2278038627
	}

skill取技能[" 飞行 "]={
	jns_1 = "飞行在非战斗状态下使用。使用后可骑乘飞行祥瑞翱翔空中。骑乘飞行祥瑞时有效，#G空中飞行移动速度与地面一致。"
	,jns_3 = 12
	,jns_6 = "common/wzife.wdf"
	,jns_7 = 2737069862
	,jns_8 = 1014997076
}

skill取技能["否定信仰"]={
	jns_1 = "不受异常、辅助效果影响，受到鬼魂类怪物攻击时伤害增加20%，不能同时拥有某些信仰类技能"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 3345212313
	,jns_8 = 3002471686
	}
skill取技能["高级否定信仰"]={
	jns_1 = "不受异常、辅助效果影响，受法术伤害减少20%，受到鬼魂类怪物攻击时伤害增加20%，不能同时拥有某些信仰类技能"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 484689261
	,jns_8 = 2449787202
	}
skill取技能["高级精神集中"]={
	jns_1 = "精神集中，可以抵御封类异常状态，躲避力提高10%，但物理攻击能力会降低20%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 3121640283
	,jns_8 = 3049938323
	}
skill取技能["高级敏捷"]={
	jns_1 = "提升自身速度的20%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 1248152147
	,jns_8 = 2061355872
	}
skill取技能["精神集中"]={
	jns_1 = "精神集中，可以抵御封类异常状态，但自己的物理攻击效果也会降低20%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 4141937856
	,jns_8 = 2799682055
	}
skill取技能["敏捷"]={
	jns_1 = "提高自身速度的10%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 3132756451
	,jns_8 = 4289478506
	}
skill取技能["高级雷属性吸收"]={
	jns_1 = "30%的几率免受雷属性法术伤害，并按应受伤害的大小恢复气血，吸收失败也可减少法术伤害的30%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 1654409054
	,jns_8 = 119787649
	}
skill取技能["雷属性吸收"]={
	jns_1 = "30%的几率免受雷属性法术伤害，并按应受伤害的大小恢复气血，吸收失败也可减少法术伤害的30%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 0xA71D860C
	,jns_8 = 0xA71D860C
	}
skill取技能["水属性吸收"]={
	jns_1 = "30%的几率免受水属性法术伤害，并按应受伤害的大小恢复气血，但受到火属性法术攻击时伤害会增加30%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 92545119
	,jns_8 = 1756512785
	}
skill取技能["高级火属性吸收"]={
	jns_1 = "30%的几率免受火属性法术伤害，并按应受伤害的大小恢复气血，吸收失败也可减少法术伤害的30%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 2898051336
	,jns_8 = 1343324785
	}
skill取技能["高级土属性吸收"]={
	jns_1 = "30%的几率免受土属性法术伤害，并按应受伤害的大小恢复气血，吸收失败也可减少法术伤害的30%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 2639364118
	,jns_8 = 751839372
	}
skill取技能["火属性吸收"]={
	jns_1 = "30%的几率免受火属性法术伤害，并按应受伤害的大小恢复气血，但受到火属性法术攻击时伤害会增加30%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 4098020456
	,jns_8 = 4092454521
	}
skill取技能["独行"]={
	jns_1 = "抵抗封印的能力提高25%"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 16777571
	,jns_8 = 16777571
	}
skill取技能["进击必杀"]={
	jns_1 = "第2回合及以后进入战斗时，提升15%的必杀几率持续5回合，且遂回合减少20%效果。"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 16777572
	,jns_8 = 16777572
	}
skill取技能["进击法暴"]={
	jns_1 = "第2回合及以后进入战斗时，提升10%6的法术暴击几率持续5回合，且逐回合臧少20%效果。"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 16777573
	,jns_8 = 16777573
	}
skill取技能["遗志"]={
	jns_1 = "替代原召唤兽进入战斗时获得“遗志：造成伤害提升10%；井获得原召唤的“遗志”。最多两层"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 16777574
	,jns_8 = 16777574
	}
skill取技能["高级独行"]={
	jns_1 = "抵抗封印的能力提高50%"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 16777575
	,jns_8 = 16777575
	}
skill取技能["高级进击必杀"]={
	jns_1 = "第2回合及以后进入战斗时，提升30%的必杀几率持续5回合，且遂回合减少20%效果。"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 16777577
	,jns_8 = 16777577
	}
skill取技能["高级进击法暴"]={
	jns_1 = "第2回合及以后进入战斗时，提升20%的法术暴击几率持续5回合，且逐回合臧少20%效果。"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 16777576
	,jns_8 = 16777576
	}
skill取技能["高级遗志"]={
	jns_1 = "替代原召唤兽进入战斗时获得“遗志：造成伤害提升20%；井获得原召唤的“遗志”。最多两层"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 16777584
	,jns_8 = 16777584
	}
skill取技能["高级水属性吸收"]={
	jns_1 = "30%的几率免受水属性法术伤害，并按应受伤害的大小恢复气血，吸收失败也可减少法术伤害的30%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 2532360260
	,jns_8 = 1312179231
	}
skill取技能["土属性吸收"]={
	jns_1 = "30%的几率免受土属性法术伤害，并按应受伤害的大小恢复气血，但受到雷属性法术攻击时伤害会增加30%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 134325226
	,jns_8 = 3503123353
	}
skill取技能["法术连击"]={
	jns_1 = "使用法术攻击目标时会有20%几率出现连续2次攻击敌人"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 2200246844
	,jns_8 = 345682085
	}
skill取技能["高级法术连击"]={
	jns_1 = "使用法术攻击目标时会有30%几率出现连续2次攻击敌人"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 3484714916
	,jns_8 = 1890987017
	}
skill取技能["高级神佑复生"]={
	jns_1 = "战斗死亡时有30%的几率复活为正常状态，如果同时拥有鬼魂术（普通或高级），神佑复生的效果将取消。"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 2040400078
	,jns_8 = 3049938323
	}
skill取技能["高级神佑复生"]={
		jns_1 = "战斗死亡时有30%的几率复活为正常状态，如果同时拥有鬼魂术（普通或高级），神佑复生的效果将取消。"
		,jns_3 = 7
		,jns_6 = "wzife.wdf"
		,jns_7 = 2040400078
		,jns_8 = 3049938323
		}
skill取技能["神佑复生"]={
	jns_1 = "战斗死亡时有15%的几率复活为正常状态，如果同时拥有鬼魂术（普通或高级），神佑复生的效果将取消。"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 1409514751
	,jns_8 = 2943632069
	}
skill取技能["偷袭"]={
	jns_1 = "身手灵敏，不会受到反击和反震。攻击效果增加5%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 3049408565
	,jns_8 = 205675459
	}
skill取技能["高级偷袭"]={
	jns_1 = "身手灵敏，不会受到反击和反震，物理攻击效果提高10%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 4012815828
	,jns_8 = 1555617599
	}
skill取技能["法术暴击"]={
	jns_1 = "使用法术攻击目标时会有10%几率使法术伤害值加倍"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 1389982585
	,jns_8 = 1108386617
	}
skill取技能["高级法术暴击"]={
	jns_1 = "使用法术攻击目标时会有15%几率使法术伤害值加倍"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 2071863113
	,jns_8 = 1628140681
	}
skill取技能["高级法术波动"]={
	jns_1 = "使用法术攻击目标时伤害在原有伤害值基础上会有较大幅度的上下波动(50%-150%)"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 2322584044
	,jns_8 = 3668919080
	}
skill取技能["法术波动"]={
	jns_1 = "使用法术攻击目标时伤害在原有伤害值基础上会有大幅度的波动(80%-120%)"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 762242741
	,jns_8 = 267613400
	}
skill取技能["弱点雷"]={
	jns_1 = "弱点为雷，受到雷属性法术攻击时伤害增加50%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 2886112942
	,jns_8 = 2605672758
	}
skill取技能["弱点火"]={
	jns_1 = "弱点为火，受到火属性法术攻击时伤害增加50%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 1546100078
	,jns_8 = 4005696838
	}
skill取技能["弱点水"]={
	jns_1 = "弱点为水，受到水属性法术攻击时伤害增加50%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 803997825
	,jns_8 = 1114088245
	}
skill取技能["弱点土"]={
	jns_1 = "弱点为土，受到土属性法术攻击时伤害增加50%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 2234852568
	,jns_8 = 910396241
	}
skill取技能["须弥真言"]={
	jns_1 = "增加魔力值*0.4的法术伤害力"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 1270009188
	,jns_8 = 1363359340
	}
skill取技能["超级三昧真火"]={
	jns_1 = "对敌方单个目标造成法术伤害。"
	,jns_3 = 4
	,jns_6 = "wzife.wdf"
	,jns_7 = 0xB0000038
	,jns_8 = 0xB0000038
	}
skill取技能["桀骜自恃"]={
	jns_1 = "法术暴击率提高50%，且不会逃跑。"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 0xB0000039
	,jns_8 = 0xB0000039
	}
skill取技能["圣婴大王"]={
	jns_1 = "增加法力*0.5的法术伤害力"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 0xB0000040
	,jns_8 = 0xB0000040
	}
skill取技能["毒"]={
	jns_1 = "物理攻击时有15%的几率使敌人中毒，中毒后每回合减少10%的气血和5%的魔法"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 142259178
	,jns_8 = 3804526840
	}
skill取技能["高级毒"]={
	jns_1 = "自身对毒免疫，物理攻击时有20%的几率使敌人中毒，中毒后每回合减少10%的气血和5%的魔法"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 589320553
	,jns_8 = 1086230366
	}
skill取技能["高级防御"]={
	jns_1 = "增加(自身等级×0.8)的防御，但法术伤害能力会降低10%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 1616189465
	,jns_8 = 3783015310
	}
skill取技能["防御"]={
	jns_1 = "增加(自身等级×0.6)的防御，但法术伤害能力会降低10%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 91393867
	,jns_8 = 4101692183
	}
skill取技能["高级强力"]={
	jns_1 = "增加(自身等级×0.715)的攻击，如果对方有防御或高级防御技能，伤害结果会减少20%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 3563500497
	,jns_8 = 2177485118
	}
skill取技能["强力"]={
	jns_1 = "增加(自身等级×0.4)的攻击，如果对方有防御或高级防御技能，伤害结果会减少20%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 1458903425
	,jns_8 = 707555275
	}
skill取技能["高级吸血"]={
	jns_1 = "物理攻击时，吸取对方所掉气血的30%，攻击鬼魂类怪物时无效"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 1364867245
	,jns_8 = 2545117654
	}
skill取技能["吸血"]={
	jns_1 = "物理攻击时，吸取对方所掉气血的25%, 如果对方有异常状态，吸血后会中毒，攻击鬼魂类怪物时无效"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 668285297
	,jns_8 = 156592686
	}
skill取技能["迟钝"]={
	jns_1 = "天生行动缓慢，速度效果会降低20%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 2619272788
	,jns_8 = 274661895
	}
skill取技能["狂怒"]={
	jns_1 = "发动神功,以狂怒之势震慑诸敌,对其造成高额伤害。\n获得与当前变身相同回合的狂怒；造成的物理伤害提高。"
	,jns_3 = 4
	,jns_4 = "30点魔法"
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0x6E34D2AA
	,jns_8 = 0x6E34D2AA
	}
skill取技能["无敌牛妖"]={
	jns_1 = "召唤使用法术的牛妖前来协助战斗"
	,jns_3 = 5
	,jns_4 = "40点魔法"
	,jns_5 = "牛虱阵技能达到25级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 526953932
	,jns_8 = 2771934779
	}
skill取技能["无敌牛虱"]={
	jns_1 = "召唤牛妖前来协助战斗"
	,jns_3 = 5
	,jns_4 = "40点魔法"
	,jns_5 = "牛虱阵技能达到25级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3889342201
	,jns_8 = 901977927
	}
skill取技能["千里神行"]={
	jns_1 = "平时状态下使用，可以瞬间回到自己的门派"
	,jns_3 = 0
	,jns_4 = "消耗10点气血和10点魔法"
	,jns_5 = "疾风步技能达到1级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 13494159
	,jns_8 = 1717996623
	}
skill取技能["乙木仙遁"]={
	jns_1 = "平时状态下使用，可以瞬间回到自己的门派"
	,jns_3 = 0
	,jns_4 = "10点气血和10点魔法"
	,jns_5 = "斜月步技能达到1级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 71432172
	,jns_8 = 436091648
	}
skill取技能["腾云驾雾"]={
	jns_1 = "平时状态下使用，可以瞬间回到自己的门派"
	,jns_3 = 0
	,jns_4 = "10点气血和10点魔法"
	,jns_5 = "云霄步技能达到1级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1924869232
	,jns_8 = 906709372
	}
skill取技能["佛门普渡"]={
	jns_1 = "平时状态下使用，可以瞬间回到自己的门派"
	,jns_3 = 0
	,jns_4 = "10点气血和10点魔法"
	,jns_5 = "渡世步技能达到1级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2996697873
	,jns_8 = 3423122163
	}
skill取技能["水遁"]={
	jns_1 = "平时或战斗中使用，可以瞬间回到自己的门派"
	,jns_3 = 0
	,jns_4 = "战斗时消耗当前所有魔法，非战斗时消耗10点气血、魔法"
	,jns_5 = "游龙术技能达到1级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 596614171
	,jns_8 = 2671300567
	}
skill取技能["杳无音讯"]={
	jns_1 = "平时状态下使用，可以瞬间回到自己的门派。"
	,jns_3 = 0
	,jns_4 = "10点气血和10点魔法"
	,jns_5 = "无常步技能达到1级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2049632078
	,jns_8 = 739072521
	}
skill取技能["坐莲"]={
	jns_1 = "平时状态下使用，可以瞬间回到自己的门派"
	,jns_3 = 0
	,jns_4 = "10点气血和10魔法"
	,jns_5 = "莲花宝座技能达到1级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2462764859
	,jns_8 = 3850121742
	}
skill取技能["振翅千里"]={
	jns_1 = "平时状态下使用，可以瞬间回到自己的门派"
	,jns_3 = 0
	,jns_4 = "10点气血和10点魔法"
	,jns_5 = "大鹏展翅技能达到1级 "
	,jns_6 = "wzife.wdf"
	,jns_7 = 3512079122
	,jns_8 = 4160807473
	}
skill取技能["牛屎遁"]={
	jns_1 = "平时状态下使用，可以瞬间回到自己的门派"
	,jns_3 = 0
	,jns_4 = "10点气血和10点魔法"
	,jns_5 = "裂石步技能达到1级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2481624731
	,jns_8 = 668274006
	}
skill取技能["天蚕丝"]={
	jns_1 = "平时状态下使用，可以瞬间回到自己的门派"
	,jns_3 = 0
	,jns_4 = "10点气血和10点魔法"
	,jns_5 = "移形换影技能达到1级 "
	,jns_6 = "wzife.wdf"
	,jns_7 = 1283246148
	,jns_8 = 1806917376
	}
skill取技能["遁地术"]={
	jns_1 = "平时状态下使用，可以瞬间回到自己的门派。"
	,jns_3 = 0
	,jns_4 = "10点气血和10点魔法"
	,jns_5 = "“秘影迷踪”技能达到1级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 0x1D14968A
	,jns_8 = 0x34D061C7
	}
skill取技能["移形换影"]={
	jns_1 = "平时状态下使用，可以瞬间回到自己的门派"
	,jns_3 = 0
	,jns_4 = "10点气血和10点魔法"
	,jns_5 = "清歌妙舞技能达到1级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2099222596
	,jns_8 = 1436233235
	}
skill取技能["斗转星移"]={
	jns_1 = "平时状态下使用，可以瞬间回到自己的门派"
	,jns_3 = 0
	,jns_4 = "10点气血和10点魔法"
	,jns_5 = "七星遁技能达到1级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2019188530
	,jns_8 = 655674701
	}
skill取技能["嗜血"]={
	jns_1 = "平时状态下使用，为项链附加提升体质的临时效果"
	,jns_3 = 12
	,jns_4 = "和技能等级数相同的活力"
	,jns_5 = "文韬武略技能达到35级 "
	,jns_6 = "wzife.wdf"
	,jns_7 = 2341356120
	,jns_8 = 831906636
	}
skill取技能["龙附"]={
	jns_1 = "打造后为武器提高一定的属性"
	,jns_3 = 12
	,jns_4 = "和技能等级数相同的活力"
	,jns_5 = "龙附技能达到35级，人物等级达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2888970157
	,jns_8 = 1784954158
	}
skill取技能["拈花妙指"]={
	jns_1 = "为鞋子附加提升速度的临时效果"
	,jns_3 = 12
	,jns_4 = "和技能等级数相同的活力"
	,jns_5 = "佛光普照技能达到35级 "
	,jns_6 = "wzife.wdf"
	,jns_7 = 177955034
	,jns_8 = 2841407500
	}
skill取技能["轻如鸿毛"]={
	jns_1 = "打造后为武器提高一定的属性"
	,jns_3 = 12
	,jns_4 = "和技能等级数相同的活力"
	,jns_5 = "香飘兰麝技能达到35级，人物等级达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 33492847
	,jns_8 = 367093981
	}
skill取技能["浩然正气"]={
	jns_1 = "为衣服附加提升法术防御的临时效果"
	,jns_3 = 12
	,jns_4 = "和技能等级数相同的活力"
	,jns_5 = "天罡气技能达到35级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3449922467
	,jns_8 = 567769462
	}
skill取技能["一气化三清"]={
	jns_1 = "为衣服附加提升魔力的临时效果"
	,jns_3 = 12
	,jns_4 = "和技能等级数相同的活力"
	,jns_5 = "修仙术技能达到35级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 4257500096
	,jns_8 = 2501870432
	}
skill取技能["莲华妙法"]={
	jns_1 = "为项链附加提升法术伤害的临时效果"
	,jns_3 = 12
	,jns_4 = "和技能等级数相同的活力"
	,jns_5 = "金刚经技能达到35级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 4050867699
	,jns_8 = 2277699794
	}
skill取技能["尸气漫天"]={
	jns_1 = "为帽子附加提升耐力的临时效果"
	,jns_3 = 12
	,jns_4 = "和技能等级数相同的活力"
	,jns_5 = "拘魂诀技能达到35级 "
	,jns_6 = "wzife.wdf"
	,jns_7 = 3830562709
	,jns_8 = 3540479557
	}
skill取技能["盘丝舞"]={
	jns_1 = "暂时提高武器的防御效果"
	,jns_3 = 12
	,jns_4 = "和技能等级数相同的活力"
	,jns_5 = "蛛丝阵法技能达到35级，人物等级达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 2082714040
	,jns_8 = 382164728
	}
skill取技能["神兵护法"]={
	jns_1 = "打造后为帽子提高一定的属性"
	,jns_3 = 12
	,jns_4 = "和技能等级数相同的活力"
	,jns_5 = "神道无念技能达到35级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1217133207
	,jns_8 = 3100160960
	}
skill取技能["魔王护持"]={
	jns_1 = "暂时附加武器提高HP上限的效果"
	,jns_3 = 12
	,jns_4 = "和技能等级数相同的活力"
	,jns_5 = "牛逼神功技能达到35级，人物等级达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 937481251
	,jns_8 = 3778438121
	}
skill取技能["神力无穷"]={
	jns_1 = "打造后为腰带提高一定的属性"
	,jns_3 = 12
	,jns_4 = "和技能等级数相同的活力"
	,jns_5 = "狂兽诀技能达到35级 "
	,jns_6 = "wzife.wdf"
	,jns_7 = 3809438015
	,jns_8 = 3884615585
	}
skill取技能["堪察令"]={
	jns_1 = "鉴定头盔、饰品、腰带、靴子等类装备，学习后也可在长安书店制作相应等级的“灵宝图鉴”。"
	,jns_3 = 12
	,jns_4 = "一定的活力，视装备等级而定"
	,jns_5 = "灵通术技能达到5级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 4073909039
	,jns_8 = 2150653771
	}
skill取技能["飞行符"]={
	jns_1 = "制作一张飞行符"
	,jns_3 = 0
	,jns_4 = "消耗50点金钱，20点魔法"
	,jns_5 = "符之术技能达到21级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1788221468
	,jns_8 = 1798664293
	}
skill取技能["兵器谱"]={
	jns_1 = "能够鉴定武器和铠甲，学习后也可在长安书店制作相应等级的“神兵图鉴”"
	,jns_3 = 12
	,jns_4 = "一定的活力，视装备等级而定"
	,jns_5 = "神兵鉴赏技能等级达到5级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1814276494
	,jns_8 = 4262913816
	}
skill取技能["裁缝技巧"]={
	jns_1 = "从天衣无缝针法演化而来，可提高缝制头盔和铠甲的能力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 1071853506
	,jns_8 = 1758794729
	}
skill取技能["暗器技巧"]={
	jns_1 = "暗器名家的家传秘笈，学习后可以提高自身使用暗器的伤害力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 2101102727
	,jns_8 = 1473796032
	}
skill取技能["冥想"]={
	jns_1 = "通过冥想凝聚强大的精神力量，学习可以提高自身一定的魔法上限"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 97139368
	,jns_8 = 903007607
	}
skill取技能["强身术"]={
	jns_1 = "强身健体是习武之人的根本，学习后可以提高自身一定的气血上限"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3597995533
	,jns_8 = 732966867
	}
skill取技能["强壮"]={
	jns_1 = "强身健体是习武之人的根本，学习后可以提高自身一定的基础气血上限"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 2458245611
	,jns_8 = 1870892091
	}
skill取技能["神速"]={
	jns_1 = "持之以恒的锻炼能够使身体更加灵巧机敏,学习后可提升自身一定的速度。"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 0x476cfc92
	,jns_8 = 0x6C81040C
}
skill取技能["打造技巧"]={
	jns_1 = "铸造名家欧冶子传下的技能，可以提高打造武器的能力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3866239213
	,jns_8 = 1635206107
	}
skill取技能["追捕技巧"]={
	jns_1 = "可以降低对手逃跑的成功率，但最低不小于10%"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 123566127
	,jns_8 = 902425300
	}
skill取技能["逃离技巧"]={
	jns_1 = "学习后可以提高战斗逃跑的成功率，但最高不超过90%"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 1198324882
	,jns_8 = 1820394508
	}
skill取技能["烹饪技巧"]={
	jns_1 = "传自商代名厨伊尹的技能，可以提高制作食物的能力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 2019196942
	,jns_8 = 3782401606
	}
skill取技能["中药医理"]={
	jns_1 = "精通歧黄之术往往可以提高炼制丹药的能力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3878607199
	,jns_8 = 642378453
	}
skill取技能["炼金术"]={
	jns_1 = "秘术士私传的炼金之术，可以提高制作饰品、靴子和腰带的能力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 1324974820
	,jns_8 = 333902768
	}
skill取技能["淬灵之术"]={
	jns_1 = "上古秘术，可以提高灵饰淬灵得能力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 0X75D782F
	,jns_8 = 0X75D782F
	}
skill取技能["养生之道"]={
	jns_1 = "修身养性，固本清元之术，学习可以增加活力上限"
	,jns_3 = 80
	,jns_6 = "wzife.wdf"
	,jns_7 = 968832765
	,jns_8 = 1635371623
	}
skill取技能["熔炼技巧"]={
	jns_1 = "异邦传入中土的锻造技巧，利用独特方法锻造而出的钨金，具有提升装备能力的特性。"
	,jns_3 = 8
	,jns_6 = "wzife.wd1"
	,jns_7 = 0x2e8a8a30
	,jns_8 = 0x2e8a8a30
	}
skill取技能["灵石技巧"]={
	jns_1 = "可在百炼精铁和天眼珠中提炼出精魄灵石，并且能将同类的精魄灵石进行合成、镶嵌"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 208669879
	,jns_8 = 208669879
	}
skill取技能["健身术"]={
	jns_1 = "由华佗所创的五禽戏发展而来，学习可以增加体力上限"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3589295296
	,jns_8 = 3157390677
	}
skill取技能["巧匠之术"]={
	jns_1 = "关于家具制作的技能，懂得一定的巧匠之术后，可以去找住在长寿村的工匠鲁成，制作各种家具的“设计图”"
	,jns_3 = 4
	,jns_6 = "wzife.wdf"
	,jns_7 = 1296624794
	,jns_8 = 732966867
	}
skill取技能["熔炼之术"]={
	jns_1 = "异帮传入中土的锻造技巧，利用独特的方法锻造而出的钨金，具有提升装备能力的特性。可产出钨金，等级越高，产出的钨金等级也越高。"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 1296624794
	,jns_8 = 732966867
	}
--新召唤兽技能
skill取技能["苍鸾怒击"]={
	jns_1 = "普通物理攻击发生必杀或连击时，临时提升10%伤害力随机攻击另一个目标，每回合最多触发一次。"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 3329378845
	,jns_8 = 3329378845
	}
skill取技能["从天而降"]={
	jns_1 = "超级神鸡专属技能，大大提高攻击时造成的伤害，但攻击时有一定几率腾空失败。"
	,jns_3 = 7
	,jns_6 = "wzife.wd5"
	,jns_7 = 2147444152
	,jns_8 = 3054593425
	}
skill取技能["大快朵颐"]={
	jns_1 = "超级神猴专属技能，出手前有一定几率触发，大大提升几率性技能（连击、必杀）的触发几率。"
	,jns_3 = 7
	,jns_6 = "wzife.wd5"
	,jns_7 = 0x4E3C17E0
	,jns_8 = 0x4E3C17E0
	}
skill取技能["千钧一怒"]={
	jns_1 = "超级神羊专属技能，普通物理攻击造成的伤害≧目标气血伤害*10%时，使自己的主人获得10点愤怒。"
	,jns_3 = 7
	,jns_6 = "wzife.wd5"
	,jns_7 = 4278299017
	,jns_8 = 2059039626
	}
skill取技能["浮云神马"]={
	jns_1 = "超级神马专属技能，在场时，提高自己及主人10%的速度，最多持续5回合。"
	,jns_3 = 7
	,jns_6 = "wzife.wd5"
	,jns_7 = 3844768104
	,jns_8 = 3844768104
	}
skill取技能["八凶法阵"]={
	jns_1 = "超级赤焰兽专属技能，发动法术攻击4个敌人。"
	,jns_3 = 4
	,jns_4 = "作用目标*30点魔法"
	,jns_6 = "wzife.wd1"
	,jns_7 = 1839332868
	,jns_8 = 4060690016
	}
skill取技能["叱咤风云"]={
	jns_1 = "水系法术攻击3个目标，并提高法术连击的概率。"
	,jns_3 = 4
	,jns_4 = "100点魔法"
	,jns_6 = "wzife.wd1"
	,jns_7 = 0xFE734991
	,jns_8 = 0xFE734992
	}
skill取技能["净台妙谛"]={ --1
	jns_1 = "增加自身体质*成长*2的气血。"
	,jns_3 = 7
	,jns_6 = "wzife.wd1"
	,jns_7 = 16777605
	,jns_8 = 16777605
	}
skill取技能["法术防御"]={
	jns_1 = "极强的法术防御技能。可以防御法术攻击，减少65%的法术伤害，但无法防御物理攻击。"
	,jns_3 = 5
	,jns_4 = "100点魔法"
	,jns_6 = "wzife.wd1"
	,jns_7 = 893630828
	,jns_8 = 622006923
	}
skill取技能["理直气壮"]={ --1
	jns_1 = "普通攻击时，40%的几率攻击3次；但物理伤害效果降低20%。"
	,jns_3 = 7
	,jns_6 = "wzife.wd1"
	,jns_7 = 16777604
	,jns_8 = 16777604
	}
skill取技能["天降灵葫"]={
	jns_1 = "群体法术攻击，随机攻击1~5个目标，最多5人。"
	,jns_3 = 4
	,jns_4 = "100点魔法"
	,jns_6 = "wzife.wd1"
	,jns_7 = 1540076105
	,jns_8 = 1540076105
	}
skill取技能["灵能激发"]={ --1
	jns_1 = "进入战斗后，提高自己的法术伤害能力。（魔力点数越高效果越好，持续到战斗结束）"
	,jns_3 = 7
	,jns_6 = "wzife.wd1"
	,jns_7 = 1074787883
	,jns_8 = 230274660
	}
skill取技能["高级法术抵抗"]={ --1
	jns_1 = "减少10%所受的法术伤害，但同时物理伤害能力减少10%。"
	,jns_3 = 7
	,jns_6 = "wzife.wd1"
	,jns_7 = 3908900845
	,jns_8 = 3908900845
	}
skill取技能["灵山禅语"]={
	jns_1 = "增加自身魔力*成长的法术防御，但是魔力不再增加法术伤害力，增加的魔法减少一半" --1
	,jns_3 = 7
	,jns_6 = "wzife.wd1"
	,jns_7 = 3754689251
	,jns_8 = 2265863757
	}
skill取技能["嗜血追击"]={
	jns_1 = "使用物理攻击击倒目标时，会继续攻击另一个目标一次。此效果每回合只会触发一次"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 3287596045
	,jns_8 = 3287596045
	}
skill取技能["观照万象"]={
	jns_1 = "使用所有的主动技能进攻目标！"
	,jns_3 = 4
	,jns_6 = "wzife.wdf"
	,jns_7 = 16777591
	,jns_8 = 16777591
	}
skill取技能["盾气"]={
	jns_1 = "进入战斗后，临时提高其等级*1.2的防御能力（持续6回合）"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 78907828
	,jns_8 = 78907828
	}
skill取技能["高级盾气"]={
	jns_1 = "进入战斗后，则提高其等级*1.5的防御能力（持续6回合）"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 2395092917
	,jns_8 = 2395092917
	}
skill取技能["合纵"]={
	jns_1 = "本方每有一种与其不同的召唤兽，则提高其等级#W//5.5的物理伤害结果。同时，灵降低10%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 2840432618
	,jns_8 = 2840432618
	}
skill取技能["高级合纵"]={
	jns_1 = "本方每有一种与其不同的召唤兽，则提高其等级#W//4的物理伤害结果。同时，灵力降低10%"
	,jns_3 = 7
	,jns_6 = "wzife.wdf"
	,jns_7 = 1319969279
	,jns_8 = 1319969279
	}
skill取技能["月光"]={
	jns_1 = "召唤数道月光攻击敌人，同一个人可以被多道月光攻击。"
	,jns_3 = 4
	,jns_4 = "100点魔法"
	,jns_6 = "wzife.wdf"
	,jns_7 = 3408104702
	,jns_8 = 79680974
	}
skill取技能["出其不意"]={
	jns_1 = "使用本回合己方召唤兽未使用过的技能时，造成的伤害结果提升15%"
	,jns_3 = 7
	,jns_6 = "other.wdf"
	,jns_7 = 16777590
	,jns_8 = 16777590
	}
skill取技能["欣欣向荣"]={
	jns_1 = "提升最大生命值百分之40五行为木时生效"
	,jns_3 = 7
	,jns_6 = "goods.wdf"
	,jns_7 = 16778023
	,jns_8 = 16778023
	}
skill取技能["食指大动" ]={
	jns_1 = "召唤随机种类的水果攻击敌人。不同的水果味道不一，效果自然各具特色。"
	,jns_3 = 4
	,jns_6 = "org.rpk"
	,jns_7 = 16777608
	,jns_8 = 16777608
	}
skill取技能["无赦魔决"]={
	jns_1 = "攻击对方单位携带高级神佑复生或神佑复生时 增加百分之十伤害"
	,jns_3 = 7
	,jns_6 = "goods.wdf"
	,jns_7 = 0xAA000002
	,jns_8 = 0xAA000002
	}
skill取技能["花好月圆"]={
	jns_1 = "每回合结束时有百分之25的几率回复自身等级x8的气血"
	,jns_3 = 7
	,jns_6 = "goods.wdf"
	,jns_7 = 16778022
	,jns_8 = 16778022
	}

skill取技能["乘胜追击"]={
	jns_1 = "普通攻击或者连击触发四次时，额外增加两次攻击次数"
	,jns_3 = 7
	,jns_6 = "goods.wdf"
	,jns_7 = 16777588
	,jns_8 = 16777588
	}
skill取技能["凭风借力"]={
	jns_1 = "每次物理攻击提升必杀时百分之12的物理伤害结果，最多四层触发必杀时清空"
	,jns_3 = 7
	,jns_6 = "goods.wdf"
	,jns_7 = 16777587
	,jns_8 = 16777587
	}
skill取技能["津津有味"]={
	jns_1 = "每回合吃掉主人一个包子，提升暴击几率，与暴击伤害"
	,jns_3 = 7
	,jns_6 = "goods.wdf"
	,jns_7 = 16777606
	,jns_8 = 16777606
	}
skill取技能["凝光炼彩"]={
	jns_1 = "受伤时有百分之25的概率获得护盾。护盾值减少所受的百分之50的伤害"
	,jns_3 = 7
	,jns_6 = "goods.wdf"
	,jns_7 = 16777602
	,jns_8 = 16777602
	}
skill取技能["流沙轻音"]={
	jns_1 = "法术攻击时有几率造成1~5个单位的伤害  最少2单位 最高五单位"
	,jns_3 = 4
	,jns_6 = "goods.wdf"
	,jns_7 = 16777601
	,jns_8 = 16777601
	}
skill取技能["昼伏夜出"]={
	jns_1 = "夜间物理伤害效果不会减少，并提高百分之十，躲避增加百分之十"
	,jns_3 = 7
	,jns_6 = "goods.wdf"
	,jns_7 = 16777600
	,jns_8 = 16777600
	}
skill取技能["神出鬼没"]={
	jns_1 = "进入战斗后获得隐身状态2~3回合，隐身状态下伤害效果提升百分之十，躲避增加百分之十"
	,jns_3 = 7
	,jns_6 = "goods.wdf"
	,jns_7 = 16777593
	,jns_8 = 16777593
	}
skill取技能["溜之大吉"]={
	jns_1 = "自身速度提高20%，躲避率增加10%。"
	,jns_3 = 7
	,jns_6 = "goods.wdf"
	,jns_7 = 16777592
	,jns_8 = 16777592
	}
skill取技能["神来气旺"]={
	jns_1 = "使用地狱烈火时 初始目标伤害提升。作用：目标数每回合有百分之50几率地狱烈火多加一个单位"
	,jns_3 = 7
	,jns_6 = "goods.wdf"
	,jns_7 = 0xA94D8F12
	,jns_8 = 0xA94D8F12
	}
skill取技能["风起龙游"]={
	jns_1 = "攻击速度低于自身的目标，提升10%的伤害效果。"
	,jns_3 = 7
	,jns_6 = "goods.wdf"
	,jns_7 = 0x1000323
	,jns_8 = 0x1000323
	}
skill取技能["扶摇万里"]={
	jns_1 = "法术攻击多个目标 按照等级 15+1 最高秒10个单位"
	,jns_3 = 4
	,jns_6 = "goods.wdf"
	,jns_7 = 16778053
	,jns_8 = 16778054
	}
skill取技能["水击三千"]={
	jns_1 = "临时提升物理伤害结果和暴击倍率进行一次攻击"
	,jns_3 = 4
	,jns_6 = "goods.wdf"
	,jns_7 = 16778055
	,jns_8 = 16778056
	}
skill取技能["逍遥游"]={
	-- jns_1 = "提升百分之20速度 每回合受到的物法伤害降低百分之20"
	jns_1 = "提升自身20%速度，每回合首次受到的物法伤害降低20%，受到的物理和法术伤害暴击倍率降低50%\n第二回合后进场时，对血量百分比最低的单位释放水击三千/扶摇万里，若场上无其他超级鲲鹏，则出场伤害提升150%"
	,jns_3 = 7
	,jns_6 = "goods.wdf"
	,jns_7 = 16778057
	,jns_8 = 16778064
	}
skill取技能["北冥之渊"]={
	jns_1 = "超级鲲鹏的专属技能“北冥之渊”能够将全队所有宝宝的攻击五行变成水,同时提升所有水属性宝宝的伤害30%。持续1回合"
	,jns_3 = 5
	,jns_6 = "goods.wdf"
	,jns_7 = 16778051
	,jns_8 = 16778052
	}
--门派前置技能
skill取技能["神兵鉴赏"]={
	jns_1 = "无效果"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 743065692
	,jns_8 = 4243999668
	}
skill取技能["龙附术"]={
	jns_1 = "无效果"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3715378746
	,jns_8 = 3758617445
	}
skill取技能["灵性"]={
	jns_1 = "按技能等级提高灵力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3949490866
	,jns_8 = 3143201775
	}
skill取技能["金刚伏魔"]={
	jns_1 = "按技能等级提高伤害力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 2566898861
	,jns_8 = 3862994147
	}
skill取技能["混天术"]={
	jns_1 = "无效果"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3643496130
	,jns_8 = 481805567
	}
skill取技能["龙腾术"]={
	jns_1 = "无效果"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3471484278
	,jns_8 = 2151837087
	}
skill取技能["闭月羞花"]={
	jns_1 = "无效果"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3321056507
	,jns_8 = 4213596062
	}
skill取技能["乾坤塔"]={
	jns_1 = "按技能等级提高防御力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 646614501
	,jns_8 = 3014813769
	}
skill取技能["灵通术"]={
	jns_1 = "无效果"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 695584869
	,jns_8 = 577240546
	}
skill取技能["迷情大法"]={
	jns_1 = "无效果"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 2410267095
	,jns_8 = 3102396352
	}
skill取技能["周易学"]={
	jns_1 = "按技能等级提高魔法上限"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 951717916
	,jns_8 = 3182787390
	}
skill取技能["五行学说"]={
	jns_1 = "无效果"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3646722626
	,jns_8 = 733606302
	}
skill取技能["诵经"]={
	jns_1 = "佛家弟子大量的诵读经书，经书读多了，见了万事万物都想度化，不免会有些罗里罗嗦、唠里唠叨的。"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 1921499236
	,jns_8 = 3515981629
	}
skill取技能["六道轮回"]={
	jns_1 = "按技能等级提高伤害力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 2191025103
	,jns_8 = 1761343362
	}
skill取技能["九幽阴魂"]={
	jns_1 = "按技能等级提高灵力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 2427286393
	,jns_8 = 2803361004
	}
skill取技能["傲世诀"]={
	jns_1 = "无效果"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3001127144
	,jns_8 = 1049195070
	}
skill取技能["生死搏"]={
	jns_1 = "按技能等级提高伤害力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3136073986
	,jns_8 = 1362791032
	}
skill取技能["阴阳二气诀"]={
	jns_1 = "无效果"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 683331190
	,jns_8 = 4236173132
	}
skill取技能["佛光普照"]={
	jns_1 = "无效果"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3599571341
	,jns_8 = 921854792
	}
skill取技能["呼风唤雨"]={
	jns_1 = "无效果"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 438165716
	,jns_8 = 1919875705
	}
skill取技能["倾国倾城"]={
	jns_1 = "无效果"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 594113044
	,jns_8 = 3862994147
	}
skill取技能["游龙术"]={
	jns_1 = "按技能等级提高躲避力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 1730135660
	,jns_8 = 316450658
	}
skill取技能["潇湘仙雨"]={
	jns_1 = "按技能等级提高伤害力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3541032788
	,jns_8 = 2723035390
	}
skill取技能["歧黄之术"]={
	jns_1 = "无效果"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 2055755507
	,jns_8 = 93243227
	}
skill取技能["训兽诀"]={
	jns_1 = "按技能等级提高灵力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 1184160039
	,jns_8 = 3128610907
	}
skill取技能["裂石步"]={
	jns_1 = "按技能等级提高躲避"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 4286232830
	,jns_8 = 3339537828
	}
skill取技能["香飘兰麝"]={
	jns_1 = "按技能等级提高灵力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3531606030
	,jns_8 = 1383632532
	}
skill取技能["莲花宝座"]={
	jns_1 = "按技能等级提高躲避力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 37911440
	,jns_8 = 2202511971
	}
skill取技能["姊妹相随"]={
	jns_1 = "无效果"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3177731283
	,jns_8 = 597142503
	}
skill取技能["云霄步"]={
	jns_1 = "按技能等级提高躲避力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 276418186
	,jns_8 = 3893284871
	}
skill取技能["玉质冰肌"]={
	jns_1 = "按技能等级提高防御力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3438751351
	,jns_8 = 2264853140
	}
skill取技能["狂兽诀"]={
	jns_1 = "无效果"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 1661790658
	,jns_8 = 2338433754
	}
skill取技能["十方无敌"]={
	jns_1 = "按技能等级提高伤害力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 1137925403
	,jns_8 = 4107877611
	}
skill取技能["修仙术"]={
	jns_1 = "无效果"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3726980014
	,jns_8 = 1673560698
	}
skill取技能["火云术"]={
	jns_1 = "无效果"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 4166858964
	,jns_8 = 909252202
	}
skill取技能["无双一击"]={
	jns_1 = "按技能等级提高命中"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 2203124248
	,jns_8 = 2998720398
	}
skill取技能["清明自在"]={
	jns_1 = "提高角色的法伤和法防"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3231066014
	,jns_8 = 3842629365
	}
skill取技能["沉鱼落雁"]={
	jns_1 = "无效果"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 370722733
	,jns_8 = 1052773261
	}
skill取技能["紫薇之术"]={
	jns_1 = "按技能等级提高灵力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3941011754
	,jns_8 = 1942519774
	}
skill取技能["符之术"]={
	jns_1 = "无效果"
	,jns_3 = 1
	,jns_6 = "wzife.wdf"
	,jns_7 = 3599571341
	,jns_8 = 921854792
	}
skill取技能["观音咒"]={
	jns_1 = "无效果"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 1410587972
	,jns_8 = 1911562650
	}
skill取技能["牛虱阵"]={
	jns_1 = "无效果"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 1129585606
	,jns_8 = 2492840335
	}
skill取技能["七星遁"]={
	jns_1 = "按技能等级提高躲避力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 923985229
	,jns_8 = 2400021580
	}
skill取技能["魔兽反噬"]={
	jns_1 = "按技能等级提高防御"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 512391647
	,jns_8 = 1359532967
	}
skill取技能["逆鳞术"]={
	jns_1 = "按技能等级提高防御力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3104091414
	,jns_8 = 3406230011
	}
skill取技能["乾坤袖"]={
	jns_1 = "无效果"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 2256743052
	,jns_8 = 3443276818
	}
skill取技能["破浪诀"]={
	jns_1 = "按技能等级提高伤害力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 4132491653
	,jns_8 = 3313121721
	}
skill取技能["拘魂诀"]={
	jns_1 = "无效果"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 1622524729
	,jns_8 = 3403104810
	}
skill取技能["毒经"]={
	jns_1 = "按技能等级提高伤害力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3161058590
	,jns_8 = 1458078261
	}
skill取技能["火牛阵"]={
	jns_1 = "按技能等级提高灵力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 1917391753
	,jns_8 = 1358009688
	}
skill取技能["金刚经"]={
	jns_1 = "无效果"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 2444843522
	,jns_8 = 4122844852
	}
skill取技能["霹雳咒"]={
	jns_1 = "无效果"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 53930907
	,jns_8 = 300592749
	}
skill取技能["渡世步"]={
	jns_1 = "按技能等级提高躲避力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 2399184502
	,jns_8 = 2261339260
	}
skill取技能["尸腐恶"]={
	jns_1 = "按技能等级提高防御力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3997271777
	,jns_8 = 22951667
	}
skill取技能["天外魔音"]={
	jns_1 = "按技能等级提高灵力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3819811307
	,jns_8 = 2331712128
	}
skill取技能["护法金刚"]={
	jns_1 = "按技能等级提高伤害力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 223144262
	,jns_8 = 84328029
	}
skill取技能["回身击"]={
	jns_1 = "按技能等级提高防御力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 1224508814
	,jns_8 = 2667913913
	}
skill取技能["小乘佛法"]={
	jns_1 = "按技能等级提高灵力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 2925047058
	,jns_8 = 1573500785
	}
skill取技能["九龙诀"]={
	jns_1 = "按技能等级提高灵力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 140291603
	,jns_8 = 923894374
	}
skill取技能["疾风步"]={
	jns_1 = "按技能等级提高躲避力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 2104231936
	,jns_8 = 552299472
	}
skill取技能["宁气诀"]={
	jns_1 = "按技能等级提高灵力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 1979452270
	,jns_8 = 3573433154
	}
skill取技能["文韬武略"]={
	jns_1 = "按技能等级提高防御力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 1708888521
	,jns_8 = 3150772814
	}
skill取技能["神道无念"]={
	jns_1 = "按技能等级提高灵力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 1749937072
	,jns_8 = 3852659463
	}
skill取技能["牛逼神功"]={
	jns_1 = "无效果"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3975126128
	,jns_8 = 2741787302
	}
skill取技能["大慈大悲"]={
	jns_1 = "按技能等级提高防御力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 1267473253
	,jns_8 = 3966881348
	}
skill取技能["混元道果"]={
	jns_1 = "按技能等级提高灵力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 675093303
	,jns_8 = 3799123064
	}
skill取技能["秋波暗送"]={
	jns_1 = "按技能等级提高命中"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 1698608098
	,jns_8 = 975668103
	}
skill取技能["黄庭经"]={
	jns_1 = "无效果"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 2680262225
	,jns_8 = 1501050246
	}
skill取技能["五行扭转"]={
	jns_1 = "按技能等级提高防御力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3256679059
	,jns_8 = 3457635171
	}
skill取技能["魔兽神功"]={
	jns_1 = "无效果"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 2952870578
	,jns_8 = 10218458
	}
skill取技能["大鹏展翅"]={
	jns_1 = "按技能等级提高躲避力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 1243494819
	,jns_8 = 2200620761
	}
skill取技能["归元心法"]={
	jns_1 = "按技能等级提高防御力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3444112895
	,jns_8 = 2996031232
	}
skill取技能["蛛丝阵法"]={
	jns_1 = "按技能等级提高防御力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 487492946
	,jns_8 = 2233726885
	}
skill取技能["斜月步"]={
	jns_1 = "按技能等级提高躲避力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 769022309
	,jns_8 = 2124205828
	}
skill取技能["无常步"]={
	jns_1 = "按技能等级提高速度"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 2772099555
	,jns_8 = 71871380
	}
skill取技能["为官之道"]={
	jns_1 = "无效果"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 2338752455
	,jns_8 = 2050205097
	}
skill取技能["盘丝步"]={
	jns_1 = "按技能等级提高躲避力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3406981495
	,jns_8 = 337337940
	}
skill取技能["磐龙灭法"]={
	jns_1 = "按技能等级提高伤害力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 423192983
	,jns_8 = 1962038233
	}
skill取技能["清歌妙舞"]={
	jns_1 = "按技能等级提高速度"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 1027945253
	,jns_8 = 2444515719
	}
skill取技能["幽冥术"]={
	jns_1 = "无效果"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 2105426613
	,jns_8 = 414994835
	}
skill取技能["盘丝大法"]={
	jns_1 = "按技能等级提高伤害力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 2544956347
	,jns_8 = 136964443
	}
skill取技能["知己知彼"]={
	jns_1 = "使用后可以领悟目标的状态"
	,jns_3 = 4
	,jns_4 = "80点魔法"
	,jns_5 = "清明自在达到35级以上"
	,jns_6 = "wzife.wdf"
	,jns_7 = 196316992
	,jns_8 = 2448181313
	}
skill取技能["天罡气"]={
	jns_1 = "按技能等级提高伤害力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 4224325719
	,jns_8 = 517623127
	}
skill取技能["震天诀"]={
	jns_1 = "按技能等级提高伤害力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 1449209742
	,jns_8 = 1917106392
	}
skill取技能["明性修身"]={
	jns_1 = "按技能等级提高防御力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 4104116990
	,jns_8 = 3074583809
}


skill取技能["BOSS绝杀"]={
	jns_1 = nil
	,jns_3 = 4
	,jns_4 = nil
	,jns_6 = nil
	,jns_7 = nil
	,jns_8 = nil
	}
skill取技能["同生共死"]={
	jns_1 = nil
	,jns_3 = 10
	,jns_4 = nil
	,jns_6 = nil
	,jns_7 = nil
	,jns_8 = nil
}
--剧情技能
skill取技能["调息"]={
	jns_1 = "非战斗情况下使用，可以按技能等级恢复一定气血值。"
	,jns_3 = 108
	,jns_6 = "wzife.wdf"
	,jns_7 = 0x94308B6B
	,jns_8 = 0x5956387D
	}
skill取技能["打坐"]={
	jns_1 = "非战斗情况下使用，可以按技能等级恢复一定魔法值。"
	,jns_3 = 108
	,jns_6 = "wzife.wdf"
	,jns_7 = 0xB77AFA4C
	,jns_8 = 0xA0D18931
	}
skill取技能["妙手空空"]={
	jns_1 = "战斗中使用的法术，可从怪物身上偷来银两或宝物。#G/(每次使用都将消耗目标等级*4点魔法)"
	,jns_3 = 108
	,jns_6 = "wzife.wdf"
	,jns_7 = 0xD4815978
	,jns_8 = 0x8466E376
	}
skill取技能["宝石工艺"]={
	jns_1 = "提高合成宝石的成功率。"
	,jns_3 = 108
	,jns_6 = "wzife.wdf"
	,jns_7 = 0x408D50D7
	,jns_8 = 0x5899607A
	}
skill取技能["奇门遁甲"]={
	jns_1 = "在特定场景使用道具“导标旗”做标记，用以传送。1级时可以在长寿村做标记，2级时增加傲来国，3级增加长安城，4级增加朱紫国。"
	,jns_3 = 108
	,jns_6 = "wzife.wdf"
	,jns_7 = 0xFDB72ACA
	,jns_8 = 0xEFE3F812
	}
skill取技能["仙灵店铺"]={
	jns_1 = "平时使用，能够呼出购买界面直接购买商品。"
	,jns_3 = 108
	,jns_6 = "wzife.wdf"
	,jns_7 = 0x47877A93
	,jns_8 = 0xF3719878
	}
skill取技能["建筑之术"]={
	jns_1 = "提高建造房屋的能力，玩家拥有较高的技能后，可以建造更高级的房屋，并获得更多的室内空间。"
	,jns_3 = 108
	,jns_6 = "wzife.wdf"
	,jns_7 = 0x9F2DFDB6
	,jns_8 = 0x16418D92
	}
skill取技能["变化之术"]={
	jns_1 = "学习后可以使用特殊的变身卡片变换造型，变身后可以获得相应的附加效果，而且不会被他人PK。技能等级提高后可以使用更为高级的卡片，并延长一定的变身时间。"
	,jns_3 = 108
	,jns_6 = "wzife.wdf"
	,jns_7 =  0xD8118484--0xE6CAA561 --0xD8118484
	,jns_8 = 0xE6CAA561--0xD8118484
	}
skill取技能["火眼金睛"]={
	jns_1 = "学习后可以使用特殊的变身卡片变换造型，变身后可以获得相应的附加效果，而且不会被他人PK。技能等级提高后可以使用更为高级的卡片，并延长一定的变身时间。"
	,jns_3 = 108
	,jns_6 = "wzife.wdf"
	,jns_7 = 0xE9D07953
	,jns_8 = 0x43CBAF9C
	}
-------------奇经八脉
--方寸山
skill取技能["苦缠"]={
	jns_1 = "失魂符、失心符、定身符降低属性的效果增加3%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xE99E9C96
	,jns_8 = 0xE99E9C96
	}
skill取技能["雷动"]={
	jns_1 = "使用落雷符时增加100点伤害。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xD2180C25
	,jns_8 = 0xD2180C25
	}
skill取技能["灵咒"]={
	jns_1 = "失魂符、失心符、定身符降低属性的效果首回合增加5%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF0000001
	,jns_8 = 0xF0000001
	}
skill取技能["奔雷"]={
	jns_1 = "使用五雷咒时，额外攻击另一个敌方目标。自身封印命中率下降15%。霹雳咒等级≥125时，首目标额外提高10%伤害。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xB490BD29
	,jns_8 = 0xB490BD29
	}
skill取技能["黄粱"]={
	jns_1 = "敌方目标被自己催眠时。必须受到100点以上的伤害才会苏醒。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xD3CF1A9E
	,jns_8 = 0xD3CF1A9E
	}
skill取技能["制约"]={
	jns_1 = "你的催眠符成功率减少基础值的5%，但你的其他封印法术成功率增加基础值的5%."
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF0000002
	,jns_8 = 0xF0000002
	}
skill取技能["必果"]={
	jns_1 = "每场战斗中，你的第—次封印对没有抗封技能且等级不大于你的玩家单位100%封印成功。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF0000003
	,jns_8 = 0xF0000003
	}
skill取技能["精炼"]={
	jns_1 = "“救命室毛”起效次数减少1，但是复活时回复量提高150%."
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF0000004
	,jns_8 = 0xF0000004
	}
skill取技能["幻变"]={
	jns_1 = "“分身术”额外使你受到的伤害降低20%，但有8回合冷却时间。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF0000005
	,jns_8 = 0xF0000005
	}
skill取技能["专神"]={
	jns_1 = "带有“凝神术”时，增加3%的抵抗封印几率。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF0000006
	,jns_8 = 0xF0000006
	}
skill取技能["额外能力"]={
	jns_1 = ""
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF0000007
	,jns_8 = 0xF0000007
	}
skill取技能["拘灵散修"]={
	jns_1 = "增加30点速度,获得拘灵散修称谓。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF0000009
	,jns_8 = 0xF0000009
	}
skill取技能["驱雷"]={
	jns_1 = "增加五雷咒3%的基础暴击几率。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF0000008
	,jns_8 = 0xF0000008
	}
skill取技能["策电"]={
	jns_1 = "五雷咒对首目标提高5%的伤害，在霹雳咒等级≥125时，额外提高5%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF0000011
	,jns_8 = 0xF0000011
	}
skill取技能["鬼怮"]={
	jns_1 = "法术防御所减免的法术伤害只对五雷咒第二目标起效10%."
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF0000016
	,jns_8 = 0xF0000016
	}
skill取技能["穿透"]={
	jns_1 = "琴音三叠对召唤兽和召唤物造成的伤害提高30%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF0000012
	,jns_8 = 0xF0000012
	}
skill取技能["余悸"]={
	jns_1 = "被五雷咒攻击过的召唤兽，受到“悲恸”的伤害加成增加至40%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF0000030
	,jns_8 = 0xF0000030
	}
skill取技能["宝诀"]={
	jns_1 = "佩戴“救命室毛”时，造成的法术伤害结果增加(救命毫毛层数÷2)%。“救命室毛”起效次数减少1，但是复活时回复量提高150%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF0000010
	,jns_8 = 0xF0000010
	}
skill取技能["妙用"]={
	jns_1 = "佩戴“救命室毛”时，造成的法术伤害结果增加(救命毫毛层数÷2)%;增加“救命笔毛”15%的基础成功率。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF0000022
	,jns_8 = 0xF0000022
	}
skill取技能["怒霆"]={
	jns_1 = "使用5次五雷咒后，下个五雷咒额外作用3个单位。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF0000023
	,jns_8 = 0xF0000023
	}
skill取技能["顺势"]={
	jns_1 = "对没有召唤兽的玩家单位造成的法术伤害提高8%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF0000025
	,jns_8 = 0xF0000025
	}
skill取技能["炼魂"]={
	jns_1 = "队伍中只有一个方寸山弟子时，当回合被自己法术攻击过的敌方玩家死亡后，目标获得状态“炼魂”︰1)“炼魂”状态持续到战斗结束，无法被移除;2)你对不带有“炼魂”的玩家单位伤害提高(5%×敌方场上“炼魂”状态数目);3)当敌方玩家单位带有“炼魂”时，你的五雷咒额外增加1个单位。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF0000019
	,jns_8 = 0xF0000019
	}
skill取技能["吐纳"]={
	jns_1 = "乾天罡气将消耗自身超过50%的所有气血，额外回复(消耗气血×25%)的魔法。主动使用的归元咒将额外回复至多(气血上限×50%)的气血，但额外消耗对应值×25%的魔法。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF0000027
	,jns_8 = 0xF0000027
	}
skill取技能["灵威"]={
	jns_1 = "使用灵宝后，回复12点愤怒."
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF0000021
	,jns_8 = 0xF0000021
	}
skill取技能["伏魔天师"]={
	jns_1 = "增加40点法术伤害，获得伏魔天师称谓。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF0000009
	,jns_8 = 0xF0000009
	}
skill取技能["灵能1"]={
	jns_1 = "使用灵宝后，你的下—个五雷咒伤害提高10%."
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF0000020
	,jns_8 = 0xF0000020
	}
skill取技能["震怒"]={
	jns_1 = "仅有1种雷法加持时，五雷正法的伤害提高16%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF0000032
	,jns_8 = 0xF0000032
	}
skill取技能["天箓"]={
	jns_1 = "有≥3种的雷法加持时，五雷正法造成的伤害提高8%."
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF0000026
	,jns_8 = 0xF0000026
	}
skill取技能["咒诀"]={
	jns_1 = "没有任何雷法加持时，至少会出现3枚符咒。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF0000033
	,jns_8 = 0xF0000033
	}
skill取技能["符威"]={
	jns_1 = "转化符咒时，每枚符咒使你回复1点愤怒."
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF0000014
	,jns_8 = 0xF0000014
	}
skill取技能["雷法·翻天"]={
	jns_1 = "使用五雷咒攻击目标。转化当前的符咒，每转化一枚符咒，五雷正法对召唤兽造成的伤害提高35%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF0000018
	,jns_8 = 0xF0000018
	}
skill取技能["吞雷"]={
	jns_1 = "受到的法术伤害降低5%."
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF0000028
	,jns_8 = 0xF0000028
	}
skill取技能["五雷正法"]={
	jns_1 = "浩然真气,感通天地。行持此符,可驱雷电。消耗所有“雷法”加持,使用五雷咒攻击目标。"
	,jns_3 = 4
	,jns_4 = "150点魔法"
	,jns_5 = "人物飞升且“神道无念”技能达到120级 "
	,jns_6 = "wzife.wdf"
	,jns_7 = 3103307429
	,jns_8 = 1116134864
}
skill取技能["雷法·崩裂"]={
	jns_1 = "【功效】使用五雷咒攻击目标。转化当前的符咒为“雷法·崩裂”加持,每转化一枚符咒，五雷正法对主目标造成的伤害提高25%。"
	,jns_3 = 4
	,jns_4 = "30点魔法"
	,jns_5 = "人物飞升且“神道无念”技能达到120级 "
	,jns_6 = "jntb.wdf"
	,jns_7 = 335544320
	,jns_8 = 335544320
}
skill取技能["雷法·震煞"]={
	jns_1 = "【功效】使用五雷咒攻击目标。转化当前的符咒为“雷法震煞”加持,每转化一枚符咒，五雷正法攻击目标增加1个。"
	,jns_3 = 4
	,jns_4 = "30点魔法"
	,jns_5 = "人物飞升且“神道无念”技能达到120级 "
	,jns_6 = "jntb.wdf"
	,jns_7 = 1476395008
	,jns_8 = 1476395008
}
skill取技能["雷法·坤伏"]={
	jns_1 = "【功效】使用五雷咒攻击目标。转化当前的符咒为“雷法·坤伏”加持,每转化一枚符咒，五雷正法的法术暴击几率提升8%。"
	,jns_3 = 4
	,jns_4 = "30点魔法"
	,jns_5 = "人物飞升且“神道无念”技能达到120级 "
	,jns_6 = "jntb.wdf"
	,jns_7 = 855638016
	,jns_8 = 855638016
}
skill取技能["雷法·轰天"]={
	jns_1 = "【功效】使用五雷咒攻击目标。转化当前的符咒为“雷法·轰天”加持,每转化一枚符咒、五雷正法几率驱散目标的随机一个增益状态。"
	,jns_3 = 4
	,jns_4 = "30点魔法"
	,jns_5 = "人物飞升且“神道无念”技能达到120级 "
	,jns_6 = "jntb.wdf"
	,jns_7 = 1946157056
	,jns_8 = 1946157056
}
skill取技能["雷法·倒海"]={
	jns_1 = "使用五雷咒攻击目标。转化当前的符咒，每转化一枚符咒，五雷正法对玩家单位造成的伤害提高8%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF0000017
	,jns_8 = 0xF0000017
	}
skill取技能["神机"]={
	jns_1 = "如果你的雷法击飞了目标，立即获得1枚符咒。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF0000024
	,jns_8 = 0xF0000024
	}
skill取技能["五雷·挪移"]={
	jns_1 = "凝神而动，随机使用—种雷法强化自身。你获得以下效果，持续6回合:1)五雷正法获得对应雷法2枚符咒的强化效果;2)对应雷法在持续时间内无法使用。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF0000029
	,jns_8 = 0xF0000029
	}
skill取技能["五雷正宗"]={
	jns_1 = "增加40点法术暴击等级，获得五雷正宗称谓。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF0000009
	,jns_8 = 0xF0000009
	}
skill取技能["造化"]={
	jns_1 = "使用灵宝后，下回合你至少出现3枚符咒。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF0000031
	,jns_8 = 0xF0000031
	}
skill取技能["补缺"]={
	jns_1 = "回合开始时，若自身魔法小于魔法上限30%时，有35%几率回复乾天罡气同等量的魔法"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x3A33F2CD
	,jns_8 = 0x3A33F2CD
	}
skill取技能["不倦"]={
	jns_1 = "催眠符命中效果增加20%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA2F9E185
	,jns_8 = 0xA2F9E185
	}
skill取技能["不舍"]={
	jns_1 = "每受到大于气血上限20%的物理伤害后，会自动使用归元咒，被封印时无法触发。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xB60A561A
	,jns_8 = 0xB60A561A
	}
skill取技能["鬼惧"]={
	jns_1 = "五雷咒提升对含有鬼魂术的敌人伤害提高30%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xB44BA05E
	,jns_8 = 0xB44BA05E
	}
skill取技能["集中"]={
	jns_1 = "提升(武器伤害/命中)*24的灵力。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA2F9E185
	,jns_8 = 0xA2F9E185
	}
skill取技能["不灭"]={
	jns_1 = "每次使用完封印类法术时，有15%的几率自动使用技能归元咒并在一定回合内提高自身10%的防御和灵力"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xAE728B11
	,jns_8 = 0xAE728B11
	}
skill取技能["化身"]={
	jns_1 = "分身术持续回合数提高1回合"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xE950182D
	,jns_8 = 0xE950182D
	}
skill取技能["调息1"]={
	jns_1 = "带有分身术状态时，回合结束恢复气血上限*4%的气血与魔法上限*3%的魔法"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x2ACC6068
	,jns_8 = 0x2ACC6068
	}
skill取技能["批亢"]={
	jns_1 = "分身术”状态下，造成的法术伤害提高20%，受到的伤害降低15%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x200F0880
	,jns_8 = 0x200F0880
	}
skill取技能["斗法"]={
	jns_1 = "增加10%的封印命中率。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x1EEA41F8
	,jns_8 = 0x1EEA41F8
	}
skill取技能["吐纳"]={
	jns_1 = "主动使用的归元咒将额外恢复气血上限*20%的气血，但额外消耗对应值*25%的魔法值。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x47BCA30B
	,jns_8 = 0x47BCA30B
	}
skill取技能["飞符炼魂"]={
	jns_1 = "一道法力强大的符咒\n能在攻击敌人的同时附加封印效果\n由于效果惊人\n菩提祖师禁止弟子随意使用\n使用法术攻击目标后\n70%几率追加使用法术落魄符\n并额外造成300点伤害"
	,jns_3 = 4
	,jns_4 = "60点愤怒"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x4C6405CB
	,jns_8 = 0x4C6405CB
	,jns_12 = '冷却5回合'
}
skill取技能["鬼念"]={
	jns_1 = "含有鬼魂术(包括高级鬼魂术)类的敌人降低对自身造成伤害的15%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF0000015
	,jns_8 = 0xF0000015
	}
skill取技能["碎甲"]={
	jns_1 = "使碎甲符作用人数提高3人，持续回合数增加1回合。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF701C5B5
	,jns_8 = 0xF701C5B5
	}
skill取技能["摧心"]={
	jns_1 = "当自身对目标造成物理伤害之后，目标概率会在之后的3回合内进入虚弱状态，降低10%的伤害力、灵力和物理防御。该效果的持续回合可以被刷新。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF0000013
	,jns_8 = 0xF0000013
	}
skill取技能["顺势而为"]={
	jns_1 = "精于封印的方寸弟子可以耗费—定的愤怒值对目标施加强大的法力，100%封印住那些没有抗封技能目标的法术能力，封印效果持续2回合。【冷却】6回合"
	,jns_3 = 4
	,jns_4 = "60点愤怒"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x9E6FFF66
	,jns_8 = 0x9E6FFF66
	,jns_12 = "冷却6回合"
}
skill取技能["钟馗论道"]={
	jns_1 = "为自己附加“钟尴论道”状态，获得下述效果，持续5回合:1）五雷咒伤害提高70%;2)该效果不会被驱散;3)回合结束时减少自身“锢魂术”“死亡禁锢”1回合持续时间;。【条件】当前气血比例≥50%"
	,jns_3 = 5
	,jns_4 = "【消耗】80点魔法，使用后仅保留1点气血【冷却】8回合，战斗开始时具有4回合冷却"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xB7CDB6AA
	,jns_8 = 0xB7CDB6AA
}
-- 大唐官府
skill取技能["目空"]={
	jns_1 = "大唐官府，使用特技翩鸿一击、后发制人时无视对手10%的防御"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x72ED61A1
	,jns_8 = 0x72ED61A1
	}
skill取技能["风刃"]={
	jns_1 = "大唐官府，普通攻击时可以对其他任意三个单位造成等级*3的伤害"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF97A7093
	,jns_8 = 0xF97A7093
	}
skill取技能["扶阵"]={
	jns_1 = "大唐官府，使队伍每个人的阵法加成效果在原数值提升3%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xD5131E6F
	,jns_8 = 0xD5131E6F
	}
skill取技能["翩鸿"]={
	jns_1 = "翩鸿一击伤害提高35%。"
	,jns_3 = 4
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x30E001D4
	,jns_8 = 0x30E001D4
	,jns_12 = "5回合"
}
skill取技能["翩鸿一击"]={
	jns_1 = "兵贵神速，对敌人造成135%的伤害，并且提高下回合15%的速度。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x30E001D4
	,jns_8 = 0x30E001D4
	,jns_12 = "5回合"
}
skill取技能["披坚执锐"]={
	jns_1 = "身披坚甲，手执利刃，敌人在追击下无所遁形\n每合随机1种你装备上的追加法术。使用披坚执锐后，视为你装备当回合随机的追加法术。"
	,jns_3 = 4
	,jns_4 = "随机法术消耗"
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0x72ED61A1
	,jns_8 = 0x72ED61A1
	}
skill取技能["谆谆教诲"]={
	jns_1 = "和尚的啰嗦中,偶尔也会夹杂蕴含大智慧的教诲。\n对敌方单个目标造成较高的法术伤害。"
	,jns_3 = 4
	,jns_4 = "45点魔法、20点愤怒"
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xF0000405
	,jns_8 = 0xF0000406
	,jns_12 = "冷却8回合"
}
skill取技能["离魂符"]={
	jns_1 = "有几率令对手一定回合内\n无法使用法术攻击并降速度\n#Y降低速度数值=技能等级*2"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "符之术技能达到25级"
	,jns_6 = "物品图标.wdf"
	,jns_7 = 146786390
	,jns_8 = 3355342391
}
skill取技能["蛊木迷瘴"]={
	jns_1 = "密林有蛊惑众生,朽木吐瘴藏杀气。释放瘴气蔓延，令对手丧魂落魄。\n对敌方5个目标造成法术伤害，有一定几率为目标附加1层“雾杀"
	,jns_3 = 4
	,jns_4 = "30点魔法*作用人数"
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0x4E4ECD7C
	,jns_8 = 0x4E4ECD7C
	}
skill取技能["催化"]={
	jns_1 = "强化目标身上来自你的“雾杀”使“雾杀”造成的伤害增加100%(300%);若有风灵,会消耗1层强化所有敌友单位身上来自你的“雾杀“本场战斗中,“雾杀”的基础伤害提高6%，最多60%。(括号内为目标是NPC时的效果）"
	,jns_3 = 4
	,jns_4 = "100点魔法"
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0xD10DF1DF
	,jns_8 = 0xD10DF1DF
}
skill取技能["勇武"]={
	jns_1 = "后发制人将获得以下额外效果：额外增加防御值40%的伤害结果；使用时不消耗气血，转而使自己增加气血上限*15%的气血（最高为人物等级*8）；使用时增加自身10点愤怒。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x265842A6
	,jns_8 = 0x265842A6
	}
skill取技能["长驱直入"]={
	jns_1 = "以迅雷不及掩耳之势切入战场，给敌军最薄弱的环节予以致命一击，电光火石之间令对手甚至来不及做出反应，无法施展保护，造成110%伤害并有60%几率降低敌人10%的防御。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xAB6EA7B4
	,jns_8 = 0xAB6EA7B4
	,jns_12 = "4回合"
}
skill取技能["杀意"]={
	jns_1 = "触发物理必杀时。必杀伤害增加20%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xBB962DBE
	,jns_8 = 0xBB962DBE
	}
skill取技能["念心"]={
	jns_1 = "攻击目标且自身召唤兽为在场时，额外增加10%必杀率。（鬼魂倒地视为未在场）"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xAB64E8CF
	,jns_8 = 0xAB64E8CF
	}
skill取技能["静岳"]={
	jns_1 = "处于后发制人或者横扫千军，破釜沉舟的休息状态时，所受伤害减少150点。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xB363459E
	,jns_8 = 0xB363459E
	}
skill取技能["干将"]={
	jns_1 = "使用破斧沉舟技能时有20%的几率额外增加一个伤害目标。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x01C779BC
	,jns_8 = 0x01C779BC
	}
skill取技能["勇念"]={
	jns_1 = "使用横扫千军时，忽略目标10%防御。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x2EF39CEC
	,jns_8 = 0x2EF39CEC
	}
skill取技能["神凝"]={
	jns_1 = "自身提高10%抗封印率。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x9640C6B0
	,jns_8 = 0x9640C6B0
	}
skill取技能["狂狷"]={
	jns_1 = "将自身（力量属性÷耐力属性）*16转化为伤害力。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xAFA63BA0
	,jns_8 = 0xAFA63BA0
	}
skill取技能["不惊"]={
	jns_1 = "额外忽视目标自身武器宝石锻造等级*5的防御。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x8F6C13D3
	,jns_8 = 0x8F6C13D3
	}
skill取技能["突进"]={
	jns_1 = "每回合开始时有45%的几率触发，提升自身防御值8%的伤害力。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA839BBD0
	,jns_8 = 0xA839BBD0
	}
skill取技能["破空"]={
	jns_1 = "使用破釜沉舟时，对目标造成目标防御*0.3的额外伤害。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x0821ADC7
	,jns_8 = 0x0821ADC7
	}
skill取技能["历战"]={
	jns_1 = "带有“安神决”时，受到的法术伤害降低50%。安神诀有70%几率抵抗驱散效果。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x438B3BD1
	,jns_8 = 0x438B3BD1
	}
skill取技能["连破"]={
	jns_1 = "横扫千军有18%几率不进入休息状态。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x8E319047
	,jns_8 = 0x8E319047
	}
skill取技能["无敌"]={
	jns_1 = "横扫千军变为4次攻击，气血消耗额外增加10%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x4640D75C
	,jns_8 = 0x4640D75C
	}
skill取技能["破军"]={
	jns_1 = "使用横扫千军时每次攻击时额外增加受击目标气血最大上限的1%*攻击次序+200的伤害结果。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xDC241728
	,jns_8 = 0xDC241728
	}
skill取技能["傲视"]={
	jns_1 = "击倒玩家单位后，你造成的物理伤害提高10%，持续6回合"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x72ED61A1
	,jns_8 = 0x72ED61A1
	}
skill取技能["安神"]={
	jns_1 = "安神诀使你受到的法术伤害额外降低50%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x72ED61A1
	,jns_8 = 0x72ED61A1
	}
skill取技能["额外能力"]={
	jns_1 = "增加40点伤害"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x72ED61A1
	,jns_8 = 0x72ED61A1
	}
skill取技能["无敌"]={
	jns_1 = "横扫千军变为4次攻击，分别使用75%/85%/95%/105%的伤害力进行攻击"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x72ED61A1
	,jns_8 = 0x72ED61A1
}
skill取技能["浴血豪侠"]={
	jns_1 = "增加40点伤害，获得浴血豪侠称谓"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x72ED61A1
	,jns_8 = 0x72ED61A1
	}
skill取技能["勇进"]={
	jns_1 = "获得连破特效,在与玩家战斗时，第一次使用横扫千军必定触发连破"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA0000338
	,jns_8 = 0xA0000338
	}
skill取技能["突刺"]={
	jns_1 = "当前气血≥90%时，你的横扫千军造成的伤害提高5%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA0000286
	,jns_8 = 0xA0000286
	}
skill取技能["亢强"]={
	jns_1 = "使用特技后，每点原始愤怒消耗使你下个横扫千军触发连破的几率增加0.2%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA0000134
	,jns_8 = 0xA0000134
	}
skill取技能["破阵"]={
	jns_1 = "使用破釜沉舟后，不再进入休息状态，但具有6回合冷却回合。(战斗开始时冷却3回合)"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x72ED61A1
	,jns_8 = 0x72ED61A1
	}
skill取技能["突刺"]={
	jns_1 = "当前气血≥90%时，你的横扫千军造成的伤害提高5%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA0000286
	,jns_8 = 0xA0000286
	}
skill取技能["破势"]={
	jns_1 = "每消耗1点灵元，你触发连破的几率增加5%，持续到战斗结束"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x72ED61A1
	,jns_8 = 0x72ED61A1
	}
skill取技能["孤勇"]={
	jns_1 = "队伍中只有一个大唐官府弟子时:主动使用横扫千军击倒召唤兽或召唤物时，你触发连破的几率增加25%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA0000071
	,jns_8 = 0xA0000071
	}
skill取技能["熟练"]={
	jns_1 = "队伍中只有一个大唐官府弟子时:你触发连破的几率增加17%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA0000268
	,jns_8 = 0xA0000268
}
skill取技能["额外能力"]={
	jns_1 = "增加280点伤害"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x72ED61A1
	,jns_8 = 0x72ED61A1
	}
skill取技能["破军"]={
	jns_1 = "使用横扫千军后，获得一层“剑意”根据“剑意”层数获得下述效果:2层及以上:攻击被保护时，被保护者所受伤害结果增加5%;5层及以上:造成的伤害增加5%;11层及以上:使用横扫千军时目标不会被保护且会对额外3个单位造成45%溅射伤害;23层及以上:不会受到无法复活的效果影响。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xDC241728
	,jns_8 = 0xDC241728
	}
skill取技能["无双战神"]={
	jns_1 = "增加280点气血，获得无双战神称谓。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x72ED61A1
	,jns_8 = 0x72ED61A1
	}
skill取技能["潜心"]={
	jns_1 = "使用披坚执锐后，法术追加套装的触发几率提高100%，持续3回合。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA0000236
	,jns_8 = 0xA0000236
	}
skill取技能["笃志"]={
	jns_1 = "法术追加套装的触发几率提高8%。与NPC战斗时，法术套装基础概率增加25％。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA0000041
	,jns_8 = 0xA0000041
	}
skill取技能["昂扬"]={
	jns_1 = "每8回合自动释放1次披坚执锐,并使法术追加套装的触发几率提高50%。不能主动使用披坚执锐。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA0000384
	,jns_8 = 0xA0000384
	}
skill取技能["效法"]={
	jns_1 = "触发的追加法术伤害提高4%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA0000306
	,jns_8 = 0xA0000306
	}
skill取技能["追戮"]={
	jns_1 = "携带的某种法术追加套装件数≥3时，基角触融发时伤害提高5%."
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA0000374
	,jns_8 = 0xA0000374
	}
skill取技能["历兵"]={
	jns_1 = "触发追加法术后，除该法术外的其他追加法术伤害提高0.3%，持续到战斗结束。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA0000155
	,jns_8 = 0xA0000155
}
skill取技能["摧枯拉朽"]={
	jns_1 = "对目标发动一次必定触发套装追加法术的物理攻击"
	,jns_3 = 4
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA0000025
	,jns_8 = 0xA0000025
	}
skill取技能["肃杀"]={
	jns_1 = "处于杀气诀状态时，你的法术追加套装角融发几率提高30%."
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA0000274
	,jns_8 = 0xA0000274
	}
skill取技能["惊天动地"]={
	jns_1 = "【主动】程咬金在“烽火连城”—役绝境之中使用的克敌之技，为了防止狐祖再次入侵长安暂时传授给大唐弟子。"
	,jns_3 = 4
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x72ED61A1
	,jns_8 = 0x72ED61A1
	}
skill取技能["烈光"]={
	jns_1 = "每携带—种不同的法术追加套装，触发追加法术的伤害提高1.5%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA0000166
	,jns_8 = 0xA0000166
	}
skill取技能["奉还"]={
	jns_1 = "触发追加法术时，对和i该法术所属门派相同的玩家的伤害提高20%."
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA0000058
	,jns_8 = 0xA0000058
	}
skill取技能["厉兵"]={
	jns_1 =  "触发追加法术后，除该法术外的其他追加法术伤害提高0.3%，持续到战斗结束。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x72ED61A1
	,jns_8 = 0x72ED61A1
	}
skill取技能["怒伤"]={
	jns_1 = "主动使用披坚执锐时，你回复10点愤怒"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA0000212
	,jns_8 = 0xA0000212
	}

skill取技能["戎威"]={
	jns_1 = "触发追加法术后，你回复5点愤怒"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x72ED61A1
	,jns_8 = 0x72ED61A1
	}
skill取技能["催迫"]={
	jns_1 =  "使用原始愤怒消耗≥120点的特技后，你的下个追加法术伤害提高12%."
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA0000032
	,jns_8 = 0xA0000032
	}
skill取技能["攻伐"]={
	jns_1 = "触发套装追加法术后，你造成的所有伤害提高5%，持续3回合(不可驱散)。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA0000069
	,jns_8 = 0xA0000069
	}
skill取技能["暴突"]={
	jns_1 = "造成的所有伤害提高3%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA0000001
	,jns_8 = 0xA0000001
	}
skill取技能["诛伤"]={
	jns_1 = "每种追加法术在战斗内被首次触发时，其伤害提高10%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA0000370
	,jns_8 = 0xA0000370
	}
skill取技能["破刃"]={
	jns_1 = "每消耗1点灵元，你的法术追加套装的触发几率提高5%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA0000224
	,jns_8 = 0xA0000224
	}
skill取技能["奋战"]={
	jns_1 = "基础物理连击几率增加3%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA0000054
	,jns_8 = 0xA0000054
	}
skill取技能["灵能"]={
	jns_1 = "击飞召唤兽或召唤物后，你的下个追加法术伤害提高12%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x72ED61A1
	,jns_8 = 0x72ED61A1
	}
skill取技能["额外能力"]={
	jns_1 = "增加30点速度"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x72ED61A1
	,jns_8 = 0x72ED61A1
	}
skill取技能["披挂上阵"]={
	jns_1 = "使用仅造成40%伤害的横扫千军攻击目标，每次攻击均有几率触发套装追加法术。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA0000219
	,jns_8 = 0xA0000219
	}
skill取技能["虎贲上将"]={
	jns_1 = "增加30点速度，获得虎贲上将称谓"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x72ED61A1
	,jns_8 = 0x72ED61A1
}
-- 阴曹地府
skill取技能["判官"]={
	jns_1 = "判官令造成的伤害增加10%、魔法损耗增加50%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xC4A24497
	,jns_8 = 0xC4A24497
	}
skill取技能["回旋"]={
	jns_1 = "受到包括固定伤害在内的所有法术伤害减少60点。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x299CC362
	,jns_8 = 0x299CC362
	}
skill取技能["夜行"]={
	jns_1 = "夜间增加人物40点速度、40点伤害、50点阎罗令伤害。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x6CB4C5F1
	,jns_8 = 0x6CB4C5F1
	}
skill取技能["入骨"]={
	jns_1 = "尸腐毒被解除时，使目标减少5%当前气血。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xB9D06801
	,jns_8 = 0xB9D06801
	}
skill取技能["聚魂"]={
	jns_1 = "摄魂的所有基础效果增加4.5%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x0EF6D102
	,jns_8 = 0x0EF6D102
	}
skill取技能["索魂"]={
	jns_1 = "锢魂术命中目标后，如果目标在此锢魂术状态下死亡，都可以增加施法者锢魂术2%的命中率，上限为10%，持续到战斗结束。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF259DD30
	,jns_8 = 0xF259DD30
	}
skill取技能["伤魂"]={
	jns_1 = "对带有尸腐毒的单位增加200点封印命中等级、100点物理伤害力。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xEDAB40CF
	,jns_8 = 0xEDAB40CF
	}
skill取技能["百炼"]={
	jns_1 = "武器耐久度消耗降低50%;使用百爪狂杀时临时增加40%的武器命中。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x2197928B
	,jns_8 = 0x2197928B
	}
skill取技能["黄泉"]={
	jns_1 = "黄泉之息的减速效果增加50%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x11A0C1AE
	,jns_8 = 0x11A0C1AE
	}
skill取技能["毒印"]={
	jns_1 = "你的判官令对带有尸腐毒的单位伤害提高20%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x49D3C846
	,jns_8 = 0x49D3C846
	}
skill取技能["百爪狂杀"]={
	jns_1 = "【被动】你被封印的几率增加20%,【主动】法术驱动的必中物理攻击，可攻击4个目标;每增加1个攻击目标，对所有目标的伤害结果降低10%。作用目标按速度排序选择。如果你的武器带有“必中”特效，则提升10%(3%)的伤害结果。(括号内为目标为NPC时的效果)"
	,jns_3 = 4
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x8FCE05BE
	,jns_8 = 0x8FCE05BE
	}
skill取技能["幽光"]={
	jns_1 = "九幽的每回合回复当前气血值的上限增加120点。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x337664F3
	,jns_8 = 0x337664F3
	}
skill取技能["泉爆"]={
	jns_1 = "队伍中只有一个阴曹地府弟子时：每场战斗的第一次黄泉之息将造成400%的伤害。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x14AB7311
	,jns_8 = 0x14AB7311
	}
skill取技能["鬼火"]={
	jns_1 = "使用原始愤怒消耗≤90的特技后，回复16点愤怒。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x93AE3E78
	,jns_8 = 0x93AE3E78
	}
skill取技能["魂飞"]={
	jns_1 = "你的魂飞魄散首目标若为玩家且当回合死亡，则附加锢魂术，持续2回合。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xC415DB52
	,jns_8 = 0xC415DB52
	}
skill取技能["汲魂"]={
	jns_1 = "每次敌方人物死亡时，回复(自身等级×6)的气血。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x808E00C5
	,jns_8 = 0x808E00C5
	}
skill取技能["击破"]={
	jns_1 = "攻击防御的目标额外增加50%伤害。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xB79CC34C
	,jns_8 = 0xB79CC34C
	}
skill取技能["魑魅缠身"]={
	jns_1 = "地府弟子可以招来地狱深处的魑魅魍魉，被他们附身的敌人将具备鬼魂精魄的特质，在擅于驱鬼的对手面前无所遁形。为对方任意成员（单目标）附加“冤魂”状态，持续5回合，冤魂状态的效果为：1.若冤魂状态的目标为召唤兽，则被携带驱鬼技能的目标攻击时伤害增加50%，被携带高级驱鬼技能的目标攻击时伤害增加100%；2.若冤魂状态的目标为人物或者NPC时，则被携带驱鬼技能的目标攻击时伤害增加15%，被携带高级驱鬼技能的目标攻击时伤害增加30%。消耗：40点愤怒值。冷却：4回合。该技能为法术技能，受封印法术限制。该技能不能对拥有鬼魂及高级鬼魂技能的目标使用。"
	,jns_3 = 3
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x2B37D923
	,jns_8 = 0x2B37D923
	}
skill取技能["六道无量"]={
	jns_1 = "法术驱动的必中单体物理攻击技能，被攻击单位若有尸腐毒,那么将额外在攻击一次。该技能攻击玩家时，双方防御下降(双方防御差)*0.75（最高为自身等级*2），持续2回合。"
	,jns_3 = 4
	,jns_4 = "40点魔法"
	,jns_5 = "“六道轮回”技能达到45级 "
	,jns_6 = "wzife.wdf"
	,jns_7 = 1594584941
	,jns_8 = 2719875429
	}
skill取技能["夜之王者"]={
	jns_1 = "百爪狂杀额外提高14%伤害结果;夜晚增加10%暴击几率。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x5192EAE6
	,jns_8 = 0x5192EAE6
	}
skill取技能["六道魍魉"]={
	jns_1 = "增加40点伤害,获得六道魍魉称谓。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x5192EAE6
	,jns_8 = 0x5192EAE6
}

skill取技能["阎罗"]={
	jns_1 = "与NPC战斗时，阎罗令伤害增加(武器伤害x15%);敌方场上有非召唤物单位死亡时，你的下一个判官令或六道无量伤害提高50%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xC4A24497
	,jns_8 = 0xC4A24497
	}
skill取技能["拘魄"]={
	jns_1 = "摄魂的所有基础效果增加6%" --但冷却回合增加至10
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x299CC362
	,jns_8 = 0x299CC362
	}
skill取技能["瘴幕"]={
	jns_1 = "受到带有“尸腐毒”单位的攻击时，受到的伤害降低3%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x6CB4C5F1
	,jns_8 = 0x6CB4C5F1
}
skill取技能["幽冥"]={
	jns_1 = "幽冥鬼眼持续回合数增加1"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xC4A24497
	,jns_8 = 0xC4A24497
	}
skill取技能["冥视"]={
	jns_1 = "幽冥鬼眼额外增加2%的抗封。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x299CC362
	,jns_8 = 0x299CC362
	}
skill取技能["扼命"]={
	jns_1 = "将魂飞魄散命中目标的几率提升至80%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x6CB4C5F1
	,jns_8 = 0x6CB4C5F1
}

skill取技能["额外能力"]={
	jns_1 = "增加30点速度"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xC4A24497
	,jns_8 = 0xC4A24497
	}
skill取技能["魍魉追魂"]={
	jns_1 = "地府弟子可以招来地狱深处的魑魅魍魉协助队友进行攻击。对本方—个死亡的单位附加“魍魉追魂”效果:造成的物理法术伤害提高(4+2xN)%，N为本方带有“魍魉追魂”的单位数，持续到战斗结束(不可驱散)"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x299CC362
	,jns_8 = 0x299CC362
	}
skill取技能["勾魂阎罗"]={
	jns_1 = "增加30点速度，获得勾魂阎罗称谓"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x6CB4C5F1
	,jns_8 = 0x6CB4C5F1
}
skill取技能["狱火"]={
	jns_1 = "攻击带有来自你的“摄魂”的单位时，造成的伤害提高12%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xC4A24497
	,jns_8 = 0xC4A24497
	}
skill取技能["咒令"]={
	jns_1 = "判官令减少魔法值效果提高50%，但增加4回合冷却时间"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x299CC362
	,jns_8 = 0x299CC362
	}
skill取技能["恶焰"]={
	jns_1 = "击飞带有尸腐毒的单位时，你获得恶焰:造成的物理伤害提高12%，持续6回合"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x6CB4C5F1
	,jns_8 = 0x6CB4C5F1
	}
skill取技能["六道"]={
	jns_1 = "六道无量的伤害结果额外增加(六道轮回技能等级×4)。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x6CB4C5F1
	,jns_8 = 0x6CB4C5F1
}
skill取技能["噬毒"]={
	jns_1 = "【主动】净化一个敌方单位带有的“尸腐毒”，受到(人物等级×10)点伤害，但是你的下一个六道无量造成伤害提高60%且增加10%的暴击几率，下一个百爪狂杀造成伤害提高60%且对敌方玩家附加防御降低效果" --;若目标不带有“尸腐毒”效果，你随机获得其中一个增益状态且不会受到伤害
	,jns_3 = 4
	,jns_4 = "50点魔法冷却8回合"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xC4A24497
	,jns_8 = 0xC4A24497
	}
skill取技能["额外能力"]={
	jns_1 = "增加40点伤害"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x299CC362
	,jns_8 = 0x299CC362
	}
skill取技能["夜之王者"]={
	jns_1 = "百爪狂杀额外提高14%伤害结果;夜晚增加10%暴击几率"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x6CB4C5F1
	,jns_8 = 0x6CB4C5F1
}
skill取技能["毒炽"]={
	jns_1 = "攻击带有尸腐毒的单位时，临时增加12%暴击几率"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xC4A24497
	,jns_8 = 0xC4A24497
	}
skill取技能["阴翳"]={
	jns_1 = "百鬼噬魂、血影蚀心附加尸腐毒的几率增加12%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x299CC362
	,jns_8 = 0x299CC362
	}
skill取技能["入魂"]={
	jns_1 = "对带有你的“摄魂”的单位附加尸腐毒几率增加50%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x6CB4C5F1
	,jns_8 = 0x6CB4C5F1
	}
skill取技能["毒慑"]={
	jns_1 = "敌方有单位处于“尸腐毒”状态时，你造成的伤害提高4%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xC4A24497
	,jns_8 = 0xC4A24497
	}
skill取技能["破印"]={
	jns_1 = "对召唤兽的伤害提高15%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x299CC362
	,jns_8 = 0x299CC362
	}
skill取技能["无赦咒令"]={
	jns_1 = "对目标发起物理攻击，随机驱散目标1个增益状态，如果目标带毒类异常，则驱散2个"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x6CB4C5F1
	,jns_8 = 0x6CB4C5F1
	}
skill取技能["通暝"]={
	jns_1 = "幽冥鬼眼仅对自己起效，但持续回合增加（释放时敌方场上带有尸腐毒的单位数量)"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xC4A24497
	,jns_8 = 0xC4A24497
	}
skill取技能["狂宴"]={
	jns_1 = "攻击附带“尸腐毒”的单位后，回复2点愤怒"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x299CC362
	,jns_8 = 0x299CC362
	}
skill取技能["轮回"]={
	jns_1 = "队伍中只有一个阴曹地府弟子时:若回合结束时，敌方场上有6个中“尸腐毒”的单位，你获得60点伤害、暴击等级、穿刺等级、狂暴等级、抗封等级、格挡值，持续6回合。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x6CB4C5F1
	,jns_8 = 0x6CB4C5F1
}
skill取技能["蚀骨"]={
	jns_1 = "如果敌方场上没有单位带有“尸腐毒”，则百鬼噬魂、血影蚀心附加“尸腐毒”的几率增加15%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xC4A24497
	,jns_8 = 0xC4A24497
	}
skill取技能["生杀予夺"]={
	jns_1 = "提高伤害对一个目标发起─次物理攻击:1)若目标带毒，此次攻击暴击伤害倍率增加60%;2)队伍中只有一个阴曹地府弟子时:回合结束时额外减少(敌方场上尸腐毒数量)的冷却回合"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x299CC362
	,jns_8 = 0x299CC362
	}
skill取技能["诛刑毒师"]={
	jns_1 = "增加40点物理暴击等级，获得诛刑毒师称谓"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x6CB4C5F1
	,jns_8 = 0x6CB4C5F1
}
--化生寺
skill取技能["止戈"]={
	jns_1 = "在原恢复技能的治疗量上再增加自身武器伤害*18%的治疗量。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x96670F08
	,jns_8 = 0x96670F08
	}
skill取技能["销武"]={
	jns_1 = "唧唧歪歪所造成的伤害将提高与人物等级同等的伤害量"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x9A717CB4
	,jns_8 = 0x9A717CB4
	}
skill取技能["佛屠"]={
	jns_1 = "金刚护法的的增益效果将在原始效果上再次增加武器伤害的9%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x32BE260B
	,jns_8 = 0x32BE260B
	}
skill取技能["佛誉"]={
	jns_1 = "活血效果提高20%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF28C8F12
	,jns_8 = 0xF28C8F12
	}
skill取技能["仁心"]={
	jns_1 = "使用活血时有20%的几率使活血的功效增加100%，但会额外消耗100点魔法。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x265842A6
	,jns_8 = 0x265842A6
	}
skill取技能["佛显"]={
	jns_1 = "推气过宫治疗效果提升10%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x8D52FE90
	,jns_8 = 0x8D52FE90
	}
skill取技能["心韧"]={
	jns_1 = "在使用推气过宫时有15%的几率使治疗效果增加100%，但同时也将额外消耗150点魔法。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x823DD991
	,jns_8 = 0x823DD991
	}
skill取技能["归气"]={
	jns_1 = "自身所有的治疗类技能都将额外增加10%的消耗，但是治疗效果将增加8%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x369BD94B
	,jns_8 = 0x369BD94B
	}
skill取技能["天照"]={
	jns_1 = "推气过言和救死扶伤会使得目标当前回合受到的法术伤害结果减少40点。醍醵灌顶会使得目标当前回合受到的法术伤害减少80点。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xE1910A2F
	,jns_8 = 0xE1910A2F
	}
skill取技能["舍利"]={
	jns_1 = "自身死亡后，己方队员随机一名队员将增加自身与自身愤怒同等的愤怒量，但是最高不会超过120点，一场战斗最多触发3次此效果."
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xEE1C323A
	,jns_8 = 0xEE1C323A
	}

skill取技能["慈针"]={
	jns_1 = "使用我佛慈悲可以使自身获得30点愤怒。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xFD3253DA
	,jns_8 = 0xFD3253DA
	}
skill取技能["佛性"]={
	jns_1 = "我佛慈悲可以增加目标80点物理防御及法术防御，持续5回合。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x5D47F1F4
	,jns_8 = 0x5D47F1F4
	}
skill取技能["妙悟"]={
	jns_1 = "恢复目标人物等级*3的气血及等级*2的魔法。同时自身会触发一次一苇渡江效果"
	,jns_3 = 3
	,jns_4 = "50点魔法"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x2F3B9A81
	,jns_8 = 0x2F3B9A81
	,jns_12 = "5回合"
}
skill取技能["慈心"]={
	jns_1 = "使用慈航普度时消耗的愤怒减少40点。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x5816C756
	,jns_8 = 0x5816C756
	}
skill取技能["映法"]={
	jns_1 = "金刚护法、金刚护体、一苇渡江有50%几率对所有单位起效。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xC8D9EE20
	,jns_8 = 0xC8D9EE20
	}
skill取技能["流刚"]={
	jns_1 = "金刚护法、金刚护体、一苇渡江的效果增加20%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x067D652B
	,jns_8 = 0x067D652B
	}
skill取技能["渡劫金身"]={
	jns_1 = "每次使用治疗类技能有10%的几率实现双倍恢复；且治疗效果将增加15%，但治疗类技能每作用一个目标，会额外消耗40点魔法。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x3819B112
	,jns_8 = 0x3819B112
	}
skill取技能["额外能力"]={
	jns_1 = "学习“渡劫金身”以后，每个额外能力的乾元丹会增加30点治疗能力，学习“诸天看护”以后，每个额外的乾元丹会增加80点法术防御。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA209C3C2
	,jns_8 = 0xA209C3C2
	}
skill取技能["诸天看护"]={
	jns_1 = "给目标附加一个状态，该状态使目标将所受到的所有伤害减少50%，持续1个回合，并为目标附加反震状态，持续5回合。"
	,jns_3 = 3
	,jns_4 = "100点魔法"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xED073209
	,jns_8 = 0xED073209
	,jns_12 = "5回合"
}
skill取技能["圣手"]={
	jns_1 = "对气血>70%的单位，治疗效果提高3%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x96670F08
	,jns_8 = 0x96670F08
	}
skill取技能["妙手"]={
	jns_1 = "你的活血效果提高25%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x9A717CB4
	,jns_8 = 0x9A717CB4
	}
skill取技能["化瘀"]={
	jns_1 = "你的活血效果提高120%，但有8回合冷却时间;使用推气过宫会立即重置冷却"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x32BE260B
	,jns_8 = 0x32BE260B
}
skill取技能["熟稔"]={
	jns_1 = "推气过宫和救死扶伤的魔法消耗变为原来的80%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x96670F08
	,jns_8 = 0x96670F08
	}
skill取技能["佛法"]={
	jns_1 = "队伍中只有一个化生寺弟子时:带有“佛法无边”会同时使你造成的所有治疗增加30%,抗封能力提高10%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x9A717CB4
	,jns_8 = 0x9A717CB4
	}
skill取技能["虔诚"]={
	jns_1 = "同时带有“金刚护法”、“金刚护体”、“—苇渡江”时，你的推气过宫额外作用1个单位"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x32BE260B
	,jns_8 = 0x32BE260B
}
skill取技能["心静"]={
	jns_1 = "使用“静心禅珠”时，有50%几率随机移除你的一个异常状态"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x96670F08
	,jns_8 = 0x96670F08
	}
skill取技能["佛法"]={
	jns_1 = "队伍中只有一个化生寺弟子时:带有“佛法无边”会同时使你造成的所有治疗增加30%,抗封能力提高10%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x9A717CB4
	,jns_8 = 0x9A717CB4
	}
skill取技能["虔诚"]={
	jns_1 = "同时带有“金刚护法”、“金刚护体”、“—苇渡江”时，你的推气过宫额外作用1个单位"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x32BE260B
	,jns_8 = 0x32BE260B
}
skill取技能["额外能力"]={
	jns_1 = "增加30点治疗能力"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x96670F08
	,jns_8 = 0x96670F08
	}
skill取技能["渡劫金身"]={
	jns_1 = "给目标附加—一个状态，持续2个回合或目标死亡。状态消失时，恢复目标一定气血、气血上限(效果与“大慈大悲”等级、治疗能力相关)"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x3819B112
	,jns_8 = 0x3819B112
	}
skill取技能["杏林妙手"]={
	jns_1 = "增加30点治疗能力，获得杏林妙手称谓"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x32BE260B
	,jns_8 = 0x32BE260B
}

skill取技能["施他"]={
	jns_1 = "进入战斗后增加40点治疗能力"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x96670F08
	,jns_8 = 0x96670F08
	}
skill取技能["聚念"]={
	jns_1 = "你的“聚气”效果增加至75%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x3819B112
	,jns_8 = 0x3819B112
	}
skill取技能["磅礴"]={
	jns_1 = "你的“聚气”触发几率提升至60%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x32BE260B
	,jns_8 = 0x32BE260B
}
skill取技能["佛显"]={
	jns_1 = "每3次活血或醍翻灌顶可以使你下─次推气过宫或救死扶伤必定触发明光。(不可驱散)"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x96670F08
	,jns_8 = 0x96670F08
	}
skill取技能["感念"]={
	jns_1 = "你的“韦陀护法”效果提高150%，但持续时间变为1回合"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x3819B112
	,jns_8 = 0x3819B112
	}
skill取技能["无碍"]={
	jns_1 = "你的“韦陀护法”效果提高100%，但作用目标变为1"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x32BE260B
	,jns_8 = 0x32BE260B
	}
skill取技能["映法"]={
	jns_1 = "金刚护法、金刚护体、一苇渡江有50%几率对所有单位起效。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x3819B112
	,jns_8 = 0x3819B112
	}
skill取技能["流刚"]={
	jns_1 = "金刚护法、金刚护体、一苇渡江的效果提高18%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x32BE260B
	,jns_8 = 0x32BE260B
}

skill取技能["护法金刚1"]={
	jns_1 = "增加80点法术防御，获得护法金刚称谓"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x3819B112
	,jns_8 = 0x3819B112
	}
skill取技能["诵律"]={
	jns_1 = "唧唧歪歪对召唤兽造成的伤害增加100点"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x32BE260B
	,jns_8 = 0x32BE260B
}
skill取技能["授业"]={
	jns_1 = "唧唧歪歪、谆谆教诲的法术伤害结果增加30点"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x96670F08
	,jns_8 = 0x96670F08
	}
skill取技能["修习"]={
	jns_1 = "增加谆谆教诲25%的法术连击几率"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x3819B112
	,jns_8 = 0x3819B112
	}

skill取技能["悲悯"]={
	jns_1 = "佩戴“慈悲”时，造成的法术伤害提高(慈悲层数/1.5)%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x96670F08
	,jns_8 = 0x96670F08
	}
skill取技能["解惑"]={
	jns_1 = "使用唧唧歪歪后，你的谆谆教诲减少3回合冷却时间"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x3819B112
	,jns_8 = 0x3819B112
	}
skill取技能["持戒"]={
	jns_1 = "对气血值>70%的单位造成的法术伤害提高5%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x32BE260B
	,jns_8 = 0x32BE260B
}
skill取技能["生花"]={
	jns_1 = "渡世步等级≥人物等级时，增加60点法术伤害力"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x96670F08
	,jns_8 = 0x96670F08
	}
skill取技能["悟彻"]={
	jns_1 = "使用灵宝后你的谆谆教诲立即取消冷却回合"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x3819B112
	,jns_8 = 0x3819B112
	}
skill取技能["抚琴"]={
	jns_1 = "使用琴音三叠后，回复10点愤怒"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x32BE260B
	,jns_8 = 0x32BE260B
}
skill取技能["舍利"]={
	jns_1 = "死亡后，回复本方其他单位愤怒，数值为(因死亡损失的愤怒×0.65)，但回复后的愤怒不会超过120，每场战斗限1次。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x96670F08
	,jns_8 = 0x96670F08
	}
skill取技能["静气"]={
	jns_1 = "你的罗汉金钟所需愤怒减少15点"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x3819B112
	,jns_8 = 0x3819B112
	}
skill取技能["自在"]={
	jns_1 = "佛法无边不再消耗魔法值"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x32BE260B
	,jns_8 = 0x32BE260B
}

skill取技能["无量"]={
	jns_1 = "队伍中仅有1个化生寺弟子时:你带有佛法无边时，唧唧歪歪有35%几率重复释放一次"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x96670F08
	,jns_8 = 0x96670F08
	}
skill取技能["慧定"]={
	jns_1 = "佛法无边仅能对自己释放，但触发法术连击的几率增加20%，持续回合减少1"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x3819B112
	,jns_8 = 0x3819B112
	}
skill取技能["金刚"]={
	jns_1 = "增加80点防御"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x32BE260B
	,jns_8 = 0x32BE260B
}
skill取技能["达摩"]={
	jns_1 = "增加320点气血上限"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x96670F08
	,jns_8 = 0x96670F08
	}
skill取技能["韦陀"]={
	jns_1 = "增加30点速度"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x3819B112
	,jns_8 = 0x3819B112
	}
skill取技能["聚气"]={
	jns_1 = "每次使用非回复类辅助门派法术时，有15%概率使下一次恢复法术效果提升30%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x86873B99
	,jns_8 = 0x86873B99
	}
skill取技能["坐禅"]={
	jns_1 = "每带有1个增益状态，造成的法术伤害提高1%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x32BE260B
	,jns_8 = 0x32BE260B
	}
skill取技能["无量尊者"]={
	jns_1 = "增加40点法术伤害，获得无量尊者称谓"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x32BE260B
	,jns_8 = 0x32BE260B
}
skill取技能["波涛"]={
	jns_1 = "龙腾对玩家单位造成的伤害提高10%."
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x4714CA13
	,jns_8 = 0x4714CA13
	}
skill取技能["破浪"]={
	jns_1 = "每回合开始时，有33%几率使本回合所有造成的法术伤害提高6%、受到的法术伤害降低9%."
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA5F354BA
	,jns_8 = 0xA5F354BA
	}
skill取技能["云霄"]={
	jns_1 = "你的法术技能额外减少目标50点魔法值。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x8A3EF0F0
	,jns_8 = 0x8A3EF0F0
	}
skill取技能["逐浪"]={
	jns_1 = "当目标处于法术减免状态时，龙卷雨击造成的伤害增加(破浪诀等级×0.8)."
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x890B8397
	,jns_8 = 0x890B8397
	}
skill取技能["踏涛"]={
	jns_1 = "破浪诀等级≥人物等级时，增加60点法伤。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x45238FC3
	,jns_8 = 0x45238FC3
	}
skill取技能["清吟"]={
	jns_1 = "龙腾对当前魔法百分比<30%的玩家单位造成伤害后，使其受到的法术伤害增加15%，持续3回合。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA135A426
	,jns_8 = 0xA135A426
	}
skill取技能["天龙"]={
	jns_1 = "每3次使用技能都能激发龙宫弟子的潜力，使得下一次法术攻击时临时提升150法术伤害力。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x4DEF4B05
	,jns_8 = 0x4DEF4B05
	}
skill取技能["龙珠"]={
	jns_1 = "法宝“镇海珠”效果提高3.3%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF4F33841
	,jns_8 = 0xF4F33841
	}
skill取技能["龙骇"]={
	jns_1 = "任何门派伤害法术造成的伤害增加40点伤害结果。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xDFF0E26B
	,jns_8 = 0xDFF0E26B
	}
skill取技能["龙慑"]={
	jns_1 = "对召唤兽增加120点法术伤害结果。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA9FDF759
	,jns_8 = 0xA9FDF759
	}

skill取技能["傲翔"]={
	jns_1 = "队伍中只有一个龙宫弟子时:增加(魔力点数×9%)的法术伤害结果，减少(魔力点数×20%)的防御力。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA925D675
	,jns_8 = 0xA925D675
	}
skill取技能["飞龙"]={
	jns_1 = "受到大于等于气血上限20%的伤害都有75%的几率触发神龙摆尾技能。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x45A7F519
	,jns_8 = 0x45A7F519
	}
skill取技能["戏珠"]={
	jns_1 = "二龙戏珠冷却回合为8，任意技能击杀召唤兽后，下次释放二龙戏珠必额外触发─次龙卷雨击。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x4B2FA59C
	,jns_8 = 0x4B2FA59C
	}
skill取技能["回魔"]={
	jns_1 = "每回合回复魔法上限与当前灵力的差值的5%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xEE1C323A
	,jns_8 = 0xEE1C323A
	}
skill取技能["月魂"]={
	jns_1 = "增加防御200点。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xBF6B4C8C
	,jns_8 = 0xBF6B4C8C
	}
skill取技能["呼风"]={
	jns_1 = "对当前魔法百分比<30%的目标，增加5%法术暴击几率。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xBF6B4C8C
	,jns_8 = 0xBF6B4C8C
	}
skill取技能["唤雨"]={
	jns_1 = "造成的法术伤害增加(1-目标当前魔法÷目标魔法上限)×8%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x773514B8
	,jns_8 = 0x773514B8
	}
skill取技能["云变"]={
	jns_1 = "二龙戏珠额外减少目标（(带有异常状态数量x90)点魔法值。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x97C568AA
	,jns_8 = 0x97C568AA
	}
skill取技能["沐雨"]={
	jns_1 = "如果龙腾攻击后的目标魔法值为0，随机驱散其1个增益状态。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA925D675
	,jns_8 = 0xA925D675
	}
skill取技能["云龙真身"]={
	jns_1 = "增加80点防御,获得云龙真身称谓"
	,jns_3 = 4
	,jns_4 = "60点魔法"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x77EC444B
	,jns_8 = 0x77EC444B
	}
skill取技能["汹涌"]={
	jns_1 = "当目标处于法术减免状态下，忽视8%的减免效果。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x773514B8
	,jns_8 = 0x773514B8
	}
skill取技能["龙魄"]={
	jns_1 = "你的龙卷雨击有20%几率额外作用3个单位。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x97C568AA
	,jns_8 = 0x97C568AA
	}
skill取技能["摧意"]={
	jns_1 = "龙腾造成的伤害≥目标气血上限*20%时，减少目标300点魔法值。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x13DFE838
	,jns_8 = 0x13DFE838
	}
skill取技能["亢龙归海"]={
	jns_1 = "矫健的神龙翻腾四海的英姿很少有人目睹，而之后更无人能够道出其中的神威。使用龙腾连续攻击2次目标，每次造成龙腾伤害的95%，使用后休息1回合。"
	,jns_3 = 4
	,jns_4 = "200点魔法"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xCE07792D
	,jns_8 = 0xCE07792D
	,jns_12 = "6回合"
}
skill取技能["雷浪穿云"]={
	jns_1 = "当那天地间卷起的白浪与电闪中的云彩揉成一片，任谁都无力承担神龙见首不见尾的后续打击。对目标使用后，目标在5回合内受到的所有法术伤害提高30%，使用法术技能消耗魔法增加100%+30点。消耗：60点MP。"
	,jns_3 = 4
	,jns_4 = "60点魔法"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x77EC444B
	,jns_8 = 0x77EC444B
}

skill取技能["狂浪"]={
	jns_1 = "龙卷雨击有50%几率额外造成80点伤害"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x4714CA13
	,jns_8 = 0x4714CA13
	}
skill取技能["叱咤"]={
	jns_1 = "触发“龙魂”提高的伤害增加至9%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA5F354BA
	,jns_8 = 0xA5F354BA
	}
skill取技能["龙啸"]={
	jns_1 = "使用龙腾后，有20%几率使目标受到的法术伤害提高15%，持续3回合"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x8A3EF0F0
	,jns_8 = 0x8A3EF0F0
}
skill取技能["龙息"]={
	jns_1 = "每回合开始时，增加0.2%法术暴击几率，持续到战斗结束"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x4714CA13
	,jns_8 = 0x4714CA13
	}
skill取技能["骇浪"]={
	jns_1 = "击倒召唤兽后，下个龙卷雨击造成的伤害提高5%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA5F354BA
	,jns_8 = 0xA5F354BA
	}
skill取技能["月光1"]={
	jns_1 = "装备上的月亮石效果提高40%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x8A3EF0F0
	,jns_8 = 0x8A3EF0F0
}
skill取技能["斩浪"]={
	jns_1 = "如果场上可被你攻击的目标数恰好为7，你的龙卷雨击暴击几率增加7%(21%)。(括号里为与NPC战斗时的效果)"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x4714CA13
	,jns_8 = 0x4714CA13
	}
skill取技能["额外能力"]={
	jns_1 = "增加40点法术伤害"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA5F354BA
	,jns_8 = 0xA5F354BA
	}
skill取技能["海中蛟虬"]={
	jns_1 = "增加40点法术伤害，获得海中蛟虬称谓"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x8A3EF0F0
	,jns_8 = 0x8A3EF0F0
	}
skill取技能["傲岸"]={
	jns_1 = "“龙骇”的触发几率提高50%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x4714CA13
	,jns_8 = 0x4714CA13
	}
skill取技能["云魄"]={
	jns_1 = "带有“龙魂”时，“龙骇”的触发几率提高100%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA5F354BA
	,jns_8 = 0xA5F354BA
	}
skill取技能["雨魄"]={
	jns_1 = "“龙骇”的效果提高50%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x8A3EF0F0
	,jns_8 = 0x8A3EF0F0
}
skill取技能["盘龙"]={
	jns_1 = "每次触发“龙魂”后，“龙魂”的效果增加2%，持续到战斗结束。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x4714CA13
	,jns_8 = 0x4714CA13
	}
skill取技能["凛然"]={
	jns_1 = "每个“龙魂”或“龙骇”状态将临时增加你80点抵抗封印等级。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA5F354BA
	,jns_8 = 0xA5F354BA
	}
skill取技能["回灵"]={
	jns_1 = "“龙魂”和“龙骇”同时触发时，额外提高16%的伤害。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x8A3EF0F0
	,jns_8 = 0x8A3EF0F0
}
skill取技能["龙钩"]={
	jns_1 = "消耗“龙骇”的龙卷雨击有40%几率额外作用3个单位"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x4714CA13
	,jns_8 = 0x4714CA13
	}
skill取技能["睥睨"]={
	jns_1 = "带有“龙魂”时，回合结束时回复5点愤"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA5F354BA
	,jns_8 = 0xA5F354BA
}
skill取技能["惊鸿"]={
	jns_1 = "龙腾忽视12%的法术减免效果。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x4714CA13
	,jns_8 = 0x4714CA13
	}
skill取技能["潜龙在渊"]={
	jns_1 = "移除自身“龙魂”和“龙骇”状态，每个被移除状态使你获得1层以下对应增益，持续到战斗结束:龙魂:造成的法术伤害提高1%。龙骇:对应被增益的龙腾或龙卷雨击伤害提高2%。(不可驱散)"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x8A3EF0F0
	,jns_8 = 0x8A3EF0F0
	}
skill取技能["沧海潜龙"]={
	jns_1 = "增加40点法术暴击等级，获得沧海潜龙称谓。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA5F354BA
	,jns_8 = 0xA5F354BA
}
skill取技能["充沛"]={
	jns_1 = "你的牛劲效果增加20%且会附加“感知”状态。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x8A07409C
	,jns_8 = 0x8A07409C
	}
skill取技能["炙烤"]={
	jns_1 = "你的牛劲持续回合减少3，但使用时额外获得“炙烤”状态:提高20%的“神焰”基础触发几率，持续回合与牛劲相同。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xBAA64557
	,jns_8 = 0xBAA64557
	}
skill取技能["震怒1"]={
	jns_1 = "飞砂走石增加40点法术伤害结果。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x403FE10F
	,jns_8 = 0x403FE10F
	}
skill取技能["蚀天"]={
	jns_1 = "受到≥(气血上限×20%)的伤害则进入“蚀天”状态:造成的法术伤害增加15%，持续3回合。(不可叠加)"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xAC17A1D4
	,jns_8 = 0xAC17A1D4
	}
skill取技能["敛恨"]={
	jns_1 = "受到物理暴击、法术暴击伤害后，本次所受与后面所受到的所有伤害减少20%。当回合有效。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x6F367EF0
	,jns_8 = 0x6F367EF0
	}
skill取技能["赤暖"]={
	jns_1 = "使用三味真火将恢复气血，恢复效果为本次造成伤害#W//50。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x36BEA656
	,jns_8 = 0x36BEA656
	}
skill取技能["火神"]={
	jns_1 = "飞砂走石造成的伤害将额外增加火云术等级*1.5的伤害"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xBF44D568
	,jns_8 = 0xBF44D568
	}
skill取技能["震天"]={
	jns_1 = "震天诀等级≥人物等级时，增加60点法术伤害力。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x06B6105D
	,jns_8 = 0x06B6105D
	}
skill取技能["神焰"]={
	jns_1 = "增加五火神焰印6%的基础触发几率。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x9D84EC63
	,jns_8 = 0x9D84EC63
	}
skill取技能["神炎"]={
	jns_1 = "三味真火造成的伤害将受自身气血影响，气血越低，附加的伤害将越高"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xBF44D568
	,jns_8 = 0xBF44D568
	}
skill取技能["返火"]={
	jns_1 = "火甲术反馈的伤害效果增加70%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd3"
	,jns_7 = 0x013D6355
	,jns_8 = 0x013D6355
	}
skill取技能["崩摧"]={
	jns_1 = "每当敌方每次封印本方单位时，无论是否成功，你的风云变色有10%几率取消冷却时间。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x4935E53B
	,jns_8 = 0x4935E53B
	}
skill取技能["魔冥"]={
	jns_1 = "每次使用完飞砂走石，可以使你下次三昧真火或魔焰滔天造成的伤害提高3%(目标为人物则为9%),持续4回合,可叠加4层,层数提升时刷新时间"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x8BF70190
	,jns_8 = 0x8BF70190
	}
skill取技能["燃魂"]={
	jns_1 = "风云变色会使你下个法术造成的伤害增加12%，持续4回合。(不可驱散)。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x79602FB7
	,jns_8 = 0x79602FB7
	}
skill取技能["狂月"]={
	jns_1 = "装备上的月亮石效果提高40%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x0A9E4158
	,jns_8 = 0x0A9E4158
	}
skill取技能["威吓"]={
	jns_1 = "触发五火神焰印时，对召唤兽和召唤物伤害倍率增加42%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x3816E2FC
	,jns_8 = 0x3816E2FC
	}
skill取技能["连营"]={
	jns_1 = "你的摇头摆尾有30%几率对随机目标再使用—次摇头摆尾，但只造成40%的伤害，可重复触发。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x90EEA1F5
	,jns_8 = 0x90EEA1F5
	}
skill取技能["魔心"]={
	jns_1 = "增加50点法术暴击等级"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xDAA0F7D4
	,jns_8 = 0xDAA0F7D4
	}
skill取技能["魔焰滔天"]={
	jns_1 = "为了能给敌人造成更大的伤害，魔王寨的弟子是不怕赌上自己运气的。使用法术攻击目标，70%几率造成三昧真火法术伤害×175%，30%几率造成三昧真火法术伤害×25%。不受佛法无边影响。冷却6回合,战斗开始时有3回合冷却时间"
	,jns_3 = 4
	,jns_4 = "60点魔法"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x525B9DB0
	,jns_8 = 0x525B9DB0
	}
skill取技能["烈焰真诀"]={
	jns_1 = "烈焰缠身，此时他们不再是普通的魔王寨弟子，他们具有更强大的法术暴击能力。使用后增加10%的魔法暴击率。持续4回合。"
	,jns_3 = 66
	,jns_4 = "50点魔法"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x1299A579
	,jns_8 = 0x1299A579
	,jns_12 = "5回合"
}
skill取技能["激怒"]={
	jns_1 = "回合开始时，有10%几率进入“蚀天”状态:造成的法术伤害增加15%，持续4回合。(不可叠加)"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x8A07409C
	,jns_8 = 0x8A07409C
	}
skill取技能["邪火"]={
	jns_1 = "三昧真火伤害提高4%，且目标处于休息状态时额外提高20%(300%)。(括号里为目标为NPC时的效果)"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xBAA64557
	,jns_8 = 0xBAA64557
	}
skill取技能["真炎"]={
	jns_1 = "三昧真火与飞砂走石有10%几率伤害提高30%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x403FE10F
	,jns_8 = 0x403FE10F
}
skill取技能["魔焱"]={
	jns_1 = "使用风云变色后，获得“炙烤”状态:提高20%的“神焰”基础触发几率，持续4回合。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x403FE10F
	,jns_8 = 0x403FE10F
	}
skill取技能["焚尽"]={
	jns_1 = "自身武器或者衣服五行为火时，法术暴击几率增加4%。(可叠加)"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x8A07409C
	,jns_8 = 0x8A07409C
	}
skill取技能["咆哮"]={
	jns_1 = "每层魔冥的效果增加至7%(目标为玩家单位时增加至21%)"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xBAA64557
	,jns_8 = 0xBAA64557
	}
skill取技能["额外能力"]={
	jns_1 = "增加40点法术伤害"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x403FE10F
	,jns_8 = 0x403FE10F
}
skill取技能["平天大圣"]={
	jns_1 = "增加40点法术伤害，获得平天大圣称谓"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x8A07409C
	,jns_8 = 0x8A07409C
	}
skill取技能["烈焰"]={
	jns_1 = "受到≥气血上限20%的伤害则进入“炙烤”状态:提高20%的“神焰”基础触发几率，持续3回合。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xBAA64557
	,jns_8 = 0xBAA64557
	}
skill取技能["折服"]={
	jns_1 = "触发“神焰”时，三昧真火会随机驱散目标一个增益状态、飞砂走石25%几率随机驱散目标一个增益状态。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x403FE10F
	,jns_8 = 0x403FE10F
}
skill取技能["焰威"]={
	jns_1 = "触发“神焰”时，回复3点愤怒;此效果每回合仅触发1次"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x8A07409C
	,jns_8 = 0x8A07409C
	}
skill取技能["狂劲"]={
	jns_1 = "你的摇头摆尾触发“神焰”的几率提高8%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xBAA64557
	,jns_8 = 0xBAA64557
	}
skill取技能["升温"]={
	jns_1 = "你每点消耗的灵元，会增加“神焰”6%的基础伤害倍率，持续到战斗结束"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x403FE10F
	,jns_8 = 0x403FE10F
}
skill取技能["盖世魔君"]={
	jns_1 = "增加80点防御，获得盖世魔君称谓"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x8A07409C
	,jns_8 = 0x8A07409C
	}
skill取技能["五蕴神焰"]={
	jns_1 = "牛魔王的秘传法术之一，修炼至极致的丹田元气，威力非普通的三昧真火可比拟。对单个敌方目标造成极高的法术伤害"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xBAA64557
	,jns_8 = 0xBAA64557
	}
skill取技能["烈火真言"]={
	jns_1 = "【被动】进入战斗后，随机获得一个“秘传法术”:替换你的三昧真火为五蕴神焰，或替换你的飞砂走石为漫卷狂沙;其冷却回合皆增加至10回合。【主动】通过刻苦的练习，能够在战斗中灵活的切换激活的秘传法术，但切换后秘传法术会立即进入冷却。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x403FE10F
	,jns_8 = 0x403FE10F
}

skill取技能["漫卷狂沙"]={
	jns_1 = "牛魔王的秘传法术之一，可以卷起狂风砂石，甚至可以摧毁山峰。施放一次强力的飞砂走石。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x8A07409C
	,jns_8 = 0x8A07409C
	}
skill取技能["极炙"]={
	jns_1 = "五蕴神焰有20%几率额外造成25%的伤害。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xBAA64557
	,jns_8 = 0xBAA64557
	}
skill取技能["咒言"]={
	jns_1 = "使用三昧真火、飞砂走石后，秘传技能冷却回合减少1。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x403FE10F
	,jns_8 = 0x403FE10F
}

skill取技能["摧山"]={
	jns_1 = "漫卷狂沙的伤害提高5%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x8A07409C
	,jns_8 = 0x8A07409C
	}
skill取技能["倍燃"]={
	jns_1 = "触发“神焰”时，五蕴神焰与漫卷狂沙伤害倍率增加20%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xBAA64557
	,jns_8 = 0xBAA64557
	}
skill取技能["震天"]={
	jns_1 = "震天诀等级≥人物等级时，增加60点法术伤害力。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x403FE10F
	,jns_8 = 0x403FE10F
}
skill取技能["融骨"]={
	jns_1 = "五蕴神焰会随机驱散目标一个增益状态;漫卷狂沙有25%几率随机驱散目标一个增益状态。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x8A07409C
	,jns_8 = 0x8A07409C
	}
skill取技能["不灭"]={
	jns_1 = "每次使用五蕴神焰或漫卷狂沙，都会使本场战斗中五蕴神焰和漫卷狂沙伤害永久增加1%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xBAA64557
	,jns_8 = 0xBAA64557
	}
skill取技能["烬藏"]={
	jns_1 = "使用原始愤怒消耗≥120点的特技后，秘传技能减少1回合冷却时间。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x403FE10F
	,jns_8 = 0x403FE10F
}
skill取技能["固基"]={
	jns_1 = "五蕴神焰或漫卷狂沙基础冷却回合减少1回合。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x8A07409C
	,jns_8 = 0x8A07409C
	}
skill取技能["惊悟"]={
	jns_1 = "使用五蕴神焰或漫卷狂沙后，有50%几率永久减少基础冷却回合1回合，每场战斗最多触发2次。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xBAA64557
	,jns_8 = 0xBAA64557
	}
skill取技能["旋阳"]={
	jns_1 = "每消耗1点灵元，五蕴神焰或漫卷狂沙冷却回合减少2。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x403FE10F
	,jns_8 = 0x403FE10F
}
skill取技能["风火燎原"]={
	jns_1 = "聆听牛魔王的秘传之咒，让魔王的意志降临于你。获得持续5回合的“牛劲”和“风火燎原”状态。风火燎原:回合结束时，五蕴神焰或漫卷狂沙冷却时间减少1。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xBAA64557
	,jns_8 = 0xBAA64557
	}
skill取技能["风火妖王"]={
	jns_1 = "增加40点法术暴击等级，获得风火妖王称谓。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x403FE10F
	,jns_8 = 0x403FE10F
}

skill取技能["自矜"]={
	jns_1 = "每次使用单体封印技能失败时，使得下次单体封印时成功率提高30%。到下一次命中时清空该效果。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x22A77A43
	,jns_8 = 0x22A77A43
	}
skill取技能["暗伤"]={
	jns_1 = "雨落寒沙增加武器伤害*18%的固定伤害。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x50E3D938
	,jns_8 = 0x50E3D938
	}
skill取技能["杏花"]={
	jns_1 = "使用雨落寒沙技能攻击时对方将有4%几率中毒。并且能对带有“高级毒”的单位起效。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x30B186DD
	,jns_8 = 0x30B186DD
	}
skill取技能["花舞"]={
	jns_1 = "每回合开始时提升自身6%的初始速度,持续到战斗结束。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xD5669AE4
	,jns_8 = 0xD5669AE4
	}
skill取技能["倩影"]={
	jns_1 = "提升自己50点速度。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x86C6B8EF
	,jns_8 = 0x86C6B8EF
	}
skill取技能["淬芒"]={
	jns_1 = "每次你使敌方中暗器毒，都可以为自己增加8%的封印命中率，效果持续3回合。(上限为16%，回合数可被刷新) "
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x20661796
	,jns_8 = 0x20661796
	}
skill取技能["傲娇"]={
	jns_1 = "使用特技时，愤怒消耗减少5点。使用笑里藏刀时，愤怒消耗额外减少6点。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x53DABF54
	,jns_8 = 0x53DABF54
	}
skill取技能["花护"]={
	jns_1 = "使用水清诀、冰清诀、晶清诀、玉清诀时，愤怒消耗减少8点，并且可以使目标100%抵抗封类法术，持续一回合。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xC412A4C0
	,jns_8 = 0xC412A4C0
	}
skill取技能["天香"]={
	jns_1 = "每次使用暗器让对方中毒，你回复5点愤怒。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x2AD7F908
	,jns_8 = 0x2AD7F908
	}
skill取技能["国色"]={
	jns_1 = "召唤兽进入战斗时速度增加12%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x0D719443
	,jns_8 = 0x0D719443
	}
skill取技能["鸿影"]={
	jns_1 = "若处于被封印状态，仍然可以使用雨落寒沙技能。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x25260F44
	,jns_8 = 0x25260F44
	}
skill取技能["轻霜"]={
	jns_1 = "任何企图攻击你的对手都有30%在攻击时受到毒的影响，每回合损失毒经技能等级*3的气血，持续4回合，该状态不可叠加。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x848E3B4F
	,jns_8 = 0x848E3B4F
}
skill取技能["机巧"]={
	jns_1 = "每次你的封印成功时，敌方会受到毒的影响，每回合损失毒经技能等级*3的气血，持续4回合，该状态不可叠加。（仅封印回合有效）"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xE6EF1BBC
	,jns_8 = 0xE6EF1BBC
}
skill取技能["毒引"]={
	jns_1 = "雨落寒沙增加10%中毒概率。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x57BD8D19
	,jns_8 = 0x57BD8D19
}
skill取技能["毒雾"]={
	jns_1 = "使用封印技能时，有30%几率使目标中毒。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA3E0CA7F
	,jns_8 = 0xA3E0CA7F
}
skill取技能["嫣然"]={
	jns_1 = "一笑倾城和似玉生香的命中率提高12%，对每个目标的持续回合有60%的几率提升1回合。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x463DBA13
	,jns_8 = 0x463DBA13
}
skill取技能["磐石"]={
	jns_1 = "坚如磐石 ,进入战斗后增加人物防御和魔法防御50点。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x4F264E2A
	,jns_8 = 0x4F264E2A
}
skill取技能["花殇"]={
	jns_1 = "飞花摘叶目标作用人数增加6"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x3590A7E4
	,jns_8 = 0x3590A7E4
	}
skill取技能["碎玉弄影"]={
	jns_1 = "“宁为玉碎，不为瓦全”，又有多少敌方可以从女儿村弟子曼妙的舞姿身影中体味那─份决绝呢?连续对敌方使用2次似玉生香。【冷却】5回合"
	,jns_3 = 4
	,jns_4 = "40点愤怒"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x347D755D
	,jns_8 = 0x347D755D
	,jns_12 = "5回合"
}
skill取技能["葬玉焚花"]={
	jns_1 = "一舞残花渐落,一念神消魂断。飞花化作无影利器,穿梭敌人之间。【功效】对4个目标造成物理伤害。"
	,jns_3 = 4
	,jns_4 = "(20*作用目标数+10)点魔法"
	,jns_5 = "清歌妙舞技能达到20级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 1442840576
	,jns_8 = 1442840576
}
skill取技能["额外能力"]={
	jns_1 = "学习“碎玉弄影”以后，每个额外乾元丹会增加40点封印命中等级，学习“鸿渐于陆”以后，每个额外的乾元丹会增加80点抵抗封妖等级。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA209C3C2
	,jns_8 = 0xA209C3C2
	}
skill取技能["鸿渐于陆"]={
	jns_1 = "伤其十指，不如断其一指。必要的时刻可以将伤害凝聚起来，给予对手一次致命的攻击。附加武器伤害*130%的伤害对对手单体进行攻击，使目标有100%率中毒。"
	,jns_3 = 4
	,jns_4 = "100点魔法"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x18D93692
	,jns_8 = 0x18D93692
	,jns_12 = "4回合"
}
skill取技能["独尊"]={
	jns_1 = "你的自矜触发几率增加至100%，但你的暗器附加毒的几率减少4%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x22A77A43
	,jns_8 = 0x22A77A43
	}
skill取技能["重明"]={
	jns_1 = "自矜状态下使用单体封印法术命中目标时，有45%几率不清空该状态，但你的暗器附加毒的几率减少4%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x50E3D938
	,jns_8 = 0x50E3D938
}

skill取技能["风行"]={
	jns_1 = "进入战斗后，队伍中所有玩家单位的速度增加8点。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x22A77A43
	,jns_8 = 0x22A77A43
	}
skill取技能["空灵"]={
	jns_1 = "使用特技后，自身抵抗封印几率临时增加12%，持续2回合。(状态可刷新，不可叠加)"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x50E3D938
	,jns_8 = 0x50E3D938
	}
skill取技能["叶护"]={
	jns_1 = "自己的速度高于同队其他玩家时，受到的所有伤害降低2%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x30B186DD
	,jns_8 = 0x30B186DD
	}
skill取技能["娉婷袅娜"]={
	jns_1 = "令对手一定回合无法使用装备特技、物理攻击和法宝,"
	,jns_3 = 4
	,jns_4 = "40点魔法"
	,jns_5 = "女儿村经脉技能"
	,jns_6 = "wzife.wdf"
	,jns_7 = 1562829683
	,jns_8 = 2704552245
	}
skill取技能["抑怒"]={
	jns_1 = "娉婷袅娜的命中率增加10%，同时增加10%的命中率上限。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x22A77A43
	,jns_8 = 0x22A77A43
	}
skill取技能["倾国"]={
	jns_1 = "—笑倾城对所有目标的命中率增加8%,但有8回合的冷却时间。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x50E3D938
	,jns_8 = 0x50E3D938
	}
skill取技能["绝代妖娆"]={
	jns_1 = "增加40点封印命中等级，获得绝代妖娆称谓。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x30B186DD
	,jns_8 = 0x30B186DD
}
skill取技能["涂毒"]={
	jns_1 = "敌方没有任何单位带有暗器毒时，使用暗器时攻击使敌方中毒几率增加6%;你的封印命中率下降10%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x22A77A43
	,jns_8 = 0x22A77A43
	}
skill取技能["暗刃"]={
	jns_1 = "对带有暗器毒的玩家单位，造成的暗器伤害提高15%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x50E3D938
	,jns_8 = 0x50E3D938
	}
skill取技能["天香"]={
	jns_1 = "每次使敌方中暗器毒，你回复6点愤怒。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x30B186DD
	,jns_8 = 0x30B186DD
}
skill取技能["百花"]={
	jns_1 = "雨落寒沙有9%几率额外作用3人。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x22A77A43
	,jns_8 = 0x22A77A43
	}
skill取技能["余韵"]={
	jns_1 = "带有你的暗器毒的单位，每回合额外减少30点魔法值。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x50E3D938
	,jns_8 = 0x50E3D938
	}
skill取技能["飞花"]={
	jns_1 = "飞花摘叶吸取魔法的效果提高200%，但具有8回合冷却。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x30B186DD
	,jns_8 = 0x30B186DD
}
skill取技能["花雨伊人"]={
	jns_1 = "增加80点抵抗封印等级，获得花雨伊人称谓。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x22A77A43
	,jns_8 = 0x22A77A43
	}
skill取技能["花刺"]={
	jns_1 = "“自矜”追加的伤害提高20%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x50E3D938
	,jns_8 = 0x50E3D938
	}
skill取技能["花骨"]={
	jns_1 = "进入战斗和攻击击飞目标后，获得“自矜”状态。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x30B186DD
	,jns_8 = 0x30B186DD
}
skill取技能["汹涌"]={
	jns_1 = "“自矜”触发几率增加15%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x22A77A43
	,jns_8 = 0x22A77A43
	}
skill取技能["花落"]={
	jns_1 = "葬玉焚花的伤害结果提高4%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x50E3D938
	,jns_8 = 0x50E3D938
	}
skill取技能["花开"]={
	jns_1 = "当前气血≥90%时，造成的物理伤害提高3%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x30B186DD
	,jns_8 = 0x30B186DD
}

skill取技能["花雨"]={
	jns_1 = "使用满天花雨时，附加毒的几率增加5%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x22A77A43
	,jns_8 = 0x22A77A43
	}
skill取技能["毒芒"]={
	jns_1 = "对带由女儿村弟子产生的毒的目标，葬玉焚花造成伤害提高8%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x50E3D938
	,jns_8 = 0x50E3D938
	}
skill取技能["追毒"]={
	jns_1 = "对带由女儿村弟子产生的毒的目标，自矜追加伤害提高12%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x30B186DD
	,jns_8 = 0x30B186DD
}
skill取技能["曼珠"]={
	jns_1 = "佩戴“曼陀罗”时，触发自矜的几率增加20%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x22A77A43
	,jns_8 = 0x22A77A43
	}
skill取技能["清澈"]={
	jns_1 = "“自矜”状态下，抵抗封印能力增加10%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x50E3D938
	,jns_8 = 0x50E3D938
	}
skill取技能["淬毒"]={
	jns_1 = "使用喑器或雨落寒沙时，目标中毒几率增加1%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x30B186DD
	,jns_8 = 0x30B186DD
}

skill取技能["怒放"]={
	jns_1 = "进入“自矜”状态时，额外回复6点愤"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x22A77A43
	,jns_8 = 0x22A77A43
	}
skill取技能["驯宠"]={
	jns_1 = "葬玉焚花攻击召唤兽时，伤害结果提高12%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x50E3D938
	,jns_8 = 0x50E3D938
	}
skill取技能["乘胜"]={
	jns_1 = "对气血≤30%的单位，追加攻击造成的伤害提高10%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x30B186DD
	,jns_8 = 0x30B186DD
}
skill取技能["痴念"]={
	jns_1 = "满天花雨对神佑过的召唤兽伤害结果提高20%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x22A77A43
	,jns_8 = 0x22A77A43
	}
skill取技能["花谢花飞"]={
	jns_1 = "连续使用2次满天花雨攻击目标。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x50E3D938
	,jns_8 = 0x50E3D938
	}
skill取技能["花间美人"]={
	jns_1 = "增加40点伤害，获得花间美人称谓。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x30B186DD
	,jns_8 = 0x30B186DD
}
skill取技能["鼓乐"]={
	jns_1 = "魔音摄魂的命中率增加20%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xC17A7A56
	,jns_8 = 0xC17A7A56
	}
skill取技能["妖气"]={
	jns_1 = "增加武器伤害*12%的封印命中等级。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xB3956495
	,jns_8 = 0xB3956495
	}
skill取技能["怜心"]={
	jns_1 = "姐妹同心的命中率增加12%。队伍中只有一个盘丝洞弟子时：每场战斗的第一次姐妹同心必中。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x38D87BEB
	,jns_8 = 0x38D87BEB
	}
skill取技能["迷瘴"]={
	jns_1 = "使用含情脉脉命中目标后，吸取目标5项属性中最高项所对应的主能力4%给自己，持续5回合。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x661970E1
	,jns_8 = 0x661970E1
	}
skill取技能["粘附"]={
	jns_1 = "与NPC战斗时，若自身敏捷≥等级×3或力量≥等级×3，增加(武器伤害×18%)的天罗地网伤害，且普通攻击和特技对带有你天罗地网的敌方单位造成的物理伤害提高50%."
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xD2180C25
	,jns_8 = 0xD2180C25
	}
skill取技能["迷障"]={
	jns_1 = "天罗地网异常状态命中率增加20%，同时增加10%的命中率上限;且额外减少目标5%速度、(等级×1.5)的伤害力、法术伤害力。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xD2180C25
	,jns_8 = 0xD2180C25
	}
skill取技能["安抚"]={
	jns_1 = "回合结束时，每个带有你的“含情脉脉”“魔音摄魂”状态的单位会为你回复4点愤怒。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x756CE723
	,jns_8 = 0x756CE723
	}
skill取技能["忘忧"]={
	jns_1 = "成功封印目标后，每回合开始时目标减少90点魔法值，直到封印解除。若因此效果导致魔法值为0，则额外受到(目标等级×4)的气血伤害。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x59ED800F
	,jns_8 = 0x59ED800F
	}
skill取技能["忘川"]={
	jns_1 = "你的“瘴气”的持续回合数增加3。当目标带有“瘴气”效果时，含情脉脉、魔音摄魂增加10%封印命中率及命中率上限。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xBAA9AF30
	,jns_8 = 0xBAA9AF30
	}
skill取技能["迷梦"]={
	jns_1 = "每当你被他人封印或封印他人时，若敌方未带有“瘴气”效果，则60%几率对其附加“瘴气”效果。(需已习得瘴气法术)"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xD713CFD8
	,jns_8 = 0xD713CFD8
	}
skill取技能["倾情"]={
	jns_1 = "使用姐妹同心成功后，如果目标的魔法值为0，则有50%的几率额外施放一次含情脉脉技能。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF28C8F12
	,jns_8 = 0xF28C8F12
	}
skill取技能["情劫"]={
	jns_1 = "带有“瘴气”的目标在解除“瘴气”时获得的气血回复受“瘴气”影响;被你封印的目标在解除封印时获得的气血回复降低100%."
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x949B1634
	,jns_8 = 0x949B1634
	}
skill取技能["脱壳"]={
	jns_1 = "自身所受到敌方任意持续回合≥5的负面持续性法术时，持续回合变为5回合。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xFF0081A3
	,jns_8 = 0xFF0081A3
	}
skill取技能["迷意"]={
	jns_1 = "带有“瘴气”的目标受到的回魔效果降低30%并且回合开始时减少40点魔法值。使用魔音摄魂命中目标时，目标不能回复魔法值。(当与其他封印效果叠加时，回魔效果变为40%。)"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x1A6D023E
	,jns_8 = 0x1A6D023E
	}
skill取技能["结阵"]={
	jns_1 = "敌方阵营所有玩家单位每回合结束损失2点速度。(降低的总速度不会超过初始速度的20%)"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x93AE3E78
	,jns_8 = 0x93AE3E78
	}
skill取技能["媚态"]={
	jns_1 = "你的勾魂、摄魄必定命中；你使用瘴气时，清除目标身上的寡欲令。"
	,jns_3 = 8
	,jns_6 = "wzife.wd3"
	,jns_7 = 0x26A40C6E
	,jns_8 = 0x26A40C6E
	}
skill取技能["利刃"]={
	jns_1 = "敌方所有单位每回合结束时减少30点魔法值。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x8282C7D1
	,jns_8 = 0x8282C7D1
	}
skill取技能["落花成泥"]={
	jns_1 = "靡靡之音进入敌人耳际，使目标下回合彷徨不知所措、额外受到24%伤害，同时100%几率无法进行除灵宝以外的任何行动。(不受化生寺门派特色影响)"
	,jns_3 = 4
	,jns_4 = "20点愤怒,冷却4回合"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x4D94B673
	,jns_8 = 0x4D94B673
	}
skill取技能["偷龙转凤"]={
	jns_1 = "这是集天地玄妙的大成之技，修习此技，不仅要有绝代风华的女儿身，更要有一颗玲珑剔透的七窍心。对目标施法后（只能是队友或自己），目标立刻损失所有魔法值，但在回合结束时会获得损失魔法值的10%，持续8回合。消耗：80点愤怒。冷却回合：8回合。（该技能为法术技能，受封印法术限制。）"
	,jns_3 = 3
	,jns_4 = "80点愤怒"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xC3BF2DE7
	,jns_8 = 0xC3BF2DE7
	,jns_9 = "8回合"
}
skill取技能["魔音"]={
	jns_1 = "受到处于“魔音摄魂”状态单位的伤害降低16%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xC17A7A56
	,jns_8 = 0xC17A7A56
	}
skill取技能["玲珑"]={
	jns_1 = "“忘情”额外增加效果:受到伤害时，有30%几率减少12%伤害并回复自身10点愤怒。(触发时消耗1点灵气)"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xB3956495
	,jns_8 = 0xB3956495
	}
skill取技能["丹香"]={
	jns_1 = "使用三级药品后，回复1点愤怒。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x38D87BEB
	,jns_8 = 0x38D87BEB
}

skill取技能["连绵"]={
	jns_1 = "你的“瘴气”持续回合数增加4。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xC17A7A56
	,jns_8 = 0xC17A7A56
	}
skill取技能["绝殇"]={
	jns_1 = "带有“瘴气”的目标回合结束时减少1点愤怒。你的瘴气、魔音摄魂使用的当前回合无法被晶清诀、玉清诀解除。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xB3956495
	,jns_8 = 0xB3956495
	}
skill取技能["幻境"]={
	jns_1 = "你的幻镜术转移目标由随机单位变为30%几率随机到施法者。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x38D87BEB
	,jns_8 = 0x38D87BEB
}
skill取技能["绝媚"]={
	jns_1 = "你的勾魂、摄魄必定命中，且技能效果增加80%，冷却时间8回合。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xC17A7A56
	,jns_8 = 0xC17A7A56
	}
skill取技能["额外能力"]={
	jns_1 = "增加80点法术防御。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xB3956495
	,jns_8 = 0xB3956495
	}
skill取技能["风华舞圣"]={
	jns_1 = "增加80点法术防御，获得风华舞圣称谓。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x38D87BEB
	,jns_8 = 0x38D87BEB
}
skill取技能["绝媚"]={
	jns_1 = "你的勾魂、摄魄必定命中，且技能效果增加80%，冷却时间8回合。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xC17A7A56
	,jns_8 = 0xC17A7A56
	}
skill取技能["意乱"]={
	jns_1 = "你的瘴气作用人数调整为(迷情人法等级÷20+1)，但持续回合数减少1。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xB3956495
	,jns_8 = 0xB3956495
	}
skill取技能["魔瘴"]={
	jns_1 = "姐妹同心对带有“瘴气”效果的目标效果增加12%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x38D87BEB
	,jns_8 = 0x38D87BEB
}

skill取技能["迷情妖姬"]={
	jns_1 = "增加30点速度，获得迷情妖姬称谓。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xC17A7A56
	,jns_8 = 0xC17A7A56
	}
skill取技能["杀戮"]={
	jns_1 = "攻击带有“天罗地网”的单位时，造成的物理伤害提高8%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xB3956495
	,jns_8 = 0xB3956495
	}
skill取技能["罗网"]={
	jns_1 = "你的普通攻击伤害提高10%，且有70%几率使目标附加“天罗地网”状态。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x38D87BEB
	,jns_8 = 0x38D87BEB
}

skill取技能["天网"]={
	jns_1 = "千蛛噬魂每次攻击都有3%几率对目标附加“天罗地网”状态（已有该状态则刷新为4回合)。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xC17A7A56
	,jns_8 = 0xC17A7A56
}
skill取技能["凌弱"]={
	jns_1 = "物理攻击负面状态数量≥2的目标时，伤害力增加80点"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xB3956495
	,jns_8 = 0xB3956495
}
skill取技能["制怒"]={
	jns_1 = "破血狂攻对带有“天罗地网”的单位使用后，你回复12点愤怒。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x38D87BEB
	,jns_8 = 0x38D87BEB
}
skill取技能["狂击"]={
	jns_1 = "使用千蛛噬魂时，物理暴击几率增加10%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x38D87BEB
	,jns_8 = 0x38D87BEB
	}
skill取技能["千蛛"]={
	jns_1 = "千蛛噬魂对召唤兽的伤害结果提高30%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x38D87BEB
	,jns_8 = 0x38D87BEB
	}
skill取技能["引诛"]={
	jns_1 = "蛛丝缠绕对玩家单位造成的伤害提高8%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x38D87BEB
	,jns_8 = 0x38D87BEB
}----
-------------------------
skill取技能["附骨"]={
	jns_1 = "你的天罗地网有30%几率不会被玉清诀、晶清诀解除。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xC17A7A56
	,jns_8 = 0xC17A7A56
	}
skill取技能["亡缚"]={
	jns_1 = "增加50点物理暴击等级。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xB3956495
	,jns_8 = 0xB3956495
	}
skill取技能["罗刹"]={
	jns_1 = "佩戴法宝“忘情”时:对带有你“天罗地网”状态的单位伤害结果提高5%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x38D87BEB
	,jns_8 = 0x38D87BEB
	}
skill取技能["障眼"]={
	jns_1 = "回合结束时若敌方单位带有“瘴气”，该单位来自你的“天罗地网”状态有30%几率延长1回合。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xC17A7A56
	,jns_8 = 0xC17A7A56
	}
skill取技能["牵魂蛛丝"]={
	jns_1 = "对目标附加持续1回合的“天罗地网”状态，随后对所有带有你“天罗地网”的单位发动1次攻击。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xB3956495
	,jns_8 = 0xB3956495
	}
skill取技能["感念"]={
	jns_1 = "减免来自带有“天罗地网”状态单位4%的伤害结果。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x38D87BEB
	,jns_8 = 0x38D87BEB
}
skill取技能["绝命毒牙"]={
	jns_1 = "对目标发动一次致命攻击。1）对目标造成125%的伤害;2)激发目标身上的“天罗地网”状态，提高（(天罗地网剩余回合数×10%)的伤害。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xB3956495
	,jns_8 = 0xB3956495
	}
skill取技能["百媚魔姝"]={
	jns_1 = "增加80点抵抗封印等级，获得百媚魔姝称谓。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x38D87BEB
	,jns_8 = 0x38D87BEB
}
skill取技能["化戈"]={
	jns_1 = "普渡众生气血回复效果增加(武器伤害×18%)"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x8FE4B9FF
	,jns_8 = 0x8FE4B9FF
	}
skill取技能["推衍"]={
	jns_1 = "与NPC战斗时，增加50点五行法术伤害和40点治疗能力。。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x7D712683
	,jns_8 = 0x7D712683
	}
skill取技能["借灵"]={
	jns_1 = "武器伤害的24%转化为五行法术伤害。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x9C0D1C5B
	,jns_8 = 0x9C0D1C5B
	}
skill取技能["莲花心音"]={
	jns_1 = "普陀弟子以莲花苞为躯，引魂入体，则可以复活在战斗中死亡的鬼魂幻兽。复活场上—个处于死亡状态的鬼魂宠，被复活目标获得60%的气血上限与当前48%的魔法。"
	,jns_3 = 3
	,jns_4 = "60点魔法"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x07DEBF4F
	,jns_8 = 0x07DEBF4F
	}
skill取技能["生克"]={
	jns_1 = "队伍内成员的五行克制能力增加4%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x1C454D91
	,jns_8 = 0x1C454D91
	}
skill取技能["默诵"]={
	jns_1 = "紧箍咒造成的伤害增加100%，同时如果目标处于紧箍咒时每回合结束时增加自身6点愤怒。持续时间增加3回合"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x6AB318F7
	,jns_8 = 0x6AB318F7
	}
skill取技能["劳心"]={
	jns_1 = "当前气血≤气血上限*30%时，使用普渡众生或者杨柳甘露技能带来的气血恢复效果额外增加100%。当回合与首选目标有效"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x00B8064E
	,jns_8 = 0x00B8064E
	}
skill取技能["普渡"]={
	jns_1 = "“普渡”基础几率增加20%且“普渡”会对紧箍咒起效。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x9110FB84
	,jns_8 = 0x9110FB84
	}
skill取技能["化怨"]={
	jns_1 = "当前气血≤气血上限*30%时，受到的所有伤害减少25%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xBBC8F2A2
	,jns_8 = 0xBBC8F2A2
	}
skill取技能["甘露"]={
	jns_1 = "对目标使用杨柳甘露法术成功时，有50%的几率附带普渡众生效果4回合。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xAF6FDE97
	,jns_8 = 0xAF6FDE97
	}
skill取技能["法印"]={
	jns_1 = "颠倒五行法术吸收几率与上限增加10%、躲避率增加8%，持续回合数增加3。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x4B145B23
	,jns_8 = 0x4B145B23
	}
skill取技能["秘术"]={
	jns_1 = "使用五行法术时，若目标气血上限被降低至0则立即死亡，当回合不能被复活。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF109AB4C
	,jns_8 = 0xF109AB4C
	}
skill取技能["灵动"]={
	jns_1 = "灵动九天效果增加30点，持续回合数增加2。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x4DCD5F44
	,jns_8 = 0x4DCD5F44
	}
skill取技能["雨润"]={
	jns_1 = "当本方玩家单位的“普渡众生”被驱散时，目标获得当前气血回复，效果等同于自在心法结算效果的80%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x4290BCBB
	,jns_8 = 0x4290BCBB
	}
skill取技能["莲心剑意"]={
	jns_1 = "普陀山的弟子情系众生、虔心不染，如—朵莲花绽放在凡尘中。但江湖险恶、妖风魔雨，为了护佑苍生，她们也不得不常怀剑意，惩恶除奸。使用此法术后进入进攻状态，增加(法术修炼等级x百分之三 )的固定伤害结果(只对首目标有效)，降低10%的回复效果。"
	,jns_3 = 5
	,jns_4 = "30点MP"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xC2D6BBD3
	,jns_8 = 0xC2D6BBD3
	}
skill取技能["玉帛"]={
	jns_1 = "护法金刚技能所为人物增加伤害的8%转化为普渡众生气血恢复效果。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA96E7A76
	,jns_8 = 0xA96E7A76
	}
skill取技能["道衍"]={
	jns_1 = "队伍中只有一个普陀山弟子时:你的自在心法效果提高(N×6%)，并为目标附加一个持续N回合的“普度众生”，N为我方带有“普度众生”的单位数。(回合数不超过8)"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xCE18F021
	,jns_8 = 0xCE18F021
	}
skill取技能["法咒"]={
	jns_1 = "五行法术有15%的几率对目标造成1.5倍的暴击效果;“莲心剑意”状态下，首目标触发率增加至40%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x2A398778
	,jns_8 = 0x2A398778
	}
skill取技能["波澜不惊"]={
	jns_1 = "普陀山弟子由于精通五行造化，方可布下这吸收一切伤害的结界阵法。为目标吸收受到的前4次攻击的伤害，持续2回合;并且将吸收的伤害转化为目标的当前气血回复，最高可吸收(普度众生首回合治疗量×2)点气血伤害。这亦是五行学派的不传之秘，只有核心弟子方能习得。"
	,jns_3 = 3
	,jns_4 = "60点魔法"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xAED0F931
	,jns_8 = 0xAED0F931
	}
skill取技能["五行制化"]={
	jns_1 = "普陀弟子可以在临敌之际运用五行之力，其所耗不过一个手印口诀，而随之而来的自然生克之力却往往令人绝望。你的“颠倒五行”获得下述加成:1)法术躲避率增加15%;2）带有该状态的单位不会被五行克制;3)持续回合数增加3。"
	,jns_3 = 3
	,jns_4 = "70点魔法"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF46EB09D
	,jns_8 = 0xF46EB09D
	,jns_12 = "6回合"
}

skill取技能["普照"]={
	jns_1 = "每有一个本方单位带有“普渡众生”，你增加15点防御和法术防御。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA0000227
	,jns_8 = 0xA0000227
	}
skill取技能["静心"]={
	jns_1 = "本方玩家单位抵抗封印几率增加3%。(不可叠加)"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA0000122
	,jns_8 = 0xA0000122
	}
skill取技能["慈佑"]={
	jns_1 = "若召唤兽带有来自你的“普渡众生”，其受到的伤害降低10%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xAA000018
	,jns_8 = 0xAA000018
}
skill取技能["明光"]={
	jns_1 = "你的治疗有18%几率触发暴击，使得技能效果翻倍。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA2F9E185
	,jns_8 = 0xA2F9E185
	}
skill取技能["度厄"]={
	jns_1 = "本方没有单位带有“普渡众生”时，“普渡”基础几率增加32%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x8FE4B9FF
	,jns_8 = 0x8FE4B9FF
	}
skill取技能["清净"]={
	jns_1 = "你的颠倒五行额外附带效果“清净”:增加30%抵抗封印类法术的能力，持续2回合。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA0000052
	,jns_8 = 0xA0000052
	}
skill取技能["妙有"]={
	jns_1 = "对带有“普渡众生”的单位使用颠倒五行时，持续回合增加2。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x9C0D1C5B
	,jns_8 = 0x9C0D1C5B
	}
skill取技能["法华"]={
	jns_1 = "灵动九天额外增加100点法伤，但不再增加法防，且作用人数变为1。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x8FE4B9FF
	,jns_8 = 0x8FE4B9FF
	}
skill取技能["感念1"]={
	jns_1 = "本方每有一个单位带有“普渡众生”灵动九天额外作用1个单位。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xDC31E128
	,jns_8 = 0xDC31E128
	}
skill取技能["额外能力"]={
	jns_1 = "增加80点法术防御。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x9C0D1C5B
	,jns_8 = 0x9C0D1C5B
	}
skill取技能["莲台仙子"]={
	jns_1 = "增加80点法术防御，获得莲台仙子称谓。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x9C0D1C5B
	,jns_8 = 0x9C0D1C5B
}
skill取技能["庄严"]={
	jns_1 = "敌方每有一个单位带有“紧箍咒”，你增加15点防御和法术防御。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA0000373
	,jns_8 = 0xA0000373
	}
skill取技能["静心"]={
	jns_1 = "本方玩家单位抵抗封印几率增加3%。(不可叠加)"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x9C0D1C5B
	,jns_8 = 0x9C0D1C5B
	}
skill取技能["赐咒"]={
	jns_1 = "敌方没有单位带有“紧箍咒”时，你的紧箍咒有54%几率额外随机作用1个单位。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xAA000021
	,jns_8 = 0xAA000021
}
skill取技能["慧眼"]={
	jns_1 = "五行法术克制召唤兽五行时，伤害增加60%且有60%几率使其本回合无法使用物理和法术攻击。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA0000094
	,jns_8 = 0xA0000094
	}
skill取技能["静心"]={
	jns_1 = "本方玩家单位抵抗封印几率增加3%。(不可叠加)"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x9C0D1C5B
	,jns_8 = 0x9C0D1C5B
}
skill取技能["无怖"]={
	jns_1 = "如果你的紧箍咒导致目标死亡，目标有30%几率公开自己的防御五行。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA0000296
	,jns_8 = 0xA0000296
	}
skill取技能["秘术"]={
	jns_1 = "使用五行法术时，若目标气血上限被降低至O则立即死亡，当回合不能被复活。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF109AB4C
	,jns_8 = 0xF109AB4C
	}

skill取技能["缘起"]={
	jns_1 = "五行法术有(敌方带有“紧箍咒”单位数量×6%)几率额外施放1次。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x7D712683
	,jns_8 = 0x7D712683
	}
skill取技能["五行咒师"]={
	jns_1 = "增加30点速度，获得五行咒师称谓。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x9C0D1C5B
	,jns_8 = 0x9C0D1C5B
}
skill取技能["湛然"]={
	jns_1 = "五行珠数量=5时，回合结束时，有40%几率进入“剑意莲心”状态。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA0000356
	,jns_8 = 0xA0000356
	}
skill取技能["因缘"]={
	jns_1 = "五行攻击克制目标五行时，造成的伤害提高5%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA0000329
	,jns_8 = 0xA0000329
	}
skill取技能["莲音"]={
	jns_1 = "使用剑意莲心后，有40%几率使你造成的物理伤害提高20%，持续3回合。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA0000159
	,jns_8 = 0xA0000159
}


skill取技能["低眉"]={
	jns_1 = "“剑意莲心”状态下，受到的伤害降低5%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA0000031
	,jns_8 = 0xA0000031
	}
skill取技能["顿悟"]={
	jns_1 = "获得五行珠后，额外回复(当前五行珠数量)的愤怒。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA0000043
	,jns_8 = 0xA0000043
}
skill取技能["安忍"]={
	jns_1 = "受到伤害降低（当前五行珠数量x1%)。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA0000381
	,jns_8 = 0xA0000381
	}
skill取技能["怒目"]={
	jns_1 = "“剑意莲心”状态下，破血狂攻、破碎无双造成伤害提高16%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA0000211
	,jns_8 = 0xA0000211
	}
skill取技能["馀威"]={
	jns_1 = "退出“剑意莲心”状态时，回复15点愤怒。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA0000345
	,jns_8 = 0xA0000345
}
skill取技能["业障"]={
	jns_1 = "对召唤兽造成的伤害提高20%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA0000326
	,jns_8 = 0xA0000326
	}
skill取技能["困兽"]={
	jns_1 = "如果你的五行攻击克制目标五行且导致目标死亡，目标本回合将无法被复活"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA0000148
	,jns_8 = 0xA0000148
	}
skill取技能["无尽"]={
	jns_1 = "每次获得五行珠后，增加8点伤害力，持续到战斗结束。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA0000298
	,jns_8 = 0xA0000298
}
skill取技能["抖擞"]={
	jns_1 = "增加(力量点数×10%+40)的伤害力。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA0000035
	,jns_8 = 0xA0000035
	}
skill取技能["莲华"]={
	jns_1 = "“剑意莲心”状态下，增加150点伤害力"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA0000158
	,jns_8 = 0xA0000158
	}
skill取技能["相生"]={
	jns_1 = "五行珠数量≥3时，获得五行珠的几率提高50%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x9C0D1C5B
	,jns_8 = 0x9C0D1C5B
}
skill取技能["智念"]={
	jns_1 = "每8回合，获得1枚五行珠。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x7D712683
	,jns_8 = 0x7D712683
	}
skill取技能["执念"]={
	jns_1 = "五行珠数量=0时，五行攻击必定获得五行珠。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA0000362
	,jns_8 = 0xA0000362
	}
skill取技能["万象"]={
	jns_1 = "你的“颠倒五行”对自己释放时，获得以下效果:1）克制目标五行时，造成伤害提高8%;2）法术躲避率增加15%;3)持续回合增加(当前五行珠数量)。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA0000289
	,jns_8 = 0xA0000289
}
skill取技能["落伽神女"]={
	jns_1 = "增加40点伤害，获得落伽神女称谓。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x9C0D1C5B
	,jns_8 = 0x9C0D1C5B
}
-- 狮驼岭
skill取技能["爪印"]={
	jns_1 = "每次攻击敌人后，在敌人身上留下爪印，每个印记使得自己在下次攻击对手时增加人物等级*0.5伤害结果。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x6E34D2AA
	,jns_8 = 0x6E34D2AA
	}
skill取技能["翼展"]={
	jns_1 = "你的鹰击攻击伤害增加生死薄技能等级*1.2"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x35A96711
	,jns_8 = 0x35A96711
	}
skill取技能["驭兽"]={
	jns_1 = "提升全队伍所有在场召唤兽的能力：你的训兽诀等级*0.4的伤害，你的训兽诀等级*0.4的防御，你的训兽诀等级*0.2的灵力。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x97EF1BE4
	,jns_8 = 0x97EF1BE4
	}
skill取技能["化血"]={
	jns_1 = "在攻击中有30%几率吸收造成伤害的16%的气血。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xBE24B04C
	,jns_8 = 0xBE24B04C
	}
skill取技能["宁息"]={
	jns_1 = "变身的持续回合数加2，且效果提升3%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF0B320B8
	,jns_8 = 0xF0B320B8
	}
skill取技能["兽王"]={
	jns_1 = "使用完变身技能后，所有攻击类技能对目标造成变身技能等级*2的额外伤害(无变身状态无效)。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x287A0188
	,jns_8 = 0x287A0188
	}
skill取技能["狮吼"]={
	jns_1 = "狮搏伤害提高15%；狮搏击倒目标时，额外触发一次狮搏。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xD10DF1DF
	,jns_8 = 0xD10DF1DF
	}
skill取技能["怒象"]={
	jns_1 = "当气血少于上限的30%时，有70%的几率在使用象形时保留变身状态。" --并延长变身1回合
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x7CDE78AD
	,jns_8 = 0x7CDE78AD
	}
skill取技能["鹰啸"]={
	jns_1 = "鹰击可以使目标造成的伤害降低15%，持续2回合。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x1D7F1771
	,jns_8 = 0x1D7F1771
	}
skill取技能["乱破"]={
	jns_1 = "使用连环击时，每次击打有45%几率附加狂兽决技能等级×100%的伤害。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x6D372C69
	,jns_8 = 0x6D372C69
	}
skill取技能["魔息"]={
	jns_1 = "魔息术效果提升50%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xC84857CA
	,jns_8 = 0xC84857CA
}
skill取技能["狂袭"]={
	jns_1 = "攻击时减少被反震的概率20%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x5154ED66
	,jns_8 = 0x5154ED66
}
skill取技能["失心"]={
	jns_1 = "使用狮搏或鹰击有15%的几率让目标1回合无法行动。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x43CEF766
	,jns_8 = 0x43CEF766
	}
skill取技能["羁绊"]={
	jns_1 = "你每次回复生命值，你的召唤兽也会回复该数值的10%。你的召唤兽每次回复生命值，你也会回复该数值的10%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x5C170F92
	,jns_8 = 0x5C170F92
	}
skill取技能["死地"]={
	jns_1 = "死亡时将提升你下一次鹰击200伤害力。"
	,jns_3 = 8
	,jns_6 = "wzife.wd3"
	,jns_7 = 0x143A6B82
	,jns_8 = 0x143A6B82
	}
skill取技能["乱击"]={
	jns_1 = "你的连环击不再取消“变身”，使用连环击时造成的伤害提高10%。。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x28EFDCA8
	,jns_8 = 0x28EFDCA8
	}
skill取技能["悲恸"]={
	jns_1 = "人物死亡时，你的召唤兽受到的伤害降低15%，造成的伤害提高15%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x1D0F8066
	,jns_8 = 0x1D0F8066
	}
skill取技能["背水"]={
	jns_1 = "虽千万人吾亦往矣，不胜则死！牺牲自身20%的当前气血，对目标造成(当前气血24%+普通攻击物理伤害+爪印个数*200)的伤害，并清除目标爪印效果。对方所受伤害最高不超过使用者自身力量点×600%的气血。消耗：20%的当前气血。自身气血少于气血上限20%时无法使用。（需要有变身状态，使用后休息1回合）"
	,jns_3 = 4
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x0B171EFB
	,jns_8 = 0x0B171EFB
	}
skill取技能["肝胆"]={
	jns_1 = "人与幻兽之间的情感，你们这些俗人又怎能了解？肝胆相照、形影相随，四海为家、浪迹天涯。命令自己的召唤兽忠诚的保护己方任意目标（除了自己的召唤兽），该技能选择目标释放后，自己的召唤兽将在3回合内无限保护目标，直至目标或者召唤兽自己死亡。保护时召唤兽承担所受伤害的40%，被保护目标承受40%的伤害。消耗：80点MP。技能冷却回合：3。"
	,jns_3 = 3
	,jns_4 = "50点魔法"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x04600746
	,jns_8 = 0x04600746
	}
skill取技能["迅捷"]={
	jns_1 = "与NPC战斗时:你进场获得2回合“变身”，但是该“变身”会使你伤害力减少（等级x1)。(套装效果附带状态“变身”时不触发)"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x6E34D2AA
	,jns_8 = 0x6E34D2AA
	}
skill取技能["威压"]={
	jns_1 = "狮搏对召唤兽伤害提高20%并有30%几率附带持续2回合的“威慑”效果。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x35A96711
	,jns_8 = 0x35A96711
	}
skill取技能["九天"]={
	jns_1 = "队伍中只有一个狮驼岭弟子时:增加(大鹏展翅等级×大鹏展翅等级÷60)的命中，且你的鹰击造成的伤害提高5%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x97EF1BE4
	,jns_8 = 0x97EF1BE4
}
skill取技能["协战"]={
	jns_1 = "召唤兽在场时，自身造成的所有物理伤害提高7%。(鬼魂倒地视为未在场)"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x6E34D2AA
	,jns_8 = 0x6E34D2AA
	}
skill取技能["怒火"]={
	jns_1 = "使用破血狂攻或破碎无双后，你的召唤兽本回合造成的伤害提高32%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x35A96711
	,jns_8 = 0x35A96711
	}
skill取技能["狂袭"]={
	jns_1 = "攻击时若被反震导致气血损失，获得下述效果:1)气血损失的4%加成至伤害力，持续1回合，可叠加。2)若气血损失>当前气血则至少保留1点气血，在行动结束时死亡。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x97EF1BE4
	,jns_8 = 0x97EF1BE4
}
skill取技能["额外能力"]={
	jns_1 = "增加30点速度。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x6E34D2AA
	,jns_8 = 0x6E34D2AA
	}
skill取技能["嗜血狂魔"]={
	jns_1 = "增加30点速度，获得嗜血狂魔称谓。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x35A96711
	,jns_8 = 0x35A96711
	}
skill取技能["拟形"]={
	jns_1 = "你使用狮搏攻击召唤兽时，你的驯兽有50%几率对其使用一次狮搏。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x97EF1BE4
	,jns_8 = 0x97EF1BE4
	}
skill取技能["念主"]={
	jns_1 = "进入与NPC的战斗时，驯兽将将会一直保护主人。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x97EF1BE4
	,jns_8 = 0x97EF1BE4
}
skill取技能["夜视"]={
	jns_1 = "你的驯兽获得‘夜战’。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x97EF1BE4
	,jns_8 = 0x97EF1BE4
	}
skill取技能["宁息"]={
	jns_1 = "变身持续回合数增加2。回合结束时若处于死亡状态，“变身”的剩余回合数有70%几率不会减少。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x6E34D2AA
	,jns_8 = 0x6E34D2AA
	}
skill取技能["饮血"]={
	jns_1 = "你和驯兽造成物理伤害后，有30%几率吸取（16%×造成伤害)的气血。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x35A96711
	,jns_8 = 0x35A96711
	}
skill取技能["健壮"]={
	jns_1 = "你的驯兽受到的伤害降低10%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x97EF1BE4
	,jns_8 = 0x97EF1BE4
}
skill取技能["守势"]={
	jns_1 = "处于休息状态时，你的驯兽受到的伤害降低12%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x6E34D2AA
	,jns_8 = 0x6E34D2AA
	}
skill取技能["狂化"]={
	jns_1 = "处于变身状态时，你的驯兽攻击时有12%几率造成双倍伤害。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x35A96711
	,jns_8 = 0x35A96711
	}
skill取技能["矫健"]={
	jns_1 = "驯兽气血≥70%时，造成的伤害提高10%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x97EF1BE4
	,jns_8 = 0x97EF1BE4
}
skill取技能["协同"]={
	jns_1 = "队伍中只有一个狮驼岭弟子时:驯兽对处于封印状态的目标造成的伤害提高100%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x6E34D2AA
	,jns_8 = 0x6E34D2AA
	}
skill取技能["争宠"]={
	jns_1 = "召唤兽在场时，你的驯兽造成的伤害提高12%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x35A96711
	,jns_8 = 0x35A96711
	}
skill取技能["识药"]={
	jns_1 = "你的驯兽受到来自药品的回复效果提高10%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x97EF1BE4
	,jns_8 = 0x97EF1BE4
	}
skill取技能["追逐"]={
	jns_1 = "使用连环击时，你的驯兽有15%的几率对其使用一次狮搏。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x6E34D2AA
	,jns_8 = 0x6E34D2AA
	}
skill取技能["逞凶"]={
	jns_1 = "你或驯兽攻击造成玩家单位死亡后，本场战斗你和驯兽对其召唤兽和孩子造成的伤害永久提高10%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x35A96711
	,jns_8 = 0x35A96711
	}
skill取技能["老练"]={
	jns_1 = "每回合结束时，驯兽造成的伤害提高4%。(当前驯兽被击飞后失效,最高伤害提高400%)"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x97EF1BE4
	,jns_8 = 0x97EF1BE4
}
skill取技能["万兽之王"]={
	jns_1 = "增加40点物理暴击等级，获得万兽之王称谓。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x6E34D2AA
	,jns_8 = 0x6E34D2AA
	}
skill取技能["狂躁"]={
	jns_1 = "“变身”的持续回合减少3，你主动使用变身时，获得相同回合数的“狂怒”状态。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x35A96711
	,jns_8 = 0x35A96711
	}
skill取技能["狂啸"]={
	jns_1 = "击飞召唤兽后，获得3回合的“狂怒”状态。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x97EF1BE4
	,jns_8 = 0x97EF1BE4
}

skill取技能["摄取"]={
	jns_1 = "“狂怒”状态下造成物理伤害后，有50%几率吸取（16%×造成伤害)的气血。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x6E34D2AA
	,jns_8 = 0x6E34D2AA
	}
skill取技能["屏息"]={
	jns_1 = "回合结束时若处于倒地状态，有70%几率不减少“变身”和“狂怒”的剩余回合数。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x35A96711
	,jns_8 = 0x35A96711
	}
skill取技能["不羁"]={
	jns_1 = "“狂怒”状态下，你的抵抗封印几率增加10%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x97EF1BE4
	,jns_8 = 0x97EF1BE4
}
-------------------------------st新技能
skill取技能["暴怒"]={
	jns_1 = "“狂怒”状态下，你临时增加10%物理暴击几率和20%物理暴击伤害倍率。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x97EF1BE4
	,jns_8 = 0x97EF1BE4
	}
skill取技能["灭兽"]={
	jns_1 = "“狂怒”状态下你的狮搏对召唤兽造成伤害提高50%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x6E34D2AA
	,jns_8 = 0x6E34D2AA
	}
skill取技能["激变"]={
	jns_1 = "进入“狂怒”时，如果你未“变身”，自动附加2回合“变身”。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x6E34D2AA
	,jns_8 = 0x6E34D2AA
}
skill取技能["狂血"]={
	jns_1 = "使用破血狂攻或破碎无双后，获得3回合的“狂怒”状态。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x6E34D2AA
	,jns_8 = 0x6E34D2AA
	}
skill取技能["狂乱"]={
	jns_1 = "“狂怒”状态下，你的鹰击有40%几率额外作用1个单位。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x35A96711
	,jns_8 = 0x35A96711
	}
skill取技能["雄风"]={
	jns_1 = "“狂怒”状态下，你使用连环击时保留“变身”状态。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x97EF1BE4
	,jns_8 = 0x97EF1BE4
}
skill取技能["狩猎"]={
	jns_1 = "你的攻击造成玩家单位死亡后，本场战斗你对其召唤兽和孩子造成的伤害永久提高10%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x6E34D2AA
	,jns_8 = 0x6E34D2AA
	}
skill取技能["狂乱"]={
	jns_1 = "“狂怒”状态下，你的鹰击有40%几率额外作用1个单位。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x35A96711
	,jns_8 = 0x35A96711
	}
skill取技能["困兽之斗"]={
	jns_1 = "进行一次猛烈的物理攻击。若处于“狂怒”状态，有50%的几率额外攻击一次。若击倒了玩家单位，则获得5回合的“狂怒”状态。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x97EF1BE4
	,jns_8 = 0x97EF1BE4
	}
skill取技能["狂怒斗兽"]={
	jns_1 = "增加40点伤害，获得狂怒斗兽称谓。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x97EF1BE4
	,jns_8 = 0x97EF1BE4
}

skill取技能["威吓1"]={
	jns_1 = "五雷轰顶成功时造成的伤害比例在基础上增加8%并且目标本回合内不再增加愤怒值。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x4E4ECD7C
	,jns_8 = 0x4E4ECD7C
	}
skill取技能["疾雷"]={
	jns_1 = "使用天雷斩攻击NPC时，额外增加0.6*(敏捷点数-人物等级)的伤害力。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x67324D63
	,jns_8 = 0x67324D63
	}
skill取技能["轰鸣"]={
	jns_1 = "使用五雷轰顶成功时，使目标减少（等级×1.6)点物理防御，持续3回合。(效果不可叠加和刷新)"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x11DBB164
	,jns_8 = 0x11DBB164
	}
skill取技能["轰鸣1"]={
	jns_1 = "混天术≥人物等级时，你增加60点法术伤害力。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x11DBB164
	,jns_8 = 0x11DBB164
	}
skill取技能["趁虚"]={
	jns_1 = "使用特技之后，封印命中率增加8%，持续3回合。(效果可刷新，不可叠加)"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x54E910DB
	,jns_8 = 0x54E910DB
	}
skill取技能["余韵1"]={
	jns_1 = "魔兽之印、河东狮吼、圣灵之甲、碎甲术、停陷术、啸风诀的效果提高50%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x8009DFB1
	,jns_8 = 0x8009DFB1
	}
skill取技能["驭意"]={
	jns_1 = "增加自身(魔力属性点×5%)的速度、(魔力属性点×10%)的法术伤害力、减少(魔力属性点×24%)的法术防御力。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x2CBA65C0
	,jns_8 = 0x2CBA65C0
	}
skill取技能["震慑"]={
	jns_1 = "使用错乱成功封印对手后，使目标同时附有掌心雷的封印效果；自身法术伤害力降低10%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xC5CB9BBB
	,jns_8 = 0xC5CB9BBB
	}
skill取技能["神念"]={
	jns_1 = "使用法宝时，额外获得10点愤怒。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA79CD890
	,jns_8 = 0xA79CD890
	}
skill取技能["伏魔"]={
	jns_1 = "附魔天书的效果增加50%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x7D54F95D
	,jns_8 = 0x7D54F95D
	}
skill取技能["苏醒"]={
	jns_1 = "在回合内掉血量达到自身气血上限的30%，回合结束时自动移除自身封印类异常状态，自身死亡时不生效。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xC8EF7B06
	,jns_8 = 0xC8EF7B06
	}
skill取技能["护佑"]={
	jns_1 = "增加50点防御力及法术防御力。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xFEAD9161
	,jns_8 = 0xFEAD9161
	}
skill取技能["电芒"]={
	jns_1 = "被雷霆万钧击中的目标，身上将缠绕着电流。带有此电流的目标再次受到雷霆万钧打击时额外承受5%的伤害，持续3回合，不可叠加。被动法术!"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x7B970F69
	,jns_8 = 0x7B970F69
	}
skill取技能["月桂"]={
	jns_1 = "增加武器伤害*12%的封印命中等级，但不再增加法术伤害力。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x71D17EEA
	,jns_8 = 0x71D17EEA
	}
skill取技能["怒火1"]={
	jns_1 = "当因气血损失而回复≥10的愤怒时，可以额外回复4点愤怒。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x58B7E9CB
	,jns_8 = 0x58B7E9CB
	}
skill取技能["灵光"]={
	jns_1 = "装备上的宝石舍利子效果增加25%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x9571F0A2
	,jns_8 = 0x9571F0A2
	}
skill取技能["神律"]={
	jns_1 = "天神护体法防效果增加100%，额外增加云霄步等级*0.3的速度，但不再增加法伤。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xEA46BD71
	,jns_8 = 0xEA46BD71
	}
skill取技能["洞察"]={
	jns_1 = "你的知己知彼额外提高自身等级*2的伤害、防御、法伤、法防、封印等级、抗封等级，持续3回合。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x8660A7C9
	,jns_8 = 0x8660A7C9
	}
skill取技能["雷波"]={
	jns_1 = "雷霆万钧对首目标造成的伤害提高8%,带有“电芒”的非召唤物单位死亡时，所有敌方存活单位附加“电芒”效果。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA7603CC9
	,jns_8 = 0xA7603CC9
	}
skill取技能["画地为牢"]={
	jns_1 = "天宫弟子随手布下的囚牢，却是无数穷凶|极恶之徒的饮恨之所。对敌方使用后，降低敌方1个单位18%的抵抗封印能力以及24%的封印能力，持续5回合。消耗：50点魔法；冷却时间：5回合。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xBAF731FA
	,jns_8 = 0xBAF731FA
	}
skill取技能["风雷韵动"]={
	jns_1 = "以法术攻击敌方单体目标，造成110%的法术伤害。对带有“电芒”的单位额外提高40%(80%)的伤害。(括号内为与NPC战斗时的效果)。"
	,jns_3 = 4
	,jns_4 = "消耗60点魔法，10点愤怒"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x169010C9
	,jns_8 = 0x169010C9
}
skill取技能["风雷斩"]={
	jns_1 = "“风烈雷迅九霄怒,一斩疾霆破惊云”。天宫弟子能以雷霆之势予以对手沉重一击。【功效】以雷霆之势攻击一个单位。"
	,jns_3 = 4
	,jns_4 = "30点魔法"
	,jns_5 = "傲世诀技能达到25级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 402653184
	,jns_8 = 402653184
}
skill取技能["霹雳弦惊"]={
	jns_1 = "【功效】强化你的风雷斩为风雷斩·霹雳:对主目标额外造成伤害,持续6回合。使用雷怒霆激后会解除此状态。"
	,jns_3 = 2
	,jns_4 = "70点魔法"
	,jns_5 = "傲世诀技能达到25级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 956301312
	,jns_8 = 956301312
}
skill取技能["雷怒霆激"]={
	jns_1 = "【功效】强化你的风雷斩为风雷斩·飞霆:额外攻击2个单位,持续6回合。使用霹苦弦惊后会解除此状态。"
	,jns_3 = 2
	,jns_4 = "70点魔法"
	,jns_5 = "傲世诀技能达到25级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 872415232
	,jns_8 = 872415232
}
skill取技能["返璞"]={
	jns_1 = "作为物理攻击的大师,门派法术造成的物理伤害提高,但封印命中率和造成的法术伤害降低。"
	,jns_3 = 55
	,jns_6 = "jntb.wdf"
	,jns_7 = 385875968
	,jns_8 = 385875968
	,jns_11 = "被动"
}
skill取技能["缭乱"]={
	jns_1 = "使用错乱后，你的下个镇妖有30%几率额外作用1个单位。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x4E4ECD7C
	,jns_8 = 0x4E4ECD7C
	}
skill取技能["藏招"]={
	jns_1 = "你的掌心雷额外作用1个单位。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x67324D63
	,jns_8 = 0x67324D63
	}
skill取技能["正气"]={
	jns_1 = "被带有异常状态单位攻击时，受到的伤害降低6%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x11DBB164
	,jns_8 = 0x11DBB164
}
skill取技能["套索"]={
	jns_1 = "你的“金刚镯”额外使目标造成的物理伤害降低10%，且持续回合增加1回合。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x4E4ECD7C
	,jns_8 = 0x4E4ECD7C
	}
skill取技能["神尊"]={
	jns_1 = "你的天神护体额外增加物理防御，效果和法防相同，但不再增加法伤。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x67324D63
	,jns_8 = 0x67324D63
	}
skill取技能["额外能力"]={
	jns_1 = "增加40点封印命中等级。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x11DBB164
	,jns_8 = 0x11DBB164
}
skill取技能["镇妖神使"]={
	jns_1 = "增加40点封印命中等级，获得镇妖神使称谓。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x4E4ECD7C
	,jns_8 = 0x4E4ECD7C
	}
skill取技能["频变"]={
	jns_1 = "“电芒”持续回合增加1。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x67324D63
	,jns_8 = 0x67324D63
	}
skill取技能["惊曜"]={
	jns_1 = "带有“电芒”的单位再次受到雷霆万钧攻击时，额外受到的伤害增加至10%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x11DBB164
	,jns_8 = 0x11DBB164
}

skill取技能["震荡"]={
	jns_1 = "攻击带有来自你“电芒”的单位时，增加80点法术伤害力。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x4E4ECD7C
	,jns_8 = 0x4E4ECD7C
}
skill取技能["驭意"]={
	jns_1 = "增加自身(魔力属性点x5%)的速度、(魔力属性点×10%)的法术伤害力、减少（魔力属性点x24%)的法术防御力。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x11DBB164
	,jns_8 = 0x11DBB164
}

skill取技能["电掣"]={
	jns_1 = "对召唤兽造成的伤害提高15%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x4E4ECD7C
	,jns_8 = 0x4E4ECD7C
	}
skill取技能["神念"]={
	jns_1 = "使用法宝时，额外回复10点愤怒"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x67324D63
	,jns_8 = 0x67324D63
	}
skill取技能["伏魔"]={
	jns_1 = "伏魔天书的效果提高50%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x11DBB164
	,jns_8 = 0x11DBB164
}
skill取技能["雷霆汹涌"]={
	jns_1 = "【被动】你的雷霆万钧不再会消耗“天雷灌注”。【主动】消耗“天雷灌注”对6个目标进行法术攻击。"
	,jns_3 = 4
	,jns_4 = "消耗作用人数×35点魔法"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x4E4ECD7C
	,jns_8 = 0x4E4ECD7C
	}
skill取技能["天劫"]={
	jns_1 = "“天雷灌注”可以叠加3层。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x67324D63
	,jns_8 = 0x67324D63
	}
skill取技能["怒电"]={
	jns_1 = "使用原始愤怒消耗≥120点的特技后，有50%几率使你的下一个“雷霆万钧”额外作用1个单位。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x11DBB164
	,jns_8 = 0x11DBB164
}

skill取技能["共鸣"]={
	jns_1 = "你的召唤兽使用的奔雷咒和雷击伤害提高8%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x4E4ECD7C
	,jns_8 = 0x4E4ECD7C
}
skill取技能["仙音"]={
	jns_1 = "琴音三叠对带有“电芒”的单位额外造成16%的伤害。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x67324D63
	,jns_8 = 0x67324D63
}
skill取技能["雷波"]={
	jns_1 = "雷霆万钧对首目标造成的伤害提高8%，带有“电芒”的非召唤物单位死亡时，所有敌方存活单位附加“电芒”效果。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x11DBB164
	,jns_8 = 0x11DBB164
}
skill取技能["踏雷天尊"]={
	jns_1 = "增加40点法术伤害，获得踏雷天尊称谓。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x4E4ECD7C
	,jns_8 = 0x4E4ECD7C
	}
skill取技能["霆震"]={
	jns_1 = "造成的伤害提高(6-霹雳弦惊或雷怒霆激剩余回合数)×1%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x67324D63
	,jns_8 = 0x67324D63
	}
skill取技能["疾雷"]={
	jns_1 = "使用天雷斩攻击NPC时，额外增加0.6x(敏捷点数-人物等级)的伤害力。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x11DBB164
	,jns_8 = 0x11DBB164
}
skill取技能["激越"]={
	jns_1 = "“霹雳弦惊”和“雷怒霆激”持续时间减少2回合，但持续回合内你造成的物理伤害提高12%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x4E4ECD7C
	,jns_8 = 0x4E4ECD7C
	}
skill取技能["存雄"]={
	jns_1 = "使用特技后，造成的物理伤害提高10%，持续3回合。(效果可刷新，不可叠加)"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x67324D63
	,jns_8 = 0x67324D63
	}
skill取技能["概叹"]={
	jns_1 = "破碎无双伤害提高40%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x11DBB164
	,jns_8 = 0x11DBB164
}
skill取技能["惊霆"]={
	jns_1 = "进入战斗时，获得4回合“霹雳弦惊”状态。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x4E4ECD7C
	,jns_8 = 0x4E4ECD7C
	}
skill取技能["电光火石"]={
	jns_1 = "使用后同时获得“霹雳弦惊”和“雷怒霆激”状态。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x67324D63
	,jns_8 = 0x67324D63
	}
skill取技能["神采"]={
	jns_1 = "气血≥70%时，造成的伤害提高5%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x11DBB164
	,jns_8 = 0x11DBB164
	}
skill取技能["劲健"]={
	jns_1 = "增加50点伤害力。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x4E4ECD7C
	,jns_8 = 0x4E4ECD7C
	}
skill取技能["啸傲"]={
	jns_1 = "使用霹雳弦惊或雷怒霆激后，增加15点伤害力，持续到战斗结束，最多叠加20次。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x67324D63
	,jns_8 = 0x67324D63
	}
skill取技能["气势"]={
	jns_1 = "战斗中首次主动使用的“霹雳弦惊”和“雷怒霆激”持续回合提高50%。(分别计算)"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x11DBB164
	,jns_8 = 0x11DBB164
}
skill取技能["鸣雷诀"]={
	jns_1 = "当前气血比例≤30%时才能使用，每回合结束时对方气血最低的单位招来天雷攻击，造成人物等级*8的伤害，持续3回合。(不可被驱散)"
	,jns_3 = 2
	,jns_4 = "100点魔法，消耗一个金鸦火羽"
	,jns_6 = "wzife.wd3"
	,jns_7 = 376590482
	,jns_8 = 502623457
	,jns_12 = "12回合"
	}
skill取技能["威仪九霄"]={
	jns_1 = "【被动】每回合开始时，威仪九霄的伤害倍率增加3%，魔法消耗增加100点(最多叠加30次);【主动】对所有目标造成10%的物理伤害，使用后清空叠加次数。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x67324D63
	,jns_8 = 0x67324D63
	}
skill取技能["霹雳真君"]={
	jns_1 = "增加40点伤害，获得霹雳真君称谓。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x11DBB164
	,jns_8 = 0x11DBB164
}
-- 五庄观
skill取技能["体恤"]={
	jns_1 = "当生命之泉的作用目标气血≤30%时，生命之泉恢复效果增加150点。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF19C2D33
	,jns_8 = 0xF19C2D33
	}
skill取技能["运转"]={
	jns_1 = "生命之泉持续回合减少3，但回复量提高30%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x11DBB164
	,jns_8 = 0x11DBB164
	}
skill取技能["锤炼"]={
	jns_1 = "武器耐久损失速度降低40%，增加4%武器伤害。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x18172D37
	,jns_8 = 0x18172D37
	}
skill取技能["神附"]={
	jns_1 = "增加人物力量*8%的伤害力。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x43F66789
	,jns_8 = 0x43F66789
	}
skill取技能["心浪"]={
	jns_1 = "回合结束时，若你愤怒少于50点，随机增加1~15点愤怒。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x284FBFEC
	,jns_8 = 0x284FBFEC
	}
skill取技能["养生"]={
	jns_1 = "当你气血<70%、且不处于生命之泉状态时，获得生命之泉状态。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xCF2DA86F
	,jns_8 = 0xCF2DA86F
	}
skill取技能["强击"]={
	jns_1 = "破血狂攻、破碎无双伤害提高32%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA88BC46C
	,jns_8 = 0xA88BC46C
	}
skill取技能["归本"]={
	jns_1 = "你的日月乾坤命中目标时，有60%几率随机驱散——个目标带有的主动法宝增益效果。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x736BD2FA
	,jns_8 = 0x736BD2FA
	}
skill取技能["修心"]={
	jns_1 = "使用除“慈航普度”以外的特技时，若愤怒不足将使用（所需愤怒*20）点魔法代替。每场战斗限一次。"
	,jns_3 = 8
	,jns_6 = "wzife.wd3"
	,jns_7 = 0x151405E2
	,jns_8 = 0x151405E2
	}
skill取技能["混元"]={
	jns_1 = "当你气血≥70%时，临时提升5%的伤害力。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x03636ACD
	,jns_8 = 0x03636ACD
	}
skill取技能["修身"]={
	jns_1 = "力量、体质、魔力、耐力、敏捷均增加14点。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x47BCA30B
	,jns_8 = 0x47BCA30B
	}
skill取技能["同辉"]={
	jns_1 = "天地同寿持续回合数增加2，但是被玩家单位攻击时额外降低15%防御。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xBF6B4C8C
	,jns_8 = 0xBF6B4C8C
	}
skill取技能["雨杀"]={
	jns_1 = "使用烟雨剑法需要的气血要求降低5%。烟雨剑法第二次攻击的必杀率提高20%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA88BC46C
	,jns_8 = 0xB6C48838
	}
skill取技能["乾坤"]={
	jns_1 = "如果你连续2回合及以上没有使用日月乾坤，则你下一次使用日月乾坤成功率提高15%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x86543FA8
	,jns_8 = 0x86543FA8
	}
skill取技能["意境"]={
	jns_1 = "本方所有目标每回合结束时回复24点魔法值、1点愤怒。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xC5AFBFE0
	,jns_8 = 0xC5AFBFE0
	}
skill取技能["傲视"]={
	jns_1 = "当攻击出现必杀时，下一次使用日月乾坤的成功率提高20%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xB6C48838
	,jns_8 = 0xB6C48838
	}
skill取技能["陌宝"]={
	jns_1 = "日月乾坤命中率增加2%，并对命中目标额外附加无法使用道具的效果。但你的物理伤害结果降低15%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xA88BC46C
	,jns_8 = 0xA88BC46C
	}
skill取技能["心随意动"]={
	jns_1 = "这是五庄弟子的最高心境，于此心法下施展“日月乾坤”，令人陶陶乎直入另一个世界。激活后（再次使用关闭此状态），持续8回合后自动关闭。持续回合内：1.增加(七星遁等级×2.2)的封印命中等级;2.使用日月乾坤封印成功后自己下回合不能使用日月乾坤;；消耗：30点MP。"
	,jns_3 = 5
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xFD5AC0B0
	,jns_8 = 0xFD5AC0B0
	}
skill取技能["致命"]={
	jns_1 = "被你攻击的目标在回合结束时，若目标气血<(其气血上限×8%)则直接死亡。(对NPC最多造成等级×8点伤害)"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x8C44F88C
	,jns_8 = 0x8C44F88C
	}
skill取技能["清风望月"]={
	jns_1 = "五庄观的弟子可以于乾坤腾挪之中领悟妙法，吸收2个队友身上的封印效果，使自己进入疯狂状态2回合。消耗：40点愤怒。冷却回合：4。"
	,jns_3 = 3
	,jns_4 = "40点愤怒"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x8FE977C4
	,jns_8 = 0x8FE977C4
	}
skill取技能["同伤式"]={
	jns_1 = "将自身所有增益状态临时转换为伤害发动致命一击，同时自身与目标速度差越高则伤害越高。"
	,jns_3 = 4
	,jns_4 = "50点魔法，消耗一个金鸦火羽"
	,jns_6 = "wzife.wd3"
	,jns_7 = 1801367551
	,jns_8 = 912434102
	,jns_12 = "16回合"
	}
skill取技能["玄黄秘术"]={
	jns_1 = "点化处在“未点化”状态下的人参果。"
	,jns_3 = 6
	,jns_4 = "50点活力、体力"
	,jns_5 = "周易学技能达到25级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 2483027968
	,jns_8 = 2483027968
	}
skill取技能["天命剑法"]={
	jns_1 = "率意而行、道法自然，在五庄弟子出手之际，他自身也道不出这一招之中蕴含了多少剑意。或许，只有冥冥之中的三清可知吧？以无人能够预知的剑术攻击目标，对其随机发动1~7次物理攻击。使用后下回合不能行动。使用需要气血≥气血上限的70%；消耗：消耗最大气血的2%*实际攻击次数。冷却回合：4回合。"
	,jns_3 = 4
	,jns_4 = "消耗最大气血的2%*实际攻击次数"
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x30EA31AF
	,jns_8 = 0x30EA31AF
	,jns_12 = "5回合"
}
skill取技能["转运"]={
	jns_1 = "生命之泉持续回合减少3，但回复量提高30%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF19C2D33
	,jns_8 = 0xF19C2D33
	}
skill取技能["行气"]={
	jns_1 = "以自身为目标释放炼气化神时，其持续回合增加3。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x18172D37
	,jns_8 = 0x18172D37
	}
skill取技能["蓄志"]={
	jns_1 = "你同时处于炼气化神和生命之泉状态时，每回合回复3点愤怒。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x43F66789
	,jns_8 = 0x43F66789
}
skill取技能["存思"]={
	jns_1 = "回合数为3的倍数时，日月乾坤增加150点封印命中等级。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF19C2D33
	,jns_8 = 0xF19C2D33
	}
skill取技能["守中"]={
	jns_1 = "受到的所有法术伤害降低6%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x18172D37
	,jns_8 = 0x18172D37
	}
skill取技能["存神"]={
	jns_1 = "使用灵宝后，有32%的几率使你的下一个日月乾坤必定命中。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x43F66789
	,jns_8 = 0x43F66789
}
skill取技能["玄机"]={
	jns_1 = "日月乾坤对带有异常状态的单位，封印命中率增加4%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF19C2D33
	,jns_8 = 0xF19C2D33
	}
skill取技能["额外能力"]={
	jns_1 = "增加30点速度。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x18172D37
	,jns_8 = 0x18172D37
	}
skill取技能["清心羽客"]={
	jns_1 = "增加30点速度，获得清心羽客称谓。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x43F66789
	,jns_8 = 0x43F66789
	}
skill取技能["无极"]={
	jns_1 = "同时处于生命之泉、炼气化神和真阳令旗状态时，提高9%的伤害力。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF19C2D33
	,jns_8 = 0xF19C2D33
	}
skill取技能["剑气"]={
	jns_1 = "回合结束时，获得4点物理暴击等级，持续到战斗结束。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x18172D37
	,jns_8 = 0x18172D37
	}
skill取技能["起雨"]={
	jns_1 = "当你的“骤雨”叠加至3层时，下一次烟雨剑法会消耗所有的“骤雨”层数，额外增加1次攻击次数。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x43F66789
	,jns_8 = 0x43F66789
	}
skill取技能["骤雨"]={
	jns_1 = "每次使用烟雨剑法后都会使你造成的伤害和暴击率提高2%,持续3回合,可叠加3层。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x43F66789
	,jns_8 = 0x43F66789
}
skill取技能["还丹"]={
	jns_1 = "敲金击玉每次攻击后可获得1枚人参娃娃,人参娃娃会在使用敲金击玉时与你一同攻击,额外造成30%伤害。最多持有3枚人参娃娃,持续时间3回合、获得时刷新持续时间。"
	,jns_3 = 55
	,jns_5 = "该被动在选择五庄万寿真仙流派时可获得。"
	,jns_6 = "jntb.wdf"
	,jns_7 = 587202560
	,jns_8 = 587202560
	,jns_11 = "被动"
}
skill取技能["滂沱"]={
	jns_1 = "每层“骤雨”的效果增加至5%伤害和5%暴击几率，且最多叠加5层。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF19C2D33
	,jns_8 = 0xF19C2D33
	}
skill取技能["剑势"]={
	jns_1 = "对气血>90%的单位造成的伤害提高9%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x18172D37
	,jns_8 = 0x18172D37
	}
skill取技能["乾坤力士"]={
	jns_1 = "增加40点伤害，获得乾坤力士称谓。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x43F66789
	,jns_8 = 0x43F66789
}
skill取技能["木摧"]={
	jns_1 = "敲金击玉基础伤害增加5%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF19C2D33
	,jns_8 = 0xF19C2D33
	}
skill取技能["道果"]={
	jns_1 = "进入战斗时默认携带1个人参娃娃，但人参娃娃增加的基础伤害减少10%。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x18172D37
	,jns_8 = 0x18172D37
	}
skill取技能["饮露"]={
	jns_1 = "每个人参娃娃增加4%的基础伤害。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x43F66789
	,jns_8 = 0x43F66789
}
skill取技能["炼果"]={
	jns_1 = "使用破血狂攻、破碎无双、弱点击破后，会获得1个人参娃娃。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF19C2D33
	,jns_8 = 0xF19C2D33
	}
skill取技能["聚力"]={
	jns_1 = "每个人参娃娃使你的破血狂攻、破碎无双、弱点击破额外造成15%的伤害。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x18172D37
	,jns_8 = 0x18172D37
	}
skill取技能["刺果"]={
	jns_1 = "敲金击玉对召唤兽的伤害提高20%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x43F66789
	,jns_8 = 0x43F66789
}
skill取技能["三元"]={
	jns_1 = "当你带有3个人参娃娃时，抵抗封印几率增加12%"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF19C2D33
	,jns_8 = 0xF19C2D33
	}
skill取技能["凝神"]={
	jns_1 = "带有人参娃娃时，你的伤害力增加120点"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x18172D37
	,jns_8 = 0x18172D37
	}
skill取技能["纳气"]={
	jns_1 = "增加(人物力量×10%+40)的伤害力。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x43F66789
	,jns_8 = 0x43F66789
	}
skill取技能["气盛"]={
	jns_1 = "每个人参娃娃使你增加60点伤害力。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF19C2D33
	,jns_8 = 0xF19C2D33
	}
skill取技能["还元"]={
	jns_1 = "你消耗的每点灵元会提高你本场战斗1%的伤害，持续到战斗结束。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x18172D37
	,jns_8 = 0x18172D37
	}
skill取技能["落土止息"]={
	jns_1 = "发动一次猛烈的攻击，你的人参娃娃会与你一同攻击，且额外造成的伤害翻倍。使用后临时降低防御与法防，所有人参娃娃消失，你休息1回合。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x43F66789
	,jns_8 = 0x43F66789
	}
skill取技能["万寿真仙"]={
	jns_1 = "增加40点物理暴击等级，获得万寿真仙称谓。"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x43F66789
	,jns_8 = 0x43F66789
	}
skill取技能["天地无极"]={
	jns_1 = "无效果"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 2616462789
	,jns_8 = 3629430297
	}
skill取技能["九转玄功"]={
	jns_1 = "无效果"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 1837364177
	,jns_8 = 1720159516
	}
skill取技能["武神显圣"]={
	jns_1 = "无效果"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3229675127
	,jns_8 = 2285367568
	}
skill取技能["啸傲"]={
	jns_1 = "按技能等级提高灵力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 1753145086
	,jns_8 = 796505945
	}
skill取技能["气吞山河"]={
	jns_1 = "按技能等级提高伤害力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 4005775594
	,jns_8 = 1613219782
	}
skill取技能["诛魔"]={
	jns_1 = "按技能等级提高防御力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 150136690
	,jns_8 = 2802612826
	}
skill取技能["法天象地"]={
	jns_1 = "按技能等级提高命中"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 2858795509
	,jns_8 = 3937616310
	}
skill取技能["踏山裂石"]={
	jns_1 = "临时提升必杀几率对单个敌人进行物理攻击"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "“气吞山河”技能达到25级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 0xF4DCF38F
	,jns_8 = 0x1C603FAE
	}
skill取技能["裂石"]={
	jns_1 = "对单个敌人进行物理攻击\n#Y技能附带20%必杀几率\n#S增加1点战意值"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "“气吞山河”技能达到25级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 0xF4DCF38F
	,jns_8 = 0x1C603FAE
	}
skill取技能["断岳势"]={
	jns_1 = "对单个敌人进行2次物理攻击\n#Y技能附带10%必杀几率\n#S消耗1点战意值"
	,jns_3 = 4
	,jns_4 = "50点魔法、1点战意"
	,jns_5 = "“气吞山河”技能达到35级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 0x5AA54949
	,jns_8 = 0x5C95AF41
	}
skill取技能["天崩地裂"]={
	jns_1 = "对单个敌人进行3次物理攻击\n#Y技能附带10%必杀几率\n#S消耗3点战意值"
	,jns_3 = 4
	,jns_4 = "50点魔法、3点战意"
	,jns_5 = "“气吞山河”技能达到45级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 0x9ADAEA80
	,jns_8 = 0x3FB03390
	}
skill取技能["浪涌"]={
	jns_1 = "对单个敌人进行物理攻击\n#Y攻击怪物个数=3个\n#Y技能附带5%必杀几率\n#S增加2点战意值"
	,jns_3 = 4
	,jns_4 = "个数*20点魔法"
	,jns_5 = "“气吞山河”技能达到25级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 0xCE61D91C
	,jns_8 = 0x1A289BEA
	}
skill取技能["惊涛怒"]={
	jns_1 = "对多个敌人进行物理攻击\n#Y攻击怪物个数=3个\n#Y技能附带5%必杀几率\n#S消耗1点战意值"
	,jns_3 = 4
	,jns_4 = "个数*20点魔法"
	,jns_5 = "“气吞山河”技能达到35级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 0xB91C6953
	,jns_8 = 0xBE11779C
	}
skill取技能["翻江搅海"]={
	jns_1 = "多个敌人进行物理攻击\n#Y技能附带3%必杀几率\n#S消耗3点战意值"
	,jns_3 = 4
	,jns_4 = "个数*30点魔法"
	,jns_5 = "“气吞山河”技能达到45级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 0x26419C11
	,jns_8 = 0x11879028
	}
skill取技能["腾雷"]={
	jns_1 = "对目标造成法术伤害\n有几率降低目标#Y50%治疗恢复效果"
	,jns_3 = 4
	,jns_4 = "60点魔法"
	,jns_5 = "“诛魔”技能达到120级，且人物飞升"
	,jns_6 = "wzife.wdf"
	,jns_7 = 0x569D01F7
	,jns_8 = 0x956BA0A2
	}
skill取技能["指地成钢"]={
	jns_1 = "克制无底洞弟子的必杀技。"
	,jns_3 = 4
	,jns_4 = "150点愤怒"
	,jns_5 = "“诛魔”技能达到25级，人物等级达到20级。"
	,jns_6 = "wzife.wdf"
	,jns_7 = 0x4AB6831C
	,jns_8 = 0x1C603FAE
	}
skill取技能["敲金击玉"]={
	jns_1 = "镇元大仙所创灵宝斋法，以五行炼化仙果,使其涤除污垢,内外晶莹\n物理攻击单个目标，你所有的人参娃娃会参与此次攻击并造成额外伤害。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0xBF6B4C8C
	,jns_8 = 0xBF6B4C8C
	}
skill取技能["金击式"]={
	jns_1 = "镇元大仙把玩金击子时自创的招式，使用时若有金玉落盈芝声。\n对敌方3个目标发动物理攻击。(对玩家使用时伤害为1）"
	,jns_3 = 4
	,jns_4 = "30点魔法*目标数"
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0x37FCB484
	,jns_8 = 0x37FCB484
	}
skill取技能["不动如山"]={
	jns_1 = "减少自身受到的法术伤害与物理伤害\n#Y提升防御数值=技能等级*2\n#Y提升法防数值=技能等级*1.5"
	,jns_3 = 5
	,jns_4 = "150点魔法"
	,jns_5 = "“九转玄功”技能达到25级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 0xD96F2331
	,jns_8 = 0x38C47290
	}
skill取技能["碎星诀"]={
	jns_1 = "提升自己或队友的物理伤害结果\n不能与镇魂诀同时存在\n#Y提升伤害数值=技能等级*2"
	,jns_3 = 5
	,jns_4 = "30点魔法"
	,jns_5 = "“武神显圣”技能达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 0x136442C0
	,jns_8 = 0x5F8D7935
	}
skill取技能["无双战魂"]={
	jns_1 = "随机获得1~3点战意战意为0时效果更好。"
	,jns_3 = 2
	,jns_4 = "100点魔法，消耗一个金鸦火羽"
	,jns_6 = "wzife.wd3"
	,jns_7 = 679069867
	,jns_8 = 3525938545
	,jns_12 = "10回合"
	}
skill取技能["穿云破空"]={
	jns_1 = "平时状态下使用，临时赋予腰带提高物理伤害结果的功效，下线后消失。"
	,jns_3 = 9
	,jns_4 = "和技能等级相同的活力"
	,jns_5 = "“啸傲”技能达到35级，人物等级达到30级。 "
	,jns_6 = "wzife.wdf"
	,jns_7 = 3294906395
	,jns_8 = 3294906395
	}
skill取技能["镇魂诀"]={
	jns_1 = "提升自己或者队友的#Y24%必杀几率\n不能与碎星诀同时存在\n#Y提升伤害数值=技能等级*1.5"
	,jns_3 = 3
	,jns_4 = "5%的当前气血"
	,jns_5 = "“武神显圣”技能达到120级，且人物飞升"
	,jns_6 = "wzife.wdf"
	,jns_7 = 0x9E1580AA
	,jns_8 = 0xF808DCC6
	}
skill取技能["无穷妙道"]={
	jns_1 = "一定几率解除无底洞封印法术。"
	,jns_3 = 5
	,jns_4 = "60点魔法"
	,jns_5 = "“法天象地”技能达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 0xAFDB81A4
	,jns_8 = 0x76FBBEEC
	}
skill取技能["纵地金光"]={
	jns_1 = "平时状态下使用，可以瞬间回到自己的门派。"
	,jns_3 = 0
	,jns_4 = "10点气血和10点魔法"
	,jns_5 = "“法天象地”技能达到1级。"
	,jns_6 = "wzife.wdf"
	,jns_7 = 0xE6A2AA59
	,jns_8 = 0xFEF5D678
	}
-- 神木林
skill取技能["瞬息万变"]={
	jns_1 = "无效果"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 91138644
	,jns_8 = 3611723828
	}
skill取技能["万灵诸念"]={
	jns_1 = "按技能等级提高灵力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 1673295044
	,jns_8 = 3633730222
	}
skill取技能["巫咒"]={
	jns_1 = "按技能等级提高伤害力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 1387740863
	,jns_8 = 3945429798
	}
skill取技能["万物轮转"]={
	jns_1 = "按技能等级提高防御力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 236054114
	,jns_8 = 3548374182
	}
skill取技能["天人庇护"]={
	jns_1 = "按技能等级提高躲避力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 466502506
	,jns_8 = 2656066797
	}
skill取技能["神木恩泽"]={
	jns_1 = "无效果"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 1911264426
	,jns_8 = 785936658
	}
skill取技能["驭灵咒"]={
	jns_1 = "按技能等级提高最大魔法上限"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3018347230
	,jns_8 = 1524159458
	}
skill取技能["落叶萧萧"]={
	jns_1 = "使用法术攻击敌方多个目标\n#Y技能附带10%法连几率"
	,jns_3 = 4
	,jns_4 = "30点魔法*作用人数"
	,jns_5 = "“瞬息万变”技能达到35级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 0x2E734F9D
	,jns_8 = 0x0B8CF3A1
	}
skill取技能["荆棘舞"]={
	jns_1 = "使用法术攻击敌方，造成较高伤害。"
	,jns_3 = 4
	,jns_4 = "30点魔法"
	,jns_5 = "“万灵诸念”技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 0xDD2AB898
	,jns_8 = 0x6A647570
	}
skill取技能["尘土刃"]={
	jns_1 = "使用法术攻击敌方单体目标\n#Y固伤伤害数值加成:\n#Y技能等级*4+自身法伤的10%\n#Y暗器技巧等级*2\n#Y固定伤害=(敏捷*0.7+武器伤害*0.46)"
	,jns_3 = 4
	,jns_4 = "30点魔法"
	,jns_5 = "“万灵诸念”技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 0x3FE17E30
	,jns_8 = 0x71C197B0
	}
skill取技能["冰川怒"]={
	jns_1 = "使用法术攻击敌方单体目标\n#Y有20%概率冻结目标使其无法行动\n#S有80%几率使目标所有伤害降低10%"
	,jns_3 = 4
	,jns_4 = "30点魔法"
	,jns_5 = "“万灵诸念”技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 0xEDF81F56
	,jns_8 = 0x3B12CD18
	}
skill取技能["雾杀"]={
	jns_1 = "使用法术攻击敌方单人目标\n对敌人造成持续毒性伤害\n#Y伤害数值=技能等级*2+自身灵力的20%"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "“巫咒”技能达到40级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 0x1EE55D3C
	,jns_8 = 0x0DA2D8DF
	}
skill取技能["血雨"]={
	jns_1 = "对目标造成大量单体法术伤害"
	,jns_3 = 4
	,jns_4 = "150点魔法"
	,jns_5 = "“巫咒”技能达到120级，且人物飞升"
	,jns_6 = "wzife.wdf"
	,jns_7 = 0x126B932F
	,jns_8 = 0x7D52C301
	}
skill取技能["星月之惠"]={
	jns_1 = "回复自身一定的气血值\n#Y回血数值=技能等级*4+自身灵力的10%"
	,jns_3 = 5
	,jns_4 = "50点魔法"
	,jns_5 = "“巫咒”技能达到40级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 4284560198
	,jns_8 = 8287795
	}
skill取技能["炎护"]={
	jns_1 = "抵御50%的气血伤害\n#Y每抵御1点伤害消耗1点魔法"
	,jns_3 = 5
	,jns_4 = "30点魔法"
	,jns_5 = "“天人庇护”技能达到50级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 0xA215E746
	,jns_8 = 0xC5D73984
	}
skill取技能["叶隐"]={
	jns_1 = "平时状态下使用，可以瞬间回到自己的门派。"
	,jns_3 = 0
	,jns_4 = "10点气血和10点魔法"
	,jns_5 = "“天人庇护”技能达到1级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 0x64FEA3A4
	,jns_8 = 0x51763883
	}
skill取技能["神木呓语"]={
	jns_1 = "打造后为鞋子临时增加一定的魔法值。"
	,jns_3 = 12
	,jns_4 = "10点气血和10点魔法"
	,jns_5 = "“神木恩泽”技能达到35级，人物等级达到30级。"
	,jns_6 = "wzife.wdf"
	,jns_7 = 0x977F5625
	,jns_8 = 0x33CC0A38
	}
skill取技能["蜜润"]={
	jns_1 = "提升自己或队友的灵力法伤\n#Y提升伤害数值=技能等级*2.5"
	,jns_3 = 5
	,jns_4 = "25点魔法"
	,jns_5 = "“驭灵咒”技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 0x058EE366
	,jns_8 = 0xF83E2272
	}
skill取技能["蝼蚁蚀天"]={
	jns_1 = "克制凌波城弟子的必杀技。"
	,jns_3 = 4
	,jns_4 = "150点愤怒值"
	,jns_5 = "“驭灵咒”技能达到25级，人物等级达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 0xAC0B8B61
	,jns_8 = 0xAC574467
	}
-- 无底洞
skill取技能["枯骨心法"]={
	jns_1 = "无效果"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3947876534
	,jns_8 = 3256658495
	}
skill取技能["阴风绝章"]={
	jns_1 = "无效果"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 580599606
	,jns_8 = 2376753741
	}
skill取技能["鬼蛊灵蕴"]={
	jns_1 = "按技能等级提高灵力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 2137124880
	,jns_8 = 642299714
	}
skill取技能["燃灯灵宝"]={
	jns_1 = "按技能等级提高防御力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 2206649654
	,jns_8 = 2011054851
	}
skill取技能["地冥妙法"]={
	jns_1 = "无效果"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 2066772317
	,jns_8 = 1202816090
	}
skill取技能["混元神功"]={
	jns_1 = "按技能等级提伤害力"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 3367413411
	,jns_8 = 2065734785
	}
skill取技能["秘影迷踪"]={
	jns_1 = "按技能等级提高速度"
	,jns_3 = 8
	,jns_6 = "wzife.wdf"
	,jns_7 = 4041502466
	,jns_8 = 2278980523
	}
skill取技能["移魂化骨"]={
	jns_1 = "使目标获得吸血效果\n持续一定回合"
	,jns_3 = 3
	,jns_4 = "高于最大气血的30%才能使用"
	,jns_5 = "“枯骨心法”技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 0x173015AE
	,jns_8 = 0x121AC8D4
	}
skill取技能["夺魄令"]={
	jns_1 = "令目标一定回合内无法使用法术。"
	,jns_3 = 4
	,jns_4 = "30点魔法"
	,jns_5 = "“阴风绝章”技能达到25级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 0x62221B56
	,jns_8 = 0x076EA85A
	}
skill取技能["煞气诀"]={
	jns_1 = "使目标一定回合无法做出行动\n并且该目标不会受到攻击\n可作用于敌人或友方"
	,jns_3 = 88
	,jns_4 = "50点魔法"
	,jns_5 = "“阴风绝章”技能达到30级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 0xC0504605
	,jns_8 = 0x28D6DCD8
	,jns_12 = "5回合"
}
skill取技能["燃血术"]={
	jns_1 = "以自身鲜血为祭,换取强大的法力。\n消耗气血，强化你的下一个地涌金莲或焕生咒:使目标获得等同于治疗量的护盾值,夺魄令5%基础封印命中"
	,jns_3 = 5
	,jns_4 = "(最大气血×10%)点气血和气血上限"
	,jns_5 = "当前气血比例≥50%"
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0x8BE68718
	,jns_8 = 0x8BE68718
	}
skill取技能["惊魂掌"]={
	jns_1 = "使用后使对手在持续回合内无法被他人保护"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "“阴风绝章”技能达到50级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 0xC232A281
	,jns_8 = 0x71307D22
	}
skill取技能["摧心术"]={
	jns_1 = "使敌方2个目标30%速度降低\n持续一定回合"
	,jns_3 = 4
	,jns_4 = "100点魔法"
	,jns_5 = "“阴风绝章”技能达到120级，且人物飞升"
	,jns_6 = "wzife.wdf"
	,jns_7 = 0x1CC2B0B0
	,jns_8 = 0xD6A5B20C
	}
skill取技能["夺命咒"]={
	jns_1 = "固定伤害攻击多目标\n#Y固伤伤害数值加成:\n#Y技能等级*4+自身灵力的20%\n#Y暗器技巧等级*2\n#Y固定伤害=(敏捷*0.7+武器伤害*0.46)"
	,jns_3 = 4
	,jns_4 = "20点魔法*人数"
	,jns_5 = "“鬼蛊灵蕴”技能达到35级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 0x2A3E7A3C
	,jns_8 = 0xA9AF9E72
	}
skill取技能["明光宝烛"]={
	jns_1 = "战斗中大幅增加队友和自己的防御\n#Y防御数值=技能等级*2"
	,jns_3 = 3
	,jns_4 = "100点魔法"
	,jns_5 = "“燃灯灵宝”技能达到35级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 0x54DB6CDE
	,jns_8 = 0x59D84304
	}
skill取技能["金身舍利"]={
	jns_1 = "战斗中大幅增加队友和自己的法防\n#Y法防数值=技能等级*4"
	,jns_3 = 3
	,jns_4 = "100点魔法"
	,jns_5 = "“燃灯灵宝”技能达到120级，且人物飞升"
	,jns_6 = "wzife.wdf"
	,jns_7 = 0x1BE322B2
	,jns_8 = 0xFE884980
	}
skill取技能["地涌金莲"]={
	jns_1 = "回复自身一定的气血值\n#Y回血数值=技能等级*4+自身灵力的20%"
	,jns_3 = 3
	,jns_4 = "50点魔法*人数"
	,jns_5 = "“地冥妙法”技能达到20级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 0x40FB7647
	,jns_8 = 0xF437CA2F
	}
skill取技能["万木凋枯"]={
	jns_1 = "克制神木林弟子的技能"
	,jns_3 = 4
	,jns_4 = "150点愤怒"
	,jns_5 = "“地冥妙法”技能达到25级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 0x036B4345
	,jns_8 = 0xF2E06AF8
	}
skill取技能["元阳护体"]={
	jns_1 = "打造后为武器提升一定的气血"
	,jns_3 = 12
	,jns_4 = "和技能等级相同的活力"
	,jns_5 = "“混元神功”技能达到25级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 0xABD57D92
	,jns_8 = 0x2EF58426
	}
skill取技能["遁地术"]={
	jns_1 = "平时状态下使用，可以瞬间回到自己的门派。"
	,jns_3 = 0
	,jns_4 = "10点气血和10点魔法"
	,jns_5 = "“秘影迷踪”技能达到1级"
	,jns_6 = "wzife.wdf"
	,jns_7 = 0x1D14968A
	,jns_8 = 0x34D061C7
	}
skill取技能["其疾如风"]={
	jns_1 = "官府弟子多善战者\n行军当迅疾如风\n攻其无备\n使用后大幅度提高我方所有30%速度\n持续6回合"
	,jns_3 = 66
	,jns_4 = "200点魔法"
	,jns_12 = "冷却16回合"
	,jns_6 = "物品图标.wdf"
	,jns_8 = 0x184E7180
	,jns_7 = 0xA208A8AE
}
skill取技能["其徐如林"]={
	jns_1 = "兵者以势制权\n徐徐如林出手则必有所得\n使用后解除我方所有异常状态\n恢复5%友方气血上限"
	,jns_3 = 66
	,jns_4 = "200点魔法"
	,jns_12 = "冷却16回合"
	,jns_6 = "物品图标.wdf"
	,jns_8 = 0x907FC1B6
	,jns_7 = 0x49FB33E7
}
skill取技能["不动如山 "]={
	jns_1 = "实而备之\n强而避之\n防御驻守合该岿然如山\n使用后大幅度降低我方所有受到30%的伤害\n持续6回合"
	,jns_3 = 66
	,jns_4 = "200点魔法"
	,jns_12 = "冷却16回合"
	,jns_6 = "物品图标.wdf"
	,jns_8 = 0x02662BEE
	,jns_7 = 0x3EE72C6A
}
skill取技能["侵掠如火"]={
	jns_1 = "善用兵者\n攻则侵掠如火\n战无不克\n使用后大幅度提高我方所有30%伤害\n持续6回合"
	,jns_3 = 66
	,jns_4 = "200点魔法"
	,jns_12 = "冷却16回合"
	,jns_6 = "物品图标.wdf"
	,jns_8 = 0x625EABBA
	,jns_7 = 0x7690D6BE
}
skill取技能["开天辟地"]={
	jns_1 = "增加统驭召唤兽忽视目标防御力的能力。"
	,jns_3 = 108
	,jns_6 = "org.rpk"
	,jns_7 = 16777620
	,jns_8 = 16777620
}
skill取技能["破釜沉州"]={
	jns_1 = "增加统驭召唤兽致命几率和命中率。"
	,jns_3 = 108
	,jns_6 = "org.rpk"
	,jns_7 = 16777621
	,jns_8 = 16777621
}
skill取技能["金刚护身"]={
	jns_1 = "统驭的召唤兽受到物理伤害时有几率减少所受伤害。"
	,jns_3 = 108
	,jns_6 = "org.rpk"
	,jns_7 = 16777622
	,jns_8 = 16777622
}
skill取技能["偃旗息鼓"]={
	jns_1 = "增加统驭召唤兽的防御。"
	,jns_3 = 108
	,jns_6 = "org.rpk"
	,jns_7 = 16777623
	,jns_8 = 16777623
}
skill取技能["飞火流星"]={
	jns_1 = "降低统驭召唤兽速度。"
	,jns_3 = 108
	,jns_6 = "org.rpk"
	,jns_7 = 16777619
	,jns_8 = 16777619
}
skill取技能["乾坤借速"]={
	jns_1 = "增加统驭的召唤兽闪躲，同时在物理攻击对方目标时有一定几率提升自身速度，效果持续3-5回合，持续回合数随技能等级增加而增加。"
	,jns_3 = 108
	,jns_6 = "org.rpk"
	,jns_7 = 16777618
	,jns_8 = 16777618
}
skill取技能["大浪淘沙"]={
	jns_1 = "降低（水攻、水漫金山、落岩、泰山压顶）水和土系法术对坐骑统驭的召唤兽伤害。"
	,jns_3 = 108
	,jns_6 = "org.rpk"
	,jns_7 = 16777617
	,jns_8 = 16777617
}
skill取技能["炫火乱舞"]={
	jns_1 = "降低（烈火、地狱烈火、雷击、奔雷咒）火和雷系法术对坐骑统驭的召唤兽伤害。"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 16777616
	,jns_8 = 16777616
}
skill取技能["铜墙铁壁"]={
	jns_1 = "增加统驭召唤兽的中毒抵抗几率，随技能等级增加会额外降低统驭召唤兽中毒后的毒伤伤害值。"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 16777609
	,jns_8 = 16777609
}
skill取技能["忠贯日月"]={
	jns_1 = "降低统驭召唤兽在战斗中忠诚的消耗速度。当坐骑饱食度低于50时，效果降低"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 16777728
	,jns_8 = 16777728
}
skill取技能["正身清心"]={
	jns_1 = "每天前N次食用长寿面、豆斋果绝对不会中毒。N为此技能等级数。当坐骑饱食度低于50时，效果无效"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 16777625
	,jns_8 = 16777625
}
skill取技能["延年益寿"]={
	jns_1 = "增加统驭召唤兽食用长寿面、桂花丸和豆斋果时增加的寿命值，技能等级越高，增加的寿命值越多。当坐骑饱食度低于50时，效果降低"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 16777624
	,jns_8 = 16777624
}
skill取技能["水来土掩"]={
	jns_1 = "增加统驭召唤兽的中毒抵抗几率，随技能等级增加会额外降低统驭召唤兽中毒后的毒伤伤害值。"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 16777729
	,jns_8 = 16777729
}
skill取技能["仙灵酒店"]={
	jns_1 = "平时使用，能够快捷住店"
	,jns_3 = 108
	,jns_6 = "wzife.wd2"
	,jns_7 = 0x895DED5F
}
skill取技能["风墙"]={
	jns_1 = "使用地涌金莲时，30%几率为目标附加护盾附加数值为当前恢复气血50%"
	,jns_3 = 8
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0xA35299B7
	,jns_8 = 0xA35299B7
	}
skill取技能["精进"]={
	jns_1 = "明光宝烛、金身舍利效果增加50%。"
	,jns_3 = 8
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0x3AC8DBC2
	,jns_8 = 0x3AC8DBC2
	}
skill取技能["救人"]={
	jns_1 = "明光宝烛、金身舍利作用人数固定为1且持续回合数减少1，但效果增加160%。被驱散后，目标增加（剩余回合数×目标等级）的护盾值。"
	,jns_3 = 8
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0xFD01D3AD
	,jns_8 = 0xFD01D3AD
}
skill取技能["佛眷"]={
	jns_1 = "活血会使目标受到来自你或来自药品的治疗量提高30%，持续3回合。"
	,jns_3 = 55
	,jns_5 = "该被动在选择化生杏林妙手流派时可获得。"
	,jns_6 = "jntb.wdf"
	,jns_7 = 536870912
	,jns_8 = 536870912
	,jns_11 = "被动"
}
skill取技能["忍辱"]={
	jns_1 = "每当你被敌方封印时，无论是否成功都有100%几率回复15点愤怒。"
	,jns_3 = 8
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0xB1254F74
	,jns_8 = 0xB1254F74
	}
skill取技能["暗潮"]={
	jns_1 = "你的玉清诀愤怒消耗减少10点。"
	,jns_3 = 8
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0x26A40C6E
	,jns_8 = 0x26A40C6E
	}
skill取技能["噬魂"]={
	jns_1 = "队伍中只有1个无底洞弟子时：你的水清诀、冰清诀消耗减半且解除封印时会使目标造成的物法伤害提高10%，持续1回合。"
	,jns_3 = 8
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0x173015AE
	,jns_8 = 0x173015AE
	}
skill取技能["御兽"]={
	jns_1 = "自身携带的召唤兽和孩子进入战斗时，如果速度≥（召唤兽等级×3），则增加召唤兽（等级×0.7)的速度和（召唤兽等级×1）的法术防御。（含初始进场及召唤进场)"
	,jns_3 = 8
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0x4972C591
	,jns_8 = 0x4972C591
	}
skill取技能["陷阱"]={
	jns_1 = "你的夺魄令被解除时，目标当前回合减少（阴风绝章等级×1.5）的物法伤害；同时使你下次地涌金莲额外作用1个单位。（不可驱散)"
	,jns_3 = 8
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0x3E7BB1D9
	,jns_8 = 0x3E7BB1D9
	}
skill取技能["灵身"]={
	jns_1 = "受到物理暴击和法术暴击伤害倍率减少40%。"
	,jns_3 = 8
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0x90622900
	,jns_8 = 0x90622900
}----
---------------------------------------------------------------------空
skill取技能["罗汉"]={
	jns_1 = "你使用罗汉金钟所需愤怒减少4点，持续回合数增加1。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000189
	,jns_8 = 0xD0000189
	}
skill取技能["血潮"]={
	jns_1 = "“燃血术”消耗翻倍，但使用后你会获得2层状态。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000320
	,jns_8 = 0xD0000320
	}
skill取技能["灵照"]={
	jns_1 = "场上友方每个带有增益状态的单位，增加你（武器伤害×3%）的治疗能力。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000179
	,jns_8 = 0xD0000179
	}
skill取技能["秉幽"]={
	jns_1 = "增加（武器伤害×18%）的治疗能力。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000006
	,jns_8 = 0xD0000006
	}
skill取技能["护法"]={
	jns_1 = "场上每个带有护盾友方单位，增加你（武器伤害×4%）的治疗能力。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000083
	,jns_8 = 0xD0000083
	}
skill取技能["涌泉"]={
	jns_1 = "地涌金莲首目标额外回复（地冥妙法等级×6)点气血。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000339
	,jns_8 = 0xD0000339
	}
skill取技能["烛照"]={
	jns_1 = "你和你的召唤兽使用药品时，触发特性“藏神”的几率提高16%。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000371
	,jns_8 = 0xD0000371
	}
skill取技能["华光"]={
	jns_1 = "燃血术强化的地涌金莲额外作用1个目标。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000086
	,jns_8 = 0xD0000086
	}
skill取技能["疗愈"]={
	jns_1 = "你的“地涌金莲”对其他与你衣服五行相同的单位的气血回复效果提高8%。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000163
	,jns_8 = 0xD0000163
	}
skill取技能["灵通"]={
	jns_1 = "“由己渡人”可提前2回合复活处于“锢魂术”与“死亡禁锢”状态的目标。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000175
	,jns_8 = 0xD0000175
	}
skill取技能["阴魅"]={
	jns_1 = "若敌方场上无处于封类异常的单位，增加（武器伤害×18%）的封印命中等级。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000330
	,jns_8 = 0xD0000330
	}
skill取技能["诡印"]={
	jns_1 = "增加（武器伤害×12%）封印命中等级。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000076
	,jns_8 = 0xD0000076
	}
skill取技能["萦魄"]={
	jns_1 = "带有>2个增益状态时，增加（武器伤害×15%)的封印命中等级。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000336
	,jns_8 = 0xD0000336
	}
skill取技能["椎骨"]={
	jns_1 = "燃血术强化的夺魄令增加120点封印命中等级。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000377
	,jns_8 = 0xD0000377
	}
skill取技能["妖法"]={
	jns_1 = "进入战斗时“宝烛”会使你的速度提高（法宝层数*1%）。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000325
	,jns_8 = 0xD0000325
	}
skill取技能["烈煞"]={
	jns_1 = "增加50点封印命中等级。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000168
	,jns_8 = 0xD0000168
	}
skill取技能["弥愤"]={
	jns_1 = "夺命咒和追魂刺基础伤害加倍，自身封印命中和造成的所有治疗效果降低30%。“追魂刺”不再消耗愤怒。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000191
	,jns_8 = 0xD0000191
	}
skill取技能["魂守"]={
	jns_1 = "夺命咒和追魂刺基础伤害加倍，自身封印命中和造成的所有治疗效果降低30%。“裂魂”产生的伤害加成提高5%。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000095
	,jns_8 = 0xD0000095
	}
skill取技能["刺骨"]={
	jns_1 = "夺命咒和追魂刺基础伤害加倍，自身封印命中和造成的所有治疗效果降低30%。“追魂刺”对玩家伤害提高12%。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000019
	,jns_8 = 0xD0000019
	}
skill取技能["余咒"]={
	jns_1 = "与玩家战斗时：夺命咒也有几率触发“裂魂”，几率为25%。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000344
	,jns_8 = 0xD0000344
	}
skill取技能["鬼袭"]={
	jns_1 = "追魂刺对召唤兽造成的伤害提高50%。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000078
	,jns_8 = 0xD0000078
	}
skill取技能["羽裂"]={
	jns_1 = "“裂魂”追加的伤害提高5%。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000346
	,jns_8 = 0xD0000346
	}
skill取技能["夺血"]={
	jns_1 = "使用燃血术时，获得8点固定伤害能力，持续到战斗结束。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000045
	,jns_8 = 0xD0000045
	}
skill取技能["盛怒"]={
	jns_1 = "燃血术不再有气血限制也不消耗气血，使用后你回复20点愤怒。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000258
	,jns_8 = 0xD0000258
	}
skill取技能["灵变"]={
	jns_1 = "与玩家战斗时：增加50点固定伤害能力。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000171
	,jns_8 = 0xD0000171
	}
skill取技能["深刻"]={
	jns_1 = "与玩家战斗时：使用追魂刺将使下一个夺命咒增加70点固定伤害能力，使用夺命咒将使下一个追魂刺增加70点固定伤害能力。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000249
	,jns_8 = 0xD0000249
	}
skill取技能["牵动"]={
	jns_1 = "追魂刺造成玩家单位死亡时，必定触发“裂魂”。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000232
	,jns_8 = 0xD0000232
	}
skill取技能["独一"]={
	jns_1 = "队伍中只有1个弟子时：增加100点固定伤害能力。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000039
	,jns_8 = 0xD0000039
	}
skill取技能["纠缠"]={
	jns_1 = "使用“追魂刺”时，50%几率回复4点愤怒。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000123
	,jns_8 = 0xD0000123
	}
skill取技能["踏魄"]={
	jns_1 = "敌方单位带有裂魂状态时造成的物理法术伤害降低6%，持续到其裂魂状态消失。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000389
	,jns_8 = 0xD0000389
	}
skill取技能["冥煞"]={
	jns_1 = "造成固定伤害时，有5%几率造成双倍伤害。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000199
	,jns_8 = 0xD0000199
	}
---------------------------------------------------------------------------------------------------------------------神木林
skill取技能["祛除"]={
	jns_1 = "获得三个百草法术:\n百草十香：解除友方目标酒类异常状态。【消耗】50点魔法，红色药灵\n百草定神：解除友方目标经脉产生的异常状态。【消耗】50点魔法，蓝色药灵\n百草红雪：解除友方目标毒类异常状态。【消耗】50点魔法，黄色药灵。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000158
	,jns_8 = 0xD0000158
	}
skill取技能["净化"]={
	jns_1 = "百草回春龙沙：解除全体友方目标非经脉、非封类、非酒类、非毒类的常规异常状态【消耗】100点魔法，红黄蓝药灵。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000122
	,jns_8 = 0xD0000122
	}
skill取技能["木魂"]={
	jns_1 = "与NPC战斗时，造成的法术伤害不再降低，但施加的治疗和护盾效果降低50%。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000177
	,jns_8 = 0xD0000177
	}
skill取技能["绿茵"]={
	jns_1 = "增加武器伤害*18%的治疗能力"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000074
	,jns_8 = 0xD0000074
	}
skill取技能["滋润"]={
	jns_1 = "对气血>70%的单位，治疗效果提高3%。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000010
	,jns_8 = 0xD0000010
	}
skill取技能["明心"]={
	jns_1 = "场上存在护盾的友方玩家抗封能力提高5%。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000091
	,jns_8 = 0xD0000091
	}
skill取技能["反哺"]={
	jns_1 = "对友方玩家使用单体回复气血的百草法术时，你也获得相应回复量10%的气血回复。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000335
	,jns_8 = 0xD0000335
	}
skill取技能["药颂"]={
	jns_1 = "战斗开始时将获得6个药灵。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000059
	,jns_8 = 0xD0000059
}
skill取技能["补血"]={
	jns_1 = "每场战斗第一次使用百草法术时对点选目标额外附加一次滋养。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000315
	,jns_8 = 0xD0000315
	}
skill取技能["风神"]={
	jns_1 = "你的物理暴击几率和法术暴击几率提高20%"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000162
	,jns_8 = 0xD0000162
	}
skill取技能["转化"]={
	jns_1 = "增加5*装备镶嵌光芒石数量的治疗能力"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000207
	,jns_8 = 0xD0000207
	}
skill取技能["灵精"]={
	jns_1 = "使用百草法术时有30%几率返还一颗消耗的药灵。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000173
	,jns_8 = 0xD0000173
	}
skill取技能["润泽"]={
	jns_1 = "你的百草复苏和百草神木复苏可以提前2回合复活处于“锢魂术”与“死亡召唤”状态下的目标"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000101
	,jns_8 = 0xD0000101
	}
skill取技能["木精"]={
	jns_1 = "你自身武器或衣服五行为木时，治疗效果提高3%。（可叠加）"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000070
	,jns_8 = 0xD0000070
	}
skill取技能["残余"]={
	jns_1 = "百草诀现在仅凝萃8颗药灵，但药灵数目≤2时使用百草诀可保留剩余药灵。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000304
	,jns_8 = 0xD0000304
	}
skill取技能["法身"]={
	jns_1 = "替换天赋：风灵：偶数回合不再获得风灵，但每层风灵额外增加2%法术暴击几率。"
	,jns_3 = 8
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0xC3E2C628
	,jns_8 = 0xC3E2C628
	}
skill取技能["冰锥"]={
	jns_1 = "冰川怒对召唤兽及召唤物使用时，若有风灵，会消耗一层风灵并获得下列效果：\n1.封印几率提升40%；\n2.伤害结果提高30%；\n3.驱散目标1个增益状态。"
	,jns_3 = 8
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0x83D1EA06
	,jns_8 = 0x83D1EA06
	}
skill取技能["风魂"]={
	jns_1 = "消耗风灵时，获得（消耗数量×等级×2）的护盾。"
	,jns_3 = 8
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0xD53A237C
	,jns_8 = 0xD53A237C
	}
skill取技能["咒法"]={
	jns_1 = "巫咒等级≥人物等级时，增加60点法术伤害。"
	,jns_3 = 8
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0xE17F1C2E
	,jns_8 = 0xE17F1C2E
	}
skill取技能["月影"]={
	jns_1 = "增加月影6%的基础法术连击几率"
	,jns_3 = 8
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0x95F03B6B
	,jns_8 = 0x95F03B6B
	}
skill取技能["蔓延"]={
	jns_1 = "使用荆棘舞、冰川怒、尘土刃造成的伤害提高10%，并且会使得你造成的所有伤害提高15%,持续3回合。（效果不可叠加，可刷新）"
	,jns_3 = 8
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0xDA21274D
	,jns_8 = 0xDA21274D
	}
skill取技能["滋养"]={
	jns_1 = "你的蜜润只能作用于自己，但是会额外获得下述效果：\n1.额外使你造成的所有法术伤害提高15%。\n2.被驱散时回复（剩余回合数×驭灵咒等级）的气血。"
	,jns_3 = 8
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0x82DE1BB0
	,jns_8 = 0x82DE1BB0
	}
skill取技能["寄生"]={
	jns_1 = "尘土刃对带有异常状态单位使用时会消耗最多2层风灵，每层风灵提高35%伤害结果。"
	,jns_3 = 8
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0x92FE057C
	,jns_8 = 0x92FE057C
	}
skill取技能["追击"]={
	jns_1 = "使用落叶萧萧时，若有风灵，会消耗1层风灵并使得伤害提高30%。"
	,jns_3 = 8
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0xCE2EEB29
	,jns_8 = 0xCE2EEB29
	}
---------------------------------------------------------------------------------------------空
skill取技能["破杀"]={
	jns_1 = "荆棘舞、冰川怒、尘土刃增加12%暴击几率和20%暴击伤害倍率。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000399
	,jns_8 = 0xD0000399
	}
skill取技能["纯净"]={
	jns_1 = "装备上的光芒石效果提高70%。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000400
	,jns_8 = 0xD0000400
	}
skill取技能["神木"]={
	jns_1 = "自身武器或者衣服五行为木时，造成的法术伤害提高4%（可叠加）。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000252
	,jns_8 = 0xD0000252
	}
skill取技能["薪火"]={
	jns_1 = "自身武器或者衣服五行为火时，每回合结束增加自己2点法伤，持续到战斗结束。（可叠加）"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000311
	,jns_8 = 0xD0000311
	}
skill取技能["星光"]={
	jns_1 = "消耗风灵的技能将使自身恢复10点愤怒。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000312
	,jns_8 = 0xD0000312
	}
skill取技能["迷缚"]={
	jns_1 = "带有来自你“雾杀”的单位对你造成的伤害降低3%。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000192
	,jns_8 = 0xD0000192
	}
skill取技能["伏毒"]={
	jns_1 = "使用蛊树迷瘴时，若有风灵，会消耗一层风灵并增加5%的附加雾杀几率。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000063
	,jns_8 = 0xD0000063
	}
skill取技能["灵木"]={
	jns_1 = "佩戴“月影”时，雾杀有（月影层数2%)的几率附加3层“雾杀”。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000174
	,jns_8 = 0xD0000174
	}
skill取技能["绞藤"]={
	jns_1 = "触发鞭挞时，有（消耗风灵数量×10%)的几率为目标附加1层雾杀。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000107
	,jns_8 = 0xD0000107
	}
skill取技能["激活"]={
	jns_1 = "每8回合，有100%的几率获得1层“催化”状态。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000096
	,jns_8 = 0xD0000096
	}
skill取技能["灵佑"]={
	jns_1 = "带有风灵时，受到的所有伤害降低2%。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000178
	,jns_8 = 0xD0000178
	}
skill取技能["狂叶"]={
	jns_1 = "当你没有风灵时，你的落叶萧萧增加90点法术伤害力。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000146
	,jns_8 = 0xD0000146
	}
skill取技能["劲草"]={
	jns_1 = "触发“鞭挞”时，每层风灵提升的伤害增加至20%"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000111
	,jns_8 = 0xD0000111
	}
skill取技能["苍埃"]={
	jns_1 = "替换天赋：鞭挞：尘土刃对玩家使用时，若有风灵，会消耗一层风灵并获得以下效果:\n1.造成伤害提高10%；\n2.额外减少目标受到伤害×50%的气血上限。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000009
	,jns_8 = 0xD0000009
	}
skill取技能["灵归"]={
	jns_1 = "回合开始有50%会获得风灵"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000172
	,jns_8 = 0xD0000172
	}
-----------------------------------------------------------------------------凌波城
skill取技能["山破"]={
	jns_1 = "使用天崩地裂与翻江搅海后，有45%-64%的几率获得1点战意"
	,jns_3 = 8
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0x673833C4
	,jns_8 = 0x673833C4
	}
skill取技能["战诀"]={
	jns_1 = "对自身使用碎星诀和镇魂诀后，额外获得1点战意。浪涌造成的伤害增加，但不再获得战意。"
	,jns_3 = 8
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0xB97A5577
	,jns_8 = 0xB97A5577
	}
skill取技能["魂聚"]={
	jns_1 = "使用消耗战意的技能后，回复10点愤怒。"
	,jns_3 = 8
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0xB7BD0013
	,jns_8 = 0xB7BD0013
	}
skill取技能["神躯"]={
	jns_1 = "受到物理暴击和法术暴击的倍率降低20%。复活时，若自身战意≤1，则额外获得1点战意。 "
	,jns_3 = 8
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0xCF5AD689
	,jns_8 = 0xCF5AD689
	}
skill取技能["不动"]={
	jns_1 = "队伍中只有一个凌波城弟子时：额外忽略目标(1-自身气血%气血上限)×10%的防御。死亡时战意≤3将额外保留1点战意。"
	,jns_3 = 8
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0x9769021C
	,jns_8 = 0x9769021C
	}
skill取技能["海沸"]={
	jns_1 = "增加（人物力量×10%+40）的伤害。"
	,jns_3 = 8
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0xBCE3BB39
	,jns_8 = 0xBCE3BB39
	}
skill取技能["煞气"]={
	jns_1 = "风云战将:使用破血狂攻后获得1点战意。\n九天武圣:凌霄斗士:使用消耗战意的技能时，增加150点伤害力并提高6%的物理伤害结果"
	,jns_3 = 8
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0x338B3040
	,jns_8 = 0x338B3040
	}
skill取技能["再战"]={
	jns_1 = "每次使用断岳势或惊涛怒造成一个单位的死亡，都会使下一个的断岳势或惊涛怒伤害提高15%。"
	,jns_3 = 8
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0x606669C9
	,jns_8 = 0x606669C9
	}
skill取技能["聚气"]={  ---和化生寺特效重名
	jns_1 = "使用消耗愤怒≥60的特技时，获得1点战意。"
	,jns_3 = 8
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0x86873B99
	,jns_8 = 0x86873B99
	}
skill取技能["威震"]={
	jns_1 = "天眼神通状态下，造成的伤害提高4%"
	,jns_3 = 8
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0x9D1ABD9E
	,jns_8 = 0x9D1ABD9E
	}
skill取技能["力战"]={
	jns_1 = "天崩地裂额外忽略目标12%防御且造成的伤害提高12%。"
	,jns_3 = 8
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0x0E10688C
	,jns_8 = 0x0E10688C
	}
skill取技能["破击"]={
	jns_1 = "物理暴击几率翻倍，但暴击伤害倍率变为原来的65%。"
	,jns_3 = 8
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0x6E010D11
	,jns_8 = 0x6E010D11
	}
skill取技能["强袭"]={
	jns_1 = "使用天崩地裂和翻江搅海后，造成的物理伤害提高16%，持续3回合。（效果可刷新，不可叠加)"
	,jns_3 = 8
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0xC6AD7685
	,jns_8 = 0xC6AD7685
	}
--------------------------------------------------------------------------------------空
skill取技能["贯通"]={ 
	jns_1 = "本方玩家单位造成的物理和法术伤害提高4%。（不可叠加）"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000073
	,jns_8 = 0xD0000073
	}
skill取技能["拍岸"]={
	jns_1 = "使用浪涌与裂石后，有40%几率额外获得1点战意。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000215
	,jns_8 = 0xD0000215
	}
skill取技能["怒眼"]={
	jns_1 = "怒眼效果提高30%。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000214
	,jns_8 = 0xD0000214
	}
skill取技能["砥石"]={
	jns_1 = "50%几率裂石、断岳式、天崩地裂忽略目标10%的防御。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000032
	,jns_8 = 0xD0000032
	}
skill取技能["盛势"]={
	jns_1 = "你的天眼神通获得≥2种增益状态的几率提高50%。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000259
	,jns_8 = 0xD0000259
	}
skill取技能["天眼"]={
	jns_1 = "你的天眼神通同时获得3种增益状态的几率提高80%。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000280
	,jns_8 = 0xD0000280
	}
skill取技能["蓄势"]={
	jns_1 = "使用天眼神通后，有50%几率回复1点战意。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000316
	,jns_8 = 0xD0000316
	}
skill取技能["杀罚"]={
	jns_1 = "天眼神通状态下造成目标死亡时，60%的几率附加持续3回合的“腾雷”：受到的治疗效果降低50%。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000246
	,jns_8 = 0xD0000246
	}
skill取技能["无双"]={
	jns_1 = "天崩地裂暴击几率增加12%；翻江搅海伤害提高12%。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000301
	,jns_8 = 0xD0000301
	}
skill取技能["冰爆"]={
	jns_1 = "50%几率浪涌、惊涛怒、翻江搅海增加10%的暴击几率。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000005
	,jns_8 = 0xD0000005
	}
skill取技能["巧变"]={
	jns_1 = "带有“镇魂诀”时，每次暴击你获得1点战意，但减少镇魂诀1回合持续时间。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000237
	,jns_8 = 0xD0000237
	}
skill取技能["石摧"]={
	jns_1 = "使用天崩地裂与翻江搅海后，有32%几率获得1点超级战意。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000263
	,jns_8 = 0xD0000263
	}
skill取技能["天泽"]={
	jns_1 = "使用技能消耗战意至战意为0时，有18%几率获得1点战意。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000281
	,jns_8 = 0xD0000281
	}
skill取技能["涡流"]={
	jns_1 = "回合开始时有8%几率会将你的所有战意转变为“超级战意”。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000294
	,jns_8 = 0xD0000294
	}
skill取技能["妙得"]={
	jns_1 = "消耗超级战意时，不再增加伤害，而是增加等额暴击几率。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000196
	,jns_8 = 0xD0000196
	}
skill取技能["闪雷"]={
	jns_1 = "但腾雷会额外消耗所有非超级战意，每点战意将使腾雷的伤害提高40%。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000248
	,jns_8 = 0xD0000248
	}
skill取技能["惊涛"]={
	jns_1 = "自身武器或者衣服五行为水时，每点消耗的超级战意将使本次攻击的伤害额外提高4%。（可叠加)"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000116
	,jns_8 = 0xD0000116
	}
skill取技能["乘势"]={
	jns_1 = "使用技能消耗超级战意后，获得持续3回合的“强袭”：物理伤害提高16%。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000014
	,jns_8 = 0xD0000014
	}
skill取技能["追袭"]={
	jns_1 = "消耗超级战意的技能攻击的目标如果在本回合死亡，附加持续3回合的“腾雷”：受到的治疗效果降低50%。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000376
	,jns_8 = 0xD0000376
	}
skill取技能["真君显灵"]={
	jns_1 = "敲动战鼓，一鼓作气拿下敌人。消耗自身所有（≥1）战意进入“真君显灵”状态，持续3回合（不可驱散）：使自己造成的物理伤害增加(20%×使用时消耗战意数)；消耗的超级战意使该效果翻倍。回合结束时获得1点战意"
	,jns_3 = 66
	,jns_4 = "100点魔法，自身所有战意"
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0x4017404F
	,jns_8 = 0x4017404F
	,jns_12 = "冷却8回合"
}
skill取技能["灵霄斗士"]={
	jns_1 = "增加30点速度"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF0000007
	,jns_8 = 0xF0000007
	}
skill取技能["灵霄斗士"]={
	jns_1 = "增加30点速度"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF0000007
	,jns_8 = 0xF0000007
	}
skill取技能["灵霄斗士"]={
	jns_1 = "增加30点速度"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF0000007
	,jns_8 = 0xF0000007
	}
skill取技能["风云战将"]={
	jns_1 = "增加40点伤害"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF0000007
	,jns_8 = 0xF0000007
	}
skill取技能["九天武圣"]={
	jns_1 = "增加40点伤害"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF0000007
	,jns_8 = 0xF0000007
	}
skill取技能["妙谛金莲"]={
	jns_1 = "增加80点法术防御"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF0000007
	,jns_8 = 0xF0000007
	}
skill取技能["摄魂迷影"]={
	jns_1 = "增加40点封印命中等级"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF0000007
	,jns_8 = 0xF0000007
	}
skill取技能["幽冥巫煞"]={
	jns_1 = "增加80点防御"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF0000007
	,jns_8 = 0xF0000007
	}
skill取技能["通天法王"]={
	jns_1 = "增加40点法术伤害"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF0000007
	,jns_8 = 0xF0000007
	}
skill取技能["巫影祭司"]={
	jns_1 = "增加280点气血"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF0000007
	,jns_8 = 0xF0000007
	}
skill取技能["灵木药宗"]={
	jns_1 = "增加80点抵抗封印等级"
	,jns_3 = 8
	,jns_6 = "wzife.wd2"
	,jns_7 = 0xF0000007
	,jns_8 = 0xF0000007
	}
skill取技能["天神怒斩"]={
	jns_1 = "天神盛怒，以开天辟地之势，挥刀怒斩：\n1.增加25%暴击几率、忽略目标25%防御发动一次物理攻击，\n命中后驱散目标随机一个增益状态。\n2.若自身战意为1，造成额外50%伤害，否则造成25%额外伤害。\n3.每次使用后本场战斗该技能伤害永久提高25%（目标为NPC时为50%）。\n4.使用天崩地裂和翻江搅海会减少这个技能1回合的冷却回合。"
	,jns_3 = 4
	,jns_4 = "300点魔法"
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0xA8AF3DC0
	,jns_8 = 0xA8AF3DC0
	,jns_12 = "冷却10回合, 战斗开始时具有5回合冷却"
}
skill取技能["耳目一新"]={
	jns_1 = "移除当前天眼神通的增益效果，并再次使用天眼神通，至少获得2种效果并且会优先获得不同的增益效果。"
	,jns_3 = 66
	,jns_4 = "300点魔法、1点战意法"
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000048
	,jns_8 = 0xD0000048
	,jns_12 = "冷却24回合"
}
skill取技能["先发制人"]={
	jns_1 = "提升队友20%的速度，持续3回合"
	,jns_3 = 3
	,jns_4 = "90点愤怒"
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0xE0000013
	,jns_8 = 0xE0000014
	}
skill取技能["吞山"]={
	jns_1 = "你的裂石、断岳势和天崩地裂增加5%的暴击几率。"
	,jns_3 = 8
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0x70FDB194
	,jns_8 = 0x70FDB194
	}
skill取技能["饮海"]={
	jns_1 = "你的浪涌、惊涛怒和翻江搅海忽略目标一定的防御。"
	,jns_3 = 8
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0x40FB7647
	,jns_8 = 0x40FB7647
	}
skill取技能["超级战意"]={ --状态
	jns_1 = "获得战意时有20%的几率获得1点超级战意，最多持有3点超级战意;每点消耗的超级战意,将提高此次攻击20%的伤害。"
	,jns_3 = 8
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0x4F57FF06
	,jns_8 = 0x4F57FF06
}
skill取技能["战意"]={--状态
	jns_1 = "用于发动门派法术。战意点数将提高自己的伤害力。战意最多累计6点，战斗中死亡时减半。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000402
	,jns_8 = 0xD0000402
}

skill取技能["天眼神通"]={
	jns_1 = "二郎真君开启天眼,使功法威力大增。\n使用后随机获得以下1到3种效果，持续5回合。(可同时触发多个效果）\n智眼:每合结束时获得1点战意;\n怒眼:惊涛怒、断岳式、翻江搅海、天崩地裂造成的伤害提高\n天眼;暴击几率增加。"
	,jns_3 = 66
	,jns_4 = "300点魔法、1点战意"
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0x1299A579
	,jns_8 = 0x1299A579
	,jns_12 = "冷却8回合"
}
skill取技能["绝处逢生"]={
	jns_1 = "恢复自身损失的50%气血及自身损失的50%气血上限，速度增加10%，持续3回合。（不可驱散)"
	,jns_3 = 5
	,jns_4 = "100点魔法"
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000129
	,jns_8 = 0xD0000129
	,jns_12 = "冷却5回合,战斗开始时具有5回合冷却"
}
skill取技能["妖风四起"]={
	jns_1 = "驱动妖风封印敌人，使其不能使用法术，持续2回合。成功率与成功率上限为（夺魄令成功率+40%）；该封印不能被水清、冰清、玉清、晶清解除（对NPC时该效果无效)"
	,jns_3 = 4
	,jns_4 = "（当前气血×40%）点气血，100点魔法"
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0x8295E360
	,jns_8 = 0x8295E360
	,jns_12 = "冷却4回合"
}
skill取技能["同舟共济"]={
	jns_1 = "为目标友方分担前6次受到的伤害，持续到本回合结束。目标友方承受25%伤害，你承受25%伤害。"
	,jns_3 = 5
	,jns_4 = "200点魔法"
	,jns_5 = "当前气血比例≥50%"
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0x57365436
	,jns_8 = 0x57365436
	,jns_12 = "冷却4回合"
}
skill取技能["分魄"]={
	jns_1 = "燃血术强化的追魂刺产生目标魂魄的几率提高80%"
	,jns_3 = 66
	,jns_4 = "30点魔法"
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0x4935E53B
	,jns_8 = 0x4935E53B
	}
skill取技能["金莲"]={
	jns_1 = "你的地涌金莲额外作用1%2个单位（“地冥妙法”等级为45%105时)但你造成的固定伤害降低30%。"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000398
	,jns_8 = 0xD0000398
}
skill取技能["五行珠"]={
	jns_1 = "非“剑意莲心”状态下:五行攻击后有50%几率获得1枚五行珠,如果克制了对面五行,则几率增加至100%;“剑意莲心”状态下:五行攻击消耗1枚五行珠,将额外攻击一次。你门派法术造成的治疗效果降低50%。"
	,jns_3 = 55
	,jns_6 = "jntb.wdf"
	,jns_7 = 1358954496
	,jns_8 = 1358954496
	,jns_11 = "被动"
}
skill取技能["日光耀"]={
	jns_1 = "以金五行发起一次攻击。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "五行学技能达到10级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 2147483648
	,jns_8 = 2147483648
}
skill取技能["靛沧啸"]={
	jns_1 = "以水五行发起一次攻击。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "五行学技能达到11级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 1694498816
	,jns_8 = 1694498816
	}
skill取技能["巨岩击"]={
	jns_1 = "以土五行发起一次攻击。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "五行学技能达到12级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 1895825408
	,jns_8 = 1895825408
	}
skill取技能["苍茫刺"]={
	jns_1 = "以木五行发起一次攻击。。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "五行学技能达到13级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 1677721600
	,jns_8 = 1677721600
	}
skill取技能["地裂焚"]={
	jns_1 = "以火五行发起一次攻击。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "五行学技能达到14级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 1728053248
	,jns_8 = 1728053248
	--
	}
skill取技能["剑意莲心"]={
	jns_1 = "莲心问剑意如何,五行珠佑便可得。在五行珠的庇佑下念动此咒,予以对手额外打击。【功效】进入“剑意莲心”状态:五行攻击会消耗1枚五行珠,但额外攻击一次。"
	,jns_3 = 2
	,jns_4 = "30点魔法"
	,jns_6 = "jntb.wdf"
	,jns_7 = 654311424
	,jns_8 = 654311424
}
skill取技能["由己渡人"]={
	jns_1 = "复活一名队友; 恢复（“地冥妙法”等级*6）气血 恢复（“地冥妙法”等级*12)临时气血上限。"
	,jns_3 = 5
	,jns_4 = "当前气血*10%"
	,jns_5 = "当前气血≥气血上限*10%"
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0xDE58924A
	,jns_8 = 0xDE58924A
	}
skill取技能["裂魂"]={
	jns_1 = "追魂刺目标为非玩家单位时,造成额外伤害;目标为玩家单位击出目标魂魄。下次使用追魂刺或夺命咒会击散离体魂魄对目标造成额外伤害"
	,jns_3 = 8
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0x49D3C846
	,jns_8 = 0x49D3C846
	}
skill取技能["追魂刺"]={
	jns_1 = "以地脉之气为媒介,不仅能够伤人肌体,更能刺穿魂魄\n对敌方单个目标造成固定伤害。"
	,jns_3 = 4
	,jns_4 = "50点魔法、20点愤怒"
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0xDBFE0302
	,jns_8 = 0xDBFE0302
	}
skill取技能["毒萃"]={
	jns_1 = "使用后你的蛊树迷瘴附加“雾杀”的几率提高100%，持续5回合（包括当前回合）。"
	,jns_3 = 66
	,jns_4 = "300点魔法，1点风灵"
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0x4935E53B
	,jns_8 = 0x4935E53B
	}
skill取技能["凋零之歌"]={
	jns_1 = "歌声飘进敌人的耳中，颤动着敌人心窝，在无形中侵袭着敌阵的斗志，埋下毁灭之种。消耗所有风灵，获得下述效果：\n1.使目标接下来2回合受到的法术伤害增加16+(2×消耗风灵层数)%。\n2.使随机敌方单位共计获得(3+消耗风灵层数×0.5)层“雾杀”效果。\n3.该技能不触发“重光”。"
	,jns_3 = 4
	,jns_4 = "100点魔法"
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0x281E732A
	,jns_8 = 0x281E732A
	,jns_12 = "冷却8回合"
}
skill取技能["风卷残云"]={
	jns_1 = "神木林在觉醒，风在咆哮！大风带着神木林弟子的怒意无情的打击面前的敌人。\n消耗所有风灵使用一次落叶萧萧，伤害结果提高（消耗风灵数×16%)。该技能不触发“重光”，但佩戴“月影”时额外提高12%伤害并消耗1点灵气。"
	,jns_3 = 4
	,jns_4 = "100点魔法"
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0x3778487D
	,jns_8 = 0x3778487D
	,jns_12 = "冷却6回合，战斗开始时具有3回合冷却却"
}
skill取技能["风灵"]={--状态
	jns_1 = "每偶数回合结束获得1层“风灵。"
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0x4BB78E6D
	,jns_8 = 0x4BB78E6D
	}
skill取技能["鞭挞"]={
	jns_1 = "荆棘舞会消耗最多3层“风灵，每层风灵增加15%伤害结果。"
	,jns_3 = 8
	,jns_6 = "物品图标.wdf"
	,jns_7 = 0x2AAB3A47
	,jns_8 = 0x2AAB3A47
	}
skill取技能["救主"]={---狮驼岭
	jns_1 = "当你死亡时，你的召唤兽尝试对你使用救主"
	,jns_3 = 8
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000125
	,jns_8 = 0xD0000125
	}
skill取技能["百草古树长青"]={
	jns_1 = "为友方单位回复（万灵诸念×8+治疗能力×2）的气血，并施加等值的护盾。"
	,jns_3 = 5
	,jns_4 = "100点魔法，红黄蓝药灵各1颗。"
	,jns_6 = "经脉修复.wdf"
	,jns_7 = 0xD0000137
	,jns_8 = 0xD0000137
	,jns_12 = "冷却10回合"
}
skill取技能["疾风秋叶"]={
	jns_1 = "疾风卷秋叶,力可撼石壁,无形杀人于动静之间。对敌方多个目标造成法术伤害。"
	,jns_3 = 4
	,jns_4 = "(30*作用目标数)点魔法,1点木精"
	,jns_6 = "jntb.wdf"
	,jns_7 = 637534208
	,jns_8 = 637534208
	}
skill取技能["风萦"]={
	jns_1 = "使用荆棘舞、冰川怒、尘士刃时,若有风灵,会消耗1层风灵使造成的伤害提高5%。"
	,jns_3 = 55
	,jns_5 = "该被动在选择神木灵木神侍流派时可获得。"
	,jns_6 = "jntb.wdf"
	,jns_7 = 419430400
	,jns_8 = 419430400
	,jns_11 = "被动"
}
skill取技能["如意神通"]={
	jns_1 = "每回合开始时，花果山弟子只能使用随机的3个“如意神通”。与NPC的战斗中，普通攻击将会额外攻击一个目标。"
	,jns_3 = 55
	,jns_5 = ""
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300019
	,jns_8 = 0xE7300019
	,jns_11 = "被动"
}
skill取技能["神通广大"]={
	jns_1 = "齐天大圣降妖伏魔，嫉恶如仇，其法术之高，神通广大，无所不能。通晓此技能，是本门修行的基础。"
	,jns_3 = 8
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300005
	,jns_8 = 0xE7300005
	}
skill取技能["如意金箍"]={
	jns_1 = "学习效果:提高角色的伤害"
	,jns_3 = 8
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300004
	,jns_8 = 0xE7300004
	}
skill取技能["齐天逞胜"]={
	jns_1 = "齐天大圣之名方可遂悟空之意，闹凌霄、撼东海、戏阎王，无一不为逞胜之举。花果山弟子均继承了此等威仪自信。"
	,jns_3 = 8
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300001
	,jns_8 = 0xE7300001
	}
skill取技能["金刚之躯"]={
	jns_1 = "学习效果:提高角色的防御"
	,jns_3 = 8
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300002
	,jns_8 = 0xE7300002
	}
skill取技能["灵猴九窍"]={
	jns_1 = "学习效果:提高角色的命中"
	,jns_3 = 8
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300003
	,jns_8 = 0xE7300003
	}
skill取技能["七十二变"]={
	jns_1 = "学习效果:提高角色的法伤和法防"
	,jns_3 = 8
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300009
	,jns_8 = 0xE7300009
	}
skill取技能["腾云驾霧"]={
	jns_1 = "以云雾飞行于天穹，自在无穷。"
	,jns_3 = 8
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300010
	,jns_8 = 0xE7300010
	}
skill取技能["威震凌霄"]={
	jns_1 = "灵霄宝殿惊玉皇，十万天军无可挡。被大圣选定的攻击目标，其勇气和攻势将大大减弱。对目标造成伤害，并降低目标物理/法术暴击等级。"
	,jns_3 = 4
	,jns_4 = "100点魔法"
	,jns_5 = "“神通广大”技能达到120级且角色飞升。"
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300016
	,jns_8 = 0xE7300016
	}
skill取技能["气慑天军"]={
	jns_1 = "大闹天宫之际，虽有天军名将，仍震慑于大圣之气势，众人攻势均不能近其要害。对自己使用，大量提升抗物理/法术暴击等级。"
	,jns_3 = 2
	,jns_4 = "100点魔法"
	,jns_5 = "“神通广大”技能达到120级且角色飞升。"
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300023
	,jns_8 = 0xE7300023
	}
skill取技能["当头一棒"]={
	jns_1 = "【如意神通】临时提升伤害攻击一个敌方单位，若目标气血百分比若处于60%至70%之间，则伤害加倍。"
	,jns_3 = 4
	,jns_4 = "75点魔法"
	,jns_5 = "“如意金箍”技能达到1级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300027
	,jns_8 = 0xE7300027
	,jns_9 = 1
}
skill取技能["神针撼海"]={
	jns_1 = "【如意神通】对敌方5个目标发动物理攻击。"
	,jns_3 = 4
	,jns_4 = "75点魔法"
	,jns_5 = "“如意金箍”技能达到1级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 3878682665
	,jns_8 = 3878682665
	,jns_9 = 1
}
skill取技能["杀威铁棒"]={
	jns_1 = "【如意神通】临时提高伤害，攻击敌方单个目标，并降低目标对自身造成的伤害，持续1回合。不会触发金甲仙衣、蟠龙玉璧等法宝效果。"
	,jns_3 = 4
	,jns_4 = "75点魔法"
	,jns_5 = "“如意金箍”技能达到1级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300025
	,jns_8 = 0xE7300025
	,jns_9 = 1
}
skill取技能["泼天乱棒"]={
	jns_1 = "【如意神通】临时提高伤害，攻击敌方单个目标，若目标未阵亡。则额外溅射敌方3个单位，该效果不会触发保护。"
	,jns_3 = 4
	,jns_4 = "75点魔法"
	,jns_5 = "“如意金箍”技能达到1级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300026
	,jns_8 = 0xE7300026
	,jns_9 = 1
}
skill取技能["九幽除名"]={
	jns_1 = "【如意神通】回合结束时，若自身处于倒地状态，则有几率复活(不受锢魂术影响)。成功率与技能等级相关。"
	,jns_3 = 2
	,jns_4 = "75点魔法"
	,jns_5 = "“齐天逞胜”技能达到1级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300024
	,jns_8 = 0xE7300024
	,jns_9 = 1
}
skill取技能["移星换斗"]={
	jns_1 = "消耗气血恢复自身的魔法。"
	,jns_3 = 3
	,jns_4 = "30点气血"
	,jns_5 = "“齐天逞胜”技能达到15级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300028
	,jns_8 = 0xE7300028
	}
skill取技能["云暗天昏"]={
	jns_1 = "对敌方多个目标造成固定伤害，并提高自身的速度，持续2回合。"
	,jns_3 = 4
	,jns_4 = "75点魔法"
	,jns_5 = "“齐天逞胜”技能达到1级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300020
	,jns_8 = 0xE7300020
	,jns_9 = 1
}
skill取技能["担山赶月"]={
	jns_1 = "力拔山河，肩挑日月，以盖世之力为项链附加力量。"
	,jns_3 = 3
	,jns_4 = "和技能等级相同点数的活力"
	,jns_5 = "“金刚之躯”技能达到35级且角色等级达到30级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300030
	,jns_8 = 0xE7300030
	}
skill取技能["铜头铁臂"]={
	jns_1 = "为自身施加一个护盾。护盾存在时间内，提高自身的伤害结果；通天行者流派效：提高自身的法术伤害结果。"
	,jns_3 = 2
	,jns_4 = "75点魔法"
	,jns_5 = "“金刚之躯”技能达到1级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300007
	,jns_8 = 0xE7300007
	,jns_9 = 1
}
skill取技能["无所遁形"]={
	jns_1 = "效果:提高自身的暴击率和忽视防御的能力；通天行者行者流派:提高自身的法术暴击几率和忽视法术减免的能力。可叠加，持续6回合。"
	,jns_3 = 2
	,jns_4 = "75点魔法"
	,jns_5 = "“灵猴九窍”技能达到1级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300011
	,jns_8 = 0xE7300011
	,jns_9 = 1
}
skill取技能["除光息焰"]={
	jns_1 = "克制女魅墓弟子的必杀技。"
	,jns_3 = 4
	,jns_4 = "150点愤怒"
	,jns_5 = "“灵猴九窍”技能达到25级且角色等级达到20级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300012
	,jns_8 = 0xE7300012
	}
skill取技能["呼子唤孙"]={
	jns_1 = "拔下一撮毫毛，一口仙气吹去，猴子猴孙纷纷来助。"
	,jns_3 = 2
	,jns_4 = "30点魔法"
	,jns_5 = "“七十二变”技能达到10级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300021
	,jns_8 = 0xE7300021
	}
skill取技能["八戒上身"]={
	jns_1 = "使敌方单个目标变身成一只可爱的小猪，并驱散目标的一个良性状态。"
	,jns_3 = 4
	,jns_4 = "50点魔法"
	,jns_5 = "“七十二变”技能达到45级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300022
	,jns_8 = 0xE7300022
	}
skill取技能["筋斗云"]={
	jns_1 = "一个筋斗十万八千里，无论在三界任一角落均可瞬间回到门派。"
	,jns_3 = 0
	,jns_4 = "10点气血、10点魔法"
	,jns_5 = "“腾云驾雾”技能达到1级"
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300013
	,jns_8 = 0xE7300013
	}
skill取技能["天地洞明"]={
	jns_1 = "(场地法术)使双方所有目标的气血条对敌方可见并缩短双方下达指令的时间。"
	,jns_3 = 2
	,jns_4 = "50点魔法，消耗一个金鸦火羽"
	,jns_5 = "化圣技能"
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300017
	,jns_8 = 0xE7300017
	,jns_12 = "16回合"
}
skill取技能["棒掀北斗"]={
	jns_1 = "【如意神通】大圣举棒掀翻北斗宫,回首振开南极院。霸道神威令对手闻风丧胆。【功效】对敌方单个目标造成法术伤害,暴击时额外造成伤害。"
	,jns_3 = 4
	,jns_4 = "75点魔法"
	,jns_6 = "jntb.wdf"
	,jns_7 = 301989888
	,jns_8 = 301989888
	,jns_9 = 1	
}
skill取技能["灵彻太虚"]={
	jns_1 = "【功效】对敌方单个目标造成法术伤害,并降低其物理暴击等级和法术暴击等级,持续3回合。"
	,jns_3 = 4
	,jns_4 = "100点魔法"
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300018
	,jns_8 = 0xE7300018	
	}
skill取技能["兴风作浪"]={
	jns_1 = "【功效】对敌方5个目标造成法术伤害,对首目标造成额外伤害。"
	,jns_3 = 4
	,jns_4 = "75点魔法"
	,jns_6 = "jntb.wdf"
	,jns_7 = 1392508928
	,jns_8 = 1392508928
	,jns_9 = 1	
}
skill取技能["棍打诸神"]={
	jns_1 = "【功效】对所有敌方单位造成法术伤害。"
	,jns_3 = 4
	,jns_4 = "75点魔法"
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300014
	,jns_8 = 0xE7300014
	,jns_9 = 1	
}
skill取技能["意马心猿"]={
	jns_1 = "【功效】对敌方单个目标造成法术伤害,并驱散1个持续回合最短的增益状态。若目标未阵亡,则额外对敌方3个单位造成溅射伤害。"
	,jns_3 = 4
	,jns_4 = "75点魔法"
	,jns_6 = "jntb.wdf"
	,jns_7 = 0xE7300015
	,jns_8 = 0xE7300015
	,jns_9 = 1	
}
skill取技能["棒打雄风"]={
	jns_1 = "【如意神通】替换技能:杀威铁棒。临时提升伤害力攻击一个敌方单位，同时驱散目标的─个持续时间最短的增益状态。"
	,jns_3 = 4
	,jns_4 = "75点魔法"
	,jns_6 = "jntb.wdf"
	,jns_7 = 1660944384
	,jns_8 = 1660944384
	,jns_9 = 1
}
skill取技能["齐天神通"]={
	jns_1 = "花果山弟子逆天而立，战天斗地，每回合使用如意神通均有50%的几率额外释放—次，但临时降低30%的抵抗封印能力，状态持续4回合。(此技能为法术技能，受封印法术限制)"
	,jns_3 = 2
	,jns_4 = "60点愤怒"
	,jns_6 = "jntb.wdf"
	,jns_7 = 2013265920
	,jns_8 = 2013265920
	,jns_12 = "8回合"
}

skill取技能["暴起"]={
		jns_1 = "进入战斗后，宠物将\n额外增加5%的伤害"
		,jns_3 = 7
		,jns_6 = "xcsc.dll"
		,jns_7 = 0x44670c7
		,jns_8 = 0x44670c7
		}
		skill取技能["千手"]={
		jns_1 = "召唤兽所造成的物理伤害\n将拥有80%~150%的波动"
		,jns_3 = 7
		,jns_6 = "xcsc.dll"
		,jns_7 = 0x3b593e30
		,jns_8 = 0x3b593e30
		}
		skill取技能["傀儡"]={
		jns_1 = "受到伤害影响的物理技能，伤害基础基数将上升20%"
		,jns_3 = 7
		,jns_6 = "xcsc.dll"
		,jns_7 = 0x77f08d10
		,jns_8 = 0x77f08d10
		}
		skill取技能["辉耀"]={
		jns_1 = "当主人作为队长时\n它极力的想在主人面前表现自己\n在回合开始时将使自己\n的气血降低为1点，并\n使本次技能的释放对其主目标造成1.5倍伤害,(此技能与鬼魂术不可共同存在)"
		,jns_3 = 7
		,jns_6 = "xcsc.dll"
		,jns_7 = 0xd4ce9460
		,jns_8 = 0xd4ce9460
		}
		skill取技能["雷伤"]={
		jns_1 = "进入战斗后，宠物将\n额外增加5%的灵力"
		,jns_3 = 7
		,jns_6 = "xcsc.dll"
		,jns_7 = 0x185c7768
		,jns_8 = 0x185c7768
		}
		skill取技能["疗愈"]={
		jns_1 = "进入战斗的后，宠物的最大\n气血将在120%~150%之间波动"
		,jns_3 = 7
		,jns_6 = "xcsc.dll"
		,jns_7 = 0x6aaef804
		,jns_8 = 0x6aaef804
		}
		skill取技能["陷足"]={
		jns_1 = "受到灵力影响的法术技能，伤害基础基数将上升20%"
		,jns_3 = 7
		,jns_6 = "xcsc.dll"
		,jns_7 = 0x497b7159
		,jns_8 = 0x497b7159
		}
		skill取技能["沸血"]={
		jns_1 = "召唤兽受到兽魂的激发，热血不断沸腾\n进入战斗时，将舍弃自己70%的气血与防御，只为了更好的表现，其余的属性\n将获得30%提升"
		,jns_3 = 7
		,jns_6 = "xcsc.dll"
		,jns_7 = 0x1618c7ad
		,jns_8 = 0x1618c7ad
		}
		skill取技能["灵涌"]={
		jns_1 = "入战斗后，宠物将\n额外增加5%的气血"
		,jns_3 = 7
		,jns_6 = "xcsc.dll"
		,jns_7 = 0xa71dee7
		,jns_8 = 0xa71dee7
		}
		skill取技能["残忍"]={
		jns_1 = "召唤兽所造成的法术伤害\n将拥有80%~150%的波动"
		,jns_3 = 7
		,jns_6 = "xcsc.dll"
		,jns_7 = 0x87040366
		,jns_8 = 0x87040366
		}
		skill取技能["暴戾"]={
		jns_1 = "额外增加召唤兽\n20%的最大气血"
		,jns_3 = 7
		,jns_6 = "xcsc.dll"
		,jns_7 = 0xf6254282
		,jns_8 = 0xf6254282
		}
		skill取技能["返照"]={
		jns_1 = "召唤兽经历了重重历练，不再那么轻易\n的会在战斗中失利\n召唤兽神佑基础几率获得70%提升"
		,jns_3 = 7
		,jns_6 = "xcsc.dll"
		,jns_7 = 0x72491389
		,jns_8 = 0x72491389
		}
		skill取技能["相胜"]={
		jns_1 = "进入战斗后，宠物将\n额外增加5%的速度"
		,jns_3 = 7
		,jns_6 = "xcsc.dll"
		,jns_7 = 0x8ff3db32
		,jns_8 = 0x8ff3db32
		}
		skill取技能["激励"]={
		jns_1 = "进入战斗的后，宠物的速度\n将在120%~150%之间波动"
		,jns_3 = 7
		,jns_6 = "xcsc.dll"
		,jns_7 = 0xe588745d
		,jns_8 = 0xe588745d
		}
		skill取技能["破体"]={
		jns_1 = "额外增加召唤兽20%的速度"
		,jns_3 = 7
		,jns_6 = "xcsc.dll"
		,jns_7 = 0xa2572ffc
		,jns_8 = 0xa2572ffc
		}
		skill取技能["爆裂"]={
		jns_1 = "狂暴的兽魂涌入召唤兽的身体内，进入\n战斗时将自身气血降低一半\n使主人在第一回合，\n获得额外30%的伤害"
		,jns_3 = 7
		,jns_6 = "xcsc.dll"
		,jns_7 = 0xa8939527
		,jns_8 = 0xa8939527
		}
		skill取技能["祈胜"]={
		jns_1 = "进入战斗后，宠物将\n额外增加5%的防御"
		,jns_3 = 7
		,jns_6 = "xcsc.dll"
		,jns_7 = 0xe364bf7c
		,jns_8 = 0xe364bf7c
		}
		skill取技能["附体"]={
		jns_1 = "进入战斗的后，宠物的防御\n将在120%~150%之间波动"
		,jns_3 = 7
		,jns_6 = "xcsc.dll"
		,jns_7 = 0xc1c16e08
		,jns_8 = 0xc1c16e08
		}
		skill取技能["御盾"]={
		jns_1 = "额外增加召唤兽20%的防御"
		,jns_3 = 7
		,jns_6 = "xcsc.dll"
		,jns_7 = 0xf0f2e8f1
		,jns_8 = 0xf0f2e8f1
		}
		skill取技能["破伤"]={
		jns_1 = "坚不可摧的兽魂附加在召唤兽与角色上\n召唤兽付出被掠夺90%属性的代价\n换取角色\n进入战斗的前2个回合\n所受的伤害为50%"
		,jns_3 = 7
		,jns_6 = "xcsc.dll"
		,jns_7 = 0x630ce9c2
		,jns_8 = 0x630ce9c2
		}



skill取技能["超级奔雷咒"]={ --完成
	jns_1 = "发动超级雷属性法术攻击多个敌人；\n#G/对主选中目标造成伤害提高10%；\n#G/并有25%几率附加弱点雷两回合；\n#G/攻击人数=自身等级/30+1，最多3人；\n#W/————九天落雷，万马齐喑。"
	,jns_3 = 4
	,jns_6 = "wzcf.npk"
	,jns_7 = 0xa1000029
	,jns_8 = 0xa1000029
	}
	skill取技能["超级地狱烈火"]={ --完成
	jns_1 = "发动超级火属性法术攻击多个敌人；\n#G/对主选中目标造成伤害提高10%；\n#G/并有25%几率附加弱点火两回合；\n#G/攻击人数=自身等级/30+1，最多3人；\n#W/————熊熊烈火，明明如光。"
	,jns_3 = 4
	,jns_6 = "wzcf.npk"
	,jns_7 = 0xa1000032
	,jns_8 = 0xa1000032
	}
	skill取技能["超级泰山压顶"]={ --完成
	jns_1 = "发动超级土属性法术攻击多个敌人；\n#G/对主选中目标造成伤害提高10%；\n#G/并有25%几率附加弱点土两回合；\n#G/攻击人数=自身等级/30+1，最多3人；\n#W/————地崩山摧，厚土重压。"
	,jns_3 = 4
	,jns_6 = "wzcf.npk"
	,jns_7 = 0x1000016
	,jns_8 = 0x1000016
	}
	skill取技能["超级水漫金山"]={ --完成
	jns_1 = "发动超级水属性法术攻击多个敌人；\n#G/对主选中目标造成伤害提高10%；\n#G/并有25%几率附加弱点水两回合；\n#G/攻击人数=自身等级/30+1，最多3人；\n#W/————雨落横流，席卷八方。"
	,jns_3 = 4
	,jns_6 = "wzcf.npk"
	,jns_7 = 0xa1000018
	,jns_8 = 0xa1000018
	}
	skill取技能["超级夜战"]={ --完成
	jns_1 = "造成物理伤害提高10%；\n#G/夜间物理伤害效果不会减少，物理躲避能力增加20%，且在攻击时显示目标的气血条；\n#W/————夜黑风高夜，杀人放火天。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = 0xa1000011
	,jns_8 = 0xa1000011
	}
	skill取技能["超级反击"]={ --完成
	jns_1 = "受到普通物理攻击后；\n#G/30%几率用物理攻击反击；\n#G/在场时主人首次被敌方物理攻击时；\n#G/必定用物理攻击进行反击；\n#W/————犯吾主者，绝不姑息。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = 0xa1000039
	,jns_8 = 0xa1000039
	}
	skill取技能["超级反震"]={ --完成
	jns_1 = "受到物理攻击时30%反震对方；\n#G/反震伤害为你所受伤害的60%；\n#G/避免被敌人连击；\n#W/————站如松，坐如钟"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = 0xa1000040
	,jns_8 = 0xa1000040
	}
	skill取技能["超级吸血"]={ --完成
	jns_1 = "物理攻击时获得对方损失气血的30%；\n#G/并将获得的溢出气血50%转化为护盾；\n#G/(攻击有鬼魂术的敌人无法吸血)\n#W/————以敌之血，尝吾之志。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = 0xa1000013
	,jns_8 = 0xa1000013
	}
	skill取技能["超级连击"]={ --完成
	jns_1 = "普通攻击时55%几率攻击2次；\n#G/触发连击时有15%几率额外攻击1次；\n#G/物理伤害效果降低20%；\n#W/————黎魂澎湃，击如怒涛。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = 0xa1000025
	,jns_8 = 0xa1000025
	}
	skill取技能["超级飞行"]={ --完成
	jns_1 = "物理攻击命中几率增加20%；\n#G/物理躲避能力提高30%；\n#G/物理躲避率提高10%；\n#G/天气为“风”时造成的物理伤害提升20%\n#W/————凭风而起，欲与天齐。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = 0xa1000042
	,jns_8 = 0xa1000042
	}
	skill取技能["超级隐身"]={ --完成
	jns_1 = "进入战斗后获得修罗隐身状态3~5回合；\n#G/隐身时不会被攻击；\n#G/物理攻击能力降低10%；\n#G/受到的伤害也降低10%；\n#G/隐身时不能施法；\n#W/————不可说、不可视、不可触。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = 0xa1000009
	,jns_8 = 0xa1000009
	}
	skill取技能["超级感知"]={ --完成
	jns_1 = "可攻击修罗隐身、楚楚可怜状态之敌；\n#G/物理躲避能力提高10%；\n#G/在场时主人也获得“感知”；\n#G/最多持续5回合；\n#W/————目光所至，无可遁形。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = 0xa1000047
	,jns_8 = 0xa1000047
	}
	skill取技能["超级再生"]={ --完成
	jns_1 = "每回合恢复自身等级X1的气血；\n#G/有10%几率回复自身等级X12的气血；\n#W/————天地之息皆入我窍，皆化骨血。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = 0xa1000007
	,jns_8 = 0xa1000007
	}
	skill取技能["超级冥思"]={ --完成
	jns_1 = "每回合恢复自身等级/2的魔法；\n#G/在场时主人时获得“冥思”；\n#G/最多持续5回合；\n#W/————心若明镜，映照你我。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = 0xa1000023
	,jns_8 = 0xa1000023
	}
	skill取技能["超级慧根"]={ --完成
	jns_1 = "使用法术时所消耗的魔法降低为正常的50%；\n#G/且有15%的几率不消耗魔法；\n#W/————意心如鉴，是为天地所钟。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = 0xa1000048
	,jns_8 = 0xa1000048
	}

	skill取技能["超级驱鬼"]={ --完成
	jns_1 = "对有鬼魂术之敌；\n#G/物理及法术伤害效果增加100%；\n#G/可将鬼魂术之敌击飞，使其不能复活；\n#G/双方场上带有鬼魂术单位的伤害降低20%；\n#G/自身的鬼魂术将无效化；\n#W/————上古魔息，小鬼勿近。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = 0xa1000020
	,jns_8 = 0xa1000020
	}
	skill取技能["超级毒"]={ --完成
	jns_1 = "自身对毒免疫物理攻击后；\n#G/20%几率使敌人中毒；\n#G/且随机降低中毒目标的攻击、防御、法伤或法防；\n#W/————毒入七窍，无药可医。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = 0xa1000033
	,jns_8 = 0xa1000033
	}
	skill取技能["超级必杀"]={ --完成
	jns_1 = "物理攻击的必杀几率增加20%；\n#G/必杀时有25%的几率造成3-4倍的伤害；\n#W/————山川踏碎魔息涌，一击搏尽日月光。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = 0xa1000030
	,jns_8 = 0xa1000030
	}
	skill取技能["超级幸运"]={ --完成
	jns_1 = "受到的物理/法术伤害暴击倍率降低50%；\n#G/有5%的概率免疫受到的攻击；\n#W/————气运非凡，傲立乱世。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = 0xa1000012
	,jns_8 = 0xa1000012
	}
	skill取技能["超级精神集中"]={ --完成
	jns_1 = "可以抵御封类异常状态，躲避力提高10%，但物理攻击能力会降低20%；\n#G/受到的伤害随机降低1% ~ 10%；\n#W/————身似菩提心如镜。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = 0xa1000026
	,jns_8 = 0xa1000026
	}
	skill取技能["超级神迹"]={ --完成 超级技能2.5 改介绍
	jns_1 = "不受除日月乾坤外的所有异常状态影响；回合结束时若主人倒地，尝试复活并解除其封印，恢复其自身等级x20的血后和伤势后自己离场；\n#W/————以身祭主，魔域不朽。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = 0xa1000019
	,jns_8 = 0xa1000019
	}
	skill取技能["超级招架"]={ --完成
	jns_1 = "每回合受到的第1次物理伤害结果减免20%；\n#G/且进战斗时获得一层“金身”；\n#G/若被召唤成幻魔,“金身”会再次触发；\n#W/————钢筋铁骨，金身难撼。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = 0xa1000006
	,jns_8 = 0xa1000006
	}
	skill取技能["超级永恒"]={ --完成 增加100%持续回合数 那就是剩余翻倍？就先按翻倍写，不对叫我改
	jns_1 = "主动法术，回合结束时；\n#G/自身的气血、魔法将回复至使用此技能前的状态，冷却150回合；\n#G/受到辅助类法术时增加100%持续回合数；\n#G/且增加的回合数不会超过6回合；\n#W/————孤舟一叶身不灭，百世轮回心永恒。"
	,jns_3 = 2 --超级技能2.6 改
	,jns_4 = "无消耗"
	,jns_6 = "wzcf.npk"
	,jns_7 = 0xa1000008
	,jns_8 = 0xa1000008
	}
	skill取技能["超级敏捷"]={  --完成 服务端无须添加技能属性了，因为敏捷已在战斗外生效
	jns_1 = "“速度增加20%”；\n#G/5%概率额外行动一次；\n#W/————其势如火，其疾如风。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = 0xa1000024
	,jns_8 = 0xa1000024
	}
	skill取技能["超级否定信仰"]={ --完成
	jns_1 = "不受一切异常和增益影响；其它超级技能失效，且每个拥有的超级技能提高20%最大气血、提高15%所有伤害、降低5%防御和法防；攻击时敌人的信仰类技能失效；\n#R/不能同时拥有信仰类技能\n#W/————天上地下，神魔无忌。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = 0xa1000043
	,jns_8 = 0xa1000043
	}
	skill取技能["超级魔之心"]={ --完成
	jns_1 = "法术伤害效果提高25%；\n#W/————纳浩瀚魔息入心，施天下无双之法。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = 0xa1000022
	,jns_8 = 0xa1000022
	}
	skill取技能["超级偷袭"]={ --完成
	jns_1 = "避免被敌人反击；\n#G/避免被敌人反震；\n#G/物理伤害效果提升15%；\n#G/物理普通攻击将无视防御指令；\n#W/————兵者，诡道也。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = 0xa1000015
	,jns_8 = 0xa1000015
	}
	skill取技能["超级雷属性吸收"]={ --完成
	jns_1 = "必定免受雷属性法术伤害；\n#G/并按应受伤害的大小恢复气血；\n#W/————雷锻吾主六感。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 =0xa1000027
	,jns_8 = 0xa1000027
	}
	skill取技能["超级土属性吸收"]={ --完成
	jns_1 = "必定免受土属性法术伤害；\n#G/并按应受伤害的大小恢复气血；\n#W/————土造吾主筋骨。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = 0xa1000014
	,jns_8 = 0xa1000014
	}
	skill取技能["超级火属性吸收"]={ --完成
	jns_1 = "必定免受火属性法术伤害；\n#G/并按应受伤害的大小恢复气血；\n#W/————火炼吾主荒魂。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = 0xa1000045
	,jns_8 = 0xa1000045
	}
	skill取技能["超级水属性吸收"]={ --完成
	jns_1 = "必定免受水属性法术伤害；\n#G/并按应受伤害的大小恢复气血；\n#W/————水塑吾主血肉。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = 0xa1000017
	,jns_8 = 0xa1000017
	}
	skill取技能["超级强力"]={ --完成
	jns_1 = "物理攻击能力增加自己等级X0.7;\n#G/攻击有招架类技能的敌人时不会减少伤害结果;有10%几率使敌人旋转并头晕：2回合内造成的伤害降低；\n#R/对有超级防御者，伤害结果减少20%。\n#W/————力势磅礴，威慑九霄。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = 0xa1000021
	,jns_8 = 0xa1000021
	}
	skill取技能["超级防御"]={ --完成
	-- jns_1 = "提高自身等级X 1的防御；\n#G/战斗中，防御时可减免75%物理伤害；\n#R/法术伤害能力降低10%；\n#W/————不可胜者，守也。"
	jns_1 = "提高自身等级X 1的防御；\n#W/————不可胜者，守也。" --官方改了
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = 0xa1000041
	,jns_8 = 0xa1000041
	}
	skill取技能["超级进击必杀"]={ --完成
	jns_1 = "第2回合及以后进入战斗时；\n#G/提升30%的必杀几率并增加50%必杀伤害倍率；\n#G/持续5回合，且逐回合减少20%效果；\n#W/————后发先至，锋芒毕露。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = 0xa1000044
	,jns_8 = 0xa1000044
	}
	skill取技能["超级进击法暴"]={ --完成
	jns_1 = "第2回合及以后进入战斗时；\n#G/提升20%的法术暴击几率并增加50%法暴伤害倍率；\n#G/持续5回合，且逐回合减少20%效果；\n#W/————一鼓作气，再而衰，三而竭。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = 0xa1000028
	,jns_8 = 0xa1000028
	}
	skill取技能["超级遗志"]={ --完成
	jns_1 = "替代原召唤兽进入战斗时获得“遗志”；\n#G/造成伤害提升15%；\n#G/并获得原召唤兽的“遗志”（最多两层）\n#W/————山不改其坚，水不改其流。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = 0xa10000a1
	,jns_8 = 0xa10000a1
	}
	skill取技能["超级法术连击"]={ --完成
	jns_1 = "法术攻击时30%几率攻击2次；\n#G/（第二次伤害效果降低25%）\n#W/————浪奔浪涌，潮起潮落。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = 0xa1000038
	,jns_8 = 0xa1000038
	}
	skill取技能["超级法术暴击"]={ --完成
	jns_1 = "法术攻击时20%几率出现暴击，且暴击时有10%的几率造成3~4倍的暴击伤害。\n#W/————三分天注定，七分靠打拼。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = 0xa1000035
	,jns_8 = 0xa1000035
	}
	skill取技能["超级法术波动"]={ --完成
	jns_1 = "法术伤害效果巨幅波动；\n#G/避免被敌人法术反震；\n#W/————三界因界，命数无常。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = 0xa1000036
	,jns_8 = 0xa1000036
	}
	skill取技能["超级壁垒击破"]={ --完成
	jns_1 = "发动物理攻击敌人，并略提高伤害；\n#G/若敌人防御，则伤害巨幅提高；\n#G/忽视等级*1.2的防御；\n#W/————魔息灌注，利刃出鞘。"
	,jns_3 = 4
	,jns_6 = "wzcf.npk"
	,jns_7 =0xa1000031
	,jns_8 = 0xa1000031
	}
	skill取技能["超级盾气"]={ --完成
	jns_1 = "第2回合及以后进入战斗时，增加等级X2的防御持续5回合，且逐回合减少20%效果。\n#G/在场时主人获得“盾气”最多持续5回合；\n#G/隐身时不触发本效果；\n#W/————有正气护体，可力挽狂势。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = 0xa1000034
	,jns_8 = 0xa1000034
	}
	skill取技能["超级合纵"]={ --完成
	jns_1 = "当本方有1/2/3/4种与其不同的召唤兽；\n#G/则提高其2%/8%/18%/32%的物理伤害；\n#G/并增加等级X0.25/0.5/0.75/1的伤害结果；\n#R/被封印几率+10%；\n#W/————合纵连横，兵法大成。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = 0xa1000046
	,jns_8 = 0xa1000046
	}
	skill取技能["超级法术抵抗"]={ --完成
	jns_1 = "减少10%所受到的法术伤害；\n#G/且进场时额外减少50%所受到的法术伤害，持续两回合；\n#W/————道法自然，心志自清。"
	,jns_3 = 7
	,jns_6 = "wzcf.npk"
	,jns_7 = 0xa1000037
	,jns_8 = 0xa1000037
	}

	skill取技能["茁壮"]={
	jns_1 = "提升25%最大生命值，五行为木时生效。（无法再触发神佑复生和鬼魂术）"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 0x1000311
	,jns_8 = 0x1000311
	}
skill取技能["万物之灵（火）"]={
	jns_1 = "自身法术伤害结果提升5%，受到的法术伤害降低5%，五行为火时生效。"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 0x1000328
	,jns_8 = 0x1000328
	}
skill取技能["万物之灵（水）"]={
	jns_1 = "自身法术伤害结果提升5%，受到的法术伤害降低5%，五行为水时生效。"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 0x1000329
	,jns_8 = 0x1000329
	}
skill取技能["万物之灵（金）"]={
	jns_1 = "自身法术伤害结果提升5%，受到的法术伤害降低5%，五行为水时生效。"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 0x1000330
	,jns_8 = 0x1000330
	}
skill取技能["万物之灵（土）"]={
	jns_1 = "自身法术伤害结果提升5%，受到的法术伤害降低5%，五行为土时生效。"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 0x1000331
	,jns_8 = 0x1000331
	}
skill取技能["万物之灵（木）"]={
	jns_1 = "自身法术伤害结果提升5%，受到的法术伤害降低5%，五行为木时生效。"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 0x1000332
	,jns_8 = 0x1000332
	}
skill取技能["力大无穷（火）"]={
	jns_1 = "自身物理伤害结果提升5%，受到的物理伤害降低5%，五行为火时生效。"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 0x1000333
	,jns_8 = 0x1000333
	}
skill取技能["力大无穷（水）"]={
	jns_1 = "自身物理伤害结果提升5%，受到的物理伤害降低5%，五行为水时生效。"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 0x1000334
	,jns_8 = 0x1000334
	}
skill取技能["力大无穷（金）"]={
	jns_1 = "自身物理伤害结果提升5%，受到的物理伤害降低5%，五行为金时生效。"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 0x1000335
	,jns_8 = 0x1000335
	}
skill取技能["力大无穷（土）"]={
	jns_1 = "自身物理伤害结果提升5%，受到的物理伤害降低5%，五行为土时生效。"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 0x1000336
	,jns_8 = 0x1000336
	}
skill取技能["力大无穷（木）"]={
	jns_1 = "自身物理伤害结果提升5%，受到的物理伤害降低5%，五行为木时生效。"
	,jns_3 = 7
	,jns_6 = "org.rpk"
	,jns_7 = 0x1000340
	,jns_8 = 0x1000340
	}

	skill取技能["神迷"]={
		jns_1 = "风华舞圣、迷情妖姬流派效果：被你含情脉脉和魔音摄魂封印命中的单位，吸取4点愤怒；百媚魔姝流派效果：你成功对玩家单位附加天罗地网异常状态时，吸取4点愤怒。"
		,jns_3 = 8
		,jns_6 = "jntb.wdf"
		,jns_7 = 1207959552
		,jns_8 = 1207959552
		,jns_11 = "被动"
	}
	skill取技能["千蛛噬魂"]={
		jns_1 = "【功效】对3个目标造成物理伤害;对带有你的“天罗地网”状态的目标造成额外伤害。"
		,jns_3 = 4
		,jns_4 = "(20*作用目标数+10)点魔法"
		,jns_5 = "蛛丝大法技能达到10级 "
		,jns_6 = "jntb.wdf"
		,jns_7 = 1107296256
		,jns_8 = 1107296256
	}
	skill取技能["蛛丝缠绕"]={
		jns_1 = "攻击单个目标,并对其附加属于你的“天罗地网”状态,持续4回合。"
		,jns_3 = 4
		,jns_4 = "50点魔法"
		,jns_5 = "蛛丝大法技能达到10级"
		,jns_6 = "jntb.wdf"
		,jns_7 = 1610612736
		,jns_8 = 1610612736
	}