function 取所有模型(jp)--梦战
	local jps = {}
	if SuoyouModel[jp] then
	    jps=SuoyouModel[jp]
	end
	if jps.站立 or jps.行走 then
		return jps
	else
		return nil
	end
end
SuoyouModel = {}
SuoyouModel["和尚2"]={小图标=0,大图标=0,对话头像=0x2B43EB3E,站立=0xD5A91213,行走=0x2AF8E37F}
SuoyouModel["百晓星君"]={小图标=0,大图标=0,对话头像=0x2E797D72,站立=0xC82770E2,行走=0x3101E857}
SuoyouModel["女人_万圣公主"]={小图标=0,大图标=0,对话头像=0x2E797D72,站立=0xC82770E2,行走=0x3101E857}
SuoyouModel["传送门" ]={小图标=0,大图标=0,对话头像=0,站立=0xee72918,行走=0xee72918}
SuoyouModel["宝石商人"]={小图标=0,大图标=0,对话头像=0x49CAFCC2,站立=0xDA498AD2,行走=0xBB95D714}
SuoyouModel["男人_财主"]={小图标=0,大图标=0,对话头像=0x49CAFCC2,站立=0xDA498AD2,行走=0xBB95D714}
SuoyouModel["宝象国国王"]={小图标=0,大图标=0,对话头像=0x49F4803B,站立=0x31684231,行走=0x23021644}
SuoyouModel["陈妈妈"]={小图标=0,大图标=0,对话头像=0x0E756971,站立=0xFF25D8BA,行走=0x879921C3}
SuoyouModel["女人_程夫人"]={小图标=0,大图标=0,对话头像=0x641650F0,站立=0xAF20E948,行走=0xA3F4919E}
SuoyouModel["程夫人"]={小图标=0,大图标=0,对话头像=0x641650F0,站立=0xAF20E948,行走=0xA3F4919E}
SuoyouModel["吹牛王"]={小图标=0,大图标=0,对话头像=0xE3510EDC,站立=0x1AA01951,行走=0x5DFA3BB9}
SuoyouModel["崔判官"]={小图标=0,大图标=0,对话头像=0x7530532F,站立=0x56738B45,行走=0x6617CE07}
SuoyouModel["崔判官_身体"]={站立=0x185ca946,行走=0x27ebf149}
SuoyouModel["翠花"]={小图标=0,大图标=0,对话头像=0x2FB1A687,站立=0x70357245,行走=0x3790FE0A}
SuoyouModel["当铺老板"]={小图标=0,大图标=0,对话头像=0x30E999AA,站立=0x64E5C547,行走=0xBE35EE06}
SuoyouModel["男人_苦力"]={小图标=0,大图标=0,对话头像=0xE3510EDC,站立=0x1AA01951,行走=0x5DFA3BB9}
SuoyouModel["男人_判官"]={小图标=0,大图标=0,对话头像=0x7530532F,站立=0x56738B45,行走=0x6617CE07}
SuoyouModel["男人_判官_身体"]={站立=0x185ca946,行走=0x27ebf149}
SuoyouModel["女人_翠花"]={小图标=0,大图标=0,对话头像=0x2FB1A687,站立=0x70357245,行走=0x3790FE0A}
SuoyouModel["男人_特产商人"]={小图标=0,大图标=0,对话头像=0x30E999AA,站立=0x64E5C547,行走=0xBE35EE06}
SuoyouModel["赌霸天"]={小图标=0,大图标=0,对话头像=0x13765D73,站立=0xC888F0C3,行走=0x6A957B1B}
SuoyouModel["房都尉"]={小图标=0,大图标=0,对话头像=0x67B62ED5,站立=0x1D232BFA,行走=0x5DBA1EE4}
SuoyouModel["房都尉_身体"]={站立=0xda6a56d6,行走=0xf840292a}
SuoyouModel["冯铁匠"]={小图标=0,大图标=0,对话头像=0xBF413F3E,站立=0x734C9CA,行走=0xB4DB94F0}
SuoyouModel["服装店老板"]={小图标=0,大图标=0,对话头像=0x340D62DD,站立=0x2EB42770,行走=0x4C62D25F}
SuoyouModel["男人_打铁"]={小图标=0,大图标=0,对话头像=0xBF413F3E,站立=0x734C9CA,行走=0xB4DB94F0}
SuoyouModel["男人_服装店老板"]={小图标=0,大图标=0,对话头像=0x340D62DD,站立=0x2EB42770,行走=0x4C62D25F}
SuoyouModel["符石道人"]={小图标=0,大图标=0,对话头像=0xDD03EB6C,站立=0x15B95C2,行走=0xF771C268}
SuoyouModel["符石道人_身体"]={站立=0x8f8bbd72,行走=0x6cec6565}
SuoyouModel["海产收购商"]={小图标=0,大图标=0,对话头像=0xE2933947,站立=0x767095C2,行走=0x3792B5F3}
SuoyouModel["海产收购商_身体"]={站立=0xd303a3b0,行走=0xfc0ee429}
SuoyouModel["简师爷"]={小图标=0,大图标=0,对话头像=0x6C29EF22,站立=0x3F91DC55,行走=0x521BFFA4}
SuoyouModel["轿夫"]={小图标=0,大图标=0,对话头像=0x758F9E60,站立=0x732407B7,行走=0x44801CB6}
SuoyouModel["教书先生"]={小图标=0,大图标=0,对话头像=0x77397968,站立=0xAE82050D,行走=0x8DB0C74C}
SuoyouModel["金圣宫"]={小图标=0,大图标=0,对话头像=0x59EAA01D,站立=0x2BB71D40,行走=0xF21DAB4A}
SuoyouModel["空慈方丈"]={小图标=0,大图标=0,对话头像=0x0A0BC629,站立=0x21EAE195,行走=0xA6169D14}
SuoyouModel["五行大师"]={小图标=0,大图标=0,对话头像=0x0A0BC629,站立=0x21EAE195,行走=0xA6169D14}
SuoyouModel["男人_方丈"]={小图标=0,大图标=0,对话头像=0x0A0BC629,站立=0x21EAE195,行走=0xA6169D14}
SuoyouModel["老孙头"]={小图标=0,大图标=0,对话头像=0x6AF31BA,站立=0xD6C941FC,行走=0x2094134A}
SuoyouModel["乐器店老板"]={小图标=0,大图标=0,对话头像=0x00F98F61,站立=0x165AEB4C,行走=0x464E819A}
SuoyouModel["雷黑子" ]={小图标=0,大图标=0,对话头像=0xD9BE63F,站立=0xDCF6A150,行走=0x7C3B4FB7}
SuoyouModel["李世民"]={小图标=0,大图标=0,对话头像=0xBBA4ED07,站立=0xB28A3DB1,行走=0xBE8A3EC9}
SuoyouModel["刘老爹"]={小图标=0,大图标=0,对话头像=0,站立=0xFD419E2C,行走=0xF3B31502}
SuoyouModel["刘老爹_身体"]={小图标=0,大图标=0,对话头像=0xEB08674C,站立=0x8bafe413,行走=0xd2bf3ad8}
SuoyouModel["男人_钓鱼"]={小图标=0,大图标=0,对话头像=0xE2933947,站立=0x767095C2,行走=0x3792B5F3}
SuoyouModel["男人_钓鱼_身体"]={站立=0xd303a3b0,行走=0xfc0ee429}
SuoyouModel["男人_师爷"]={小图标=0,大图标=0,对话头像=0x6C29EF22,站立=0x3F91DC55,行走=0x521BFFA4}
SuoyouModel["男人_武器店老板"]={小图标=0,大图标=0,对话头像=0x758F9E60,站立=0x732407B7,行走=0x44801CB6}
SuoyouModel["男人_书生"]={小图标=0,大图标=0,对话头像=0x77397968,站立=0xAE82050D,行走=0x8DB0C74C}
SuoyouModel["男人_老孙头"]={小图标=0,大图标=0,对话头像=0x6AF31BA,站立=0xD6C941FC,行走=0x2094134A}
SuoyouModel["罗百万"]={小图标=0,大图标=0,对话头像=0x00F98F61,站立=0x165AEB4C,行走=0x464E819A}
SuoyouModel["小孩_雷黑子" ]={小图标=0,大图标=0,对话头像=0xD9BE63F,站立=0xDCF6A150,行走=0x7C3B4FB7}
SuoyouModel["皇帝"]={小图标=0,大图标=0,对话头像=0xBBA4ED07,站立=0xB28A3DB1,行走=0xBE8A3EC9,待战=0x307fa58d,挨打=0x472d738e,防御=0x4c752c05,施法=0x9e7aba66,倒地=0xc7e0c439,跑去=0xff452f8f,跑回=0,攻击=0x4fd41e69,攻击B=0x41c73336}

SuoyouModel["男人_村长"]={小图标=0,大图标=0,对话头像=0,站立=0xFD419E2C,行走=0xF3B31502}
SuoyouModel["男人_村长_身体"]={小图标=0,大图标=0,对话头像=0xEB08674C,站立=0x8bafe413,行走=0xd2bf3ad8}
SuoyouModel["鲁成"]={小图标=0,大图标=0,对话头像=0xBFC714C2,站立=0x67C56BF0,行走=0x5B5B600B}
SuoyouModel["孟大娘"]={小图标=0,大图标=0,对话头像=0x1C9CBA0C,站立=0xD7A74DE2,行走=0xF846C711}
SuoyouModel["珍品商人"]={小图标=0,大图标=0,对话头像=0x1C9CBA0C,站立=0xD7A74DE2,行走=0xF846C711}
SuoyouModel["女人_染色师"]={小图标=0,大图标=0,对话头像=0x1C9CBA0C,站立=0xD7A74DE2,行走=0xF846C711}
SuoyouModel["南极仙翁"]={小图标=0,大图标=0,对话头像=0x304E494E,站立=0xB4DA85C7,行走=0xBE41583A}
SuoyouModel["樵夫"]={小图标=0,大图标=0,对话头像=0xEB321EDA,站立=0xBC6BD1E8,行走=0x8736E40D}
SuoyouModel["樵夫_身体"]={站立=0x2d65c68b,行走=0xf4d3ac42}
SuoyouModel["吴刚"]={小图标=0,大图标=0,对话头像=0xEB321EDA,站立=0x4BC6BD1E8,行走=0x8736E40D}
SuoyouModel["秦琼"]={小图标=0,大图标=0,对话头像=0x522601D6,站立=0x4D41D5D2,行走=0x8A05EDF0}
SuoyouModel["清风"]={小图标=0,大图标=0,对话头像=0x1E1F098C,站立=0xF4848781,行走=0x7376DB37}
SuoyouModel["清风_身体"]={站立=0x1e1dc060,行走=0xced8a325}
SuoyouModel["男人_道童"]={小图标=0,大图标=0,对话头像=0x1E1F098C,站立=0xF4848781,行走=0x7376DB37}
SuoyouModel["男人_道童_身体"]={站立=0x1e1dc060,行走=0xced8a325}
SuoyouModel["穷汉"]={小图标=0,大图标=0,对话头像=0x93EC2C89,站立=0xBF882D3F,行走=0x97CDC297}
SuoyouModel["穷汉_身体"]={站立=0xd8ac93e2,行走=0xe7b9d554}
SuoyouModel["太上老君"]={小图标=0,大图标=0,对话头像=0xBADB9340,站立=0x3599D5C3,行走=0x16505471}
SuoyouModel["男人_太上老君"]={小图标=0,大图标=0,对话头像=0xBADB9340,站立=0x3599D5C3,行走=0x16505471}
SuoyouModel["王大嫂"]={小图标=0,大图标=0,对话头像=0x74D5FF09,站立=0x2C2259AB,行走=0xB0250DEE}
SuoyouModel["女人_栗栗娘"]={小图标=0,大图标=0,对话头像=0x74D5FF09,站立=0x2C2259AB,行走=0xB0250DEE}
SuoyouModel["女人_王大嫂"]={小图标=0,大图标=0,对话头像=0x74D5FF09,站立=0x2C2259AB,行走=0xB0250DEE}
SuoyouModel["赵元宝"]={小图标=0,大图标=0,对话头像=0x61117204,站立=0x4ED41E93,行走=0x3DD602B8}
SuoyouModel["男人_老伯"]={小图标=0,大图标=0,对话头像=0x61117204,站立=0x4ED41E93,行走=0x3DD602B8}
SuoyouModel["文伯"]={小图标=0,大图标=0,对话头像=0x61117204,站立=0x4ED41E93,行走=0x3DD602B8}
SuoyouModel["仓库保管员"]={小图标=0,大图标=0,对话头像=0x6081AD14,站立=0xBB9C549,行走=0x703420B3}
SuoyouModel["奸商"]={小图标=0,大图标=0,对话头像=0x6081AD14,站立=0xBB9C549,行走=0x703420B3}
SuoyouModel["仓库管理员"]={小图标=0,大图标=0,对话头像=0x6081AD14,站立=0xBB9C549,行走=0x703420B3}
SuoyouModel["香料店老板"]={小图标=0,大图标=0,对话头像=0x37075308,站立=0x53D7FFCA,行走=0x241D8F39}
SuoyouModel["小木匠"]={小图标=0,大图标=0,对话头像=0xC942664B,站立=0x5641D9BE,行走=0x9D836B06}
SuoyouModel["小桃红"]={小图标=0,大图标=0,对话头像=0x421D6F27,站立=0x1BB1AF36,行走=0xA69EAB9D}
SuoyouModel["少女"]={小图标=0,大图标=0,对话头像=0x421D6F27,站立=0x1BB1AF36,行走=0xA69EAB9D}
SuoyouModel["女人_丫鬟"]={小图标=0,大图标=0,对话头像=0x421D6F27,站立=0x1BB1AF36,行走=0xA69EAB9D}
SuoyouModel["许大娘"]={小图标=0,大图标=0,对话头像=0x8C639246,站立=0xD97E30F0,行走=0x6FBF6A9F}
SuoyouModel["女人_赵姨娘"]={小图标=0,大图标=0,对话头像=0x8C639246,站立=0xD97E30F0,行走=0x6FBF6A9F}
SuoyouModel["太白金星"]={小图标=0,大图标=0,对话头像=0x3E2EE17D,站立=0xCA3334FF,行走=0x5745E837}
SuoyouModel["药店老板"]={小图标=0,大图标=0,对话头像=0xC2A7F86E,站立=0xE0DC6D93,行走=0xC3627242}
SuoyouModel["男人_药店老板"]={小图标=0,大图标=0,对话头像=0xC2A7F86E,站立=0xE0DC6D93,行走=0xC3627242}
SuoyouModel["驿站老板"]={小图标=0,大图标=0,对话头像=0x792EA858,站立=0x72EEB38D,行走=0x6F6C1A7C}
SuoyouModel["男人_驿站老板"]={小图标=0,大图标=0,对话头像=0x792EA858,站立=0x72EEB38D,行走=0x6F6C1A7C}
SuoyouModel["月老"]={小图标=0,大图标=0,对话头像=0xA5E5DB73,站立=0xA33DB160,行走=0x20A19816}
SuoyouModel["月老_身体"]={小图标=0,大图标=0,对话头像=0,站立=0x681881e7,行走=0x40c10ad7}
SuoyouModel["张老财"]={小图标=0,大图标=0,对话头像=0xEF00905F,站立=0xA9F796EA,行走=0xF637E75A}
SuoyouModel["男人_老财"]={小图标=0,大图标=0,对话头像=0xEF00905F,站立=0xA9F796EA,行走=0xF637E75A}
SuoyouModel["张老头"]={小图标=0,大图标=0,对话头像=0x5DA91845,站立=0x5D14A411,行走=0x4E0B8DAC}
SuoyouModel["招罗弟"]={小图标=0,大图标=0,对话头像=0x1FC0FCAC,站立=0x7555A8D0,行走=0x4468668F}
SuoyouModel["赵捕头"]={小图标=0,大图标=0,对话头像=0xF81B16C1,站立=0x40B1BCC3,行走=0x8AC693A9}
SuoyouModel["小孩_飞儿"]={小图标=0,大图标=0,对话头像=0x1FC0FCAC,站立=0x7555A8D0,行走=0x4468668F}
SuoyouModel["男人_衙役"]={小图标=0,大图标=0,对话头像=0xF81B16C1,站立=0x40B1BCC3,行走=0x8AC693A9}
SuoyouModel["郑镖头"]={小图标=0,大图标=0,对话头像=0xDA66E6C8,站立=0xD02A9BB5,行走=0x4D0AAF3C,待战=0x4f98584f,挨打=0x2a6f55bb,防御=0x20a48c2c,施法=0xede20dc2,倒地=0xdd6dfe7a,跑去=0x429649f9,跑回=0,攻击=0x4610a379,攻击B=0xa76de573}
SuoyouModel["男人_镖头"]={小图标=0,大图标=0,对话头像=0xDA66E6C8,站立=0xD02A9BB5,行走=0x4D0AAF3C,待战=0x4f98584f,挨打=0x2a6f55bb,防御=0x20a48c2c,施法=0xede20dc2,倒地=0xdd6dfe7a,跑去=0x429649f9,跑回=0,攻击=0x4610a379,攻击B=0xa76de573}
SuoyouModel["钟馗"]={小图标=0,大图标=0,对话头像=0x3655FC65,站立=0xF1E86993,行走=0x39A1E40F}
SuoyouModel["男人_钟馗"]={小图标=0,大图标=0,对话头像=0x3655FC65,站立=0xF1E86993,行走=0x39A1E40F}
SuoyouModel["周猎户"]={小图标=0,大图标=0,对话头像=0x88CA9EC4,站立=0x6F1DE7D,行走=0x37ADE1CA}
SuoyouModel["男人_兰虎"]={小图标=0,大图标=0,对话头像=0x88CA9EC4,站立=0x6F1DE7D,行走=0x37ADE1CA}
SuoyouModel["朱紫校尉"]={小图标=0,大图标=0,对话头像=0x1CA66D04,站立=0x589A2894,行走=0x7ECE7DB2}
SuoyouModel["将军1"]={小图标=0,大图标=0,对话头像=0x1CA66D04,站立=0x589A2894,行走=0x7ECE7DB2}
SuoyouModel["校尉"]={小图标=0,大图标=0,对话头像=0x1CA66D04,站立=0x589A2894,行走=0x7ECE7DB2}
SuoyouModel["帮派机关人"]={小图标=0,大图标=0,对话头像=2294980292,站立=0x48EFADFA,行走=0x48EFADFA}
SuoyouModel["春十三娘"]={小图标=0,大图标=0,对话头像=0x13343683,站立=0x2E305A78,行走=0x61A8F3FF,待战=0x1881a745,挨打=0x89787a04,防御=0xf4dad89f,施法=0xff037975,倒地=0x879ca2c4,跑去=0x52954492,跑回=0,攻击=0x4687e84,攻击B=0x9069ae02}
SuoyouModel["二大王"]={小图标=0,大图标=0,对话头像=0x2478FFCE,站立=0x50355C48,行走=0x403A153E}
SuoyouModel["三大王"]={小图标=0,大图标=0,对话头像=0x425EE9E7,站立=0x228D340F,行走=0x2059CBB0}
SuoyouModel["婆婆"]={小图标=0,大图标=0,对话头像=0x0167D818,站立=0xAFA62A72,行走=0xCB62E343}
SuoyouModel["婆婆_身体"]={站立=0x2b04d19c,行走=0x5d257258}
SuoyouModel["哪吒"]={小图标=0,大图标=0,对话头像=0x0D24234C,站立=0x5903D418,行走=0x259EC5A7}
SuoyouModel["满天星"]={小图标=0,大图标=0,对话头像=0x221DF8A8,站立=0x6D96A509,行走=0x1A8279CA}
SuoyouModel["玉皇大帝"]={小图标=0,大图标=0,对话头像=0x23DB547E,站立=3942702687,行走=0x3C7DB1FD}
SuoyouModel["玉皇大帝_身体"]={站立=0xae517661,行走=0x6fea8637}
SuoyouModel["女人_孟婆"]={小图标=0,大图标=0,对话头像=0x0167D818,站立=0xAFA62A72,行走=0xCB62E343}
SuoyouModel["女人_孟婆_身体"]={站立=0x2b04d19c,行走=0x5d257258}
SuoyouModel["大宝"]={小图标=0,大图标=0,对话头像=0xAF9D765,站立=0xD0A9859B,行走=0xC5E98CA8}
SuoyouModel["男人_哪吒"]={小图标=0,大图标=0,对话头像=0x0D24234C,站立=0x5903D418,行走=0x259EC5A7}
SuoyouModel["女人_满天星"]={小图标=0,大图标=0,对话头像=0x221DF8A8,站立=0x6D96A509,行走=0x1A8279CA}
SuoyouModel["男人_玉帝"]={小图标=0,大图标=0,对话头像=0x23DB547E,站立=3942702687,行走=0x3C7DB1FD}
SuoyouModel["男人_玉帝_身体"]={站立=0xae517661,行走=0x6fea8637}
SuoyouModel["白无常"]={小图标=0,大图标=0,对话头像=0x2EAD989A,站立=0x67B85348,行走=0x837D7776}
SuoyouModel["黑无常"]={小图标=0,大图标=0,对话头像=0x8CAD1F2F,站立=0xF250443E,行走=0xB181318C}
SuoyouModel["管家"]={小图标=0,大图标=0,对话头像=0x34D77690,站立=0x3112FBE1,行走=0xE34A5A3}
SuoyouModel["嫦娥"]={小图标=0,大图标=0,对话头像=0x76226129,站立=0x93A1B0A9,行走=0xEC91EDA2}
SuoyouModel["至尊宝"]={小图标=0,大图标=0,对话头像=0x8309B5DC,站立=0xEA27AD31,行走=0xFB629346}
SuoyouModel["唐僧"]={小图标=0,大图标=0,对话头像=0x87DD16C5,站立=0xF707EA37,行走=0xFF76393B}
SuoyouModel["巨子"]={小图标=0,大图标=0,对话头像=0xBACDA9D6,站立=0x636012E7,行走=0x66FE03D3}
SuoyouModel["西梁女国国王"]={小图标=0,大图标=0,对话头像=0x76C6D7D4,站立=0x3EA2FA4D,行走=0x12DAD117}
SuoyouModel["莫夫人"]={小图标=0,大图标=0,对话头像=0x868E2879,站立=0x234BC575,行走=0x36F5656A}
SuoyouModel["小笛"]={小图标=0,大图标=0,对话头像=0xDE850375,站立=0x54D687BC,行走=0x3EAA6EC8}
SuoyouModel["上官丞相"]={小图标=0,大图标=0,对话头像=0xF6D4D1DD,站立=0x40D087F9,行走=0xD104A2CD}
SuoyouModel["颜如羽"]={小图标=0,大图标=0,对话头像=0xA02DBEDE,站立=0xAD7A1BD3,行走=0xBB2ECF8E}
SuoyouModel["考官1"]={小图标=0,大图标=0,对话头像=0xA02DBEDE,站立=0xAD7A1BD3,行走=0xBB2ECF8E}
SuoyouModel["男人_老书生"]={小图标=0,大图标=0,对话头像=0xA02DBEDE,站立=0xAD7A1BD3,行走=0xBB2ECF8E}
SuoyouModel["酒店老板"]={小图标=0,大图标=0,对话头像=0x310CBA1A,站立=0x8783CF82,行走=0xAF2386A2}
SuoyouModel["灵鼠娃娃"]={小图标=0,大图标=0,对话头像=0x51058D2C,站立=0x738F33AF,行走=0x9A5FA693}
SuoyouModel["火焰山土地"]={小图标=0,大图标=0,对话头像=0x52C6D4DB,站立=0x81895D83,行走=0x6E805BF9}
SuoyouModel["守门天将"]={小图标=0,大图标=0,对话头像=0x70CE5AB6,站立=0x35F5C343,行走=0x28B91D6}
SuoyouModel["守门天将_身体"]={站立=0xd67ac350,行走=0x61332e9a}
SuoyouModel["王母娘娘"]={小图标=0,大图标=0,对话头像=0x77B7E4FF,站立=0x248A3E4C,行走=0x2B2CC199}
SuoyouModel["王母娘娘_身体"]={站立=0x3cca50d0,行走=0xf472599d}
SuoyouModel["红毛猿"]={小图标=0,大图标=0,对话头像=0x87DB4BCC,站立=0xBDD0DC76,行走=0xC230BE81}
SuoyouModel["有个和尚"]={小图标=0,大图标=0,对话头像=0x8BB5A31A,站立=0xE4926FC7,行走=0xBC6686FD,待战=0x307fa58d,挨打=0x472d738e,防御=0x4c752c05,施法=0x9e7aba66,倒地=0xc7e0c439,跑去=0xff452f8f,跑回=0,攻击=0x4fd41e69,攻击B=0x41c73336}
SuoyouModel["罗道人"]={小图标=0,大图标=0,对话头像=0x9158832E,站立=0xB7809CE0,行走=0x159CCC9F}
SuoyouModel["罗道人_身体"]={站立=0xe39ed0e8,行走=0x49bcec01}
SuoyouModel["小宝"]={小图标=0,大图标=0,对话头像=0xA74969CD,站立=0x9493C216,行走=0xF269B9B7}
SuoyouModel["杨戟"]={小图标=0,大图标=0,对话头像=0xB061E863,站立=0x1D8F9ABB,行走=0x4103E1D}
SuoyouModel["杨戟_身体"]={站立=0x14044ec,行走=0x21dd3a0}
SuoyouModel["魏征"]={小图标=0,大图标=0,对话头像=0xEC3608BC,站立=0x6ABF75AD,行走=0x8DDC27F7}
SuoyouModel["女人_云小奴"]={小图标=0,大图标=0,对话头像=0xEED08D0E,站立=0x18791291,行走=0x90065904}
SuoyouModel["超级巫医"]={小图标=0,大图标=0,对话头像=0xF575B185,站立=0x3A16E96D,行走=0xDCEBC9E8}
SuoyouModel["马副将"]={小图标=0,大图标=0,对话头像=0x3242A9D3,站立=0x6843A912,行走=0x4EE87EE9}
SuoyouModel["马副将_身体"]={站立=0xda6a56d6,行走=0xf840292a}
SuoyouModel["西梁女兵"]={小图标=0,大图标=0,对话头像=0x4BDE70FC,站立=0xE7D72D11,行走=0x6E8CD009}
SuoyouModel["袁天罡"]={小图标=0,大图标=0,对话头像=0xF9CC9FCF,站立=0x41B1D8EC,行走=0x5FD74EE1}
SuoyouModel["小二"]={小图标=0,大图标=0,对话头像=0x4E52D71E,站立=0x8F5E39E1,行走=0xDD211906}
SuoyouModel["男人_酒店老板"]={小图标=0,大图标=0,对话头像=0x310CBA1A,站立=0x8783CF82,行走=0xAF2386A2}
SuoyouModel["女人_灵鼠娃娃"]={小图标=0,大图标=0,对话头像=0x51058D2C,站立=0x738F33AF,行走=0x9A5FA693}
SuoyouModel["男人_土地"]={小图标=0,大图标=0,对话头像=0x52C6D4DB,站立=0x81895D83,行走=0x6E805BF9}
SuoyouModel["男人_将军"]={小图标=0,大图标=0,对话头像=0x70CE5AB6,站立=0x35F5C343,行走=0x28B91D6}
SuoyouModel["男人_将军_身体"]={站立=0xd67ac350,行走=0x61332e9a}
SuoyouModel["女人_王母"]={小图标=0,大图标=0,对话头像=0x77B7E4FF,站立=0x248A3E4C,行走=0x2B2CC199}
SuoyouModel["女人_王母_身体"]={站立=0x3cca50d0,行走=0xf472599d}
SuoyouModel["马猴"]={小图标=0,大图标=0,对话头像=0x87DB4BCC,站立=0xBDD0DC76,行走=0xC230BE81}
SuoyouModel["男人_胖和尚"]={小图标=0,大图标=0,对话头像=0x8BB5A31A,站立=0xE4926FC7,行走=0xBC6686FD,待战=0x307fa58d,挨打=0x472d738e,防御=0x4c752c05,施法=0x9e7aba66,倒地=0xc7e0c439,跑去=0xff452f8f,跑回=0,攻击=0x4fd41e69,攻击B=0x41c73336}
SuoyouModel["男人_道士"]={小图标=0,大图标=0,对话头像=0x9158832E,站立=0xB7809CE0,行走=0x159CCC9F}
SuoyouModel["男人_道士_身体"]={站立=0xe39ed0e8,行走=0x49bcec01}
SuoyouModel["女人_绿儿"]={小图标=0,大图标=0,对话头像=0xA74969CD,站立=0x9493C216,行走=0xF269B9B7}
SuoyouModel["男人_杨戬"]={小图标=0,大图标=0,对话头像=0xB061E863,站立=0x1D8F9ABB,行走=0x4103E1D}
SuoyouModel["男人_杨戬_身体"]={站立=0x14044ec,行走=0x21dd3a0}
SuoyouModel["考官2"]={小图标=0,大图标=0,对话头像=0xEC3608BC,站立=0x6ABF75AD,行走=0x8DDC27F7}
SuoyouModel["男人_巫医"]={小图标=0,大图标=0,对话头像=0xF575B185,站立=0x3A16E96D,行走=0xDCEBC9E8}
SuoyouModel["男人_马副将"]={小图标=0,大图标=0,对话头像=0x3242A9D3,站立=0x6843A912,行走=0x4EE87EE9}
SuoyouModel["男人_马副将_身体"]={站立=0xda6a56d6,行走=0xf840292a}
SuoyouModel["女官"]={小图标=0,大图标=0,对话头像=0x4BDE70FC,站立=0xE7D72D11,行走=0x6E8CD009}
SuoyouModel["男人_诗中仙"]={小图标=0,大图标=0,对话头像=0xF9CC9FCF,站立=0x41B1D8EC,行走=0x5FD74EE1}
SuoyouModel["男人_店小二"]={小图标=0,大图标=0,对话头像=0x4E52D71E,站立=0x8F5E39E1,行走=0xDD211906}
SuoyouModel["宝象国国王坐"]={小图标=0,大图标=0,对话头像=0x49F4803B,站立=0x7DD7F706,行走=0}
SuoyouModel["莫爷爷"]={小图标=0,大图标=0,对话头像=0x18ACCF64,站立=0xDE7DA687,行走=0x1210A82F}
SuoyouModel["小宝贝"]={小图标=0,大图标=0,对话头像=0,站立=0xC680D6C0,行走=0x204413F8}
SuoyouModel["蒋大全"]={小图标=0,大图标=0,对话头像=0x75DD9222,站立=0x65D0C53D,行走=0xD8300A1A}
SuoyouModel["女"]={小图标=0,大图标=0,对话头像=0,站立=0x6282B5AB,行走=0x35F4E996}
SuoyouModel["舞狮人"]={小图标=0,大图标=0,对话头像=0,站立=0x5AFA5725,行走=0xC5A358C2}
SuoyouModel["狮子"]={小图标=0,大图标=0,对话头像=0,站立=0x402BB63B,行走=0x226CE8C7}
SuoyouModel["媒婆"]={小图标=0,大图标=0,对话头像=0,站立=0x90B6C959,行走=0xB98A494F}
SuoyouModel["轿子"]={小图标=0,大图标=0,对话头像=0,站立=0x811B9CB3,行走=0xDA7C649}
SuoyouModel["骑马新郎"]={小图标=0,大图标=0,对话头像=0,站立=0x8266156A,行走=0x69616440}
SuoyouModel["吹号手"]={小图标=0,大图标=0,对话头像=0,站立=0x7772C95B,行走=0x3CD9A806}
SuoyouModel["女随从"]={小图标=0,大图标=0,对话头像=0,站立=0xCE0D9C8B,行走=0x32195B4F}
SuoyouModel["禄星"]={小图标=0,大图标=0,对话头像=0x99EB8BE,站立=0xC490F81,行走=0xA67ACBC8}
SuoyouModel["禄星2"]={小图标=0,大图标=0,对话头像=0x99EB8BE,站立=0x589BBFFE,行走=0xA67ACBC8}
SuoyouModel["福星"]={小图标=0,大图标=0,对话头像=0x279B729D,站立=0x9E8FC397,行走=0xA25FFDB3}
SuoyouModel["福星2"]={小图标=0,大图标=0,对话头像=0x279B729D,站立=0xCB71F060,行走=0xA25FFDB3}
SuoyouModel["金圣宫2"]={小图标=0,大图标=0,对话头像=0x59EAA01D,站立=0x708A094F,行走=0}
SuoyouModel["铁匠"]={小图标=0,大图标=0,对话头像=0x6533EA01,站立=0x75BB33D2,行走=0xE0942BC2}
SuoyouModel["酒仙"]={小图标=0,大图标=0,对话头像=0x8C6FE78,站立=0xf98d2a1b,行走=0xbe860ace}
SuoyouModel["小西天长和尚"]={小图标=0,大图标=0,对话头像=0x12210C6A,站立=0xA831A782,行走=0xA7362DEF}
SuoyouModel["小西天和尚"]={小图标=0,大图标=0,对话头像=0xB365FAC7,站立=0x6341E0D6,行走=0x177CDA70}
SuoyouModel["二郎神2"]={小图标=0,大图标=0,对话头像=0x57CCD052,站立=0xCF6966D6,行走=0xF87DE3EF}
SuoyouModel["小白龙"]={小图标=0,大图标=0,对话头像=0xF9F031A5,站立=0xCC61903E,行走=0x29DCD4EF}
SuoyouModel["小白龙_身体"]={站立=0xd48dbd82,行走=0x5b7af8b8}
SuoyouModel["普陀山_接引仙女"]={小图标=0,大图标=0,对话头像=0x7F84C945,站立=0x7792B6DA,行走=0xDB11C815}
SuoyouModel["普陀山_接引仙女_身体"]={站立=0x3e6bc45f,行走=0xec193418}
SuoyouModel["热心仙人"]={小图标=0,大图标=0,对话头像=0x12210C6A,站立=0xA831A782,行走=0xA7362DEF}
SuoyouModel["和尚3"]={小图标=0,大图标=0,对话头像=0x12210C6A,站立=0xA831A782,行走=0xA7362DEF}
SuoyouModel["和尚1"]={小图标=0,大图标=0,对话头像=0xB365FAC7,站立=0x6341E0D6,行走=0x177CDA70}
SuoyouModel["二郎神_坐"]={小图标=0,大图标=0,对话头像=0x57CCD052,站立=0xCF6966D6,行走=0xF87DE3EF}
SuoyouModel["男人_小白龙"]={小图标=0,大图标=0,对话头像=0xF9F031A5,站立=0xCC61903E,行走=0x29DCD4EF}
SuoyouModel["男人_小白龙_身体"]={站立=0xd48dbd82,行走=0x5b7af8b8}
SuoyouModel["普陀_接引仙女"]={小图标=0,大图标=0,对话头像=0x7F84C945,站立=0x7792B6DA,行走=0xDB11C815}
SuoyouModel["普陀_接引仙女_身体"]={站立=0x3e6bc45f,行走=0xec193418}
--================================================================================
SuoyouModel["生肖鸡"]={小图标=0,大图标=0,对话头像=0,站立=0xCC9CE563,行走=0x9D353BF4}
SuoyouModel["生肖龙"]={小图标=0,大图标=0,对话头像=0,站立=0x7FD9D3BC,行走=0x289C773D}
SuoyouModel["生肖蛇"]={小图标=0,大图标=0,对话头像=0,站立=0xB0F79819,行走=0x800A4859}
SuoyouModel["生肖猴"]={小图标=0,大图标=0,对话头像=0,站立=0xAA910FFF,行走=0x51FC5B28}
SuoyouModel["生肖狗"]={小图标=0,大图标=0,对话头像=0,站立=0xF41F6038,行走=0xDE58CA6F}
SuoyouModel["生肖虎"]={小图标=0,大图标=0,对话头像=0,站立=0x59D6FB3B,行走=0xD7DC93DE}
SuoyouModel["生肖兔"]={小图标=0,大图标=0,对话头像=0,站立=0x9D99A10D,行走=0x524EA098}
SuoyouModel["生肖牛"]={小图标=0,大图标=0,对话头像=0,站立=0x6644A046,行走=0x350A49B8}
SuoyouModel["生肖猪"]={小图标=0,大图标=0,对话头像=0,站立=0x60976277,行走=0x1F9309D8}
SuoyouModel["生肖羊"]={小图标=0,大图标=0,对话头像=0,站立=0xDEBBC85B,行走=0x87C63E1}
SuoyouModel["生肖鼠"]={小图标=0,大图标=0,对话头像=0,站立=0xDAC84F94,行走=0x39195BC3}
SuoyouModel["生肖马"]={小图标=0,大图标=0,对话头像=0,站立=0x7FD84FE9,行走=0x4D8E1F0C}
--================================================================================
SuoyouModel["酒仙2"]={小图标=0,大图标=0,对话头像=0,站立=0x786acc50,行走=0x4fcbb9e4}
SuoyouModel["巨子2"]={小图标=0,大图标=0,对话头像=0xBACDA9D6,站立=0x83bb5054,行走=0xfdeafa12}
SuoyouModel["超级巫医_旧"]={小图标=0,大图标=0,对话头像=0xde831cb7,站立=0xe5218837,行走=0xfe3a270f}
SuoyouModel["罗道人_旧"]={小图标=0,大图标=0,对话头像=0x272d812e,站立=0x39da26ff,行走=0x290b7a68}
--================================================================================
SuoyouModel["桃树"]={小图标=0,大图标=0,对话头像=0,站立=0x544A2675,行走=0}
SuoyouModel["蟠桃树"]={小图标=0,大图标=0,对话头像=0,站立=1414145653,行走=0}
SuoyouModel["圣诞树"]={小图标=0,大图标=0,对话头像=0,站立=3298113552,行走=0}
SuoyouModel["摇钱树阶段1"]={小图标=0,大图标=0,对话头像=0,站立=0x94a738e1,行走=0}
SuoyouModel["摇钱树阶段2"]={小图标=0,大图标=0,对话头像=0,站立=0x70b0708e,行走=0}
SuoyouModel["摇钱树阶段3"]={小图标=0,大图标=0,对话头像=0,站立=0x4a2078c9,行走=0}
SuoyouModel["摇钱树"]={小图标=0,大图标=0,对话头像=0,站立=1459613714,行走=0}
SuoyouModel["道观"]={小图标=0,大图标=0,对话头像=0,站立=0x639E73B0,行走=0}
SuoyouModel["道观2"]={小图标=0,大图标=0,对话头像=0,站立=0xc28024c8,行走=0}
SuoyouModel["道观3"]={小图标=0,大图标=0,对话头像=0,站立=0x7a313e8,行走=0}
SuoyouModel["想念你的雪人1" ]={小图标=0,大图标=0,对话头像=0,站立=0xDA74178C,行走=0}
SuoyouModel["想念你的雪人2" ]={小图标=0,大图标=0,对话头像=0,站立=0xBE52981A,行走=0}
SuoyouModel["想念你的雪人3" ]={小图标=0,大图标=0,对话头像=0,站立=0xF6655BCB,行走=0}
SuoyouModel["想念你的雪人4" ]={小图标=0,大图标=0,对话头像=0,站立=0x7ED2C0BE,行走=0}
SuoyouModel["想念你的雪人5"]={小图标=0,大图标=0,对话头像=0,站立=0x6843DF1A,行走=0}
SuoyouModel["雪人袜子绿"]={小图标=0,大图标=0,对话头像=0,站立=0x17fa31aa,行走=0}
SuoyouModel["雪人袜子红"]={小图标=0,大图标=0,对话头像=0,站立=0x8480a64e,行走=0}
SuoyouModel["雪人袜子棕"]={小图标=0,大图标=0,对话头像=0,站立=0x2d31b38f,行走=0}
SuoyouModel["雪人袜子白"]={小图标=0,大图标=0,对话头像=0,站立=0x4839c0f4,行走=0}
SuoyouModel["雪人小"]={小图标=0,大图标=0,对话头像=0,站立=0x37cacc80,行走=0}
SuoyouModel["雪人中"]={小图标=0,大图标=0,对话头像=0,站立=0x3cf6e5d1,行走=0}
SuoyouModel["宝箱"]={小图标=0,大图标=0,对话头像=0,站立=0xEFFD57F2,行走=0xEFFD57F2}
SuoyouModel["物件_缝纫台"]={小图标=0,大图标=0,对话头像=0,站立=0x31EA6E7F,行走=0x31EA6E7F}
SuoyouModel["物件_打铁炉"]={小图标=0,大图标=0,对话头像=2074974822,站立=0x7BAD9A66,行走=0x7BAD9A66}
SuoyouModel["银两"]={小图标=0,大图标=0,对话头像=0xC880FF79,站立=0xC880FF79,行走=0xC880FF79}
SuoyouModel["食物"]={小图标=0,大图标=0,对话头像=0xCEC4E67F,站立=0xCEC4E67F,行走=0xCEC4E67F}
SuoyouModel["口粮"]={小图标=0,大图标=0,对话头像=0xD13C14A1,站立=0xD13C14A1,行走=0xD13C14A1}
SuoyouModel["摄妖香"]={小图标=0,大图标=0,对话头像=0x7FC3DE36,站立=0x7FC3DE36,行走=0x7FC3DE36}
SuoyouModel["药品"]={小图标=0,大图标=0,对话头像=0x66CC7A29,站立=0x66CC7A29,行走=0x66CC7A29}
SuoyouModel["牵牛花"]={小图标=0,大图标=0,对话头像=0,站立=0xed219e4,行走=0x8d0ebcfa}
SuoyouModel["蟠桃1"]={小图标=0,大图标=0,对话头像=0,站立=0x18959f38,行走=0}
SuoyouModel["蟠桃2"]={小图标=0,大图标=0,对话头像=0,站立=0xaf8fe24f,行走=0}
SuoyouModel["蟠桃3"]={小图标=0,大图标=0,对话头像=0,站立=0x23b33d3d,行走=0}
SuoyouModel["木材"]={小图标=0,大图标=0,对话头像=0,站立=3234232742,行走=0}
SuoyouModel["灵灯"]={小图标=0,大图标=0,对话头像=0,站立=286542707,行走=0}
SuoyouModel["金鱼"]={小图标=0,大图标=0,对话头像=0,站立=0x9FA21058,行走=0}
SuoyouModel["钻石"]={小图标=0,大图标=0,对话头像=0,站立=3408246706,行走=0}
--======================================================================================================================================
SuoyouModel["孙悟空"]={小图标=0,大图标=0xCD603016,对话头像=0x3FA3472C,站立=0x14692807,行走=0x2C4D8EC8,待战=0x14692807,挨打=0x5de938ba,防御=0xB3A2B015,施法=0xE42F3F94,倒地=0x6FF03AB0,跑去=0xCCAC3F69,跑回=0x31B2CA29,攻击=0x6C1336EC,攻击B=0x6C1336EC}
SuoyouModel["齐天大圣"]={小图标=0,大图标=0xCD603016,对话头像=0x3FA3472C,站立=0x14692807,行走=0x2C4D8EC8,待战=0x14692807,挨打=0x5de938ba,防御=0xB3A2B015,施法=0xE42F3F94,倒地=0x6FF03AB0,跑去=0xCCAC3F69,跑回=0x31B2CA29,攻击=0x6C1336EC,攻击B=0x6C1336EC}
SuoyouModel["沙和尚"]={小图标=0,大图标=0x69042416,对话头像=0x40488B18,站立=0x9E8754B2,行走=0xF58104E2,待战=0x9E8754B2,挨打=0xfaadce7f,防御=0x63DF2FE0,施法=0xBB5DC671,倒地=0xDAFF6024,跑去=0x13550448,跑回=0x1E40F132,攻击=0x1D90BAA0,攻击B=0x1D90BAA0,}
SuoyouModel["蚩尤"]={小图标=0,大图标=0,对话头像=0x5822CC97,站立=0x5D1C654C,行走=0x62F5CF03,待战=0xB547D6C5,挨打=0xc53745f,防御=0xA96AF127,施法=0xB95AC7D1,倒地=0xCF27623F,跑去=0x84E89BDB,跑回=0xE352C9C,攻击=0x37CC913E,攻击B=0x9938240A}
SuoyouModel["猪八戒"]={小图标=0,大图标=0xBAFDAD60,对话头像=0x93557CA2,站立=0x46ADE41,行走=0x85C12349,待战=0x46ADE41,挨打=0x94c75679,防御=0xC8DD73,施法=0xAFF97BB0,倒地=0xFD013477,跑去=0xDE64A152,跑回=0x522B9A47,攻击=0x1D7E5D02,攻击B=0x1D7E5D02}
SuoyouModel["小蚩尤"]={小图标=0,大图标=0,对话头像=0x5822CC97,站立=0x5D1C654C,行走=0x62F5CF03,待战=0xB547D6C5,挨打=0xc53745f,防御=0xA96AF127,施法=0xB95AC7D1,倒地=0xCF27623F,跑去=0x84E89BDB,跑回=0xE352C9C,攻击=0x37CC913E,攻击B=0x9938240A}

-- SuoyouModel["小蚩尤"]={小图标=0,大图标=0,对话头像=0x5822CC97,站立=0x20000220,行走=0x20000223,待战=0x20000221,挨打=0x20000225,防御=0x20000219,施法=0x20000222,倒地=0x20000218,跑去=0x20000223,跑回=0x20000223,攻击=0x20000217,攻击B=0x20000222}
SuoyouModel["知了王"]={小图标=0,大图标=0,对话头像=0xE300F089,站立=0x790BD1B7,行走=0x5B6E64F,待战=0x790BD1B7,挨打=0xE425B3FE,防御=0x3847C1E,施法=0xA49609CA,倒地=0x2BAD174A,跑去=0x34713A17,跑回=0x93117A64,攻击=0x34C5779E,攻击B=0x34C5779E}
SuoyouModel["赛太岁"]={小图标=0,大图标=0,对话头像=0x49A7562B,站立=0xD252E998,行走=0xF70F4844,待战=0xD252E998,挨打=0x2e8c40ec,防御=0xCC07284,施法=0x48CC7DD,倒地=0xD225AEF5,跑去=0xEC64162,跑回=0x4D10286A,攻击=0xC1816D39,攻击B=0xC1816D39}
SuoyouModel["九灵元圣"]={小图标=0,大图标=0,对话头像=0x49A7562B,站立=0xD252E998,行走=0xF70F4844,待战=0xD252E998,挨打=0x2e8c40ec,防御=0xCC07284,施法=0x48CC7DD,倒地=0xD225AEF5,跑去=0xEC64162,跑回=0x4D10286A,攻击=0xC1816D39,攻击B=0xC1816D39}
SuoyouModel["周杰伦"]={小图标=0,大图标=0,对话头像=0x962BD68A,站立=0x5DACE991,行走=0x1E12FFC4,待战=0xA81EA7D2,挨打=0x31b65a0a,防御=0xB67D1163,施法=0xAD73D867,倒地=0xB9C13DAB,跑去=0x3EBB092D,跑回=0xF2AE7F68,攻击=0xAA5313BB,攻击B=0x7B6CA3D6}
SuoyouModel["帮派妖兽"]={小图标=0,大图标=0,对话头像=0x49A7562B,站立=0xD252E998,行走=0xF70F4844,待战=0xD252E998,挨打=0x2e8c40ec,防御=0xCC07284,施法=0x48CC7DD,倒地=0xD225AEF5,跑去=0xEC64162,跑回=0x4D10286A,攻击=0xC1816D39,攻击B=0xC1816D39}
-- SuoyouModel["成周妖皇"]={小图标=0,大图标=0,对话头像=0x962BD68A,站立=0x5DACE991,行走=0x1E12FFC4,待战=0xA81EA7D2,挨打=0x31b65a0a,防御=0xB67D1163,施法=0xAD73D867,倒地=0xB9C13DAB,跑去=0x3EBB092D,跑回=0xF2AE7F68,攻击=0xAA5313BB,攻击B=0x7B6CA3D6}
SuoyouModel["阎罗王"]={小图标=0,大图标=0,对话头像=0x7A22D6D1,站立=0xA5B436EE,行走=0x558B14D5,待战=0xA5B436EE,挨打=0x455697fe,防御=0x9402033C,施法=0x21B6E8AA,倒地=0x9152660,跑去=0xE5AB6916,跑回=0x883B1581,攻击=0x15F50CFF,攻击B=0x15F50CFF}
SuoyouModel["转轮王"]={小图标=0,大图标=0,对话头像=0x266D7180,站立=0xA5B436EE,行走=0x558B14D5,待战=0xA5B436EE,挨打=0x455697fe,防御=0x9402033C,施法=0x21B6E8AA,倒地=0x9152660,跑去=0xE5AB6916,跑回=0x883B1581,攻击=0x15F50CFF,攻击B=0x15F50CFF}
SuoyouModel["火星人"]={小图标=0,大图标=0,对话头像=0,站立=0xBFCA22B3,行走=0xC69C5C9B,待战=0xBFCA22B3,挨打=0x54164c29,防御=0xF7A4F1E2,施法=0xC21FDC40,倒地=0x46D74A8,跑去=0xCD46D49,跑回=0x6144B148,攻击=0xA2A59267,攻击B=0xA2A59267}
SuoyouModel["九头精怪"]={小图标=0,大图标=0,对话头像=0xFB43BB92,站立=0x7CAF3ABB,行走=0xB8285F9,待战=0x7CAF3ABB,挨打=3472119832,防御=0x540D1100,施法=0xBB56EF5A,倒地=0x92F0C045,跑去=0x6C396AD2,跑回=0x5B2FE6A5,攻击=0xC9EC64BB,攻击B=0xC9EC64BB}
SuoyouModel["九头虫"]={小图标=0,大图标=0,对话头像=0xFB43BB92,站立=0x7CAF3ABB,行走=0xB8285F9,待战=0x7CAF3ABB,挨打=3472119832,防御=0x540D1100,施法=0xBB56EF5A,倒地=0x92F0C045,跑去=0x6C396AD2,跑回=0x5B2FE6A5,攻击=0xC9EC64BB,攻击B=0xC9EC64BB}
SuoyouModel["腾蛇"]={小图标=0x1554198D,大图标=0xB118ECE8,对话头像=0x66F2BEB4,站立=0x277A9966,行走=0x6F52F0B,待战=0xBEB42B08,挨打=182408524,防御=0xF4DDF4C7,施法=0x212B61B8,倒地=0x194B0A66,跑去=0x8CFB271D,跑回=0x14D8E03F,攻击=0x2D55C711,攻击B=0x2D55C711}
SuoyouModel["超级腾蛇"]={小图标=0x1554198D,大图标=0xB118ECE8,对话头像=0x66F2BEB4,站立=0x277A9966,行走=0x6F52F0B,待战=0xBEB42B08,挨打=182408524,防御=0xF4DDF4C7,施法=0x212B61B8,倒地=0x194B0A66,跑去=0x8CFB271D,跑回=0x14D8E03F,攻击=0x2D55C711,攻击B=0x2D55C711}
SuoyouModel["进阶超级腾蛇"]={小图标=0x1554198D,大图标=0xB118ECE8,对话头像=0x66F2BEB4,站立=0x277A9966,行走=0x6F52F0B,待战=0xBEB42B08,挨打=182408524,防御=0xF4DDF4C7,施法=0x212B61B8,倒地=0x194B0A66,跑去=0x8CFB271D,跑回=0x14D8E03F,攻击=0x2D55C711,攻击B=0x2D55C711}
SuoyouModel["东海龙王"]={小图标=0,大图标=0,对话头像=0xECF36B2F,站立=0x810e3469,行走=0x77748072,待战=0x263C28F5,挨打=0xb45ac1cb,防御=0x623BF6C,施法=0xD8AC6ADA,倒地=0xA9135905,跑去=0xEA1FB934,跑回=0x325826A0,攻击=0x12062DFD,攻击B=0xA730EB06}
SuoyouModel["男人_东海龙王"]={小图标=0,大图标=0,对话头像=0xECF36B2F,站立=0x810e3469,行走=0x77748072,待战=0x263C28F5,挨打=0xb45ac1cb,防御=0x623BF6C,施法=0xD8AC6ADA,倒地=0xA9135905,跑去=0xEA1FB934,跑回=0x325826A0,攻击=0x12062DFD,攻击B=0xA730EB06}
SuoyouModel["孙婆婆"]={小图标=0,大图标=0,对话头像=0xEEB6DF92,站立=0x81F4F89D,行走=0x600ba182,待战=0xFBB05C33,挨打=0xeed0bf37,防御=0x60F5A1CF,施法=0x7E2E23A0,倒地=0x6F4EEC5,跑去=0x6F41C860,跑回=0xAA845245,攻击=0x44EE03AD,攻击B=0x8ACDDCAE}
SuoyouModel["牛魔王_装饰"]={站立=0x1d540bcc,行走=0xb634ff7c,待战=0x64e51b02,挨打=0x7dc329ce,防御=0xea2d469f,施法=0x703ce097,倒地=0x96b0a572,跑去=0x393490e0,跑回=0x393490e0,攻击=0x2046cb95,攻击B=0x7eb345c1}
SuoyouModel["牛魔王"]={小图标=0x44829CE3,大图标=0,对话头像=0x83547F15,站立=0x5867f741,行走=0xfbb7a2a2,待战=0xB69B44D,挨打=0x90bb1a9e,防御=0xC096C013,施法=0x65EB0501,倒地=0x113CB79E,跑去=0xD8CFAC15,跑回=0xD8CFAC15,攻击=0xC18A0B9F,攻击B=0xDFAB4445}
SuoyouModel["镇元大仙"]={小图标=0,大图标=0,对话头像=0x648449CE,站立=0x22406e66,行走=0x5e8cc3f3,待战=0x75cdf97c,挨打=0x5ad58d24,防御=0xAE592351,施法=0x16385B4D,倒地=0x54F4C87,跑去=0x578BA3B5,跑回=0x9517238B,攻击=0x9E9D4886,攻击B=0x9F64FB32}
SuoyouModel["菩提祖师"]={小图标=0,大图标=0,对话头像=0x8D656188,站立=0x2073F650,行走=0x31B5E0BE,待战=0x2073F650,挨打=0xe84c322a,防御=0xACD5800,施法=0xFC7EAE69,倒地=0xEF5514E5,跑去=0x88BE1E61,跑回=0x1331085B,攻击=0xBF5273C3,攻击B=0xA0ED7C6}
SuoyouModel["白晶晶"]={小图标=0,大图标=0,对话头像=0xDA313059,站立=0xF5D47E2E,行走=0x9957A256,待战=0xF5D47E2E,挨打=0x7fe8694c,防御=0xEF4D4EBB,施法=0xD45D160,倒地=0xE702BDC7,跑去=0x2B6371A2,跑回=0x164C2F9C,攻击=0x7963E3C2,攻击B=0xE1D303C3}
SuoyouModel["李靖"]={小图标=0,大图标=0,对话头像=0xDAE855F8,站立=0x2596ec14,行走=0x67AA2B8A,待战=0xb760b5cc,挨打=0x8996bf86,防御=0xA14063D6,施法=0x14867FC2,倒地=0xBDA4348A,跑去=0x67AA2B8A,跑回=0x164CD389,攻击=0x6A0DEC0F,攻击B=0x90682983}
SuoyouModel["李靖_装饰"]={站立=0x492eef88,行走=0x9fcb54f2,待战=0x8c24e820,挨打=0x16504675,防御=0xfd2c04f1,施法=0x3388ffa2,倒地=0xd7fdde24,跑去=0xdab186e4,跑回=0,攻击=0x704b4c72,攻击B=0x8abcc311}
SuoyouModel["程咬金"]={小图标=0,大图标=0,对话头像=0x58A56B36,站立=0xE1A120FF,行走=0x58F4B663,待战=0xE1A120FF,挨打=0x5868edbe,防御=0x87EF3814,施法=0x15125FC7,倒地=0xB41DCF3F,跑去=0xD99529D8,跑回=0x594994E9,攻击=0xEE96905A,攻击B=0xD3E3A473}
SuoyouModel["地藏王"]={小图标=0,大图标=0xDABD9C04,对话头像=0xE9F0579D,站立=0x3a11c300,行走=0x32c68cc9,待战=0x16b69387,挨打=0xa8312fdb,防御=0x4E4C9223,施法=0x1A7C6CAC,倒地=0x7AD0002B,跑去=0xD13E1FFF,跑回=0x3FD0D0BD,攻击=0xD572D8E4,攻击B=0xDBC25AB2}
SuoyouModel["观音姐姐"]={小图标=0,大图标=0,对话头像=0x8C4AEEA9,站立=0x405c585,行走=0x4ba25376,待战=0xF9F80A42,挨打=0x5d49f27c,防御=0xD503EE2F,施法=0x2ECAAEEF,倒地=0x471104A5,跑去=0xF45349EA,跑回=0x5D4BC070,攻击=0x93DC0379,攻击B=0xABC48778}
SuoyouModel["空度禅师"]={小图标=0,大图标=0,对话头像=0xA248A88A,站立=0xb73531b1,行走=0x6ea6e77,待战=0x469ac4be,挨打=0x4308f507,防御=0xBD41CBB0,施法=0x5B721A00,倒地=0xAC761E66,跑去=0x987B611D,跑回=0xD1C64CB1,攻击=0x3674178B,攻击B=0xD5F72B15}
SuoyouModel["大大王"]={小图标=0,大图标=0,对话头像=0x1CDF6FF5,站立=0x3f24ed26,行走=0xad23d962,待战=0x3f24ed26,挨打=0x5e8396a5,防御=0xF8EE8A5D,施法=0xD5A6A3B1,倒地=0xD9B62122,跑去=0xBE283FFC,跑回=0xBE283FFC,攻击=0x99871326,攻击B=0xBD490B9E}
SuoyouModel["镇元子"]={小图标=0,大图标=0,对话头像=0x648449CE,站立=0x22406e66,行走=0x5e8cc3f3,待战=0x75cdf97c,挨打=0x5ad58d24,防御=0xAE592351,施法=0x16385B4D,倒地=0x54F4C87,跑去=0x578BA3B5,跑回=0x9517238B,攻击=0x9E9D4886,攻击B=0x9F64FB32}
SuoyouModel["菩提老祖"]={小图标=0,大图标=0,对话头像=0x8D656188,站立=0x2073F650,行走=0x31B5E0BE,待战=0x2073F650,挨打=0xe84c322a,防御=0xACD5800,施法=0xFC7EAE69,倒地=0xEF5514E5,跑去=0x88BE1E61,跑回=0x1331085B,攻击=0xBF5273C3,攻击B=0xA0ED7C6}
SuoyouModel["晶晶姑娘"]={小图标=0,大图标=0,对话头像=0xDA313059,站立=0xF5D47E2E,行走=0x9957A256,待战=0xF5D47E2E,挨打=0x7fe8694c,防御=0xEF4D4EBB,施法=0xD45D160,倒地=0xE702BDC7,跑去=0x2B6371A2,跑回=0x164C2F9C,攻击=0x7963E3C2,攻击B=0xE1D303C3}
SuoyouModel["李天王"]={小图标=0,大图标=0,对话头像=0xDAE855F8,站立=0x2596ec14,行走=0x67AA2B8A,待战=0xb760b5cc,挨打=0x8996bf86,防御=0xA14063D6,施法=0x14867FC2,倒地=0xBDA4348A,跑去=0x67AA2B8A,跑回=0x164CD389,攻击=0x6A0DEC0F,攻击B=0x90682983}
SuoyouModel["李天王_装饰"]={站立=0x492eef88,行走=0x9fcb54f2,待战=0x8c24e820,挨打=0x16504675,防御=0xfd2c04f1,施法=0x3388ffa2,倒地=0xd7fdde24,跑去=0xdab186e4,跑回=0,攻击=0x704b4c72,攻击B=0x8abcc311}
SuoyouModel["男人_程咬金"]={小图标=0,大图标=0,对话头像=0x58A56B36,站立=0xE1A120FF,行走=0x58F4B663,待战=0xE1A120FF,挨打=0x5868edbe,防御=0x87EF3814,施法=0x15125FC7,倒地=0xB41DCF3F,跑去=0xD99529D8,跑回=0x594994E9,攻击=0xEE96905A,攻击B=0xD3E3A473}
SuoyouModel["地藏菩萨"]={小图标=0,大图标=0xDABD9C04,对话头像=0xE9F0579D,站立=0x3a11c300,行走=0x32c68cc9,待战=0x16b69387,挨打=0xa8312fdb,防御=0x4E4C9223,施法=0x1A7C6CAC,倒地=0x7AD0002B,跑去=0xD13E1FFF,跑回=0x3FD0D0BD,攻击=0xD572D8E4,攻击B=0xDBC25AB2}
SuoyouModel["观音菩萨"]={小图标=0,大图标=0,对话头像=0x8C4AEEA9,站立=0x405c585,行走=0x4ba25376,待战=0xF9F80A42,挨打=0x5d49f27c,防御=0xD503EE2F,施法=0x2ECAAEEF,倒地=0x471104A5,跑去=0xF45349EA,跑回=0x5D4BC070,攻击=0x93DC0379,攻击B=0xABC48778}
SuoyouModel["男人_老和尚"]={小图标=0,大图标=0,对话头像=0xA248A88A,站立=0xb73531b1,行走=0x6ea6e77,待战=0x469ac4be,挨打=0x4308f507,防御=0xBD41CBB0,施法=0x5B721A00,倒地=0xAC761E66,跑去=0x987B611D,跑回=0xD1C64CB1,攻击=0x3674178B,攻击B=0xD5F72B15}
SuoyouModel["青狮精"]={小图标=0,大图标=0,对话头像=0x1CDF6FF5,站立=0x3f24ed26,行走=0xad23d962,待战=0x3f24ed26,挨打=0x5e8396a5,防御=0xF8EE8A5D,施法=0xD5A6A3B1,倒地=0xD9B62122,跑去=0xBE283FFC,跑回=0x8F75AEC7,攻击=0x99871326,攻击B=0xBD490B9E}
SuoyouModel["地涌夫人"]={小图标=0,大图标=0,对话头像=0x4B343272,站立=0xCA07B7B2,行走=0xE46EA6C3,待战=0x2EDEAF19,挨打=0xc4fd3d4d,防御=0x5E0EFF3A,施法=0x65192B88,倒地=0xD4124C46,跑去=0xA69241A0,跑回=0x53DDB16A,攻击=0x3AE7A8F2,攻击B=0x78F227D8}
SuoyouModel["二郎神"]={小图标=0,大图标=0,对话头像=0x57CCD052,站立=0x1F5F4404,行走=0xF87DE3EF,待战=0x894CBF63,挨打=0xcfd07d68,防御=0xFDEB3130,施法=0x3304B122,倒地=0x506FB295,跑去=0x829CFEA0,跑回=0x4D6B7663,攻击=0x3C04B467,攻击B=0xAF3DDAD}
SuoyouModel["巫奎虎"]={小图标=0,大图标=0,对话头像=0x7ABE5099,站立=0x62150F6,行走=0x922CB5F2,待战=0xA9DD17BC,挨打=0xa1c77a74,防御=0x4286FB27,施法=0xD6E6F43,倒地=0x6DED77DA,跑去=0x4BC4A592,跑回=0xE217FC34,攻击=0xAB3F493A,攻击B=0x3D7718F1}
SuoyouModel["烟花占卜师"]={小图标=0xD5941BB1,大图标=0,对话头像=0x2F728796,站立=0xB692F3E2,行走=0xD569F35B,待战=0x3C76D8F5,挨打=0x57c06f84,防御=0x5DACB03A,施法=0xA5AE9914,倒地=0x3667C87D,跑去=0xE2F35B90,跑回=0x53845609,攻击=0x51493CA4,攻击B=0x51493CA4}
SuoyouModel["巫师"]={小图标=0xD5941BB1,大图标=0,对话头像=0x2F728796,站立=0xB692F3E2,行走=0xD569F35B,待战=0x3C76D8F5,挨打=0x57c06f84,防御=0x5DACB03A,施法=0xA5AE9914,倒地=0x3667C87D,跑去=0xE2F35B90,跑回=0x53845609,攻击=0x51493CA4,攻击B=0x51493CA4}
SuoyouModel["哮天犬"]={小图标=0x212B8B39,大图标=0xFB118648,对话头像=0x6F7E5529,站立=0xe2f56a21,行走=0xee55164b,待战=0x39796CC6,挨打=0x1d94428c,防御=0xFB2593E3,施法=0xEC8A08AA,倒地=0xD926D7D7,跑去=0xE873A88F,跑回=0x892CF6CE,攻击=0x67B9A21D,攻击B=0xAEC5D0D9}
SuoyouModel["进阶哮天犬"]={小图标=0x212B8B39,大图标=0xFB118648,对话头像=0x6F7E5529,站立=0x9351393,行走=0x8A284760,待战=0xDE1355D4,挨打=0x9856c8ff,防御=0x80599206,施法=0xe06f5d8a,倒地=0xFB7E93DE,跑去=0x603FCBF9,跑回=0x2572BF6,攻击=0xebb6057c,攻击B=0xaa0683ed}
SuoyouModel["九色鹿"]={小图标=0xDD000E7B,大图标=0x7E77B841,对话头像=0x851ED1C6,站立=0x746AC442,行走=0x3973278F,待战=0x746AC442,挨打=0xeb9b2d80,防御=0xFF13CB78,施法=0x676EB44D,倒地=0xEC48D75,跑去=0x22518607,跑回=0x5C2D78CF,攻击=0x25286A3A,攻击B=0x5959A126}
SuoyouModel["小象"]={站立=0x98c776c,行走=0x7263e8fa,待战=0x4411fb6d,挨打=0x311ff88,防御=0xf4387487,施法=0xc4f59df9,倒地=0xea9a837d,跑去=0xa3aa2e20,跑回=0x781f0443,攻击=0x9aefebc6,攻击B=0x9aefebc6}
SuoyouModel["腾蛇"]={小图标=0x1554198D,大图标=0xB118ECE8,对话头像=0x66F2BEB4,站立=0x277a9966,行走=0x6f52f0b,待战=0xbeb42b08,挨打=0xadf554c,防御=0xf4ddf4c7,施法=0x1bf0086b,倒地=0x194b0a66,跑去=0x8cfb271d,跑回=0x14d8e03f,攻击=0x2d55c711,攻击B=0x9f72ebdc}
SuoyouModel["雪人"]={小图标=0,大图标=0,对话头像=0,站立=0xd563cd1c,行走=0xfe19e0e5,待战=0xd7a342ff,挨打=0x94c5e9ae,防御=0x99491273,施法=0x2041ab14,施法2=0x4b39a64,倒地=0xf5eee054,跑去=0xeed0c1e6,跑回=0,攻击=0x8403c458,攻击B=0xd004e346}
SuoyouModel["蜈蚣精"]={站立=0x2b59854c,行走=0x2b59854c,待战=0x2b59854c,挨打=0x18cc3124,防御=0x9c39b91d,施法=0x93eb5e15,倒地=0x6ba99908,跑去=0x2b59854c,跑回=0x2b59854c,攻击=0x10e66935,攻击B=0x1279e93f}
SuoyouModel["自在天魔"]={站立=0xf207f1a0,行走=0xf207f1a0,待战=0xf207f1a0,挨打=0x2fe25a8b,防御=0x2fe25a8b,施法=0xbf358ffe,施法B=0x22413486,倒地=0x6f8c61b8,跑去=0xf207f1a0,跑回=0xf207f1a0,攻击=0x679f3915,攻击B=0x141ff4c2,攻击C=0x6c1bfd1f}
SuoyouModel["自在天魔_饰品"]={站立=0xf88f0c7e,行走=0xf88f0c7e,待战=0xf88f0c7e,挨打=0xeb3135ed,防御=0xeb3135ed,施法=0x66b8ce86,施法B=0,倒地=0xb16bfe02,跑去=0xf88f0c7e,跑回=0xf88f0c7e,攻击=0xc7b373dd,攻击B=0xd0451625,攻击C=0}
SuoyouModel["自在天魔斧钺"]={站立=0xbcf47b21,行走=0xb17f83f3,待战=0xbcf47b21,挨打=0x89e82fde,防御=0x1dc957cb,施法=0xb604fa09,施法B=0,倒地=0x4d4ebf7b,跑去=0xb17f83f3,跑回=0x4cd685a8,攻击=0xb604fa09,攻击B=0xb604fa09,攻击C=0}
SuoyouModel["自在天魔法杖"]={站立=0x79eb272e,行走=0x79eb272e,待战=0x79eb272e,挨打=0x3aba3972,防御=0x6290ea4d,施法=0xab853e76,施法B=0,倒地=0xc5614b62,跑去=0x79eb272e,跑回=0x79eb272e,攻击=0xab853e76,攻击B=0xab853e76,攻击C=0}
SuoyouModel["自在天魔弓弩"]={站立=0xab6fbed,行走=0xab6fbed,待战=0xab6fbed,挨打=0xb05a5c8f,防御=0xbe65c91e,施法=0x391750cc,施法B=0,倒地=0x8c4812a,跑去=0xab6fbed,跑回=0xab6fbed,攻击=0x391750cc,攻击B=0x391750cc,攻击C=0}
SuoyouModel["自在天魔经筒"]={站立=0xebf5d6ef,行走=0xebf5d6ef,待战=0xebf5d6ef,挨打=0xc4beed34,防御=0xc4beed34,施法=0x81542dce,施法B=0,倒地=0xe454c88e,跑去=0xebf5d6ef,跑回=0xebf5d6ef,攻击=0x81542dce,攻击B=0x81542dce,攻击C=0}
SuoyouModel["自在天魔宝剑"]={站立=0x9f776d40,行走=0xa5c091a0,待战=0x9f776d40,挨打=0xac3e8866,防御=0x508f338a,施法=0x67b8329c,施法B=0,倒地=0xefc7a1f2,跑去=0xa5c091a0,跑回=0x733a3064,攻击=0x7b287cfb,攻击B=0x7b287cfb,攻击C=0}
SuoyouModel["自在天魔刀"]={站立=0xf4dd4073,行走=0xf1b93a69,待战=0xf4dd4073,挨打=0xc6bf8023,防御=0x5226cdeb,施法=0x740466a4,施法B=0,倒地=0x657bca06,跑去=0xf1b93a69,跑回=0x78421a88,攻击=0x740466a4,攻击B=0x740466a4,攻击C=0}
SuoyouModel["自在天魔宝珠"]={站立=0x53dd8291,行走=0x53dd8291,待战=0x53dd8291,挨打=0xc18e99c1,防御=0xff533d6d,施法=0xd2eec28,倒地=0xd40eb6a,跑去=0x53dd8291,跑回=0,攻击=0xd2eec28,攻击B=0xd2eec28}
SuoyouModel["龙马"]={小图标=0xb1e73c63,大图标=0x62add87c,对话头像=0xf2d36051,站立=0x8801fe92,行走=0x598aa693,待战=0xd8ce56b,挨打=0x7515dfaa,防御=0xd9326464,施法=0xf7bab56f,倒地=0xf549e418,跑去=0x6a27a943,跑回=0,攻击=0xbb661d15,攻击B=0x4ec9f85a}
SuoyouModel["木桩"]={站立 = 0x0CC00001,小图标=0xAAA00000,大图标=0xAAA00001,对话头像=0xAAA00016,行走 = 0x0CC00001,待战 = 0x0CC00001,挨打 = 0xaCC00003,防御 = 0xaCC00003,施法 = 0xaCC00003,倒地 = 0xaCC00002,跑去 = 0xaCC00003,跑回=0xaCC00003,攻击 = 0xaCC00003,攻击B = 0xaCC00003}

--==================================召唤兽==========================================================================--
SuoyouModel["自在心猿"]        ={站立=0xAAA00004,行走=0xAAA00017,待战=0xAAA00004,挨打=0xAAA00002,防御=0xAAA00006,施法=0xAAA00011,倒地=0xAAA00014,跑去=0xAAA00017,跑回=0,攻击=0xAAA00008,攻击B=0xAAA00008,小图标=0xAAA00000,大图标=0xAAA00001,对话头像=0xAAA00016}
SuoyouModel["自在心猿_装饰"]={站立=0xAAA00005,行走=0xAAA00018,待战=0xAAA00005,挨打=0xAAA00003,防御=0xAAA00007,施法=0xAAA00012,倒地=0xAAA00015,跑去=0xAAA00018,跑回=0,攻击=0xAAA00009,攻击B=0xAAA00009}
SuoyouModel["自在心猿_饰品"]={站立=0xAAA00020,行走=0xAAA00025,待战=0xAAA00020,挨打=0xAAA00019,防御=0xAAA00021,施法=0xAAA00023,倒地=0xAAA00024,跑去=0xAAA00025,跑回=0,攻击=0xAAA00022,攻击B=0xAAA00022}
SuoyouModel["妙华天女"]     ={站立=0xAB100003,行走=0xAB100018,待战=0xAB100003,挨打=0xAB100002,防御=0xAB100004,施法=0xAB100014,倒地=0xAB100016,跑去=0xAB100018,跑回=0,攻击=0xAB100005,攻击B=0xAB100005,小图标=0xAB100000,大图标=0xAB100001,对话头像=0xAB100017}
SuoyouModel["妙华天女_装饰"]={站立=0xAB100003,行走=0xAB100018,待战=0xAB100003,挨打=0xAB100003,防御=0xAB100004,施法=0xAB100015,倒地=0xAB100016,跑去=0xAB100018,跑回=0,攻击=0xAB100006,攻击B=0xAB100006}
SuoyouModel["妙华天女_饰品"]={站立=0xAB100008,行走=0xAB100013,待战=0xAB100008,挨打=0xAB100007,防御=0xAB100009,施法=0xAB100011,倒地=0xAB100012,跑去=0xAB100013,跑回=0,攻击=0xAB100010,攻击B=0xAB100010}
SuoyouModel["大力金刚"]     ={站立=0x01001102,行走=0x01001116,待战=0x01001102,挨打=0x01001100,防御=0x01001104,施法=0x01001111,倒地=0x01001114,跑去=0x01001116,跑回=0,攻击=0x01001106,攻击B=0x01001106,小图标=0xA1000000,大图标=0xA1000001,对话头像=0xA1000002}
SuoyouModel["大力金刚_装饰"]={站立=0x01001103,行走=0x01001117,待战=0x01001103,挨打=0x01001101,防御=0x01001105,施法=0x01001112,倒地=0x01001115,跑去=0x01001117,跑回=0,攻击=0x01001107,攻击B=0x01001107}
SuoyouModel["大力金刚_饰品"]={站立=0x01001B01,行走=0x01001B07,待战=0x01001B01,挨打=0x01001B00,防御=0x01001B02,施法=0x01001B05,倒地=0x01001B06,跑去=0x01001B07,跑回=0,攻击=0x01001B03,攻击B=0x01001B03}
SuoyouModel["进阶大力金刚"]     ={站立=0xAA200104,行走=0xAA200124,待战=0xAA200104,挨打=0xAA200102,防御=0xAA200106,施法=0xAA200118,倒地=0xAA200121,跑去=0xAA200124,跑回=0,攻击=0xAA200108,攻击B=0xAA200108,小图标=0xAA200100,大图标=0xAA200101,对话头像=0xAA200123}
SuoyouModel["进阶大力金刚_装饰"]={站立=0xAA200105,行走=0xAA200125,待战=0xAA200105,挨打=0xAA200103,防御=0xAA200107,施法=0xAA200119,倒地=0xAA200122,跑去=0xAA200125,跑回=0,攻击=0xAA200109,攻击B=0xAA200109}
SuoyouModel["进阶大力金刚_饰品"]={站立=0xAA200112,行走=0xAA200117,待战=0xAA200112,挨打=0xAA200111,防御=0xAA200113,施法=0xAA200115,倒地=0xAA200116,跑去=0xAA200117,跑回=0,攻击=0xAA200114,攻击B=0xAA200114}
SuoyouModel["进阶毗舍童子"]     ={站立=0xAA201604,行走=0xAA201624,待战=0xAA201604,挨打=0xAA201602,防御=0xAA201606,施法=0xAA201618,倒地=0xAA201621,跑去=0xAA201624,跑回=0,攻击=0xAA201608,攻击B=0xAA201608,小图标=0xAA201600,大图标=0xAA201601,对话头像=0xAA201623}
SuoyouModel["进阶毗舍童子_装饰"]={站立=0xAA201605,行走=0xAA201625,待战=0xAA201605,挨打=0xAA201603,防御=0xAA201607,施法=0xAA201619,倒地=0xAA201622,跑去=0xAA201625,跑回=0,攻击=0xAA201609,攻击B=0xAA201609}
SuoyouModel["进阶毗舍童子_饰品"]={站立=0xAA201612,行走=0xAA201617,待战=0xAA201612,挨打=0xAA201611,防御=0xAA201613,施法=0xAA201615,倒地=0xAA201616,跑去=0xAA201617,跑回=0,攻击=0xAA201614,攻击B=0xAA201614}
SuoyouModel["鬼将"]     ={站立=0x01001902,行走=0x01001914,待战=0x01001902,挨打=0x01001900,防御=0x01001904,施法=0x01001909,倒地=0x01001912,跑去=0x01001914,跑回=0,攻击=0x01001906,攻击B=0x01001906,小图标=0x01008254,大图标=0x01008255,对话头像=0x01008253}
SuoyouModel["鬼将_装饰"]={站立=0x01001903,行走=0x01001915,待战=0x01001903,挨打=0x01001901,防御=0x01001905,施法=0x01001910,倒地=0x01001913,跑去=0x01001915,跑回=0,攻击=0x01001907,攻击B=0x01001907}
SuoyouModel["鬼将_饰品"]={站立=0x0100AA01,行走=0x0100AA06,待战=0x0100AA01,挨打=0x0100AA00,防御=0x0100AA02,施法=0x0100AA04,倒地=0x0100AA05,跑去=0x0100AA06,跑回=0,攻击=0x0100AA03,攻击B=0x0100AA03}
SuoyouModel["进阶鬼将"]     ={站立=0xAA200604,行走=0xAA200624,待战=0xAA200604,挨打=0xAA200602,防御=0xAA200606,施法=0xAA200618,倒地=0xAA200621,跑去=0xAA200624,跑回=0,攻击=0xAA200608,攻击B=0xAA200608,小图标=0xAA200600,大图标=0xAA200601,对话头像=0xAA200623}
SuoyouModel["进阶鬼将_装饰"]={站立=0xAA200605,行走=0xAA200625,待战=0xAA200605,挨打=0xAA200603,防御=0xAA200607,施法=0xAA200619,倒地=0xAA200622,跑去=0xAA200625,跑回=0,攻击=0xAA200609,攻击B=0xAA200609}
SuoyouModel["进阶鬼将_饰品"]={站立=0xAA200612,行走=0xAA200617,待战=0xAA200612,挨打=0xAA200611,防御=0xAA200613,施法=0xAA200615,倒地=0xAA200616,跑去=0xAA200617,跑回=0,攻击=0xAA200614,攻击B=0xAA200614}
SuoyouModel["黑山老妖"]     ={站立=0x01002302,行走=0x01002314,待战=0x01002302,挨打=0x01002300,防御=0x01002304,施法=0x01002309,倒地=0x01002312,跑去=0x01002314,跑回=0,攻击=0x01002306,攻击B=0x01002306,小图标=0x01008266,大图标=0x01008267,对话头像=0x01008265}
SuoyouModel["黑山老妖_装饰"]={站立=0x01002303,行走=0x01002315,待战=0x01002303,挨打=0x01002301,防御=0x01002305,施法=0x01002310,倒地=0x01002313,跑去=0x01002315,跑回=0,攻击=0x01002307,攻击B=0x01002307}
SuoyouModel["黑山老妖_饰品"]={站立=0x0100AB01,行走=0x0100AB06,待战=0x0100AB01,挨打=0x0100AB00,防御=0x0100AB02,施法=0x0100AB04,倒地=0x0100AB05,跑去=0x0100AB06,跑回=0,攻击=0x0100AB03,攻击B=0x0100AB03}
SuoyouModel["芙蓉仙子"]     ={站立=0x01001702,行走=0x01001713,待战=0x01001702,挨打=0x01001700,防御=0x01001704,施法=0x01001708,倒地=0x01001711,跑去=0x01001713,跑回=0,攻击=0x01001706,攻击B=0x01001706,小图标=0xA1000003,大图标=0xA1000004,对话头像=0xA1000005}
SuoyouModel["芙蓉仙子_装饰"]={站立=0x01001703,行走=0x01001714,待战=0x01001703,挨打=0x01001701,防御=0x01001705,施法=0x01001709,倒地=0x01001712,跑去=0x01001714,跑回=0,攻击=0x01001707,攻击B=0x01001707}
SuoyouModel["芙蓉仙子_饰品"]={站立=0x01001E01,行走=0x01001E07,待战=0x01001E01,挨打=0x01001E00,防御=0x01001E02,施法=0x01001E04,倒地=0x01001E06,跑去=0x01001E07,跑回=0,攻击=0x01001E03,攻击B=0x01001E03}
SuoyouModel["独角鬼王"]     ={站立=0x01001602,行走=0x01001616,待战=0x01001602,挨打=0x01001600,防御=0x01001604,施法=0x01001611,倒地=0x01001614,跑去=0x01001616,跑回=0,攻击=0x01001606,攻击B=0x01001606,小图标=0xA1000009,大图标=0xA1000010,对话头像=0xA1000011}
SuoyouModel["独角鬼王_装饰"]={站立=0x01001603,行走=0x01001617,待战=0x01001603,挨打=0x01001601,防御=0x01001605,施法=0x01001612,倒地=0x01001615,跑去=0x01001617,跑回=0,攻击=0x01001607,攻击B=0x01001607}
SuoyouModel["独角鬼王_饰品"]={站立=0x01001D01,行走=0x01001D07,待战=0x01001D01,挨打=0x01001D00,防御=0x01001D02,施法=0x01001D05,倒地=0x01001D06,跑去=0x01001D07,跑回=0,攻击=0x01001D03,攻击B=0x01001D03}
SuoyouModel["广目巡守"]     ={站立=0x01001802,行走=0x01001814,待战=0x01001802,挨打=0x01001800,防御=0x01001804,施法=0x01001809,倒地=0x01001812,跑去=0x01001814,跑回=0,攻击=0x01001806,攻击B=0x01001806,小图标=0xA1000012,大图标=0xA1000013,对话头像=0xA1000014}
SuoyouModel["广目巡守_装饰"]={站立=0x01001803,行走=0x01001815,待战=0x01001803,挨打=0x01001801,防御=0x01001805,施法=0x01001810,倒地=0x01001813,跑去=0x01001815,跑回=0,攻击=0x01001807,攻击B=0x01001807}
SuoyouModel["广目巡守_饰品"]={站立=0x01001F01,行走=0x01001F06,待战=0x01001F01,挨打=0x01001F00,防御=0x01001F02,施法=0x01001F04,倒地=0x01001F05,跑去=0x01001F06,跑回=0,攻击=0x01001F03,攻击B=0x01001F03}
SuoyouModel["超级飞廉"]     ={站立=0x01000802,行走=0x01000816,待战=0x01000802,挨打=0x01000800,防御=0x01000804,施法=0x01000811,倒地=0x01000814,跑去=0x01000816,跑回=0,攻击=0x01000806,攻击B=0x01000806,小图标=0xA1000015,大图标=0x00000018,对话头像=0xA1000017}
SuoyouModel["超级飞廉_装饰"]={站立=0x01000803,行走=0x01000817,待战=0x01000803,挨打=0x01000801,防御=0x01000805,施法=0x01000812,倒地=0x01000815,跑去=0x01000817,跑回=0,攻击=0x01000807,攻击B=0x01000807}
SuoyouModel["超级离火兽"]     ={站立=0x01000902,行走=0x01000916,待战=0x01000902,挨打=0x01000900,防御=0x01000904,施法=0x01000911,倒地=0x01000914,跑去=0x01000916,跑回=0,攻击=0x01000906,攻击B=0x01000906,小图标=0x01008224,大图标=0x01008225,对话头像=0x01008223}
SuoyouModel["超级离火兽_装饰"]={站立=0x01000903,行走=0x01000917,待战=0x01000903,挨打=0x01000901,防御=0x01000905,施法=0x01000912,倒地=0x01000915,跑去=0x01000917,跑回=0,攻击=0x01000907,攻击B=0x01000907}
SuoyouModel["超级卯兔"]     ={站立=0x01001001,行走=0x01001009,待战=0x01001001,挨打=0x01001000,防御=0x01001002,施法=0x01001006,倒地=0x01001008,跑去=0x01001009,跑回=0,攻击=0x01001003,攻击B=0x01001003,小图标=0xA1000021,大图标=0xA1000022,对话头像=0xA1000023}
SuoyouModel["进阶超级卯兔"]     ={站立=0x01001001,行走=0x01001009,待战=0x01001001,挨打=0x01001000,防御=0x01001002,施法=0x01001006,倒地=0x01001008,跑去=0x01001009,跑回=0,攻击=0x01001003,攻击B=0x01001003,小图标=0xA1000021,大图标=0xA1000022,对话头像=0xA1000023}
SuoyouModel["涂山瞳"]     ={站立=0xAA100034,行走=0xAA100058,待战=0xAA100034,挨打=0xAA100032,防御=0xAA100036,施法=0xAA100044,倒地=0xAA100055,跑去=0xAA100058,跑回=0,攻击=0xAA100038,攻击B=0xAA100041,小图标=0xAA100030,大图标=0xAA100031,对话头像=0xAA100057}
SuoyouModel["涂山瞳_装饰"]={站立=0xAA100035,行走=0xAA100059,待战=0xAA100035,挨打=0xAA100033,防御=0xAA100037,施法=0xAA100045,倒地=0xAA100056,跑去=0xAA100059,跑回=0,攻击=0xAA100039,攻击B=0xAA100042}
SuoyouModel["涂山瞳_饰品"]={站立=0xAA100048,行走=0xAA100054,待战=0xAA100048,挨打=0xAA100047,防御=0xAA100049,施法=0xAA100052,倒地=0xAA100053,跑去=0xAA100054,跑回=0,攻击=0xAA100050,攻击B=0xAA100051}
SuoyouModel["进阶涂山瞳"]        ={站立=0xAA100004,行走=0xAA100028,待战=0xAA100004,挨打=0xAA100002,防御=0xAA100006,施法=0xAA100014,倒地=0xAA100025,跑去=0xAA100028,跑回=0,攻击=0xAA100008,攻击B=0xAA100011,小图标=0xAA100000,大图标=0xAA100001,对话头像=0xAA100027}
SuoyouModel["进阶涂山瞳_装饰"]={站立=0xAA100005,行走=0xAA100029,待战=0xAA100005,挨打=0xAA100003,防御=0xAA100007,施法=0xAA100015,倒地=0xAA100026,跑去=0xAA100029,跑回=0,攻击=0xAA100009,攻击B=0xAA100012}
SuoyouModel["进阶涂山瞳_饰品"]={站立=0xAA100018,行走=0xAA100024,待战=0xAA100018,挨打=0xAA100017,防御=0xAA100019,施法=0xAA100022,倒地=0xAA100023,跑去=0xAA100024,跑回=0,攻击=0xAA100020,攻击B=0xAA100021}
SuoyouModel["超级白泽"]           ={小图标=0xAA100100,大图标=0xAA100101,对话头像=0xAA100109,站立=0xAA100103,行走=0xAA100110,待战=0xAA100103,挨打=0xAA100102,防御=0xAA100104,施法=0xAA100107,倒地=0xAA100108,跑去=0xAA100110,跑回=0,攻击=0xAA100106,攻击B=0xAA100105}
SuoyouModel["进阶超级白泽"]     ={小图标=0xAA100100,大图标=0xAA100101,对话头像=0xAA100109,站立=0xAA100103,行走=0xAA100110,待战=0xAA100103,挨打=0xAA100102,防御=0xAA100104,施法=0xAA100107,倒地=0xAA100108,跑去=0xAA100110,跑回=0,攻击=0xAA100106,攻击B=0xAA100105}
SuoyouModel["超级赤焰兽"]        ={小图标=0xAA100200,大图标=0xAA100201,对话头像=0xAA100209,站立=0xAA100203,行走=0xAA100210,待战=0xAA100203,挨打=0xAA100202,防御=0xAA100204,施法=0xAA100207,倒地=0xAA100208,跑去=0xAA100210,跑回=0,攻击=0xAA100206,攻击B=0xAA100205}
SuoyouModel["进阶超级赤焰兽"] ={小图标=0xAA100200,大图标=0xAA100201,对话头像=0xAA100209,站立=0xAA100203,行走=0xAA100210,待战=0xAA100203,挨打=0xAA100202,防御=0xAA100204,施法=0xAA100207,倒地=0xAA100208,跑去=0xAA100210,跑回=0,攻击=0xAA100206,攻击B=0xAA100205}
SuoyouModel["超级大鹏"]           ={小图标=0xAA100300,大图标=0xAA100301,对话头像=0xAA100309,站立=0xAA100303,行走=0xAA100310,待战=0xAA100303,挨打=0xAA100302,防御=0xAA100304,施法=0xAA100307,倒地=0xAA100308,跑去=0xAA100310,跑回=0,攻击=0xAA100306,攻击B=0xAA100305}
SuoyouModel["进阶超级大鹏"]     ={小图标=0xAA100300,大图标=0xAA100301,对话头像=0xAA100309,站立=0xAA100303,行走=0xAA100310,待战=0xAA100303,挨打=0xAA100302,防御=0xAA100304,施法=0xAA100307,倒地=0xAA100308,跑去=0xAA100310,跑回=0,攻击=0xAA100306,攻击B=0xAA100305}
SuoyouModel["超级大象"]           ={小图标=0xAA100400,大图标=0xAA100401,对话头像=0xAA100409,站立=0xAA100403,行走=0xAA100410,待战=0xAA100403,挨打=0xAA100402,防御=0xAA100404,施法=0xAA100407,倒地=0xAA100408,跑去=0xAA100410,跑回=0,攻击=0xAA100406,攻击B=0xAA100405}
SuoyouModel["进阶超级大象"]    ={小图标=0xAA100400,大图标=0xAA100401,对话头像=0xAA100409,站立=0xAA100403,行走=0xAA100410,待战=0xAA100403,挨打=0xAA100402,防御=0xAA100404,施法=0xAA100407,倒地=0xAA100408,跑去=0xAA100410,跑回=0,攻击=0xAA100406,攻击B=0xAA100405}
SuoyouModel["超级大熊猫"]       ={小图标=0xAA100500,大图标=0xAA100501,对话头像=0xAA100509,站立=0xAA100503,行走=0xAA100510,待战=0xAA100503,挨打=0xAA100502,防御=0xAA100504,施法=0xAA100507,倒地=0xAA100508,跑去=0xAA100510,跑回=0,攻击=0xAA100506,攻击B=0xAA100505}
SuoyouModel["进阶超级大熊猫"] ={小图标=0xAA100500,大图标=0xAA100501,对话头像=0xAA100509,站立=0xAA100503,行走=0xAA100510,待战=0xAA100503,挨打=0xAA100502,防御=0xAA100504,施法=0xAA100507,倒地=0xAA100508,跑去=0xAA100510,跑回=0,攻击=0xAA100506,攻击B=0xAA100505}
SuoyouModel["超级海豚"]          ={小图标=0xAA100600,大图标=0xAA100601,对话头像=0xAA100609,站立=0xAA100603,行走=0xAA100610,待战=0xAA100603,挨打=0xAA100602,防御=0xAA100604,施法=0xAA100607,倒地=0xAA100608,跑去=0xAA100610,跑回=0,攻击=0xAA100606,攻击B=0xAA100605}
SuoyouModel["进阶超级海豚"]    ={小图标=0xAA100600,大图标=0xAA100601,对话头像=0xAA100609,站立=0xAA100603,行走=0xAA100610,待战=0xAA100603,挨打=0xAA100602,防御=0xAA100604,施法=0xAA100607,倒地=0xAA100608,跑去=0xAA100610,跑回=0,攻击=0xAA100606,攻击B=0xAA100605}
SuoyouModel["超级金猴"]          ={小图标=0xAA100700,大图标=0xAA100701,对话头像=0xAA100709,站立=0xAA100703,行走=0xAA100710,待战=0xAA100703,挨打=0xAA100702,防御=0xAA100704,施法=0xAA100707,倒地=0xAA100708,跑去=0xAA100710,跑回=0,攻击=0xAA100706,攻击B=0xAA100705}
SuoyouModel["进阶超级金猴"]   ={小图标=0xAA100700,大图标=0xAA100701,对话头像=0xAA100709,站立=0xAA100703,行走=0xAA100710,待战=0xAA100703,挨打=0xAA100702,防御=0xAA100704,施法=0xAA100707,倒地=0xAA100708,跑去=0xAA100710,跑回=0,攻击=0xAA100706,攻击B=0xAA100705}
SuoyouModel["超级筋斗云"]={小图标=0xAA100800,大图标=0xAA100801,对话头像=0xAA100809,站立=0xAA100803,行走=0xAA100810,待战=0xAA100803,挨打=0xAA100802,防御=0xAA100804,施法=0xAA100807,倒地=0xAA100808,跑去=0xAA100810,跑回=0,攻击=0xAA100806,攻击B=0xAA100805}
SuoyouModel["进阶超级筋斗云"]={小图标=0xAA100800,大图标=0xAA100801,对话头像=0xAA100809,站立=0xAA100803,行走=0xAA100810,待战=0xAA100803,挨打=0xAA100802,防御=0xAA100804,施法=0xAA100807,倒地=0xAA100808,跑去=0xAA100810,跑回=0,攻击=0xAA100806,攻击B=0xAA100805}
SuoyouModel["超级孔雀"]={小图标=0xAA100900,大图标=0xAA100901,对话头像=0xAA100909,站立=0xAA100903,行走=0xAA100910,待战=0xAA100903,挨打=0xAA100902,防御=0xAA100904,施法=0xAA100907,倒地=0xAA100908,跑去=0xAA100910,跑回=0,攻击=0xAA100906,攻击B=0xAA100905}
SuoyouModel["进阶超级孔雀"]={小图标=0xAA100900,大图标=0xAA100901,对话头像=0xAA100909,站立=0xAA100903,行走=0xAA100910,待战=0xAA100903,挨打=0xAA100902,防御=0xAA100904,施法=0xAA100907,倒地=0xAA100908,跑去=0xAA100910,跑回=0,攻击=0xAA100906,攻击B=0xAA100905}
SuoyouModel["超级灵狐"]={小图标=0xAA101000,大图标=0xAA101001,对话头像=0xAA101009,站立=0xAA101003,行走=0xAA101010,待战=0xAA101003,挨打=0xAA101002,防御=0xAA101004,施法=0xAA101007,倒地=0xAA101008,跑去=0xAA101010,跑回=0,攻击=0xAA101006,攻击B=0xAA101005}
SuoyouModel["进阶超级灵狐"]={小图标=0xAA101000,大图标=0xAA101001,对话头像=0xAA101009,站立=0xAA101003,行走=0xAA101010,待战=0xAA101003,挨打=0xAA101002,防御=0xAA101004,施法=0xAA101007,倒地=0xAA101008,跑去=0xAA101010,跑回=0,攻击=0xAA101006,攻击B=0xAA101005}
SuoyouModel["超级灵鹿"]={小图标=0xAA101100,大图标=0xAA101101,对话头像=0xAA101109,站立=0xAA101103,行走=0xAA101110,待战=0xAA101103,挨打=0xAA101102,防御=0xAA101104,施法=0xAA101107,倒地=0xAA101108,跑去=0xAA101110,跑回=0,攻击=0xAA101106,攻击B=0xAA101105}
SuoyouModel["进阶超级灵鹿"]={小图标=0xAA101100,大图标=0xAA101101,对话头像=0xAA101109,站立=0xAA101103,行走=0xAA101110,待战=0xAA101103,挨打=0xAA101102,防御=0xAA101104,施法=0xAA101107,倒地=0xAA101108,跑去=0xAA101110,跑回=0,攻击=0xAA101106,攻击B=0xAA101105}
SuoyouModel["超级泡泡"]={小图标=0xAA101300,大图标=0xAA101301,对话头像=0xAA101309,站立=0xAA101303,行走=0xAA101310,待战=0xAA101303,挨打=0xAA101302,防御=0xAA101304,施法=0xAA101307,倒地=0xAA101308,跑去=0xAA101310,跑回=0,攻击=0xAA101306,攻击B=0xAA101305}
SuoyouModel["进阶超级泡泡"]={小图标=0xAA101300,大图标=0xAA101301,对话头像=0xAA101309,站立=0xAA101303,行走=0xAA101310,待战=0xAA101303,挨打=0xAA101302,防御=0xAA101304,施法=0xAA101307,倒地=0xAA101308,跑去=0xAA101310,跑回=0,攻击=0xAA101306,攻击B=0xAA101305}
SuoyouModel["超级麒麟"]={小图标=0xAA101200,大图标=0xAA101201,对话头像=0xAA101209,站立=0xAA101203,行走=0xAA101210,待战=0xAA101203,挨打=0xAA101202,防御=0xAA101204,施法=0xAA101207,倒地=0xAA101208,跑去=0xAA101210,跑回=0,攻击=0xAA101206,攻击B=0xAA101205}
SuoyouModel["进阶超级麒麟"]={小图标=0xAA101200,大图标=0xAA101201,对话头像=0xAA101209,站立=0xAA101203,行走=0xAA101210,待战=0xAA101203,挨打=0xAA101202,防御=0xAA101204,施法=0xAA101207,倒地=0xAA101208,跑去=0xAA101210,跑回=0,攻击=0xAA101206,攻击B=0xAA101205}
SuoyouModel["超级青鸾"]={小图标=0xAA101400,大图标=0xAA101401,对话头像=0xAA101409,站立=0xAA101403,行走=0xAA101410,待战=0xAA101403,挨打=0xAA101402,防御=0xAA101404,施法=0xAA101407,倒地=0xAA101408,跑去=0xAA101410,跑回=0,攻击=0xAA101406,攻击B=0xAA101405}
SuoyouModel["进阶超级青鸾"]={小图标=0xAA101400,大图标=0xAA101401,对话头像=0xAA101409,站立=0xAA101403,行走=0xAA101410,待战=0xAA101403,挨打=0xAA101402,防御=0xAA101404,施法=0xAA101407,倒地=0xAA101408,跑去=0xAA101410,跑回=0,攻击=0xAA101406,攻击B=0xAA101405}
SuoyouModel["超级人参娃娃"]={小图标=0xAA101500,大图标=0xAA101501,对话头像=0xAA101509,站立=0xAA101503,行走=0xAA101510,待战=0xAA101503,挨打=0xAA101502,防御=0xAA101504,施法=0xAA101507,倒地=0xAA101508,跑去=0xAA101510,跑回=0,攻击=0xAA101506,攻击B=0xAA101505}
SuoyouModel["进阶超级人参娃娃"]={小图标=0xAA101500,大图标=0xAA101501,对话头像=0xAA101509,站立=0xAA101503,行走=0xAA101510,待战=0xAA101503,挨打=0xAA101502,防御=0xAA101504,施法=0xAA101507,倒地=0xAA101508,跑去=0xAA101510,跑回=0,攻击=0xAA101506,攻击B=0xAA101505}
SuoyouModel["超级神虎"]={小图标=0xAA101600,大图标=0xAA101601,对话头像=0xAA101609,站立=0xAA101603,行走=0xAA101610,待战=0xAA101603,挨打=0xAA101602,防御=0xAA101604,施法=0xAA101607,倒地=0xAA101608,跑去=0xAA101610,跑回=0,攻击=0xAA101606,攻击B=0xAA101605}
SuoyouModel["进阶超级神虎"]={小图标=0xAA101600,大图标=0xAA101601,对话头像=0xAA101609,站立=0xAA101603,行走=0xAA101610,待战=0xAA101603,挨打=0xAA101602,防御=0xAA101604,施法=0xAA101607,倒地=0xAA101608,跑去=0xAA101610,跑回=0,攻击=0xAA101606,攻击B=0xAA101605}
SuoyouModel["超级神龙"]={小图标=0xAA101700,大图标=0xAA101701,对话头像=0xAA101709,站立=0xAA101703,行走=0xAA101710,待战=0xAA101703,挨打=0xAA101702,防御=0xAA101704,施法=0xAA101707,倒地=0xAA101708,跑去=0xAA101710,跑回=0,攻击=0xAA101706,攻击B=0xAA101705}
SuoyouModel["进阶超级神龙"]={小图标=0xAA101700,大图标=0xAA101701,对话头像=0xAA101709,站立=0xAA101703,行走=0xAA101710,待战=0xAA101703,挨打=0xAA101702,防御=0xAA101704,施法=0xAA101707,倒地=0xAA101708,跑去=0xAA101710,跑回=0,攻击=0xAA101706,攻击B=0xAA101705}
SuoyouModel["超级神马"]={小图标=0xAA101800,大图标=0xAA101801,对话头像=0xAA101809,站立=0xAA101803,行走=0xAA101810,待战=0xAA101803,挨打=0xAA101802,防御=0xAA101804,施法=0xAA101807,倒地=0xAA101808,跑去=0xAA101810,跑回=0,攻击=0xAA101806,攻击B=0xAA101805}
SuoyouModel["进阶超级神马"]={小图标=0xAA101800,大图标=0xAA101801,对话头像=0xAA101809,站立=0xAA101803,行走=0xAA101810,待战=0xAA101803,挨打=0xAA101802,防御=0xAA101804,施法=0xAA101807,倒地=0xAA101808,跑去=0xAA101810,跑回=0,攻击=0xAA101806,攻击B=0xAA101805}
SuoyouModel["超级神牛"]={小图标=0xAA101900,大图标=0xAA101901,对话头像=0xAA101909,站立=0xAA101903,行走=0xAA101910,待战=0xAA101903,挨打=0xAA101902,防御=0xAA101904,施法=0xAA101907,倒地=0xAA101908,跑去=0xAA101910,跑回=0,攻击=0xAA101906,攻击B=0xAA101905}
SuoyouModel["进阶超级神牛"]={小图标=0xAA101900,大图标=0xAA101901,对话头像=0xAA101909,站立=0xAA101903,行走=0xAA101910,待战=0xAA101903,挨打=0xAA101902,防御=0xAA101904,施法=0xAA101907,倒地=0xAA101908,跑去=0xAA101910,跑回=0,攻击=0xAA101906,攻击B=0xAA101905}
SuoyouModel["超级神蛇"]={小图标=0xAA102000,大图标=0xAA102001,对话头像=0xAA102009,站立=0xAA102003,行走=0xAA102010,待战=0xAA102003,挨打=0xAA102002,防御=0xAA102004,施法=0xAA102007,倒地=0xAA102008,跑去=0xAA102010,跑回=0,攻击=0xAA102006,攻击B=0xAA102005}
SuoyouModel["进阶超级神蛇"]={小图标=0xAA102000,大图标=0xAA102001,对话头像=0xAA102009,站立=0xAA102003,行走=0xAA102010,待战=0xAA102003,挨打=0xAA102002,防御=0xAA102004,施法=0xAA102007,倒地=0xAA102008,跑去=0xAA102010,跑回=0,攻击=0xAA102006,攻击B=0xAA102005}
SuoyouModel["超级神兔"]={小图标=0xAA102100,大图标=0xAA102101,对话头像=0xAA102109,站立=0xAA102103,行走=0xAA102110,待战=0xAA102103,挨打=0xAA102102,防御=0xAA102104,施法=0xAA102107,倒地=0xAA102108,跑去=0xAA102110,跑回=0,攻击=0xAA102106,攻击B=0xAA102105}
SuoyouModel["进阶超级神兔"]={小图标=0xAA102100,大图标=0xAA102101,对话头像=0xAA102109,站立=0xAA102103,行走=0xAA102110,待战=0xAA102103,挨打=0xAA102102,防御=0xAA102104,施法=0xAA102107,倒地=0xAA102108,跑去=0xAA102110,跑回=0,攻击=0xAA102106,攻击B=0xAA102105}
SuoyouModel["超级神蛇乙巳"]={小图标=0xAA102000,大图标=0x4b055007,对话头像=0x4b055008,站立=0xbf100008,行走=0xbf100008,待战=0xbf100008,挨打=0xbf100001,防御=0xbf100004,施法=0xbf100006,倒地=0xbf100010,跑去=0xbf100008,跑回=0xbf100008,攻击=0xbf100005,攻击B=0xbf100005}
SuoyouModel["进阶超级神蛇乙巳"]={小图标=0xAA102000,大图标=0x4b055007,对话头像=0x4b055008,站立=0xbf100008,行走=0xbf100008,待战=0xbf100008,挨打=0xbf100001,防御=0xbf100004,施法=0xbf100006,倒地=0xbf100010,跑去=0xbf100008,跑回=0xbf100008,攻击=0xbf100005,攻击B=0xbf100005}

SuoyouModel["超级六耳猕猴"]={小图标=0xAA102200,大图标=0xAA102201,对话头像=0xAA102209,站立=0xAA102203,行走=0xAA102210,待战=0xAA102203,挨打=0xAA102202,防御=0xAA102204,施法=0xAA102207,倒地=0xAA102208,跑去=0xAA102210,跑回=0,攻击=0xAA102205,攻击B=0xAA102205}
SuoyouModel["进阶超级六耳猕猴"]={小图标=0xAA102200,大图标=0xAA102201,对话头像=0xAA102209,站立=0xAA102203,行走=0xAA102210,待战=0xAA102203,挨打=0xAA102202,防御=0xAA102204,施法=0xAA102207,倒地=0xAA102208,跑去=0xAA102210,跑回=0,攻击=0xAA102205,攻击B=0xAA102205}
SuoyouModel["超级神羊"]={小图标=0xAA102300,大图标=0xAA102301,对话头像=0xAA102309,站立=0xAA102303,行走=0xAA102310,待战=0xAA102303,挨打=0xAA102302,防御=0xAA102304,施法=0xAA102307,倒地=0xAA102308,跑去=0xAA102310,跑回=0,攻击=0xAA102306,攻击B=0xAA102305}
SuoyouModel["进阶超级神羊"]={小图标=0xAA102300,大图标=0xAA102301,对话头像=0xAA102309,站立=0xAA102303,行走=0xAA102310,待战=0xAA102303,挨打=0xAA102302,防御=0xAA102304,施法=0xAA102307,倒地=0xAA102308,跑去=0xAA102310,跑回=0,攻击=0xAA102306,攻击B=0xAA102305}
SuoyouModel["超级土地公公"]={小图标=0xAA102400,大图标=0xAA102401,对话头像=0xAA102409,站立=0xAA102403,行走=0xAA102410,待战=0xAA102403,挨打=0xAA102402,防御=0xAA102404,施法=0xAA102407,倒地=0xAA102408,跑去=0xAA102410,跑回=0,攻击=0xAA102405,攻击B=0xAA102405}
SuoyouModel["进阶超级土地公公"]={小图标=0xAA102400,大图标=0xAA102401,对话头像=0xAA102409,站立=0xAA102403,行走=0xAA102410,待战=0xAA102403,挨打=0xAA102402,防御=0xAA102404,施法=0xAA102407,倒地=0xAA102408,跑去=0xAA102410,跑回=0,攻击=0xAA102405,攻击B=0xAA102405}
SuoyouModel["超级神鸡"]={小图标=0xAA102500,大图标=0xAA102501,对话头像=0xAA102509,站立=0xAA102503,行走=0xAA102510,待战=0xAA102503,挨打=0xAA102502,防御=0xAA102504,施法=0xAA102507,倒地=0xAA102508,跑去=0xAA102510,跑回=0,攻击=0xAA102506,攻击B=0xAA102505}
SuoyouModel["进阶超级神鸡"]={小图标=0xAA102500,大图标=0xAA102501,对话头像=0xAA102509,站立=0xAA102503,行走=0xAA102510,待战=0xAA102503,挨打=0xAA102502,防御=0xAA102504,施法=0xAA102507,倒地=0xAA102508,跑去=0xAA102510,跑回=0,攻击=0xAA102506,攻击B=0xAA102505}
SuoyouModel["超级神猴"]={小图标=0xAA102600,大图标=0xAA102601,对话头像=0xAA102609,站立=0xAA102603,行走=0xAA102610,待战=0xAA102603,挨打=0xAA102602,防御=0xAA102604,施法=0xAA102607,倒地=0xAA102608,跑去=0xAA102610,跑回=0,攻击=0xAA102606,攻击B=0xAA102605}
SuoyouModel["进阶超级神猴"]={小图标=0xAA102600,大图标=0xAA102601,对话头像=0xAA102609,站立=0xAA102603,行走=0xAA102610,待战=0xAA102603,挨打=0xAA102602,防御=0xAA102604,施法=0xAA102607,倒地=0xAA102608,跑去=0xAA102610,跑回=0,攻击=0xAA102606,攻击B=0xAA102605}
SuoyouModel["超级玉兔"]={小图标=0xAA102700,大图标=0xAA102701,对话头像=0xAA102709,站立=0xAA102703,行走=0xAA102710,待战=0xAA102703,挨打=0xAA102702,防御=0xAA102704,施法=0xAA102707,倒地=0xAA102708,跑去=0xAA102710,跑回=0,攻击=0xAA102706,攻击B=0xAA102705}
SuoyouModel["进阶超级玉兔"]={小图标=0xAA102700,大图标=0xAA102701,对话头像=0xAA102709,站立=0xAA102703,行走=0xAA102710,待战=0xAA102703,挨打=0xAA102702,防御=0xAA102704,施法=0xAA102707,倒地=0xAA102708,跑去=0xAA102710,跑回=0,攻击=0xAA102706,攻击B=0xAA102705}
SuoyouModel["泡泡灵仙·飞燕女"]     ={站立=0x01004112,行走=0x01004128,待战=0x01004112,挨打=0x01004110,防御=0x01004114,施法=0x01004122,倒地=0x01004125,跑去=0x01004128,跑回=0,攻击=0x01004116,攻击B=0x01004116,小图标=0x01004108,大图标=0x01004109,对话头像=0x01004127}
SuoyouModel["泡泡灵仙·飞燕女_装饰"]={站立=0x01004113,行走=0x01004129,待战=0x01004113,挨打=0x01004111,防御=0x01004115,施法=0x01004123,倒地=0x01004126,跑去=0x01004129,跑回=0,攻击=0x01004117,攻击B=0x01004117}
SuoyouModel["泡泡灵仙·飞燕女_饰品"]={站立=0x01004101,行走=0x01004107,待战=0x01004101,挨打=0x01004100,防御=0x01004102,施法=0x01004105,倒地=0x01004106,跑去=0x01004107,跑回=0,攻击=0x01004103,攻击B=0x01004103}
SuoyouModel["泡泡灵仙·骨精灵"]     ={站立=0x01004212,行走=0x01004228,待战=0x01004212,挨打=0x01004210,防御=0x01004214,施法=0x01004222,倒地=0x01004225,跑去=0x01004228,跑回=0,攻击=0x01004216,攻击B=0x01004216,小图标=0x01004208,大图标=0x01004209,对话头像=0x01004227}
SuoyouModel["泡泡灵仙·骨精灵_装饰"]={站立=0x01004213,行走=0x01004229,待战=0x01004213,挨打=0x01004211,防御=0x01004215,施法=0x01004223,倒地=0x01004226,跑去=0x01004229,跑回=0,攻击=0x01004217,攻击B=0x01004217}
SuoyouModel["泡泡灵仙·骨精灵_饰品"]={站立=0x01004201,行走=0x01004207,待战=0x01004201,挨打=0x01004200,防御=0x01004202,施法=0x01004205,倒地=0x01004206,跑去=0x01004207,跑回=0,攻击=0x01004203,攻击B=0x01004203}
SuoyouModel["泡泡灵仙·剑侠客"]     ={站立=0x01004312,行走=0x01004328,待战=0x01004312,挨打=0x01004310,防御=0x01004314,施法=0x01004322,倒地=0x01004325,跑去=0x01004328,跑回=0,攻击=0x01004316,攻击B=0x01004316,小图标=0x01004308,大图标=0x01004309,对话头像=0x01004327}
SuoyouModel["泡泡灵仙·剑侠客_装饰"]={站立=0x01004313,行走=0x01004329,待战=0x01004313,挨打=0x01004311,防御=0x01004315,施法=0x01004323,倒地=0x01004326,跑去=0x01004329,跑回=0,攻击=0x01004317,攻击B=0x01004317}
SuoyouModel["泡泡灵仙·剑侠客_饰品"]={站立=0x01004301,行走=0x01004307,待战=0x01004301,挨打=0x01004300,防御=0x01004302,施法=0x01004305,倒地=0x01004306,跑去=0x01004307,跑回=0,攻击=0x01004303,攻击B=0x01004303}
SuoyouModel["泡泡灵仙·龙太子"]     ={站立=0x01004412,行走=0x01004428,待战=0x01004412,挨打=0x01004410,防御=0x01004414,施法=0x01004422,倒地=0x01004425,跑去=0x01004428,跑回=0,攻击=0x01004416,攻击B=0x01004416,小图标=0x01004408,大图标=0x01004409,对话头像=0x01004427}
SuoyouModel["泡泡灵仙·龙太子_装饰"]={站立=0x01004413,行走=0x01004429,待战=0x01004413,挨打=0x01004411,防御=0x01004415,施法=0x01004423,倒地=0x01004426,跑去=0x01004429,跑回=0,攻击=0x01004417,攻击B=0x01004417}
SuoyouModel["泡泡灵仙·龙太子_饰品"]={站立=0x01004401,行走=0x01004407,待战=0x01004401,挨打=0x01004400,防御=0x01004402,施法=0x01004405,倒地=0x01004406,跑去=0x01004407,跑回=0,攻击=0x01004403,攻击B=0x01004403}
SuoyouModel["泡泡灵仙·杀破狼"]     ={站立=0x01004512,行走=0x01004528,待战=0x01004512,挨打=0x01004510,防御=0x01004514,施法=0x01004522,倒地=0x01004525,跑去=0x01004528,跑回=0,攻击=0x01004516,攻击B=0x01004516,小图标=0x01004508,大图标=0x01004509,对话头像=0x01004527}
SuoyouModel["泡泡灵仙·杀破狼_装饰"]={站立=0x01004513,行走=0x01004529,待战=0x01004513,挨打=0x01004511,防御=0x01004515,施法=0x01004523,倒地=0x01004526,跑去=0x01004529,跑回=0,攻击=0x01004517,攻击B=0x01004517}
SuoyouModel["泡泡灵仙·杀破狼_饰品"]={站立=0x01004501,行走=0x01004507,待战=0x01004501,挨打=0x01004500,防御=0x01004502,施法=0x01004505,倒地=0x01004506,跑去=0x01004507,跑回=0,攻击=0x01004503,攻击B=0x01004503}
SuoyouModel["泡泡灵仙·神天兵"]     ={站立=0x01004612,行走=0x01004628,待战=0x01004612,挨打=0x01004610,防御=0x01004614,施法=0x01004622,倒地=0x01004625,跑去=0x01004628,跑回=0,攻击=0x01004616,攻击B=0x01004616,小图标=0x01004608,大图标=0x01004609,对话头像=0x01004627}
SuoyouModel["泡泡灵仙·神天兵_装饰"]={站立=0x01004613,行走=0x01004629,待战=0x01004613,挨打=0x01004611,防御=0x01004615,施法=0x01004623,倒地=0x01004626,跑去=0x01004629,跑回=0,攻击=0x01004617,攻击B=0x01004617}
SuoyouModel["泡泡灵仙·神天兵_饰品"]={站立=0x01004601,行走=0x01004607,待战=0x01004601,挨打=0x01004600,防御=0x01004602,施法=0x01004605,倒地=0x01004606,跑去=0x01004607,跑回=0,攻击=0x01004603,攻击B=0x01004603}
SuoyouModel["泡泡灵仙·巫蛮儿"]     ={站立=0x01004712,行走=0x01004728,待战=0x01004712,挨打=0x01004710,防御=0x01004714,施法=0x01004722,倒地=0x01004725,跑去=0x01004728,跑回=0,攻击=0x01004716,攻击B=0x01004716,小图标=0x01004708,大图标=0x01004709,对话头像=0x01004727}
SuoyouModel["泡泡灵仙·巫蛮儿_装饰"]={站立=0x01004713,行走=0x01004729,待战=0x01004713,挨打=0x01004711,防御=0x01004715,施法=0x01004723,倒地=0x01004726,跑去=0x01004729,跑回=0,攻击=0x01004717,攻击B=0x01004717}
SuoyouModel["泡泡灵仙·巫蛮儿_饰品"]={站立=0x01004701,行走=0x01004707,待战=0x01004701,挨打=0x01004700,防御=0x01004702,施法=0x01004705,倒地=0x01004706,跑去=0x01004707,跑回=0,攻击=0x01004703,攻击B=0x01004703}
SuoyouModel["泡泡灵仙·羽灵神"]     ={站立=0x01004812,行走=0x01004828,待战=0x01004812,挨打=0x01004810,防御=0x01004814,施法=0x01004822,倒地=0x01004825,跑去=0x01004828,跑回=0,攻击=0x01004816,攻击B=0x01004816,小图标=0x01004808,大图标=0x01004809,对话头像=0x01004827}
SuoyouModel["泡泡灵仙·羽灵神_装饰"]={站立=0x01004813,行走=0x01004829,待战=0x01004813,挨打=0x01004811,防御=0x01004815,施法=0x01004823,倒地=0x01004826,跑去=0x01004829,跑回=0,攻击=0x01004817,攻击B=0x01004817}
SuoyouModel["泡泡灵仙·羽灵神_饰品"]={站立=0x01004801,行走=0x01004807,待战=0x01004801,挨打=0x01004800,防御=0x01004802,施法=0x01004805,倒地=0x01004806,跑去=0x01004807,跑回=0,攻击=0x01004803,攻击B=0x01004803}
SuoyouModel["沙暴"]     ={站立=0x01007112,行走=0x01007128,待战=0x01007112,挨打=0x01007110,防御=0x01007114,施法=0x01007122,倒地=0x01007125,跑去=0x01007128,跑回=0,攻击=0x01007116,攻击B=0x01007116,小图标=0x01007108,大图标=0x01007109,对话头像=0x01007127}
SuoyouModel["沙暴_装饰"]={站立=0x01007113,行走=0x01007129,待战=0x01007113,挨打=0x01007111,防御=0x01007115,施法=0x01007123,倒地=0x01007126,跑去=0x01007129,跑回=0,攻击=0x01007117,攻击B=0x01007117}
SuoyouModel["沙暴_饰品"]={站立=0x01007101,行走=0x01007107,待战=0x01007101,挨打=0x01007100,防御=0x01007102,施法=0x01007105,倒地=0x01007106,跑去=0x01007107,跑回=0,攻击=0x01007103,攻击B=0x01007103}
SuoyouModel["虬龙"]     ={站立=0x01005212,行走=0x01005228,待战=0x01005212,挨打=0x01005210,防御=0x01005214,施法=0x01005222,倒地=0x01005225,跑去=0x01005228,跑回=0,攻击=0x01005216,攻击B=0x01005216,小图标=0x01005208,大图标=0x01005209,对话头像=0x01005227}
SuoyouModel["虬龙_装饰"]={站立=0x01005213,行走=0x01005229,待战=0x01005213,挨打=0x01005211,防御=0x01005215,施法=0x01005223,倒地=0x01005226,跑去=0x01005229,跑回=0,攻击=0x01005217,攻击B=0x01005217}
SuoyouModel["虬龙_饰品"]={站立=0x01005201,行走=0x01005207,待战=0x01005201,挨打=0x01005200,防御=0x01005202,施法=0x01005205,倒地=0x01005206,跑去=0x01005207,跑回=0,攻击=0x01005203,攻击B=0x01005203}
SuoyouModel["强盗鬼狸"]     ={站立=0x01004904,行走=0x01004920,待战=0x01004904,挨打=0x01004902,防御=0x01004906,施法=0x01004914,倒地=0x01004917,跑去=0x01004920,跑回=0,攻击=0x01004908,攻击B=0x01004908,小图标=0x01004900,大图标=0x01004901,对话头像=0x01004919}
SuoyouModel["强盗鬼狸_装饰"]={站立=0x01004905,行走=0x01004921,待战=0x01004905,挨打=0x01004903,防御=0x01004907,施法=0x01004915,倒地=0x01004918,跑去=0x01004921,跑回=0,攻击=0x01004909,攻击B=0x01004909}
SuoyouModel["强盗狸"]     ={站立=0x01005003,行走=0x01005013,待战=0x01005003,挨打=0x01005002,防御=0x01005004,施法=0x01005009,倒地=0x01005011,跑去=0x01005013,跑回=0,攻击=0x01005005,攻击B=0x01005005,小图标=0x01005000,大图标=0x01005001,对话头像=0x01005012}
SuoyouModel["强盗沙狸"]     ={站立=0x01005103,行走=0x01005113,待战=0x01005103,挨打=0x01005102,防御=0x01005104,施法=0x01005109,倒地=0x01005111,跑去=0x01005113,跑回=0,攻击=0x01005105,攻击B=0x01005105,小图标=0x01005100,大图标=0x01005101,对话头像=0x01005112}
SuoyouModel["熔火虫"]     ={站立=0x01005303,行走=0x01005313,待战=0x01005303,挨打=0x01005302,防御=0x01005304,施法=0x01005309,倒地=0x01005311,跑去=0x01005313,跑回=0,攻击=0x01005305,攻击B=0x01005305,小图标=0x01005300,大图标=0x01005301,对话头像=0x01005312}
SuoyouModel["熔火蛙"]     ={站立=0x01005403,行走=0x01005413,待战=0x01005403,挨打=0x01005402,防御=0x01005404,施法=0x01005409,倒地=0x01005411,跑去=0x01005413,跑回=0,攻击=0x01005405,攻击B=0x01005405,小图标=0x01005400,大图标=0x01005401,对话头像=0x01005412}
SuoyouModel["熔岩龟"]     ={站立=0x01005503,行走=0x01005513,待战=0x01005503,挨打=0x01005502,防御=0x01005504,施法=0x01005509,倒地=0x01005511,跑去=0x01005513,跑回=0,攻击=0x01005505,攻击B=0x01005505,小图标=0x01005500,大图标=0x01005501,对话头像=0x01005512}
SuoyouModel["沙虫"]     ={站立=0x01005603,行走=0x01005613,待战=0x01005603,挨打=0x01005602,防御=0x01005604,施法=0x01005609,倒地=0x01005611,跑去=0x01005613,跑回=0,攻击=0x01005605,攻击B=0x01005605,小图标=0x01005600,大图标=0x01005601,对话头像=0x01005612}
SuoyouModel["沙狸"]     ={站立=0x01005703,行走=0x01005713,待战=0x01005703,挨打=0x01005702,防御=0x01005704,施法=0x01005709,倒地=0x01005711,跑去=0x01005713,跑回=0,攻击=0x01005705,攻击B=0x01005705,小图标=0x01005700,大图标=0x01005701,对话头像=0x01005712}
SuoyouModel["食魂虫(日)"]     ={站立=0x01005803,行走=0x01005813,待战=0x01005803,挨打=0x01005802,防御=0x01005804,施法=0x01005809,倒地=0x01005811,跑去=0x01005813,跑回=0,攻击=0x01005805,攻击B=0x01005805,小图标=0x01005800,大图标=0x01005801,对话头像=0x01005812}
SuoyouModel["食魂虫(夜)"]     ={站立=0x01005903,行走=0x01005913,待战=0x01005903,挨打=0x01005902,防御=0x01005904,施法=0x01005909,倒地=0x01005911,跑去=0x01005913,跑回=0,攻击=0x01005905,攻击B=0x01005905,小图标=0x01005900,大图标=0x01005901,对话头像=0x01005912}
SuoyouModel["食铁兽"]     ={站立=0x01006002,行走=0x01006010,待战=0x01006002,挨打=0x01006001,防御=0x01006003,施法=0x01006006,倒地=0x01006008,跑去=0x01006010,跑回=0,攻击=0x01006004,攻击B=0x01006004,小图标=0x01006000,大图标=0x01005601,对话头像=0x01006009}
SuoyouModel["燧明兽"]     ={站立=0x01006103,行走=0x01006113,待战=0x01006103,挨打=0x01006102,防御=0x01006104,施法=0x01006109,倒地=0x01006111,跑去=0x01006113,跑回=0,攻击=0x01006105,攻击B=0x01006105,小图标=0x01006100,大图标=0x01006101,对话头像=0x01006112}
SuoyouModel["望月蛙"]     ={站立=0x01006203,行走=0x01006213,待战=0x01006203,挨打=0x01006202,防御=0x01006204,施法=0x01006209,倒地=0x01006211,跑去=0x01006213,跑回=0,攻击=0x01006205,攻击B=0x01006205,小图标=0x01006200,大图标=0x01006201,对话头像=0x01006212}
SuoyouModel["无名"]     ={站立=0x01006301,行走=0x01006310,待战=0x01006301,挨打=0x01006300,防御=0x01006302,施法=0x01006307,倒地=0x01006309,跑去=0x01006310,跑回=0,攻击=0x01006303,攻击B=0x01006303,小图标=0x01006200,大图标=0x01006201,对话头像=0x01006212}
SuoyouModel["雪狸"]     ={站立=0x01006404,行走=0x01006420,待战=0x01006404,挨打=0x01006402,防御=0x01006406,施法=0x01006414,倒地=0x01006417,跑去=0x01006420,跑回=0,攻击=0x01006408,攻击B=0x01006408,小图标=0x01006400,大图标=0x01006401,对话头像=0x01006419}
SuoyouModel["雪狸_装饰"]={站立=0x01006405,行走=0x01006421,待战=0x01006405,挨打=0x01006403,防御=0x01006406,施法=0x01006415,倒地=0x01006418,跑去=0x01006421,跑回=0,攻击=0x01006409,攻击B=0x01006409}
SuoyouModel["雪蛙"]     ={站立=0x01006503,行走=0x01006513,待战=0x01006503,挨打=0x01006502,防御=0x01006504,施法=0x01006509,倒地=0x01006511,跑去=0x01006513,跑回=0,攻击=0x01006505,攻击B=0x01006505,小图标=0x01006500,大图标=0x01006501,对话头像=0x01006512}
SuoyouModel["雪月蛙"]     ={站立=0x01006603,行走=0x01006613,待战=0x01006603,挨打=0x01006602,防御=0x01006604,施法=0x01006609,倒地=0x01006611,跑去=0x01006613,跑回=0,攻击=0x01006605,攻击B=0x01006605,小图标=0x01006600,大图标=0x01006601,对话头像=0x01006612}
SuoyouModel["岩冰龟"]     ={站立=0x01006703,行走=0x01006713,待战=0x01006703,挨打=0x01006702,防御=0x01006704,施法=0x01006709,倒地=0x01006711,跑去=0x01006713,跑回=0,攻击=0x01006705,攻击B=0x01006705,小图标=0x01006700,大图标=0x01006701,对话头像=0x01006712}
SuoyouModel["岩龟"]     ={站立=0x01006803,行走=0x01006813,待战=0x01006803,挨打=0x01006802,防御=0x01006804,施法=0x01006809,倒地=0x01006811,跑去=0x01006813,跑回=0,攻击=0x01006805,攻击B=0x01006805,小图标=0x01006800,大图标=0x01006801,对话头像=0x01006812}
SuoyouModel["竹笋虫"]     ={站立=0x01006903,行走=0x01006913,待战=0x01006903,挨打=0x01006902,防御=0x01006904,施法=0x01006909,倒地=0x01006911,跑去=0x01006913,跑回=0,攻击=0x01006905,攻击B=0x01006905,小图标=0x01006900,大图标=0x01006901,对话头像=0x01006912}
SuoyouModel["纵火狸"]     ={站立=0x01007003,行走=0x01007013,待战=0x01007003,挨打=0x01007002,防御=0x01007004,施法=0x01007009,倒地=0x01007011,跑去=0x01007013,跑回=0,攻击=0x01007005,攻击B=0x01007005,小图标=0x01007000,大图标=0x01007001,对话头像=0x01007012}
SuoyouModel["阿宝"]     ={站立=0x01000102,行走=0x01000114,待战=0x01000102,挨打=0x01000100,防御=0x01000104,施法=0x01000109,倒地=0x01000112,跑去=0x01000114,跑回=0,攻击=0x01000106,攻击B=0x01000106,小图标=0x01008201,大图标=0x01008202,对话头像=0x01008200}
SuoyouModel["阿宝_装饰"]={站立=0x01000103,行走=0x01000115,待战=0x01000103,挨打=0x01000101,防御=0x01000105,施法=0x01000110,倒地=0x01000113,跑去=0x01000115,跑回=0,攻击=0x01000107,攻击B=0x01000107}
SuoyouModel["阿宝_饰品"]={站立=0x01001A01,行走=0x01001A07,待战=0x01001A01,挨打=0x01001A00,防御=0x01001A02,施法=0x01001A05,倒地=0x01001A06,跑去=0x01001A07,跑回=0,攻击=0x01001A03,攻击B=0x01001A03}
SuoyouModel["芭将军"]     ={站立=0x01000201,行走=0x01000212,待战=0x01000201,挨打=0x01000200,防御=0x01000202,施法=0x01000208,倒地=0x01000210,跑去=0x01000212,跑回=0,攻击=0x01000203,攻击B=0x01000203,小图标=0xAAAA0001,大图标=0x01000018,对话头像=0xAAAA0000}
SuoyouModel["冰龟"]     ={站立=0x01000301,行走=0x01000309,待战=0x01000301,挨打=0x01000300,防御=0x01000302,施法=0x01000306,倒地=0x01000308,跑去=0x01000309,跑回=0,攻击=0x01000303,攻击B=0x01000303,小图标=0x01008206,大图标=0x01008207,对话头像=0x01008205}
SuoyouModel["冰火龟"]     ={站立=0x01000401,行走=0x01000409,待战=0x01000401,挨打=0x01000400,防御=0x01000402,施法=0x01000406,倒地=0x01000408,跑去=0x01000409,跑回=0,攻击=0x01000403,攻击B=0x01000403,小图标=0x01008209,大图标=0x01008210,对话头像=0x01008208}
SuoyouModel["草龟"]     ={站立=0x01000501,行走=0x01000509,待战=0x01000501,挨打=0x01000500,防御=0x01000502,施法=0x01000506,倒地=0x01000508,跑去=0x01000509,跑回=0,攻击=0x01000503,攻击B=0x01000503,小图标=0x01008212,大图标=0x01008213,对话头像=0x01008211}
SuoyouModel["草叶虫"]     ={站立=0x01000601,行走=0x01000609,待战=0x01000601,挨打=0x01000600,防御=0x01000602,施法=0x01000606,倒地=0x01000608,跑去=0x01000609,跑回=0,攻击=0x01000603,攻击B=0x01000603,小图标=0x01008215,大图标=0x01008216,对话头像=0x01008214}
SuoyouModel["草叶魂虫"]     ={站立=0x01000701,行走=0x01000709,待战=0x01000701,挨打=0x01000700,防御=0x01000702,施法=0x01000706,倒地=0x01000708,跑去=0x01000709,跑回=0,攻击=0x01000703,攻击B=0x01000703,小图标=0x01008218,大图标=0x01008219,对话头像=0x01008217}
SuoyouModel["鬼蛙"]     ={站立=0x01002101,行走=0x01002108,待战=0x01002101,挨打=0x01002100,防御=0x01002102,施法=0x01002105,倒地=0x01002107,跑去=0x01002108,跑回=0,攻击=0x01002103,攻击B=0x01002103,小图标=0x01008260,大图标=0x01008261,对话头像=0x01008259}
SuoyouModel["海狸"]     ={站立=0x01002201,行走=0x01002208,待战=0x01002201,挨打=0x01002200,防御=0x01002202,施法=0x01002205,倒地=0x01002207,跑去=0x01002208,跑回=0,攻击=0x01002203,攻击B=0x01002203,小图标=0x01008263,大图标=0x01008264,对话头像=0x01008262}
SuoyouModel["幻姬"]     ={站立=0x01002402,行走=0x01002414,待战=0x01002402,挨打=0x01002400,防御=0x01002404,施法=0x01002409,倒地=0x01002412,跑去=0x01002414,跑回=0,攻击=0x01002406,攻击B=0x01002406,小图标=0x01008269,大图标=0x01008270,对话头像=0x01008268}
SuoyouModel["幻姬_装饰"]={站立=0x01002403,行走=0x01002415,待战=0x01002403,挨打=0x01002401,防御=0x01002405,施法=0x01002410,倒地=0x01002413,跑去=0x01002415,跑回=0,攻击=0x01002407,攻击B=0x01002407}
SuoyouModel["幻姬_饰品"]={站立=0x0100AC01,行走=0x0100AC06,待战=0x0100AC01,挨打=0x0100AC00,防御=0x0100AC02,施法=0x0100AC04,倒地=0x0100AC05,跑去=0x0100AC06,跑回=0,攻击=0x0100AC03,攻击B=0x0100AC03}
SuoyouModel["火沙虫"]     ={站立=0x01002501,行走=0x01002508,待战=0x01002501,挨打=0x01002500,防御=0x01002502,施法=0x01002505,倒地=0x01002507,跑去=0x01002508,跑回=0,攻击=0x01002503,攻击B=0x01002503,小图标=0x01008272,大图标=0x01008273,对话头像=0x01008271}
SuoyouModel["火月蛙"]     ={站立=0x01002601,行走=0x01002608,待战=0x01002601,挨打=0x01002600,防御=0x01002602,施法=0x01002605,倒地=0x01002607,跑去=0x01002608,跑回=0,攻击=0x01002603,攻击B=0x01002603,小图标=0x01008275,大图标=0x01008276,对话头像=0x01008274}
SuoyouModel["火云龟"]     ={站立=0x01002701,行走=0x01002708,待战=0x01002701,挨打=0x01002700,防御=0x01002702,施法=0x01002705,倒地=0x01002707,跑去=0x01002708,跑回=0,攻击=0x01002703,攻击B=0x01002703,小图标=0x01008278,大图标=0x01008279,对话头像=0x01008277}
SuoyouModel["积水鬼蛙"]     ={站立=0x01002801,行走=0x01002808,待战=0x01002801,挨打=0x01002800,防御=0x01002802,施法=0x01002805,倒地=0x01002807,跑去=0x01002808,跑回=0,攻击=0x01002803,攻击B=0x01002803,小图标=0x01008281,大图标=0x01008282,对话头像=0x01008280}
SuoyouModel["积水蛙"]     ={站立=0x01002901,行走=0x01002908,待战=0x01002901,挨打=0x01002900,防御=0x01002902,施法=0x01002905,倒地=0x01002907,跑去=0x01002908,跑回=0,攻击=0x01002903,攻击B=0x01002903,小图标=0x01008284,大图标=0x01008285,对话头像=0x01008283}
SuoyouModel["金乌虫"]     ={站立=0x01003101,行走=0x01003108,待战=0x01003101,挨打=0x01003100,防御=0x01003102,施法=0x01003105,倒地=0x01003107,跑去=0x01003108,跑回=0,攻击=0x01003103,攻击B=0x01003103,小图标=0x01008290,大图标=0x01008291,对话头像=0x01008289}
SuoyouModel["金乌火虫"]     ={站立=0x01003201,行走=0x01003208,待战=0x01003201,挨打=0x01003200,防御=0x01003202,施法=0x01003205,倒地=0x01003207,跑去=0x01003208,跑回=0,攻击=0x01003203,攻击B=0x01003203,小图标=0x01008293,大图标=0x01008294,对话头像=0x01008292}
SuoyouModel["金乌月光虫"]     ={站立=0x01003301,行走=0x01003308,待战=0x01003301,挨打=0x01003300,防御=0x01003302,施法=0x01003305,倒地=0x01003307,跑去=0x01003308,跑回=0,攻击=0x01003303,攻击B=0x01003303,小图标=0x01008296,大图标=0x01008297,对话头像=0x01008295}
SuoyouModel["金翼"]     ={站立=0x01003412,行走=0x01003428,待战=0x01003412,挨打=0x01003410,防御=0x01003414,施法=0x01003422,倒地=0x01003425,跑去=0x01003428,跑回=0,攻击=0x01003416,攻击B=0x01003416,小图标=0x01003408,大图标=0x01003409,对话头像=0x01003427}
SuoyouModel["金翼_装饰"]={站立=0x01003413,行走=0x01003429,待战=0x01003413,挨打=0x01003411,防御=0x01003415,施法=0x01003423,倒地=0x01003426,跑去=0x01003429,跑回=0,攻击=0x01003417,攻击B=0x01003417}
SuoyouModel["金翼_饰品"]={站立=0x01003401,行走=0x01003407,待战=0x01003401,挨打=0x01003400,防御=0x01003402,施法=0x01003405,倒地=0x01003406,跑去=0x01003407,跑回=0,攻击=0x01003403,攻击B=0x01003403}
SuoyouModel["雷龙"]     ={站立=0x01003510,行走=0x01003524,待战=0x01003510,挨打=0x01003508,防御=0x01003512,施法=0x01003518,倒地=0x01003521,跑去=0x01003524,跑回=0,攻击=0x01003514,攻击B=0x01003514,小图标=0x01003506,大图标=0x01003507,对话头像=0x01003523}
SuoyouModel["雷龙_装饰"]={站立=0x01003511,行走=0x01003525,待战=0x01003511,挨打=0x01003509,防御=0x01003513,施法=0x01003519,倒地=0x01003522,跑去=0x01003525,跑回=0,攻击=0x01003515,攻击B=0x01003515}
SuoyouModel["雷龙_饰品"]={站立=0x01003501,行走=0x01003505,待战=0x01003501,挨打=0x01003500,防御=0x01003502,施法=0x01003503,倒地=0x01003504,跑去=0x01003505,跑回=0,攻击=0x01003515,攻击B=0x01003515}
SuoyouModel["龙鲤"]     ={站立=0x01003612,行走=0x01003628,待战=0x01003612,挨打=0x01003610,防御=0x01003614,施法=0x01003622,倒地=0x01003625,跑去=0x01003628,跑回=0,攻击=0x01003616,攻击B=0x01003616,小图标=0x01003608,大图标=0x01003609,对话头像=0x01003627}
SuoyouModel["龙鲤_装饰"]={站立=0x01003613,行走=0x01003629,待战=0x01003613,挨打=0x01003611,防御=0x01003615,施法=0x01003623,倒地=0x01003626,跑去=0x01003629,跑回=0,攻击=0x01003617,攻击B=0x01003617}
SuoyouModel["龙鲤_饰品"]={站立=0x01003601,行走=0x01003607,待战=0x01003601,挨打=0x01003600,防御=0x01003602,施法=0x01003605,倒地=0x0100AF05,跑去=0x01003607,跑回=0,攻击=0x01003603,攻击B=0x01003603}
SuoyouModel["魔化涂山瞳"]     ={站立=0x01003703,行走=0x01003714,待战=0x01003703,挨打=0x01003701,防御=0x01003705,施法=0x01003709,倒地=0x01003711,跑去=0x01003714,跑回=0,攻击=0x01003707,攻击B=0x01003707,小图标=0x01003608,大图标=0x01003700,对话头像=0x01003713}
SuoyouModel["魔化涂山瞳_装饰"]={站立=0x01003704,行走=0x01003715,待战=0x01003704,挨打=0x01003702,防御=0x01003706,施法=0x01003710,倒地=0x01003712,跑去=0x01003715,跑回=0,攻击=0x01003708,攻击B=0x01003708}
SuoyouModel["魔化有苏鸩"]     ={站立=0x01003803,行走=0x01003815,待战=0x01003803,挨打=0x01003801,防御=0x01003805,施法=0x01003809,倒地=0x01003812,跑去=0x01003815,跑回=0,攻击=0x01003807,攻击B=0x01003807,小图标=0x01003608,大图标=0x01003800,对话头像=0x01003814}
SuoyouModel["魔化有苏鸩_装饰"]={站立=0x01003804,行走=0x01003816,待战=0x01003804,挨打=0x01003802,防御=0x01003806,施法=0x01003810,倒地=0x01003813,跑去=0x01003816,跑回=0,攻击=0x01003808,攻击B=0x01003808}
SuoyouModel["莫忘"]     ={站立=0x01003901,行走=0x01003907,待战=0x01003901,挨打=0x01003900,防御=0x01003902,施法=0x01003905,倒地=0x01003906,跑去=0x01003907,跑回=0,攻击=0x01003903,攻击B=0x01003903,小图标=0x01003608,大图标=0x01003800,对话头像=0x01003814}
SuoyouModel["胖海狸"]     ={站立=0x01004003,行走=0x01004013,待战=0x01004003,挨打=0x01004002,防御=0x01004004,施法=0x01004009,倒地=0x01004011,跑去=0x01004013,跑回=0,攻击=0x01004005,攻击B=0x01004005,小图标=0x01004000,大图标=0x01004001,对话头像=0x01004012}
SuoyouModel["司辰侍者过去"]     ={站立=0x01007212,行走=0x01007228,待战=0x01007212,挨打=0x01007210,防御=0x01007214,施法=0x01007222,倒地=0x01007225,跑去=0x01007228,跑回=0,攻击=0x01007216,攻击B=0x01007216,小图标=0x01007208,大图标=0x01007209,对话头像=0x01007227}
SuoyouModel["司辰侍者过去_装饰"]={站立=0x01007213,行走=0x01007229,待战=0x01007213,挨打=0x01007211,防御=0x01007215,施法=0x01007223,倒地=0x01007226,跑去=0x01007229,跑回=0,攻击=0x01007217,攻击B=0x01007217}
SuoyouModel["司辰侍者过去_饰品"]={站立=0x01007201,行走=0x01007207,待战=0x01007201,挨打=0x01007200,防御=0x01007202,施法=0x01007205,倒地=0x01007206,跑去=0x01007207,跑回=0,攻击=0x01007203,攻击B=0x01007203}
SuoyouModel["司辰侍者未来"]     ={站立=0x01007312,行走=0x01007328,待战=0x01007312,挨打=0x01007310,防御=0x01007314,施法=0x01007322,倒地=0x01007325,跑去=0x01007328,跑回=0,攻击=0x01007316,攻击B=0x01007316,小图标=0x01007308,大图标=0x01007309,对话头像=0x01007327}
SuoyouModel["司辰侍者未来_装饰"]={站立=0x01007313,行走=0x01007329,待战=0x01007313,挨打=0x01007311,防御=0x01007315,施法=0x01007323,倒地=0x01007326,跑去=0x01007329,跑回=0,攻击=0x01007317,攻击B=0x01007317}
SuoyouModel["司辰侍者未来_饰品"]={站立=0x01007301,行走=0x01007307,待战=0x01007301,挨打=0x01007300,防御=0x01007302,施法=0x01007305,倒地=0x01007306,跑去=0x01007307,跑回=0,攻击=0x01007303,攻击B=0x01007303}
SuoyouModel["五行山神(火)"]     ={站立=0x01007412,行走=0x01007428,待战=0x01007412,挨打=0x01007410,防御=0x01007414,施法=0x01007422,倒地=0x01007425,跑去=0x01007428,跑回=0,攻击=0x01007416,攻击B=0x01007416,小图标=0x01007408,大图标=0x01007409,对话头像=0x01007427}
SuoyouModel["五行山神(火)_装饰"]={站立=0x01007413,行走=0x01007429,待战=0x01007413,挨打=0x01007411,防御=0x01007415,施法=0x01007423,倒地=0x01007426,跑去=0x01007429,跑回=0,攻击=0x01007417,攻击B=0x01007417}
SuoyouModel["五行山神(火)_饰品"]={站立=0x01007401,行走=0x01007407,待战=0x01007401,挨打=0x01007400,防御=0x01007402,施法=0x01007405,倒地=0x01007406,跑去=0x01007407,跑回=0,攻击=0x01007403,攻击B=0x01007403}
SuoyouModel["五行山神(金)"]     ={站立=0x01007512,行走=0x01007528,待战=0x01007512,挨打=0x01007510,防御=0x01007514,施法=0x01007522,倒地=0x01007525,跑去=0x01007528,跑回=0,攻击=0x01007516,攻击B=0x01007516,小图标=0x01007508,大图标=0x01007509,对话头像=0x01007527}
SuoyouModel["五行山神(金)_装饰"]={站立=0x01007513,行走=0x01007529,待战=0x01007513,挨打=0x01007511,防御=0x01007515,施法=0x01007523,倒地=0x01007526,跑去=0x01007529,跑回=0,攻击=0x01007517,攻击B=0x01007517}
SuoyouModel["五行山神(金)_饰品"]={站立=0x01007501,行走=0x01007507,待战=0x01007501,挨打=0x01007500,防御=0x01007502,施法=0x01007505,倒地=0x01007506,跑去=0x01007507,跑回=0,攻击=0x01007503,攻击B=0x01007503}
SuoyouModel["五行山神(木)"]     ={站立=0x01007612,行走=0x01007628,待战=0x01007612,挨打=0x01007610,防御=0x01007614,施法=0x01007622,倒地=0x01007625,跑去=0x01007628,跑回=0,攻击=0x01007616,攻击B=0x01007616,小图标=0x01007608,大图标=0x01007609,对话头像=0x01007627}
SuoyouModel["五行山神(木)_装饰"]={站立=0x01007613,行走=0x01007629,待战=0x01007613,挨打=0x01007611,防御=0x01007615,施法=0x01007623,倒地=0x01007626,跑去=0x01007629,跑回=0,攻击=0x01007617,攻击B=0x01007617}
SuoyouModel["五行山神(木)_饰品"]={站立=0x01007601,行走=0x01007607,待战=0x01007601,挨打=0x01007600,防御=0x01007602,施法=0x01007605,倒地=0x01007606,跑去=0x01007607,跑回=0,攻击=0x01007603,攻击B=0x01007603}
SuoyouModel["五行山神(水)"]     ={站立=0x01007712,行走=0x01007728,待战=0x01007712,挨打=0x01007710,防御=0x01007714,施法=0x01007722,倒地=0x01007725,跑去=0x01007728,跑回=0,攻击=0x01007716,攻击B=0x01007716,小图标=0x01007708,大图标=0x01007709,对话头像=0x01007727}
SuoyouModel["五行山神(水)_装饰"]={站立=0x01007713,行走=0x01007729,待战=0x01007713,挨打=0x01007711,防御=0x01007715,施法=0x01007723,倒地=0x01007726,跑去=0x01007729,跑回=0,攻击=0x01007717,攻击B=0x01007717}
SuoyouModel["五行山神(水)_饰品"]={站立=0x01007701,行走=0x01007707,待战=0x01007701,挨打=0x01007700,防御=0x01007702,施法=0x01007705,倒地=0x01007706,跑去=0x01007707,跑回=0,攻击=0x01007703,攻击B=0x01007703}
SuoyouModel["五行山神(土)"]     ={站立=0x01007812,行走=0x01007828,待战=0x01007812,挨打=0x01007810,防御=0x01007814,施法=0x01007822,倒地=0x01007825,跑去=0x01007828,跑回=0,攻击=0x01007816,攻击B=0x01007816,小图标=0x01007808,大图标=0x01007809,对话头像=0x01007827}
SuoyouModel["五行山神(土)_装饰"]={站立=0x01007813,行走=0x01007829,待战=0x01007813,挨打=0x01007811,防御=0x01007815,施法=0x01007823,倒地=0x01007826,跑去=0x01007829,跑回=0,攻击=0x01007817,攻击B=0x01007817}
SuoyouModel["五行山神(土)_饰品"]={站立=0x01007801,行走=0x01007807,待战=0x01007801,挨打=0x01007800,防御=0x01007802,施法=0x01007805,倒地=0x01007806,跑去=0x01007807,跑回=0,攻击=0x01007803,攻击B=0x01007803}
SuoyouModel["司风"]     ={站立=0x01007912,行走=0x01007928,待战=0x01007912,挨打=0x01007910,防御=0x01007914,施法=0x01007922,倒地=0x01007925,跑去=0x01007928,跑回=0,攻击=0x01007916,攻击B=0x01007916,小图标=0x01007908,大图标=0x01007909,对话头像=0x01007927}
SuoyouModel["司风_装饰"]={站立=0x01007913,行走=0x01007929,待战=0x01007913,挨打=0x01007911,防御=0x01007915,施法=0x01007923,倒地=0x01007926,跑去=0x01007929,跑回=0,攻击=0x01007917,攻击B=0x01007917}
SuoyouModel["司风_饰品"]={站立=0x01007901,行走=0x01007907,待战=0x01007901,挨打=0x01007900,防御=0x01007902,施法=0x01007905,倒地=0x01007906,跑去=0x01007907,跑回=0,攻击=0x01007903,攻击B=0x01007903}
SuoyouModel["司雪"]     ={站立=0x01008012,行走=0x01008028,待战=0x01008012,挨打=0x01008010,防御=0x01008014,施法=0x01008022,倒地=0x01008025,跑去=0x01008028,跑回=0,攻击=0x01008016,攻击B=0x01008016,小图标=0x01008008,大图标=0x01008009,对话头像=0x01008027}
SuoyouModel["司雪_装饰"]={站立=0x01008013,行走=0x01008029,待战=0x01008013,挨打=0x01008011,防御=0x01008015,施法=0x01008023,倒地=0x01008026,跑去=0x01008029,跑回=0,攻击=0x01008017,攻击B=0x01008017}
SuoyouModel["司雪_饰品"]={站立=0x01008001,行走=0x01008007,待战=0x01008001,挨打=0x01008000,防御=0x01008002,施法=0x01008005,倒地=0x01008006,跑去=0x01008007,跑回=0,攻击=0x01008003,攻击B=0x01008003}
SuoyouModel["司雨"]     ={站立=0x01008112,行走=0x01008128,待战=0x01008112,挨打=0x01008110,防御=0x01008114,施法=0x01008122,倒地=0x01008125,跑去=0x01008128,跑回=0,攻击=0x01008116,攻击B=0x01008116,小图标=0x01008108,大图标=0x01008109,对话头像=0x01008127}
SuoyouModel["司雨_装饰"]={站立=0x01008113,行走=0x01008129,待战=0x01008113,挨打=0x01008111,防御=0x01008115,施法=0x01008123,倒地=0x01008126,跑去=0x01008129,跑回=0,攻击=0x01008117,攻击B=0x01008117}
SuoyouModel["司雨_饰品"]={站立=0x01008101,行走=0x01008107,待战=0x01008101,挨打=0x01008100,防御=0x01008102,施法=0x01008105,倒地=0x01008106,跑去=0x01008107,跑回=0,攻击=0x01008103,攻击B=0x01008103}
SuoyouModel["上古雷神"]     ={站立=0xB1000003,行走=0xB1000019,待战=0xB1000003,挨打=0xB1000000,防御=0xB1000006,施法=0xB1000012,倒地=0xB1000015,跑去=0xB1000019,跑回=0,攻击=0xB1000009,攻击B=0xB1000009,小图标=0xB1000018,大图标=0xB1000018,对话头像=0xB1000018}
SuoyouModel["上古雷神_饰品"]={站立=0xB1000004,行走=0xB1000020,待战=0xB1000004,挨打=0xB1000001,防御=0xB1000007,施法=0xB1000013,倒地=0xB1000016,跑去=0xB1000020,跑回=0,攻击=0xB1000010,攻击B=0xB1000010}
SuoyouModel["上古雷神_装饰"]={站立=0xB1000005,行走=0xB1000021,待战=0xB1000005,挨打=0xB1000002,防御=0xB1000008,施法=0xB1000014,倒地=0xB1000017,跑去=0xB1000021,跑回=0,攻击=0xB1000011,攻击B=0xB1000011}
SuoyouModel["谛听"]     ={站立=0x01001202,行走=0x01001216,待战=0x01001202,挨打=0x01001200,防御=0x01001204,施法=0x01001211,倒地=0x01001214,跑去=0x01001216,跑回=0,攻击=0x01001206,攻击B=0x01001206,小图标=0x01008233,大图标=0x01008234,对话头像=0x01008232}
SuoyouModel["谛听_装饰"]={站立=0x01001203,行走=0x01001217,待战=0x01001203,挨打=0x01001201,防御=0x01001205,施法=0x01001212,倒地=0x01001215,跑去=0x01001217,跑回=0,攻击=0x01001207,攻击B=0x01001207}
SuoyouModel["谛听_饰品"]={站立=0x01001C01,行走=0x01001C07,待战=0x01001C01,挨打=0x01001C00,防御=0x01001C02,施法=0x01001C05,倒地=0x01001C06,跑去=0x01001C07,跑回=0,攻击=0x01001C03,攻击B=0x01001C03}
SuoyouModel["毒花龟(日)"]     ={站立=0x01001301,行走=0x01001309,待战=0x01001301,挨打=0x01001300,防御=0x01001302,施法=0x01001306,倒地=0x01001308,跑去=0x01001309,跑回=0,攻击=0x01001303,攻击B=0x01001303,小图标=0x01008236,大图标=0x01008237,对话头像=0x01008235}
SuoyouModel["毒花龟(夜)"]     ={站立=0x01001401,行走=0x01001409,待战=0x01001401,挨打=0x01001400,防御=0x01001402,施法=0x01001406,倒地=0x01001408,跑去=0x01001409,跑回=0,攻击=0x01001403,攻击B=0x01001403,小图标=0x01008239,大图标=0x01008240,对话头像=0x01008238}
SuoyouModel["毒云龟"]     ={站立=0x01001501,行走=0x01001509,待战=0x01001501,挨打=0x01001500,防御=0x01001502,施法=0x01001506,倒地=0x01001508,跑去=0x01001509,跑回=0,攻击=0x01001503,攻击B=0x01001503,小图标=0x01008242,大图标=0x01008243,对话头像=0x01008241}
SuoyouModel["进阶阿宝"]     ={站立=0xAA200004,行走=0xAA200024,待战=0xAA200004,挨打=0xAA200002,防御=0xAA200006,施法=0xAA200018,倒地=0xAA200021,跑去=0xAA200024,跑回=0,攻击=0xAA200008,攻击B=0xAA200008,小图标=0xAA200000,大图标=0xAA200001,对话头像=0xAA200023}
SuoyouModel["进阶阿宝_装饰"]={站立=0xAA200005,行走=0xAA200025,待战=0xAA200005,挨打=0xAA200003,防御=0xAA200007,施法=0xAA200019,倒地=0xAA200022,跑去=0xAA200025,跑回=0,攻击=0xAA200009,攻击B=0xAA200009}
SuoyouModel["进阶阿宝_饰品"]={站立=0xAA200012,行走=0xAA200017,待战=0xAA200012,挨打=0xAA200011,防御=0xAA200013,施法=0xAA200015,倒地=0xAA200016,跑去=0xAA200017,跑回=0,攻击=0xAA200014,攻击B=0xAA200014}
SuoyouModel["进阶谛听"]     ={站立=0xAA200204,行走=0xAA200224,待战=0xAA200204,挨打=0xAA200202,防御=0xAA200206,施法=0xAA200218,倒地=0xAA200221,跑去=0xAA200224,跑回=0,攻击=0xAA200208,攻击B=0xAA200208,小图标=0xAA200200,大图标=0xAA200201,对话头像=0xAA200223}
SuoyouModel["进阶谛听_装饰"]={站立=0xAA200205,行走=0xAA200225,待战=0xAA200205,挨打=0xAA200203,防御=0xAA200207,施法=0xAA200219,倒地=0xAA200222,跑去=0xAA200225,跑回=0,攻击=0xAA200209,攻击B=0xAA200209}
SuoyouModel["进阶谛听_饰品"]={站立=0xAA200212,行走=0xAA200217,待战=0xAA200212,挨打=0xAA200211,防御=0xAA200213,施法=0xAA200215,倒地=0xAA200216,跑去=0xAA200217,跑回=0,攻击=0xAA200214,攻击B=0xAA200214}
SuoyouModel["进阶独角鬼王"]     ={站立=0xAA200304,行走=0xAA200324,待战=0xAA200304,挨打=0xAA200302,防御=0xAA200306,施法=0xAA200318,倒地=0xAA200321,跑去=0xAA200324,跑回=0,攻击=0xAA200308,攻击B=0xAA200308,小图标=0xAA200300,大图标=0xAA200301,对话头像=0xAA200323}
SuoyouModel["进阶独角鬼王_装饰"]={站立=0xAA200305,行走=0xAA200325,待战=0xAA200305,挨打=0xAA200303,防御=0xAA200307,施法=0xAA200319,倒地=0xAA200322,跑去=0xAA200325,跑回=0,攻击=0xAA200309,攻击B=0xAA200309}
SuoyouModel["进阶独角鬼王_饰品"]={站立=0xAA200312,行走=0xAA200317,待战=0xAA200312,挨打=0xAA200311,防御=0xAA200313,施法=0xAA200315,倒地=0xAA200316,跑去=0xAA200317,跑回=0,攻击=0xAA200314,攻击B=0xAA200314}
SuoyouModel["进阶幻姬"]     ={站立=0xAA200804,行走=0xAA200824,待战=0xAA200804,挨打=0xAA200802,防御=0xAA200806,施法=0xAA200818,倒地=0xAA200821,跑去=0xAA200824,跑回=0,攻击=0xAA200808,攻击B=0xAA200808,小图标=0xAA200800,大图标=0xAA200801,对话头像=0xAA200823}
SuoyouModel["进阶幻姬_装饰"]={站立=0xAA200805,行走=0xAA200825,待战=0xAA200805,挨打=0xAA200803,防御=0xAA200807,施法=0xAA200819,倒地=0xAA200822,跑去=0xAA200825,跑回=0,攻击=0xAA200809,攻击B=0xAA200809}
SuoyouModel["进阶幻姬_饰品"]={站立=0xAA200812,行走=0xAA200817,待战=0xAA200812,挨打=0xAA200811,防御=0xAA200813,施法=0xAA200815,倒地=0xAA200816,跑去=0xAA200817,跑回=0,攻击=0xAA200814,攻击B=0xAA200814}
SuoyouModel["觉醒涂山雪"]     ={站立=0xAA200904,行走=0xAA200924,待战=0xAA200904,挨打=0xAA200902,防御=0xAA200906,施法=0xAA200918,倒地=0xAA200921,跑去=0xAA200924,跑回=0,攻击=0xAA200908,攻击B=0xAA200908,小图标=0xAA200900,大图标=0xAA200901,对话头像=0xAA200923}
SuoyouModel["觉醒涂山雪_装饰"]={站立=0xAA200905,行走=0xAA200925,待战=0xAA200905,挨打=0xAA200903,防御=0xAA200907,施法=0xAA200919,倒地=0xAA200922,跑去=0xAA200925,跑回=0,攻击=0xAA200909,攻击B=0xAA200909}
SuoyouModel["觉醒涂山雪_饰品"]={站立=0xAA200912,行走=0xAA200917,待战=0xAA200912,挨打=0xAA200911,防御=0xAA200913,施法=0xAA200915,倒地=0xAA200916,跑去=0xAA200917,跑回=0,攻击=0xAA200914,攻击B=0xAA200914}
SuoyouModel["进阶觉醒涂山雪"]     ={站立=0xAA200904,行走=0xAA200924,待战=0xAA200904,挨打=0xAA200902,防御=0xAA200906,施法=0xAA200918,倒地=0xAA200921,跑去=0xAA200924,跑回=0,攻击=0xAA200908,攻击B=0xAA200908,小图标=0xAA200900,大图标=0xAA200901,对话头像=0xAA200923}
SuoyouModel["进阶觉醒涂山雪_装饰"]={站立=0xAA200905,行走=0xAA200925,待战=0xAA200905,挨打=0xAA200903,防御=0xAA200907,施法=0xAA200919,倒地=0xAA200922,跑去=0xAA200925,跑回=0,攻击=0xAA200909,攻击B=0xAA200909}
SuoyouModel["进阶觉醒涂山雪_饰品"]={站立=0xAA200912,行走=0xAA200917,待战=0xAA200912,挨打=0xAA200911,防御=0xAA200913,施法=0xAA200915,倒地=0xAA200916,跑去=0xAA200917,跑回=0,攻击=0xAA200914,攻击B=0xAA200914}
SuoyouModel["进阶巨石守卫夜"]     ={站立=0xAA201004,行走=0xAA201024,待战=0xAA201004,挨打=0xAA201002,防御=0xAA201006,施法=0xAA201018,倒地=0xAA201021,跑去=0xAA201024,跑回=0,攻击=0xAA201008,攻击B=0xAA201008,小图标=0xAA201000,大图标=0xAA201001,对话头像=0xAA201023}
SuoyouModel["进阶巨石守卫夜_装饰"]={站立=0xAA201005,行走=0xAA201025,待战=0xAA201005,挨打=0xAA201003,防御=0xAA201007,施法=0xAA201019,倒地=0xAA201022,跑去=0xAA201025,跑回=0,攻击=0xAA201009,攻击B=0xAA201009}
SuoyouModel["进阶巨石守卫夜_饰品"]={站立=0xAA201012,行走=0xAA201017,待战=0xAA201012,挨打=0xAA201011,防御=0xAA201013,施法=0xAA201015,倒地=0xAA201016,跑去=0xAA201017,跑回=0,攻击=0xAA201014,攻击B=0xAA201014}
SuoyouModel["进阶巨石守卫昼"]     ={站立=0xAA201104,行走=0xAA201124,待战=0xAA201104,挨打=0xAA201102,防御=0xAA201106,施法=0xAA201118,倒地=0xAA201121,跑去=0xAA201124,跑回=0,攻击=0xAA201108,攻击B=0xAA201108,小图标=0xAA201100,大图标=0xAA201101,对话头像=0xAA201123}
SuoyouModel["进阶巨石守卫昼_装饰"]={站立=0xAA201105,行走=0xAA201125,待战=0xAA201105,挨打=0xAA201103,防御=0xAA201107,施法=0xAA201119,倒地=0xAA201122,跑去=0xAA201125,跑回=0,攻击=0xAA201109,攻击B=0xAA201109}
SuoyouModel["进阶巨石守卫昼_饰品"]={站立=0xAA201112,行走=0xAA201117,待战=0xAA201112,挨打=0xAA201111,防御=0xAA201113,施法=0xAA201115,倒地=0xAA201116,跑去=0xAA201117,跑回=0,攻击=0xAA201114,攻击B=0xAA201114}
SuoyouModel["进阶炼丹童子"]     ={站立=0xAA201204,行走=0xAA201224,待战=0xAA201204,挨打=0xAA201202,防御=0xAA201206,施法=0xAA201218,倒地=0xAA201221,跑去=0xAA201224,跑回=0,攻击=0xAA201208,攻击B=0xAA201208,小图标=0xAA201200,大图标=0xAA201201,对话头像=0xAA201223}
SuoyouModel["进阶炼丹童子_装饰"]={站立=0xAA201205,行走=0xAA201225,待战=0xAA201205,挨打=0xAA201203,防御=0xAA201207,施法=0xAA201219,倒地=0xAA201222,跑去=0xAA201225,跑回=0,攻击=0xAA201209,攻击B=0xAA201209}
SuoyouModel["进阶炼丹童子_饰品"]={站立=0xAA201212,行走=0xAA201217,待战=0xAA201212,挨打=0xAA201211,防御=0xAA201213,施法=0xAA201215,倒地=0xAA201216,跑去=0xAA201217,跑回=0,攻击=0xAA201214,攻击B=0xAA201214}
SuoyouModel["进阶魔化毗舍童子"]     ={站立=0xAA201504,行走=0xAA201524,待战=0xAA201504,挨打=0xAA201502,防御=0xAA201506,施法=0xAA201518,倒地=0xAA201521,跑去=0xAA201524,跑回=0,攻击=0xAA201508,攻击B=0xAA201508,小图标=0xAA201500,大图标=0xAA201501,对话头像=0xAA201523}
SuoyouModel["进阶魔化毗舍童子_装饰"]={站立=0xAA201505,行走=0xAA201525,待战=0xAA201505,挨打=0xAA201503,防御=0xAA201507,施法=0xAA201519,倒地=0xAA201522,跑去=0xAA201525,跑回=0,攻击=0xAA201509,攻击B=0xAA201509}
SuoyouModel["进阶魔化毗舍童子_饰品"]={站立=0xAA201512,行走=0xAA201517,待战=0xAA201512,挨打=0xAA201511,防御=0xAA201513,施法=0xAA201515,倒地=0xAA201516,跑去=0xAA201517,跑回=0,攻击=0xAA201514,攻击B=0xAA201514}
SuoyouModel["进阶虬龙"]     ={站立=0xAA201704,行走=0xAA201724,待战=0xAA201704,挨打=0xAA201702,防御=0xAA201706,施法=0xAA201718,倒地=0xAA201721,跑去=0xAA201724,跑回=0,攻击=0xAA201708,攻击B=0xAA201708,小图标=0xAA201700,大图标=0xAA201701,对话头像=0xAA201723}
SuoyouModel["进阶虬龙_装饰"]={站立=0xAA201705,行走=0xAA201725,待战=0xAA201705,挨打=0xAA201703,防御=0xAA201707,施法=0xAA201719,倒地=0xAA201722,跑去=0xAA201725,跑回=0,攻击=0xAA201709,攻击B=0xAA201709}
SuoyouModel["进阶虬龙_饰品"]={站立=0xAA201712,行走=0xAA201717,待战=0xAA201712,挨打=0xAA201711,防御=0xAA201713,施法=0xAA201715,倒地=0xAA201716,跑去=0xAA201717,跑回=0,攻击=0xAA201714,攻击B=0xAA201714}
SuoyouModel["进阶沙暴"]     ={站立=0xAA201804,行走=0xAA201824,待战=0xAA201804,挨打=0xAA201802,防御=0xAA201806,施法=0xAA201818,倒地=0xAA201821,跑去=0xAA201824,跑回=0,攻击=0xAA201808,攻击B=0xAA201808,小图标=0xAA201800,大图标=0xAA201801,对话头像=0xAA201823}
SuoyouModel["进阶沙暴_装饰"]={站立=0xAA201805,行走=0xAA201825,待战=0xAA201805,挨打=0xAA201803,防御=0xAA201807,施法=0xAA201819,倒地=0xAA201822,跑去=0xAA201825,跑回=0,攻击=0xAA201809,攻击B=0xAA201809}
SuoyouModel["进阶沙暴_饰品"]={站立=0xAA201812,行走=0xAA201817,待战=0xAA201812,挨打=0xAA201811,防御=0xAA201813,施法=0xAA201815,倒地=0xAA201816,跑去=0xAA201817,跑回=0,攻击=0xAA201814,攻击B=0xAA201814}
SuoyouModel["进阶司辰侍者未来"]     ={站立=0xAA202004,行走=0xAA202024,待战=0xAA202004,挨打=0xAA202002,防御=0xAA202006,施法=0xAA202018,倒地=0xAA202021,跑去=0xAA202024,跑回=0,攻击=0xAA202008,攻击B=0xAA202008,小图标=0xAA202000,大图标=0xAA202001,对话头像=0xAA202023}
SuoyouModel["进阶司辰侍者未来_装饰"]={站立=0xAA202005,行走=0xAA202025,待战=0xAA202005,挨打=0xAA202003,防御=0xAA202007,施法=0xAA202019,倒地=0xAA202022,跑去=0xAA202025,跑回=0,攻击=0xAA202009,攻击B=0xAA202009}
SuoyouModel["进阶司辰侍者未来_饰品"]={站立=0xAA202012,行走=0xAA202017,待战=0xAA202012,挨打=0xAA202011,防御=0xAA202013,施法=0xAA202015,倒地=0xAA202016,跑去=0xAA202017,跑回=0,攻击=0xAA202014,攻击B=0xAA202014}
SuoyouModel["进阶司辰侍者过去"]     ={站立=0xAA201904,行走=0xAA201924,待战=0xAA201904,挨打=0xAA201902,防御=0xAA201906,施法=0xAA201918,倒地=0xAA201921,跑去=0xAA201924,跑回=0,攻击=0xAA201908,攻击B=0xAA201908,小图标=0xAA201900,大图标=0xAA201901,对话头像=0xAA201923}
SuoyouModel["进阶司辰侍者过去_装饰"]={站立=0xAA201905,行走=0xAA201925,待战=0xAA201905,挨打=0xAA201903,防御=0xAA201907,施法=0xAA201919,倒地=0xAA201922,跑去=0xAA201925,跑回=0,攻击=0xAA201909,攻击B=0xAA201909}
SuoyouModel["进阶司辰侍者过去_饰品"]={站立=0xAA201912,行走=0xAA201917,待战=0xAA201912,挨打=0xAA201911,防御=0xAA201913,施法=0xAA201915,倒地=0xAA201916,跑去=0xAA201917,跑回=0,攻击=0xAA201914,攻击B=0xAA201914}
SuoyouModel["进阶司风"]     ={站立=0xAA202104,行走=0xAA202124,待战=0xAA202104,挨打=0xAA202102,防御=0xAA202106,施法=0xAA202118,倒地=0xAA202121,跑去=0xAA202124,跑回=0,攻击=0xAA202108,攻击B=0xAA202108,小图标=0xAA202100,大图标=0xAA202101,对话头像=0xAA202123}
SuoyouModel["进阶司风_装饰"]={站立=0xAA202105,行走=0xAA202125,待战=0xAA202105,挨打=0xAA202103,防御=0xAA202107,施法=0xAA202119,倒地=0xAA202122,跑去=0xAA202125,跑回=0,攻击=0xAA202109,攻击B=0xAA202109}
SuoyouModel["进阶司风_饰品"]={站立=0xAA202112,行走=0xAA202117,待战=0xAA202112,挨打=0xAA202111,防御=0xAA202113,施法=0xAA202115,倒地=0xAA202116,跑去=0xAA202117,跑回=0,攻击=0xAA202114,攻击B=0xAA202114}
SuoyouModel["进阶司雨"]     ={站立=0xAA202304,行走=0xAA202324,待战=0xAA202304,挨打=0xAA202302,防御=0xAA202306,施法=0xAA202318,倒地=0xAA202321,跑去=0xAA202324,跑回=0,攻击=0xAA202308,攻击B=0xAA202308,小图标=0xAA202300,大图标=0xAA202301,对话头像=0xAA202323}
SuoyouModel["进阶司雨_装饰"]={站立=0xAA202305,行走=0xAA202325,待战=0xAA202305,挨打=0xAA202303,防御=0xAA202307,施法=0xAA202319,倒地=0xAA202322,跑去=0xAA202325,跑回=0,攻击=0xAA202309,攻击B=0xAA202309}
SuoyouModel["进阶司雨_饰品"]={站立=0xAA202312,行走=0xAA202317,待战=0xAA202312,挨打=0xAA202311,防御=0xAA202313,施法=0xAA202315,倒地=0xAA202316,跑去=0xAA202317,跑回=0,攻击=0xAA202314,攻击B=0xAA202314}
SuoyouModel["进阶五行山神(火)"]     ={站立=0xAA202404,行走=0xAA202424,待战=0xAA202404,挨打=0xAA202402,防御=0xAA202406,施法=0xAA202418,倒地=0xAA202421,跑去=0xAA202424,跑回=0,攻击=0xAA202408,攻击B=0xAA202408,小图标=0xAA202400,大图标=0xAA202401,对话头像=0xAA202423}
SuoyouModel["进阶五行山神(火)_装饰"]={站立=0xAA202405,行走=0xAA202425,待战=0xAA202405,挨打=0xAA202403,防御=0xAA202407,施法=0xAA202419,倒地=0xAA202422,跑去=0xAA202425,跑回=0,攻击=0xAA202409,攻击B=0xAA202409}
SuoyouModel["进阶五行山神(火)_饰品"]={站立=0xAA202412,行走=0xAA202417,待战=0xAA202412,挨打=0xAA202411,防御=0xAA202413,施法=0xAA202415,倒地=0xAA202416,跑去=0xAA202417,跑回=0,攻击=0xAA202414,攻击B=0xAA202414}
SuoyouModel["进阶五行山神(金)"]     ={站立=0xAA202504,行走=0xAA202524,待战=0xAA202504,挨打=0xAA202502,防御=0xAA202506,施法=0xAA202518,倒地=0xAA202521,跑去=0xAA202524,跑回=0,攻击=0xAA202508,攻击B=0xAA202508,小图标=0xAA202500,大图标=0xAA202501,对话头像=0xAA202523}
SuoyouModel["进阶五行山神(金)_装饰"]={站立=0xAA202505,行走=0xAA202525,待战=0xAA202505,挨打=0xAA202503,防御=0xAA202507,施法=0xAA202519,倒地=0xAA202522,跑去=0xAA202525,跑回=0,攻击=0xAA202509,攻击B=0xAA202509}
SuoyouModel["进阶五行山神(金)_饰品"]={站立=0xAA202512,行走=0xAA202517,待战=0xAA202512,挨打=0xAA202511,防御=0xAA202513,施法=0xAA202515,倒地=0xAA202516,跑去=0xAA202517,跑回=0,攻击=0xAA202514,攻击B=0xAA202514}
SuoyouModel["进阶五行山神(木)"]     ={站立=0xAA202604,行走=0xAA202624,待战=0xAA202604,挨打=0xAA202602,防御=0xAA202606,施法=0xAA202618,倒地=0xAA202621,跑去=0xAA202624,跑回=0,攻击=0xAA202608,攻击B=0xAA202608,小图标=0xAA202600,大图标=0xAA202601,对话头像=0xAA202623}
SuoyouModel["进阶五行山神(木)_装饰"]={站立=0xAA202605,行走=0xAA202625,待战=0xAA202605,挨打=0xAA202603,防御=0xAA202607,施法=0xAA202619,倒地=0xAA202622,跑去=0xAA202625,跑回=0,攻击=0xAA202609,攻击B=0xAA202609}
SuoyouModel["进阶五行山神(木)_饰品"]={站立=0xAA202612,行走=0xAA202617,待战=0xAA202612,挨打=0xAA202611,防御=0xAA202613,施法=0xAA202615,倒地=0xAA202616,跑去=0xAA202617,跑回=0,攻击=0xAA202614,攻击B=0xAA202614}
SuoyouModel["进阶五行山神(水)"]     ={站立=0xAA202704,行走=0xAA202724,待战=0xAA202704,挨打=0xAA202702,防御=0xAA202706,施法=0xAA202718,倒地=0xAA202721,跑去=0xAA202724,跑回=0,攻击=0xAA202708,攻击B=0xAA202708,小图标=0xAA202700,大图标=0xAA202701,对话头像=0xAA202723}
SuoyouModel["进阶五行山神(水)_装饰"]={站立=0xAA202705,行走=0xAA202725,待战=0xAA202705,挨打=0xAA202703,防御=0xAA202707,施法=0xAA202719,倒地=0xAA202722,跑去=0xAA202725,跑回=0,攻击=0xAA202709,攻击B=0xAA202709}
SuoyouModel["进阶五行山神(水)_饰品"]={站立=0xAA202712,行走=0xAA202717,待战=0xAA202712,挨打=0xAA202711,防御=0xAA202713,施法=0xAA202715,倒地=0xAA202716,跑去=0xAA202717,跑回=0,攻击=0xAA202714,攻击B=0xAA202714}
SuoyouModel["进阶五行山神(土)"]     ={站立=0xAA202804,行走=0xAA202824,待战=0xAA202804,挨打=0xAA202802,防御=0xAA202806,施法=0xAA202818,倒地=0xAA202821,跑去=0xAA202824,跑回=0,攻击=0xAA202808,攻击B=0xAA202808,小图标=0xAA202800,大图标=0xAA202801,对话头像=0xAA202823}
SuoyouModel["进阶五行山神(土)_装饰"]={站立=0xAA202805,行走=0xAA202825,待战=0xAA202805,挨打=0xAA202803,防御=0xAA202807,施法=0xAA202819,倒地=0xAA202822,跑去=0xAA202825,跑回=0,攻击=0xAA202809,攻击B=0xAA202809}
SuoyouModel["进阶五行山神(土)_饰品"]={站立=0xAA202812,行走=0xAA202817,待战=0xAA202812,挨打=0xAA202811,防御=0xAA202813,施法=0xAA202815,倒地=0xAA202816,跑去=0xAA202817,跑回=0,攻击=0xAA202814,攻击B=0xAA202814}
SuoyouModel["进阶有苏鸩"]     ={站立=0xAA202904,行走=0xAA202924,待战=0xAA202904,挨打=0xAA202902,防御=0xAA202906,施法=0xAA202918,倒地=0xAA202921,跑去=0xAA202924,跑回=0,攻击=0xAA202908,攻击B=0xAA202908,小图标=0xAA202900,大图标=0xAA202901,对话头像=0xAA202923}
SuoyouModel["进阶有苏鸩_装饰"]={站立=0xAA202905,行走=0xAA202925,待战=0xAA202905,挨打=0xAA202903,防御=0xAA202907,施法=0xAA202919,倒地=0xAA202922,跑去=0xAA202925,跑回=0,攻击=0xAA202909,攻击B=0xAA202909}
SuoyouModel["进阶有苏鸩_饰品"]={站立=0xAA202912,行走=0xAA202917,待战=0xAA202912,挨打=0xAA202911,防御=0xAA202913,施法=0xAA202915,倒地=0xAA202916,跑去=0xAA202917,跑回=0,攻击=0xAA202914,攻击B=0xAA202914}
SuoyouModel["葫芦宝贝"]     ={站立=0xAAA10004,行走=0xAAA10022,待战=0xAAA10004,挨打=0xAAA10002,防御=0xAAA10006,施法=0xAAA10017,倒地=0xAAA10019,跑去=0xAAA10022,跑回=0,攻击=0xAAA10008,攻击B=0xAAA10008,小图标=0xAAA10000,大图标=0xAAA10001,对话头像=0xAAA10021}
SuoyouModel["葫芦宝贝_装饰"]={站立=0xAAA10005,行走=0xAAA10023,待战=0xAAA10005,挨打=0xAAA10003,防御=0xAAA10007,施法=0xAAA10018,倒地=0xAAA10020,跑去=0xAAA10023,跑回=0,攻击=0xAAA10009,攻击B=0xAAA10009}
SuoyouModel["葫芦宝贝_饰品"]={站立=0xAAA10011,行走=0xAAA10016,待战=0xAAA10012,挨打=0xAAA10010,防御=0xAAA10012,施法=0xAAA10014,倒地=0xAAA10015,跑去=0xAAA10016,跑回=0,攻击=0xAAA10013,攻击B=0xAAA10013}
SuoyouModel["进阶涂山雪"]     ={站立=0xAAA10104,行走=0xAAA10124,待战=0xAAA10104,挨打=0xAAA10102,防御=0xAAA10106,施法=0xAAA10118,倒地=0xAAA10119,跑去=0xAAA10124,跑回=0,攻击=0xAAA10108,攻击B=0xAAA10108,小图标=0xAAA10100,大图标=0xAAA10101,对话头像=0xAAA10123}
SuoyouModel["进阶涂山雪_装饰"]={站立=0xAAA10105,行走=0xAAA10125,待战=0xAAA10105,挨打=0xAAA10103,防御=0xAAA10107,施法=0xAAA10119,倒地=0xAAA10120,跑去=0xAAA10125,跑回=0,攻击=0xAAA10109,攻击B=0xAAA10109}
SuoyouModel["进阶涂山雪_饰品"]={站立=0xAAA10112,行走=0xAAA10117,待战=0xAAA10112,挨打=0xAAA10111,防御=0xAAA10113,施法=0xAAA10115,倒地=0xAAA10116,跑去=0xAAA10117,跑回=0,攻击=0xAAA10114,攻击B=0xAAA10114}
SuoyouModel["涂山雪"]     ={站立=0xAAA10204,行走=0xAAA10224,待战=0xAAA10204,挨打=0xAAA10202,防御=0xAAA10206,施法=0xAAA10218,倒地=0xAAA10219,跑去=0xAAA10224,跑回=0,攻击=0xAAA10208,攻击B=0xAAA10208,小图标=0xAAA10200,大图标=0xAAA10201,对话头像=0xAAA10223}
SuoyouModel["涂山雪_装饰"]={站立=0xAAA10205,行走=0xAAA10225,待战=0xAAA10205,挨打=0xAAA10203,防御=0xAAA10207,施法=0xAAA10219,倒地=0xAAA10220,跑去=0xAAA10225,跑回=0,攻击=0xAAA10209,攻击B=0xAAA10209}
SuoyouModel["涂山雪_饰品"]={站立=0xAAA10212,行走=0xAAA10217,待战=0xAAA10212,挨打=0xAAA10211,防御=0xAAA10213,施法=0xAAA10215,倒地=0xAAA10216,跑去=0xAAA10217,跑回=0,攻击=0xAAA10214,攻击B=0xAAA10214}
SuoyouModel["长乐灵仙"]     ={站立=0xAAA10304,行走=0xAAA10324,待战=0xAAA10304,挨打=0xAAA10302,防御=0xAAA10306,施法=0xAAA10318,倒地=0xAAA10321,跑去=0xAAA10324,跑回=0,攻击=0xAAA10308,攻击B=0xAAA10308,小图标=0xAAA10300,大图标=0xAAA10301,对话头像=0xAAA10323}
SuoyouModel["长乐灵仙_装饰"]={站立=0xAAA10305,行走=0xAAA10325,待战=0xAAA10305,挨打=0xAAA10303,防御=0xAAA10307,施法=0xAAA10319,倒地=0xAAA10322,跑去=0xAAA10325,跑回=0,攻击=0xAAA10309,攻击B=0xAAA10309}
SuoyouModel["长乐灵仙_饰品"]={站立=0xAAA10312,行走=0xAAA10317,待战=0xAAA10312,挨打=0xAAA10311,防御=0xAAA10313,施法=0xAAA10315,倒地=0xAAA10316,跑去=0xAAA10317,跑回=0,攻击=0xAAA10314,攻击B=0xAAA10314}
SuoyouModel["真陀护法"]     ={站立=0xAAA10404,行走=0xAAA10424,待战=0xAAA10404,挨打=0xAAA10402,防御=0xAAA10406,施法=0xAAA10418,倒地=0xAAA10419,跑去=0xAAA10424,跑回=0,攻击=0xAAA10408,攻击B=0xAAA10408,小图标=0xAAA10400,大图标=0xAAA10401,对话头像=0xAAA10423}
SuoyouModel["真陀护法_装饰"]={站立=0xAAA10405,行走=0xAAA10425,待战=0xAAA10405,挨打=0xAAA10403,防御=0xAAA10407,施法=0xAAA10419,倒地=0xAAA10420,跑去=0xAAA10425,跑回=0,攻击=0xAAA10409,攻击B=0xAAA10409}
SuoyouModel["真陀护法_饰品"]={站立=0xAAA10412,行走=0xAAA10417,待战=0xAAA10412,挨打=0xAAA10411,防御=0xAAA10413,施法=0xAAA10415,倒地=0xAAA10416,跑去=0xAAA10417,跑回=0,攻击=0xAAA10414,攻击B=0xAAA10414}
SuoyouModel["执音"]     ={站立=0xAAA10504,行走=0xAAA10524,待战=0xAAA10504,挨打=0xAAA10502,防御=0xAAA10506,施法=0xAAA10518,倒地=0xAAA10519,跑去=0xAAA10524,跑回=0,攻击=0xAAA10508,攻击B=0xAAA10508,小图标=0xAAA10500,大图标=0xAAA10501,对话头像=0xAAA10523}
SuoyouModel["执音_装饰"]={站立=0xAAA10505,行走=0xAAA10525,待战=0xAAA10505,挨打=0xAAA10503,防御=0xAAA10507,施法=0xAAA10519,倒地=0xAAA10520,跑去=0xAAA10525,跑回=0,攻击=0xAAA10509,攻击B=0xAAA10509}
SuoyouModel["执音_饰品"]={站立=0xAAA10512,行走=0xAAA10517,待战=0xAAA10512,挨打=0xAAA10511,防御=0xAAA10513,施法=0xAAA10515,倒地=0xAAA10516,跑去=0xAAA10517,跑回=0,攻击=0xAAA10514,攻击B=0xAAA10514}
SuoyouModel["进阶般若天女"]     ={站立=0xAA203004,行走=0xAA203024,待战=0xAA203004,挨打=0xAA203002,防御=0xAA203006,施法=0xAA203018,倒地=0xAA203021,跑去=0xAA203024,跑回=0,攻击=0xAA203008,攻击B=0xAA203008,小图标=0xAA203000,大图标=0xAA203001,对话头像=0xAA203023}
SuoyouModel["进阶般若天女_装饰"]={站立=0xAA203005,行走=0xAA203025,待战=0xAA203005,挨打=0xAA203003,防御=0xAA203007,施法=0xAA203019,倒地=0xAA203022,跑去=0xAA203025,跑回=0,攻击=0xAA203009,攻击B=0xAA203009}
SuoyouModel["进阶般若天女_饰品"]={站立=0xAA203012,行走=0xAA203017,待战=0xAA203012,挨打=0xAA203011,防御=0xAA203013,施法=0xAA203015,倒地=0xAA203016,跑去=0xAA203017,跑回=0,攻击=0xAA203014,攻击B=0xAA203014}
SuoyouModel["进阶地狱战神"]     ={站立=0xAA203104,行走=0xAA203124,待战=0xAA203104,挨打=0xAA203102,防御=0xAA203106,施法=0xAA203118,倒地=0xAA203121,跑去=0xAA203124,跑回=0,攻击=0xAA203108,攻击B=0xAA203108,小图标=0xAA203100,大图标=0xAA203101,对话头像=0xAA203123}
SuoyouModel["进阶地狱战神_装饰"]={站立=0xAA203105,行走=0xAA203125,待战=0xAA203105,挨打=0xAA203103,防御=0xAA203107,施法=0xAA203119,倒地=0xAA203122,跑去=0xAA203125,跑回=0,攻击=0xAA203109,攻击B=0xAA203109}
SuoyouModel["进阶地狱战神_饰品"]={站立=0xAA203112,行走=0xAA203117,待战=0xAA203112,挨打=0xAA203111,防御=0xAA203113,施法=0xAA203115,倒地=0xAA203116,跑去=0xAA203117,跑回=0,攻击=0xAA203114,攻击B=0xAA203114}
SuoyouModel["进阶多闻巡守"]     ={站立=0xAA203204,行走=0xAA203224,待战=0xAA203204,挨打=0xAA203202,防御=0xAA203206,施法=0xAA203218,倒地=0xAA203221,跑去=0xAA203224,跑回=0,攻击=0xAA203208,攻击B=0xAA203208,小图标=0xAA203200,大图标=0xAA203201,对话头像=0xAA203223}
SuoyouModel["进阶多闻巡守_装饰"]={站立=0xAA203205,行走=0xAA203225,待战=0xAA203205,挨打=0xAA203203,防御=0xAA203207,施法=0xAA203219,倒地=0xAA203222,跑去=0xAA203225,跑回=0,攻击=0xAA203209,攻击B=0xAA203209}
SuoyouModel["进阶多闻巡守_饰品"]={站立=0xAA203212,行走=0xAA203217,待战=0xAA203212,挨打=0xAA203211,防御=0xAA203213,施法=0xAA203215,倒地=0xAA203216,跑去=0xAA203217,跑回=0,攻击=0xAA203214,攻击B=0xAA203214}
SuoyouModel["进阶广目巡守"]     ={站立=0xAA203304,行走=0xAA203324,待战=0xAA203304,挨打=0xAA203302,防御=0xAA203306,施法=0xAA203318,倒地=0xAA203321,跑去=0xAA203324,跑回=0,攻击=0xAA203308,攻击B=0xAA203308,小图标=0xAA203300,大图标=0xAA203301,对话头像=0xAA203323}
SuoyouModel["进阶广目巡守_装饰"]={站立=0xAA203305,行走=0xAA203325,待战=0xAA203305,挨打=0xAA203303,防御=0xAA203307,施法=0xAA203319,倒地=0xAA203322,跑去=0xAA203325,跑回=0,攻击=0xAA203309,攻击B=0xAA203309}
SuoyouModel["进阶广目巡守_饰品"]={站立=0xAA203312,行走=0xAA203317,待战=0xAA203312,挨打=0xAA203311,防御=0xAA203313,施法=0xAA203315,倒地=0xAA203316,跑去=0xAA203317,跑回=0,攻击=0xAA203314,攻击B=0xAA203314}
SuoyouModel["进阶狐不归"]     ={站立=0xAA203404,行走=0xAA203424,待战=0xAA203404,挨打=0xAA203402,防御=0xAA203406,施法=0xAA203418,倒地=0xAA203421,跑去=0xAA203424,跑回=0,攻击=0xAA203408,攻击B=0xAA203408,小图标=0xAA203400,大图标=0xAA203401,对话头像=0xAA203423}
SuoyouModel["进阶狐不归_装饰"]={站立=0xAA203405,行走=0xAA203425,待战=0xAA203405,挨打=0xAA203403,防御=0xAA203407,施法=0xAA203419,倒地=0xAA203422,跑去=0xAA203425,跑回=0,攻击=0xAA203409,攻击B=0xAA203409}
SuoyouModel["进阶狐不归_饰品"]={站立=0xAA203412,行走=0xAA203417,待战=0xAA203412,挨打=0xAA203411,防御=0xAA203413,施法=0xAA203415,倒地=0xAA203416,跑去=0xAA203417,跑回=0,攻击=0xAA203414,攻击B=0xAA203414}
SuoyouModel["进阶蝴蝶仙子"]     ={站立=0xAA203504,行走=0xAA203524,待战=0xAA203504,挨打=0xAA203502,防御=0xAA203506,施法=0xAA203518,倒地=0xAA203521,跑去=0xAA203524,跑回=0,攻击=0xAA203508,攻击B=0xAA203508,小图标=0xAA203500,大图标=0xAA203501,对话头像=0xAA203523}
SuoyouModel["进阶蝴蝶仙子_装饰"]={站立=0xAA203505,行走=0xAA203525,待战=0xAA203505,挨打=0xAA203503,防御=0xAA203507,施法=0xAA203519,倒地=0xAA203522,跑去=0xAA203525,跑回=0,攻击=0xAA203509,攻击B=0xAA203509}
SuoyouModel["进阶蝴蝶仙子_饰品"]={站立=0xAA203512,行走=0xAA203517,待战=0xAA203512,挨打=0xAA203511,防御=0xAA203513,施法=0xAA203515,倒地=0xAA203516,跑去=0xAA203517,跑回=0,攻击=0xAA203514,攻击B=0xAA203514}
SuoyouModel["进阶花铃"]     ={站立=0xAA203604,行走=0xAA203624,待战=0xAA203604,挨打=0xAA203602,防御=0xAA203606,施法=0xAA203618,倒地=0xAA203621,跑去=0xAA203624,跑回=0,攻击=0xAA203608,攻击B=0xAA203608,小图标=0xAA203600,大图标=0xAA203601,对话头像=0xAA203623}
SuoyouModel["进阶花铃_装饰"]={站立=0xAA203605,行走=0xAA203625,待战=0xAA203605,挨打=0xAA203603,防御=0xAA203607,施法=0xAA203619,倒地=0xAA203622,跑去=0xAA203625,跑回=0,攻击=0xAA203609,攻击B=0xAA203609}
SuoyouModel["进阶花铃_饰品"]={站立=0xAA203612,行走=0xAA203617,待战=0xAA203612,挨打=0xAA203611,防御=0xAA203613,施法=0xAA203615,倒地=0xAA203616,跑去=0xAA203617,跑回=0,攻击=0xAA203614,攻击B=0xAA203614}
SuoyouModel["进阶机关鸟"]     ={站立=0xAA203704,行走=0xAA203724,待战=0xAA203704,挨打=0xAA203702,防御=0xAA203706,施法=0xAA203718,倒地=0xAA203721,跑去=0xAA203724,跑回=0,攻击=0xAA203708,攻击B=0xAA203708,小图标=0xAA203700,大图标=0xAA203701,对话头像=0xAA203723}
SuoyouModel["进阶机关鸟_装饰"]={站立=0xAA203705,行走=0xAA203725,待战=0xAA203705,挨打=0xAA203703,防御=0xAA203707,施法=0xAA203719,倒地=0xAA203722,跑去=0xAA203725,跑回=0,攻击=0xAA203709,攻击B=0xAA203709}
SuoyouModel["进阶机关鸟_饰品"]={站立=0xAA203712,行走=0xAA203717,待战=0xAA203712,挨打=0xAA203711,防御=0xAA203713,施法=0xAA203715,倒地=0xAA203716,跑去=0xAA203717,跑回=0,攻击=0xAA203714,攻击B=0xAA203714}
SuoyouModel["进阶机关人人形"]     ={站立=0xAA203804,行走=0xAA203824,待战=0xAA203804,挨打=0xAA203802,防御=0xAA203806,施法=0xAA203818,倒地=0xAA203821,跑去=0xAA203824,跑回=0,攻击=0xAA203808,攻击B=0xAA203808,小图标=0xAA203800,大图标=0xAA203801,对话头像=0xAA203823}
SuoyouModel["进阶机关人人形_装饰"]={站立=0xAA203805,行走=0xAA203825,待战=0xAA203805,挨打=0xAA203803,防御=0xAA203807,施法=0xAA203819,倒地=0xAA203822,跑去=0xAA203825,跑回=0,攻击=0xAA203809,攻击B=0xAA203809}
SuoyouModel["进阶机关人人形_饰品"]={站立=0xAA203812,行走=0xAA203817,待战=0xAA203812,挨打=0xAA203811,防御=0xAA203813,施法=0xAA203815,倒地=0xAA203816,跑去=0xAA203817,跑回=0,攻击=0xAA203814,攻击B=0xAA203814}
SuoyouModel["进阶机关兽"]     ={站立=0xAA203904,行走=0xAA203924,待战=0xAA203904,挨打=0xAA203902,防御=0xAA203906,施法=0xAA203918,倒地=0xAA203921,跑去=0xAA203924,跑回=0,攻击=0xAA203908,攻击B=0xAA203908,小图标=0xAA203900,大图标=0xAA203901,对话头像=0xAA203923}
SuoyouModel["进阶机关兽_装饰"]={站立=0xAA203905,行走=0xAA203925,待战=0xAA203905,挨打=0xAA203903,防御=0xAA203907,施法=0xAA203919,倒地=0xAA203922,跑去=0xAA203925,跑回=0,攻击=0xAA203909,攻击B=0xAA203909}
SuoyouModel["进阶机关兽_饰品"]={站立=0xAA203912,行走=0xAA203917,待战=0xAA203912,挨打=0xAA203911,防御=0xAA203913,施法=0xAA203915,倒地=0xAA203916,跑去=0xAA203917,跑回=0,攻击=0xAA203914,攻击B=0xAA203914}
SuoyouModel["进阶蛟龙"]     ={站立=0xAA204004,行走=0xAA204024,待战=0xAA204004,挨打=0xAA204002,防御=0xAA204006,施法=0xAA204018,倒地=0xAA204021,跑去=0xAA204024,跑回=0,攻击=0xAA204008,攻击B=0xAA204008,小图标=0xAA204000,大图标=0xAA204001,对话头像=0xAA204023}
SuoyouModel["进阶蛟龙_装饰"]={站立=0xAA204005,行走=0xAA204025,待战=0xAA204005,挨打=0xAA204003,防御=0xAA204007,施法=0xAA204019,倒地=0xAA204022,跑去=0xAA204025,跑回=0,攻击=0xAA204009,攻击B=0xAA204009}
SuoyouModel["进阶蛟龙_饰品"]={站立=0xAA204012,行走=0xAA204017,待战=0xAA204012,挨打=0xAA204011,防御=0xAA204013,施法=0xAA204015,倒地=0xAA204016,跑去=0xAA204017,跑回=0,攻击=0xAA204014,攻击B=0xAA204014}
SuoyouModel["进阶金翼"]     ={站立=0xAA204104,行走=0xAA204124,待战=0xAA204104,挨打=0xAA204102,防御=0xAA204106,施法=0xAA204118,倒地=0xAA204121,跑去=0xAA204124,跑回=0,攻击=0xAA204108,攻击B=0xAA204108,小图标=0xAA204100,大图标=0xAA204101,对话头像=0xAA204123}
SuoyouModel["进阶金翼_装饰"]={站立=0xAA204105,行走=0xAA204125,待战=0xAA204105,挨打=0xAA204103,防御=0xAA204107,施法=0xAA204119,倒地=0xAA204122,跑去=0xAA204125,跑回=0,攻击=0xAA204109,攻击B=0xAA204109}
SuoyouModel["进阶金翼_饰品"]={站立=0xAA204112,行走=0xAA204117,待战=0xAA204112,挨打=0xAA204111,防御=0xAA204113,施法=0xAA204115,倒地=0xAA204116,跑去=0xAA204117,跑回=0,攻击=0xAA204114,攻击B=0xAA204114}
SuoyouModel["进阶巨力神猿"]     ={站立=0xAA204204,行走=0xAA204224,待战=0xAA204204,挨打=0xAA204202,防御=0xAA204206,施法=0xAA204218,倒地=0xAA204221,跑去=0xAA204224,跑回=0,攻击=0xAA204208,攻击B=0xAA204208,小图标=0xAA204200,大图标=0xAA204201,对话头像=0xAA204223}
SuoyouModel["进阶巨力神猿_装饰"]={站立=0xAA204205,行走=0xAA204225,待战=0xAA204205,挨打=0xAA204203,防御=0xAA204207,施法=0xAA204219,倒地=0xAA204222,跑去=0xAA204225,跑回=0,攻击=0xAA204209,攻击B=0xAA204209}
SuoyouModel["进阶巨力神猿_饰品"]={站立=0xAA204212,行走=0xAA204217,待战=0xAA204212,挨打=0xAA204211,防御=0xAA204213,施法=0xAA204215,倒地=0xAA204216,跑去=0xAA204217,跑回=0,攻击=0xAA204214,攻击B=0xAA204214}
SuoyouModel["进阶雷龙"]     ={站立=0xAA204304,行走=0xAA204324,待战=0xAA204304,挨打=0xAA204302,防御=0xAA204306,施法=0xAA204318,倒地=0xAA204321,跑去=0xAA204324,跑回=0,攻击=0xAA204308,攻击B=0xAA204308,小图标=0xAA204300,大图标=0xAA204301,对话头像=0xAA204323}
SuoyouModel["进阶雷龙_装饰"]={站立=0xAA204305,行走=0xAA204325,待战=0xAA204305,挨打=0xAA204303,防御=0xAA204307,施法=0xAA204319,倒地=0xAA204322,跑去=0xAA204325,跑回=0,攻击=0xAA204309,攻击B=0xAA204309}
SuoyouModel["进阶雷龙_饰品"]={站立=0xAA204312,行走=0xAA204317,待战=0xAA204312,挨打=0xAA204311,防御=0xAA204313,施法=0xAA204315,倒地=0xAA204316,跑去=0xAA204317,跑回=0,攻击=0xAA204314,攻击B=0xAA204314}
SuoyouModel["进阶雷鸟人"]     ={站立=0xAA204404,行走=0xAA204424,待战=0xAA204404,挨打=0xAA204402,防御=0xAA204406,施法=0xAA204418,倒地=0xAA204421,跑去=0xAA204424,跑回=0,攻击=0xAA204408,攻击B=0xAA204408,小图标=0xAA204400,大图标=0xAA204401,对话头像=0xAA204423}
SuoyouModel["进阶雷鸟人_装饰"]={站立=0xAA204405,行走=0xAA204425,待战=0xAA204405,挨打=0xAA204403,防御=0xAA204407,施法=0xAA204419,倒地=0xAA204422,跑去=0xAA204425,跑回=0,攻击=0xAA204409,攻击B=0xAA204409}
SuoyouModel["进阶雷鸟人_饰品"]={站立=0xAA204412,行走=0xAA204417,待战=0xAA204412,挨打=0xAA204411,防御=0xAA204413,施法=0xAA204415,倒地=0xAA204416,跑去=0xAA204417,跑回=0,攻击=0xAA204414,攻击B=0xAA204414}
SuoyouModel["进阶连弩车"]     ={站立=0xAA204504,行走=0xAA204524,待战=0xAA204504,挨打=0xAA204502,防御=0xAA204506,施法=0xAA204518,倒地=0xAA204521,跑去=0xAA204524,跑回=0,攻击=0xAA204508,攻击B=0xAA204508,小图标=0xAA204500,大图标=0xAA204501,对话头像=0xAA204523}
SuoyouModel["进阶连弩车_装饰"]={站立=0xAA204505,行走=0xAA204525,待战=0xAA204505,挨打=0xAA204503,防御=0xAA204507,施法=0xAA204519,倒地=0xAA204522,跑去=0xAA204525,跑回=0,攻击=0xAA204509,攻击B=0xAA204509}
SuoyouModel["进阶连弩车_饰品"]={站立=0xAA204512,行走=0xAA204517,待战=0xAA204512,挨打=0xAA204511,防御=0xAA204513,施法=0xAA204515,倒地=0xAA204516,跑去=0xAA204517,跑回=0,攻击=0xAA204514,攻击B=0xAA204514}
SuoyouModel["进阶灵灯侍者"]     ={站立=0xAA204604,行走=0xAA204624,待战=0xAA204604,挨打=0xAA204602,防御=0xAA204606,施法=0xAA204618,倒地=0xAA204621,跑去=0xAA204624,跑回=0,攻击=0xAA204608,攻击B=0xAA204608,小图标=0xAA204600,大图标=0xAA204601,对话头像=0xAA204623}
SuoyouModel["进阶灵灯侍者_装饰"]={站立=0xAA204605,行走=0xAA204625,待战=0xAA204605,挨打=0xAA204603,防御=0xAA204607,施法=0xAA204619,倒地=0xAA204622,跑去=0xAA204625,跑回=0,攻击=0xAA204609,攻击B=0xAA204609}
SuoyouModel["进阶灵灯侍者_饰品"]={站立=0xAA204612,行走=0xAA204617,待战=0xAA204612,挨打=0xAA204611,防御=0xAA204613,施法=0xAA204615,倒地=0xAA204616,跑去=0xAA204617,跑回=0,攻击=0xAA204614,攻击B=0xAA204614}
SuoyouModel["进阶龙鲤"]     ={站立=0xAA204704,行走=0xAA204724,待战=0xAA204704,挨打=0xAA204702,防御=0xAA204706,施法=0xAA204718,倒地=0xAA204721,跑去=0xAA204724,跑回=0,攻击=0xAA204708,攻击B=0xAA204708,小图标=0xAA204700,大图标=0xAA204701,对话头像=0xAA204723}
SuoyouModel["进阶龙鲤_装饰"]={站立=0xAA204705,行走=0xAA204725,待战=0xAA204705,挨打=0xAA204703,防御=0xAA204707,施法=0xAA204719,倒地=0xAA204722,跑去=0xAA204725,跑回=0,攻击=0xAA204709,攻击B=0xAA204709}
SuoyouModel["进阶龙鲤_饰品"]={站立=0xAA204712,行走=0xAA204717,待战=0xAA204712,挨打=0xAA204711,防御=0xAA204713,施法=0xAA204715,倒地=0xAA204716,跑去=0xAA204717,跑回=0,攻击=0xAA204714,攻击B=0xAA204714}
SuoyouModel["进阶曼珠沙华"]     ={站立=0xAA204804,行走=0xAA204824,待战=0xAA204804,挨打=0xAA204802,防御=0xAA204806,施法=0xAA204818,倒地=0xAA204821,跑去=0xAA204824,跑回=0,攻击=0xAA204808,攻击B=0xAA204808,小图标=0xAA204800,大图标=0xAA204801,对话头像=0xAA204823}
SuoyouModel["进阶曼珠沙华_装饰"]={站立=0xAA204805,行走=0xAA204825,待战=0xAA204805,挨打=0xAA204803,防御=0xAA204807,施法=0xAA204819,倒地=0xAA204822,跑去=0xAA204825,跑回=0,攻击=0xAA204809,攻击B=0xAA204809}
SuoyouModel["进阶曼珠沙华_饰品"]={站立=0xAA204812,行走=0xAA204817,待战=0xAA204812,挨打=0xAA204811,防御=0xAA204813,施法=0xAA204815,倒地=0xAA204816,跑去=0xAA204817,跑回=0,攻击=0xAA204814,攻击B=0xAA204814}
SuoyouModel["进阶妙华天女"]     ={站立=0xAA204904,行走=0xAA204924,待战=0xAA204904,挨打=0xAA204902,防御=0xAA204906,施法=0xAA204918,倒地=0xAA204921,跑去=0xAA204924,跑回=0,攻击=0xAA204908,攻击B=0xAA204908,小图标=0xAA204900,大图标=0xAA204901,对话头像=0xAA204923}
SuoyouModel["进阶妙华天女_装饰"]={站立=0xAA204905,行走=0xAA204925,待战=0xAA204905,挨打=0xAA204903,防御=0xAA204907,施法=0xAA204919,倒地=0xAA204922,跑去=0xAA204925,跑回=0,攻击=0xAA204909,攻击B=0xAA204909}
SuoyouModel["进阶妙华天女_饰品"]={站立=0xAA204912,行走=0xAA204917,待战=0xAA204912,挨打=0xAA204911,防御=0xAA204913,施法=0xAA204915,倒地=0xAA204916,跑去=0xAA204917,跑回=0,攻击=0xAA204914,攻击B=0xAA204914}
SuoyouModel["进阶千年蛇魅"]     ={站立=0xAA205004,行走=0xAA205024,待战=0xAA205004,挨打=0xAA205002,防御=0xAA205006,施法=0xAA205018,倒地=0xAA205021,跑去=0xAA205024,跑回=0,攻击=0xAA205008,攻击B=0xAA205008,小图标=0xAA205000,大图标=0xAA205001,对话头像=0xAA205023}
SuoyouModel["进阶千年蛇魅_装饰"]={站立=0xAA205005,行走=0xAA205025,待战=0xAA205005,挨打=0xAA205003,防御=0xAA205007,施法=0xAA205019,倒地=0xAA205022,跑去=0xAA205025,跑回=0,攻击=0xAA205009,攻击B=0xAA205009}
SuoyouModel["进阶千年蛇魅_饰品"]={站立=0xAA205012,行走=0xAA205017,待战=0xAA205012,挨打=0xAA205011,防御=0xAA205013,施法=0xAA205015,倒地=0xAA205016,跑去=0xAA205017,跑回=0,攻击=0xAA205014,攻击B=0xAA205014}
SuoyouModel["进阶日游神"]     ={站立=0xAA205104,行走=0xAA205124,待战=0xAA205104,挨打=0xAA205102,防御=0xAA205106,施法=0xAA205118,倒地=0xAA205121,跑去=0xAA205124,跑回=0,攻击=0xAA205108,攻击B=0xAA205108,小图标=0xAA205100,大图标=0xAA205101,对话头像=0xAA205123}
SuoyouModel["进阶日游神_装饰"]={站立=0xAA205105,行走=0xAA205125,待战=0xAA205105,挨打=0xAA205103,防御=0xAA205107,施法=0xAA205119,倒地=0xAA205122,跑去=0xAA205125,跑回=0,攻击=0xAA205109,攻击B=0xAA205109}
SuoyouModel["进阶日游神_饰品"]={站立=0xAA205112,行走=0xAA205117,待战=0xAA205112,挨打=0xAA205111,防御=0xAA205113,施法=0xAA205115,倒地=0xAA205116,跑去=0xAA205117,跑回=0,攻击=0xAA205114,攻击B=0xAA205114}
SuoyouModel["进阶噬天虎"]     ={站立=0xAA205204,行走=0xAA205224,待战=0xAA205204,挨打=0xAA205202,防御=0xAA205206,施法=0xAA205218,倒地=0xAA205221,跑去=0xAA205224,跑回=0,攻击=0xAA205208,攻击B=0xAA205208,小图标=0xAA205200,大图标=0xAA205201,对话头像=0xAA205223}
SuoyouModel["进阶噬天虎_装饰"]={站立=0xAA205205,行走=0xAA205225,待战=0xAA205205,挨打=0xAA205203,防御=0xAA205207,施法=0xAA205219,倒地=0xAA205222,跑去=0xAA205225,跑回=0,攻击=0xAA205209,攻击B=0xAA205209}
SuoyouModel["进阶噬天虎_饰品"]={站立=0xAA205212,行走=0xAA205217,待战=0xAA205212,挨打=0xAA205211,防御=0xAA205213,施法=0xAA205215,倒地=0xAA205216,跑去=0xAA205217,跑回=0,攻击=0xAA205214,攻击B=0xAA205214}
SuoyouModel["进阶司雪"]     ={站立=0xAA205304,行走=0xAA205324,待战=0xAA205304,挨打=0xAA205302,防御=0xAA205306,施法=0xAA205318,倒地=0xAA205321,跑去=0xAA205324,跑回=0,攻击=0xAA205308,攻击B=0xAA205308,小图标=0xAA205300,大图标=0xAA205301,对话头像=0xAA205323}
SuoyouModel["进阶司雪_装饰"]={站立=0xAA205305,行走=0xAA205325,待战=0xAA205305,挨打=0xAA205303,防御=0xAA205307,施法=0xAA205319,倒地=0xAA205322,跑去=0xAA205325,跑回=0,攻击=0xAA205309,攻击B=0xAA205309}
SuoyouModel["进阶司雪_饰品"]={站立=0xAA205312,行走=0xAA205317,待战=0xAA205312,挨打=0xAA205311,防御=0xAA205313,施法=0xAA205315,倒地=0xAA205316,跑去=0xAA205317,跑回=0,攻击=0xAA205314,攻击B=0xAA205314}
SuoyouModel["进阶无常鬼差白"]     ={站立=0xAA205404,行走=0xAA205424,待战=0xAA205404,挨打=0xAA205402,防御=0xAA205406,施法=0xAA205418,倒地=0xAA205421,跑去=0xAA205424,跑回=0,攻击=0xAA205408,攻击B=0xAA205408,小图标=0xAA205400,大图标=0xAA205401,对话头像=0xAA205423}
SuoyouModel["进阶无常鬼差白_装饰"]={站立=0xAA205405,行走=0xAA205425,待战=0xAA205405,挨打=0xAA205403,防御=0xAA205407,施法=0xAA205419,倒地=0xAA205422,跑去=0xAA205425,跑回=0,攻击=0xAA205409,攻击B=0xAA205409}
SuoyouModel["进阶无常鬼差白_饰品"]={站立=0xAA205412,行走=0xAA205417,待战=0xAA205412,挨打=0xAA205411,防御=0xAA205413,施法=0xAA205415,倒地=0xAA205416,跑去=0xAA205417,跑回=0,攻击=0xAA205414,攻击B=0xAA205414}
SuoyouModel["进阶无常鬼差黑"]     ={站立=0xAA205504,行走=0xAA205524,待战=0xAA205504,挨打=0xAA205502,防御=0xAA205506,施法=0xAA205518,倒地=0xAA205521,跑去=0xAA205524,跑回=0,攻击=0xAA205508,攻击B=0xAA205508,小图标=0xAA205500,大图标=0xAA205501,对话头像=0xAA205523}
SuoyouModel["进阶无常鬼差黑_装饰"]={站立=0xAA205505,行走=0xAA205525,待战=0xAA205505,挨打=0xAA205503,防御=0xAA205507,施法=0xAA205519,倒地=0xAA205522,跑去=0xAA205525,跑回=0,攻击=0xAA205509,攻击B=0xAA205509}
SuoyouModel["进阶无常鬼差黑_饰品"]={站立=0xAA205512,行走=0xAA205517,待战=0xAA205512,挨打=0xAA205511,防御=0xAA205513,施法=0xAA205515,倒地=0xAA205516,跑去=0xAA205517,跑回=0,攻击=0xAA205514,攻击B=0xAA205514}
SuoyouModel["进阶吸血鬼"]     ={站立=0xAA205604,行走=0xAA205624,待战=0xAA205604,挨打=0xAA205602,防御=0xAA205606,施法=0xAA205618,倒地=0xAA205621,跑去=0xAA205624,跑回=0,攻击=0xAA205608,攻击B=0xAA205608,小图标=0xAA205600,大图标=0xAA205601,对话头像=0xAA205623}
SuoyouModel["进阶吸血鬼_装饰"]={站立=0xAA205605,行走=0xAA205625,待战=0xAA205605,挨打=0xAA205603,防御=0xAA205607,施法=0xAA205619,倒地=0xAA205622,跑去=0xAA205625,跑回=0,攻击=0xAA205609,攻击B=0xAA205609}
SuoyouModel["进阶吸血鬼_饰品"]={站立=0xAA205612,行走=0xAA205617,待战=0xAA205612,挨打=0xAA205611,防御=0xAA205613,施法=0xAA205615,倒地=0xAA205616,跑去=0xAA205617,跑回=0,攻击=0xAA205614,攻击B=0xAA205614}
SuoyouModel["进阶小精灵"]     ={站立=0xAA205704,行走=0xAA205724,待战=0xAA205704,挨打=0xAA205702,防御=0xAA205706,施法=0xAA205718,倒地=0xAA205721,跑去=0xAA205724,跑回=0,攻击=0xAA205708,攻击B=0xAA205708,小图标=0xAA205700,大图标=0xAA205701,对话头像=0xAA205723}
SuoyouModel["进阶小精灵_装饰"]={站立=0xAA205705,行走=0xAA205725,待战=0xAA205705,挨打=0xAA205703,防御=0xAA205707,施法=0xAA205719,倒地=0xAA205722,跑去=0xAA205725,跑回=0,攻击=0xAA205709,攻击B=0xAA205709}
SuoyouModel["进阶小精灵_饰品"]={站立=0xAA205712,行走=0xAA205717,待战=0xAA205712,挨打=0xAA205711,防御=0xAA205713,施法=0xAA205715,倒地=0xAA205716,跑去=0xAA205717,跑回=0,攻击=0xAA205714,攻击B=0xAA205714}
SuoyouModel["进阶小毛头"]     ={站立=0xAA205804,行走=0xAA205824,待战=0xAA205804,挨打=0xAA205802,防御=0xAA205806,施法=0xAA205818,倒地=0xAA205821,跑去=0xAA205824,跑回=0,攻击=0xAA205808,攻击B=0xAA205808,小图标=0xAA205800,大图标=0xAA205801,对话头像=0xAA205823}
SuoyouModel["进阶小毛头_装饰"]={站立=0xAA205805,行走=0xAA205825,待战=0xAA205805,挨打=0xAA205803,防御=0xAA205807,施法=0xAA205819,倒地=0xAA205822,跑去=0xAA205825,跑回=0,攻击=0xAA205809,攻击B=0xAA205809}
SuoyouModel["进阶小毛头_饰品"]={站立=0xAA205812,行走=0xAA205817,待战=0xAA205812,挨打=0xAA205811,防御=0xAA205813,施法=0xAA205815,倒地=0xAA205816,跑去=0xAA205817,跑回=0,攻击=0xAA205814,攻击B=0xAA205814}
SuoyouModel["进阶小魔头"]     ={站立=0xAA205904,行走=0xAA205924,待战=0xAA205904,挨打=0xAA205902,防御=0xAA205906,施法=0xAA205918,倒地=0xAA205921,跑去=0xAA205924,跑回=0,攻击=0xAA205908,攻击B=0xAA205908,小图标=0xAA205900,大图标=0xAA205901,对话头像=0xAA205923}
SuoyouModel["进阶小魔头_装饰"]={站立=0xAA205905,行走=0xAA205925,待战=0xAA205905,挨打=0xAA205903,防御=0xAA205907,施法=0xAA205919,倒地=0xAA205922,跑去=0xAA205925,跑回=0,攻击=0xAA205909,攻击B=0xAA205909}
SuoyouModel["进阶小魔头_饰品"]={站立=0xAA205912,行走=0xAA205917,待战=0xAA205912,挨打=0xAA205911,防御=0xAA205913,施法=0xAA205915,倒地=0xAA205916,跑去=0xAA205917,跑回=0,攻击=0xAA205914,攻击B=0xAA205914}
SuoyouModel["进阶小仙灵"]     ={站立=0xAA206004,行走=0xAA206024,待战=0xAA206004,挨打=0xAA206002,防御=0xAA206006,施法=0xAA206018,倒地=0xAA206021,跑去=0xAA206024,跑回=0,攻击=0xAA206008,攻击B=0xAA206008,小图标=0xAA206000,大图标=0xAA206001,对话头像=0xAA206023}
SuoyouModel["进阶小仙灵_装饰"]={站立=0xAA206005,行走=0xAA206025,待战=0xAA206005,挨打=0xAA206003,防御=0xAA206007,施法=0xAA206019,倒地=0xAA206022,跑去=0xAA206025,跑回=0,攻击=0xAA206009,攻击B=0xAA206009}
SuoyouModel["进阶小仙灵_饰品"]={站立=0xAA206012,行走=0xAA206017,待战=0xAA206012,挨打=0xAA206011,防御=0xAA206013,施法=0xAA206015,倒地=0xAA206016,跑去=0xAA206017,跑回=0,攻击=0xAA206014,攻击B=0xAA206014}
SuoyouModel["进阶小仙女"]     ={站立=0xAA206104,行走=0xAA206124,待战=0xAA206104,挨打=0xAA206102,防御=0xAA206106,施法=0xAA206118,倒地=0xAA206121,跑去=0xAA206124,跑回=0,攻击=0xAA206108,攻击B=0xAA206108,小图标=0xAA206100,大图标=0xAA206101,对话头像=0xAA206123}
SuoyouModel["进阶小仙女_装饰"]={站立=0xAA206105,行走=0xAA206125,待战=0xAA206105,挨打=0xAA206103,防御=0xAA206107,施法=0xAA206119,倒地=0xAA206122,跑去=0xAA206125,跑回=0,攻击=0xAA206109,攻击B=0xAA206109}
SuoyouModel["进阶小仙女_饰品"]={站立=0xAA206112,行走=0xAA206117,待战=0xAA206112,挨打=0xAA206111,防御=0xAA206113,施法=0xAA206115,倒地=0xAA206116,跑去=0xAA206117,跑回=0,攻击=0xAA206114,攻击B=0xAA206114}
SuoyouModel["进阶小丫丫"]     ={站立=0xAA206204,行走=0xAA206224,待战=0xAA206204,挨打=0xAA206202,防御=0xAA206206,施法=0xAA206218,倒地=0xAA206221,跑去=0xAA206224,跑回=0,攻击=0xAA206208,攻击B=0xAA206208,小图标=0xAA206200,大图标=0xAA206201,对话头像=0xAA206223}
SuoyouModel["进阶小丫丫_装饰"]={站立=0xAA206205,行走=0xAA206225,待战=0xAA206205,挨打=0xAA206203,防御=0xAA206207,施法=0xAA206219,倒地=0xAA206222,跑去=0xAA206225,跑回=0,攻击=0xAA206209,攻击B=0xAA206209}
SuoyouModel["进阶小丫丫_饰品"]={站立=0xAA206212,行走=0xAA206217,待战=0xAA206212,挨打=0xAA206211,防御=0xAA206213,施法=0xAA206215,倒地=0xAA206216,跑去=0xAA206217,跑回=0,攻击=0xAA206214,攻击B=0xAA206214}
SuoyouModel["进阶玄珠灵仙"]     ={站立=0xAA206304,行走=0xAA206324,待战=0xAA206304,挨打=0xAA206302,防御=0xAA206306,施法=0xAA206318,倒地=0xAA206321,跑去=0xAA206324,跑回=0,攻击=0xAA206308,攻击B=0xAA206308,小图标=0xAA206300,大图标=0xAA206301,对话头像=0xAA206323}
SuoyouModel["进阶玄珠灵仙_装饰"]={站立=0xAA206305,行走=0xAA206325,待战=0xAA206305,挨打=0xAA206303,防御=0xAA206307,施法=0xAA206319,倒地=0xAA206322,跑去=0xAA206325,跑回=0,攻击=0xAA206309,攻击B=0xAA206309}
SuoyouModel["进阶玄珠灵仙_饰品"]={站立=0xAA206312,行走=0xAA206317,待战=0xAA206312,挨打=0xAA206311,防御=0xAA206313,施法=0xAA206315,倒地=0xAA206316,跑去=0xAA206317,跑回=0,攻击=0xAA206314,攻击B=0xAA206314}
SuoyouModel["进阶巡游天神"]     ={站立=0xAA206404,行走=0xAA206424,待战=0xAA206404,挨打=0xAA206402,防御=0xAA206406,施法=0xAA206418,倒地=0xAA206421,跑去=0xAA206424,跑回=0,攻击=0xAA206408,攻击B=0xAA206408,小图标=0xAA206400,大图标=0xAA206401,对话头像=0xAA206423}
SuoyouModel["进阶巡游天神_装饰"]={站立=0xAA206405,行走=0xAA206425,待战=0xAA206405,挨打=0xAA206403,防御=0xAA206407,施法=0xAA206419,倒地=0xAA206422,跑去=0xAA206425,跑回=0,攻击=0xAA206409,攻击B=0xAA206409}
SuoyouModel["进阶巡游天神_饰品"]={站立=0xAA206412,行走=0xAA206417,待战=0xAA206412,挨打=0xAA206411,防御=0xAA206413,施法=0xAA206415,倒地=0xAA206416,跑去=0xAA206417,跑回=0,攻击=0xAA206414,攻击B=0xAA206414}
SuoyouModel["进阶炎魔神"]     ={站立=0xAA206504,行走=0xAA206524,待战=0xAA206504,挨打=0xAA206502,防御=0xAA206506,施法=0xAA206518,倒地=0xAA206521,跑去=0xAA206524,跑回=0,攻击=0xAA206508,攻击B=0xAA206508,小图标=0xAA206500,大图标=0xAA206501,对话头像=0xAA206523}
SuoyouModel["进阶炎魔神_装饰"]={站立=0xAA206505,行走=0xAA206525,待战=0xAA206505,挨打=0xAA206503,防御=0xAA206507,施法=0xAA206519,倒地=0xAA206522,跑去=0xAA206525,跑回=0,攻击=0xAA206509,攻击B=0xAA206509}
SuoyouModel["进阶炎魔神_饰品"]={站立=0xAA206512,行走=0xAA206517,待战=0xAA206512,挨打=0xAA206511,防御=0xAA206513,施法=0xAA206515,倒地=0xAA206516,跑去=0xAA206517,跑回=0,攻击=0xAA206514,攻击B=0xAA206514}
SuoyouModel["进阶野猪精"]     ={站立=0xAA206604,行走=0xAA206624,待战=0xAA206604,挨打=0xAA206602,防御=0xAA206606,施法=0xAA206618,倒地=0xAA206621,跑去=0xAA206624,跑回=0,攻击=0xAA206608,攻击B=0xAA206608,小图标=0xAA206600,大图标=0xAA206601,对话头像=0xAA206623}
SuoyouModel["进阶野猪精_装饰"]={站立=0xAA206605,行走=0xAA206625,待战=0xAA206605,挨打=0xAA206603,防御=0xAA206607,施法=0xAA206619,倒地=0xAA206622,跑去=0xAA206625,跑回=0,攻击=0xAA206609,攻击B=0xAA206609}
SuoyouModel["进阶野猪精_饰品"]={站立=0xAA206612,行走=0xAA206617,待战=0xAA206612,挨打=0xAA206611,防御=0xAA206613,施法=0xAA206615,倒地=0xAA206616,跑去=0xAA206617,跑回=0,攻击=0xAA206614,攻击B=0xAA206614}
SuoyouModel["进阶夜罗刹"]     ={站立=0xAA206704,行走=0xAA206724,待战=0xAA206704,挨打=0xAA206702,防御=0xAA206706,施法=0xAA206718,倒地=0xAA206721,跑去=0xAA206724,跑回=0,攻击=0xAA206708,攻击B=0xAA206708,小图标=0xAA206700,大图标=0xAA206701,对话头像=0xAA206723}
SuoyouModel["进阶夜罗刹_装饰"]={站立=0xAA206705,行走=0xAA206725,待战=0xAA206705,挨打=0xAA206703,防御=0xAA206707,施法=0xAA206719,倒地=0xAA206722,跑去=0xAA206725,跑回=0,攻击=0xAA206709,攻击B=0xAA206709}
SuoyouModel["进阶夜罗刹_饰品"]={站立=0xAA206712,行走=0xAA206717,待战=0xAA206712,挨打=0xAA206711,防御=0xAA206713,施法=0xAA206715,倒地=0xAA206716,跑去=0xAA206717,跑回=0,攻击=0xAA206714,攻击B=0xAA206714}
SuoyouModel["进阶月魅"]     ={站立=0xAA206804,行走=0xAA206824,待战=0xAA206804,挨打=0xAA206802,防御=0xAA206806,施法=0xAA206818,倒地=0xAA206821,跑去=0xAA206824,跑回=0,攻击=0xAA206808,攻击B=0xAA206808,小图标=0xAA206800,大图标=0xAA206801,对话头像=0xAA206823}
SuoyouModel["进阶月魅_装饰"]={站立=0xAA206805,行走=0xAA206825,待战=0xAA206805,挨打=0xAA206803,防御=0xAA206807,施法=0xAA206819,倒地=0xAA206822,跑去=0xAA206825,跑回=0,攻击=0xAA206809,攻击B=0xAA206809}
SuoyouModel["进阶月魅_饰品"]={站立=0xAA206812,行走=0xAA206817,待战=0xAA206812,挨打=0xAA206811,防御=0xAA206813,施法=0xAA206815,倒地=0xAA206816,跑去=0xAA206817,跑回=0,攻击=0xAA206814,攻击B=0xAA206814}
SuoyouModel["进阶月影仙"]     ={站立=0xAA206904,行走=0xAA206924,待战=0xAA206904,挨打=0xAA206902,防御=0xAA206906,施法=0xAA206918,倒地=0xAA206921,跑去=0xAA206924,跑回=0,攻击=0xAA206908,攻击B=0xAA206908,小图标=0xAA206900,大图标=0xAA206901,对话头像=0xAA206923}
SuoyouModel["进阶月影仙_装饰"]={站立=0xAA206905,行走=0xAA206925,待战=0xAA206905,挨打=0xAA206903,防御=0xAA206907,施法=0xAA206919,倒地=0xAA206922,跑去=0xAA206925,跑回=0,攻击=0xAA206909,攻击B=0xAA206909}
SuoyouModel["进阶月影仙_饰品"]={站立=0xAA206912,行走=0xAA206917,待战=0xAA206912,挨打=0xAA206911,防御=0xAA206913,施法=0xAA206915,倒地=0xAA206916,跑去=0xAA206917,跑回=0,攻击=0xAA206914,攻击B=0xAA206914}
SuoyouModel["进阶云游火"]     ={站立=0xAA207004,行走=0xAA207024,待战=0xAA207004,挨打=0xAA207002,防御=0xAA207006,施法=0xAA207018,倒地=0xAA207021,跑去=0xAA207024,跑回=0,攻击=0xAA207008,攻击B=0xAA207008,小图标=0xAA207000,大图标=0xAA207001,对话头像=0xAA207023}
SuoyouModel["进阶云游火_装饰"]={站立=0xAA207005,行走=0xAA207025,待战=0xAA207005,挨打=0xAA207003,防御=0xAA207007,施法=0xAA207019,倒地=0xAA207022,跑去=0xAA207025,跑回=0,攻击=0xAA207009,攻击B=0xAA207009}
SuoyouModel["进阶云游火_饰品"]={站立=0xAA207012,行走=0xAA207017,待战=0xAA207012,挨打=0xAA207011,防御=0xAA207013,施法=0xAA207015,倒地=0xAA207016,跑去=0xAA207017,跑回=0,攻击=0xAA207014,攻击B=0xAA207014}
SuoyouModel["进阶长乐灵仙"]     ={站立=0xAA207104,行走=0xAA207124,待战=0xAA207104,挨打=0xAA207102,防御=0xAA207106,施法=0xAA207118,倒地=0xAA207121,跑去=0xAA207124,跑回=0,攻击=0xAA207108,攻击B=0xAA207108,小图标=0xAA207100,大图标=0xAA207101,对话头像=0xAA207123}
SuoyouModel["进阶长乐灵仙_装饰"]={站立=0xAA207105,行走=0xAA207125,待战=0xAA207105,挨打=0xAA207103,防御=0xAA207107,施法=0xAA207119,倒地=0xAA207122,跑去=0xAA207125,跑回=0,攻击=0xAA207109,攻击B=0xAA207109}
SuoyouModel["进阶长乐灵仙_饰品"]={站立=0xAA207112,行走=0xAA207117,待战=0xAA207112,挨打=0xAA207111,防御=0xAA207113,施法=0xAA207115,倒地=0xAA207116,跑去=0xAA207117,跑回=0,攻击=0xAA207114,攻击B=0xAA207114}
SuoyouModel["进阶执音"]     ={站立=0xAA207204,行走=0xAA207224,待战=0xAA207204,挨打=0xAA207202,防御=0xAA207206,施法=0xAA207218,倒地=0xAA207221,跑去=0xAA207224,跑回=0,攻击=0xAA207208,攻击B=0xAA207208,小图标=0xAA207200,大图标=0xAA207201,对话头像=0xAA207223}
SuoyouModel["进阶执音_装饰"]={站立=0xAA207205,行走=0xAA207225,待战=0xAA207205,挨打=0xAA207203,防御=0xAA207207,施法=0xAA207219,倒地=0xAA207222,跑去=0xAA207225,跑回=0,攻击=0xAA207209,攻击B=0xAA207209}
SuoyouModel["进阶执音_饰品"]={站立=0xAA207212,行走=0xAA207217,待战=0xAA207212,挨打=0xAA207211,防御=0xAA207213,施法=0xAA207215,倒地=0xAA207216,跑去=0xAA207217,跑回=0,攻击=0xAA207214,攻击B=0xAA207214}
SuoyouModel["进阶自在心猿"]     ={站立=0xAA207304,行走=0xAA207324,待战=0xAA207304,挨打=0xAA207302,防御=0xAA207306,施法=0xAA207318,倒地=0xAA207321,跑去=0xAA207324,跑回=0,攻击=0xAA207308,攻击B=0xAA207308,小图标=0xAA207300,大图标=0xAA207301,对话头像=0xAA207323}
SuoyouModel["进阶自在心猿_装饰"]={站立=0xAA207305,行走=0xAA207325,待战=0xAA207305,挨打=0xAA207303,防御=0xAA207307,施法=0xAA207319,倒地=0xAA207322,跑去=0xAA207325,跑回=0,攻击=0xAA207309,攻击B=0xAA207309}
SuoyouModel["进阶自在心猿_饰品"]={站立=0xAA207312,行走=0xAA207317,待战=0xAA207312,挨打=0xAA207311,防御=0xAA207313,施法=0xAA207315,倒地=0xAA207316,跑去=0xAA207317,跑回=0,攻击=0xAA207314,攻击B=0xAA207314}
SuoyouModel["进阶白熊"]     ={站立=0xAA207404,行走=0xAA207424,待战=0xAA207404,挨打=0xAA207402,防御=0xAA207406,施法=0xAA207418,倒地=0xAA207421,跑去=0xAA207424,跑回=0,攻击=0xAA207408,攻击B=0xAA207408,小图标=0xAA207400,大图标=0xAA207401,对话头像=0xAA207423}
SuoyouModel["进阶白熊_装饰"]={站立=0xAA207405,行走=0xAA207425,待战=0xAA207405,挨打=0xAA207403,防御=0xAA207407,施法=0xAA207419,倒地=0xAA207422,跑去=0xAA207425,跑回=0,攻击=0xAA207409,攻击B=0xAA207409}
SuoyouModel["进阶白熊_饰品"]={站立=0xAA207412,行走=0xAA207417,待战=0xAA207412,挨打=0xAA207411,防御=0xAA207413,施法=0xAA207415,倒地=0xAA207416,跑去=0xAA207417,跑回=0,攻击=0xAA207414,攻击B=0xAA207414}
SuoyouModel["进阶百足将军"]     ={站立=0xAA207504,行走=0xAA207524,待战=0xAA207504,挨打=0xAA207502,防御=0xAA207506,施法=0xAA207518,倒地=0xAA207521,跑去=0xAA207524,跑回=0,攻击=0xAA207508,攻击B=0xAA207508,小图标=0xAA207500,大图标=0xAA207501,对话头像=0xAA207523}
SuoyouModel["进阶百足将军_装饰"]={站立=0xAA207505,行走=0xAA207525,待战=0xAA207505,挨打=0xAA207503,防御=0xAA207507,施法=0xAA207519,倒地=0xAA207522,跑去=0xAA207525,跑回=0,攻击=0xAA207509,攻击B=0xAA207509}
SuoyouModel["进阶百足将军_饰品"]={站立=0xAA207512,行走=0xAA207517,待战=0xAA207512,挨打=0xAA207511,防御=0xAA207513,施法=0xAA207515,倒地=0xAA207516,跑去=0xAA207517,跑回=0,攻击=0xAA207514,攻击B=0xAA207514}
SuoyouModel["进阶碧水夜叉"]     ={站立=0xAA207604,行走=0xAA207624,待战=0xAA207604,挨打=0xAA207602,防御=0xAA207606,施法=0xAA207618,倒地=0xAA207621,跑去=0xAA207624,跑回=0,攻击=0xAA207608,攻击B=0xAA207608,小图标=0xAA207600,大图标=0xAA207601,对话头像=0xAA207623}
SuoyouModel["进阶碧水夜叉_装饰"]={站立=0xAA207605,行走=0xAA207625,待战=0xAA207605,挨打=0xAA207603,防御=0xAA207607,施法=0xAA207619,倒地=0xAA207622,跑去=0xAA207625,跑回=0,攻击=0xAA207609,攻击B=0xAA207609}
SuoyouModel["进阶碧水夜叉_饰品"]={站立=0xAA207612,行走=0xAA207617,待战=0xAA207612,挨打=0xAA207611,防御=0xAA207613,施法=0xAA207615,倒地=0xAA207616,跑去=0xAA207617,跑回=0,攻击=0xAA207614,攻击B=0xAA207614}
SuoyouModel["进阶风伯"]     ={站立=0xAA207704,行走=0xAA207724,待战=0xAA207704,挨打=0xAA207702,防御=0xAA207706,施法=0xAA207718,倒地=0xAA207721,跑去=0xAA207724,跑回=0,攻击=0xAA207708,攻击B=0xAA207708,小图标=0xAA207700,大图标=0xAA207701,对话头像=0xAA207723}
SuoyouModel["进阶风伯_装饰"]={站立=0xAA207705,行走=0xAA207725,待战=0xAA207705,挨打=0xAA207703,防御=0xAA207707,施法=0xAA207719,倒地=0xAA207722,跑去=0xAA207725,跑回=0,攻击=0xAA207709,攻击B=0xAA207709}
SuoyouModel["进阶风伯_饰品"]={站立=0xAA207712,行走=0xAA207717,待战=0xAA207712,挨打=0xAA207711,防御=0xAA207713,施法=0xAA207715,倒地=0xAA207716,跑去=0xAA207717,跑回=0,攻击=0xAA207714,攻击B=0xAA207714}
SuoyouModel["进阶凤凰"]     ={站立=0xAA207804,行走=0xAA207824,待战=0xAA207804,挨打=0xAA207802,防御=0xAA207806,施法=0xAA207818,倒地=0xAA207821,跑去=0xAA207824,跑回=0,攻击=0xAA207808,攻击B=0xAA207808,小图标=0xAA207800,大图标=0xAA207801,对话头像=0xAA207823}
SuoyouModel["进阶凤凰_装饰"]={站立=0xAA207805,行走=0xAA207825,待战=0xAA207805,挨打=0xAA207803,防御=0xAA207807,施法=0xAA207819,倒地=0xAA207822,跑去=0xAA207825,跑回=0,攻击=0xAA207809,攻击B=0xAA207809}
SuoyouModel["进阶凤凰_饰品"]={站立=0xAA207812,行走=0xAA207817,待战=0xAA207812,挨打=0xAA207811,防御=0xAA207813,施法=0xAA207815,倒地=0xAA207816,跑去=0xAA207817,跑回=0,攻击=0xAA207814,攻击B=0xAA207814}
SuoyouModel["进阶鲛人"]     ={站立=0xAA207904,行走=0xAA207924,待战=0xAA207904,挨打=0xAA207902,防御=0xAA207906,施法=0xAA207918,倒地=0xAA207921,跑去=0xAA207924,跑回=0,攻击=0xAA207908,攻击B=0xAA207908,小图标=0xAA207900,大图标=0xAA207901,对话头像=0xAA207923}
SuoyouModel["进阶鲛人_装饰"]={站立=0xAA207905,行走=0xAA207925,待战=0xAA207905,挨打=0xAA207903,防御=0xAA207907,施法=0xAA207919,倒地=0xAA207922,跑去=0xAA207925,跑回=0,攻击=0xAA207909,攻击B=0xAA207909}
SuoyouModel["进阶鲛人_饰品"]={站立=0xAA207912,行走=0xAA207917,待战=0xAA207912,挨打=0xAA207911,防御=0xAA207913,施法=0xAA207915,倒地=0xAA207916,跑去=0xAA207917,跑回=0,攻击=0xAA207914,攻击B=0xAA207914}
SuoyouModel["进阶金铙僧"]     ={站立=0xAA208004,行走=0xAA208024,待战=0xAA208004,挨打=0xAA208002,防御=0xAA208006,施法=0xAA208018,倒地=0xAA208021,跑去=0xAA208024,跑回=0,攻击=0xAA208008,攻击B=0xAA208008,小图标=0xAA208000,大图标=0xAA208001,对话头像=0xAA208023}
SuoyouModel["进阶金铙僧_装饰"]={站立=0xAA208005,行走=0xAA208025,待战=0xAA208005,挨打=0xAA208003,防御=0xAA208007,施法=0xAA208019,倒地=0xAA208022,跑去=0xAA208025,跑回=0,攻击=0xAA208009,攻击B=0xAA208009}
SuoyouModel["进阶金铙僧_饰品"]={站立=0xAA208012,行走=0xAA208017,待战=0xAA208012,挨打=0xAA208011,防御=0xAA208013,施法=0xAA208015,倒地=0xAA208016,跑去=0xAA208017,跑回=0,攻击=0xAA208014,攻击B=0xAA208014}
SuoyouModel["进阶金身罗汉"]     ={站立=0xAA208104,行走=0xAA208124,待战=0xAA208104,挨打=0xAA208102,防御=0xAA208106,施法=0xAA208118,倒地=0xAA208121,跑去=0xAA208124,跑回=0,攻击=0xAA208108,攻击B=0xAA208108,小图标=0xAA208100,大图标=0xAA208101,对话头像=0xAA208123}
SuoyouModel["进阶金身罗汉_装饰"]={站立=0xAA208105,行走=0xAA208125,待战=0xAA208105,挨打=0xAA208103,防御=0xAA208107,施法=0xAA208119,倒地=0xAA208122,跑去=0xAA208125,跑回=0,攻击=0xAA208109,攻击B=0xAA208109}
SuoyouModel["进阶金身罗汉_饰品"]={站立=0xAA208112,行走=0xAA208117,待战=0xAA208112,挨打=0xAA208111,防御=0xAA208113,施法=0xAA208115,倒地=0xAA208116,跑去=0xAA208117,跑回=0,攻击=0xAA208114,攻击B=0xAA208114}
SuoyouModel["进阶锦毛貂精"]     ={站立=0xAA208204,行走=0xAA208224,待战=0xAA208204,挨打=0xAA208202,防御=0xAA208206,施法=0xAA208218,倒地=0xAA208221,跑去=0xAA208224,跑回=0,攻击=0xAA208208,攻击B=0xAA208208,小图标=0xAA208200,大图标=0xAA208201,对话头像=0xAA208223}
SuoyouModel["进阶锦毛貂精_装饰"]={站立=0xAA208205,行走=0xAA208225,待战=0xAA208205,挨打=0xAA208203,防御=0xAA208207,施法=0xAA208219,倒地=0xAA208222,跑去=0xAA208225,跑回=0,攻击=0xAA208209,攻击B=0xAA208209}
SuoyouModel["进阶锦毛貂精_饰品"]={站立=0xAA208212,行走=0xAA208217,待战=0xAA208212,挨打=0xAA208211,防御=0xAA208213,施法=0xAA208215,倒地=0xAA208216,跑去=0xAA208217,跑回=0,攻击=0xAA208214,攻击B=0xAA208214}
SuoyouModel["进阶鼠先锋"]     ={站立=0xAA208304,行走=0xAA208324,待战=0xAA208304,挨打=0xAA208302,防御=0xAA208306,施法=0xAA208318,倒地=0xAA208321,跑去=0xAA208324,跑回=0,攻击=0xAA208308,攻击B=0xAA208308,小图标=0xAA208300,大图标=0xAA208301,对话头像=0xAA208323}
SuoyouModel["进阶鼠先锋_装饰"]={站立=0xAA208305,行走=0xAA208325,待战=0xAA208305,挨打=0xAA208303,防御=0xAA208307,施法=0xAA208319,倒地=0xAA208322,跑去=0xAA208325,跑回=0,攻击=0xAA208309,攻击B=0xAA208309}
SuoyouModel["进阶鼠先锋_饰品"]={站立=0xAA208312,行走=0xAA208317,待战=0xAA208312,挨打=0xAA208311,防御=0xAA208313,施法=0xAA208315,倒地=0xAA208316,跑去=0xAA208317,跑回=0,攻击=0xAA208314,攻击B=0xAA208314}
SuoyouModel["进阶踏云兽"]     ={站立=0xAA208404,行走=0xAA208424,待战=0xAA208404,挨打=0xAA208402,防御=0xAA208406,施法=0xAA208418,倒地=0xAA208421,跑去=0xAA208424,跑回=0,攻击=0xAA208408,攻击B=0xAA208408,小图标=0xAA208400,大图标=0xAA208401,对话头像=0xAA208423}
SuoyouModel["进阶踏云兽_装饰"]={站立=0xAA208405,行走=0xAA208425,待战=0xAA208405,挨打=0xAA208403,防御=0xAA208407,施法=0xAA208419,倒地=0xAA208422,跑去=0xAA208425,跑回=0,攻击=0xAA208409,攻击B=0xAA208409}
SuoyouModel["进阶踏云兽_饰品"]={站立=0xAA208412,行走=0xAA208417,待战=0xAA208412,挨打=0xAA208411,防御=0xAA208413,施法=0xAA208415,倒地=0xAA208416,跑去=0xAA208417,跑回=0,攻击=0xAA208414,攻击B=0xAA208414}
SuoyouModel["进阶天兵"]     ={站立=0xAA208504,行走=0xAA208524,待战=0xAA208504,挨打=0xAA208502,防御=0xAA208506,施法=0xAA208518,倒地=0xAA208521,跑去=0xAA208524,跑回=0,攻击=0xAA208508,攻击B=0xAA208508,小图标=0xAA208500,大图标=0xAA208501,对话头像=0xAA208523}
SuoyouModel["进阶天兵_装饰"]={站立=0xAA208505,行走=0xAA208525,待战=0xAA208505,挨打=0xAA208503,防御=0xAA208507,施法=0xAA208519,倒地=0xAA208522,跑去=0xAA208525,跑回=0,攻击=0xAA208509,攻击B=0xAA208509}
SuoyouModel["进阶天兵_饰品"]={站立=0xAA208512,行走=0xAA208517,待战=0xAA208512,挨打=0xAA208511,防御=0xAA208513,施法=0xAA208515,倒地=0xAA208516,跑去=0xAA208517,跑回=0,攻击=0xAA208514,攻击B=0xAA208514}
SuoyouModel["进阶天将"]     ={站立=0xAA208604,行走=0xAA208624,待战=0xAA208604,挨打=0xAA208602,防御=0xAA208606,施法=0xAA208618,倒地=0xAA208621,跑去=0xAA208624,跑回=0,攻击=0xAA208608,攻击B=0xAA208608,小图标=0xAA208600,大图标=0xAA208601,对话头像=0xAA208623}
SuoyouModel["进阶天将_装饰"]={站立=0xAA208605,行走=0xAA208625,待战=0xAA208605,挨打=0xAA208603,防御=0xAA208607,施法=0xAA208619,倒地=0xAA208622,跑去=0xAA208625,跑回=0,攻击=0xAA208609,攻击B=0xAA208609}
SuoyouModel["进阶天将_饰品"]={站立=0xAA208612,行走=0xAA208617,待战=0xAA208612,挨打=0xAA208611,防御=0xAA208613,施法=0xAA208615,倒地=0xAA208616,跑去=0xAA208617,跑回=0,攻击=0xAA208614,攻击B=0xAA208614}
SuoyouModel["进阶犀牛将军人形"]     ={站立=0xAA208704,行走=0xAA208724,待战=0xAA208704,挨打=0xAA208702,防御=0xAA208706,施法=0xAA208718,倒地=0xAA208721,跑去=0xAA208724,跑回=0,攻击=0xAA208708,攻击B=0xAA208708,小图标=0xAA208700,大图标=0xAA208701,对话头像=0xAA208723}
SuoyouModel["进阶犀牛将军人形_装饰"]={站立=0xAA208705,行走=0xAA208725,待战=0xAA208705,挨打=0xAA208703,防御=0xAA208707,施法=0xAA208719,倒地=0xAA208722,跑去=0xAA208725,跑回=0,攻击=0xAA208709,攻击B=0xAA208709}
SuoyouModel["进阶犀牛将军人形_饰品"]={站立=0xAA208712,行走=0xAA208717,待战=0xAA208712,挨打=0xAA208711,防御=0xAA208713,施法=0xAA208715,倒地=0xAA208716,跑去=0xAA208717,跑回=0,攻击=0xAA208714,攻击B=0xAA208714}
SuoyouModel["进阶星灵仙子"]     ={站立=0xAA208804,行走=0xAA208824,待战=0xAA208804,挨打=0xAA208802,防御=0xAA208806,施法=0xAA208818,倒地=0xAA208821,跑去=0xAA208824,跑回=0,攻击=0xAA208808,攻击B=0xAA208808,小图标=0xAA208800,大图标=0xAA208801,对话头像=0xAA208823}
SuoyouModel["进阶星灵仙子_装饰"]={站立=0xAA208805,行走=0xAA208825,待战=0xAA208805,挨打=0xAA208803,防御=0xAA208807,施法=0xAA208819,倒地=0xAA208822,跑去=0xAA208825,跑回=0,攻击=0xAA208809,攻击B=0xAA208809}
SuoyouModel["进阶星灵仙子_饰品"]={站立=0xAA208812,行走=0xAA208817,待战=0xAA208812,挨打=0xAA208811,防御=0xAA208813,施法=0xAA208815,倒地=0xAA208816,跑去=0xAA208817,跑回=0,攻击=0xAA208814,攻击B=0xAA208814}
SuoyouModel["进阶夜游神"]     ={站立=0xAA208904,行走=0xAA208924,待战=0xAA208904,挨打=0xAA208902,防御=0xAA208906,施法=0xAA208918,倒地=0xAA208921,跑去=0xAA208924,跑回=0,攻击=0xAA208908,攻击B=0xAA208908,小图标=0xAA208900,大图标=0xAA208901,对话头像=0xAA208923}
SuoyouModel["进阶夜游神_装饰"]={站立=0xAA208905,行走=0xAA208925,待战=0xAA208905,挨打=0xAA208903,防御=0xAA208907,施法=0xAA208919,倒地=0xAA208922,跑去=0xAA208925,跑回=0,攻击=0xAA208909,攻击B=0xAA208909}
SuoyouModel["进阶夜游神_饰品"]={站立=0xAA208912,行走=0xAA208917,待战=0xAA208912,挨打=0xAA208911,防御=0xAA208913,施法=0xAA208915,倒地=0xAA208916,跑去=0xAA208917,跑回=0,攻击=0xAA208914,攻击B=0xAA208914}
SuoyouModel["进阶增长巡守"]     ={站立=0xAA209004,行走=0xAA209024,待战=0xAA209004,挨打=0xAA209002,防御=0xAA209006,施法=0xAA209018,倒地=0xAA209021,跑去=0xAA209024,跑回=0,攻击=0xAA209008,攻击B=0xAA209008,小图标=0xAA209000,大图标=0xAA209001,对话头像=0xAA209023}
SuoyouModel["进阶增长巡守_装饰"]={站立=0xAA209005,行走=0xAA209025,待战=0xAA209005,挨打=0xAA209003,防御=0xAA209007,施法=0xAA209019,倒地=0xAA209022,跑去=0xAA209025,跑回=0,攻击=0xAA209009,攻击B=0xAA209009}
SuoyouModel["进阶增长巡守_饰品"]={站立=0xAA209012,行走=0xAA209017,待战=0xAA209012,挨打=0xAA209011,防御=0xAA209013,施法=0xAA209015,倒地=0xAA209016,跑去=0xAA209017,跑回=0,攻击=0xAA209014,攻击B=0xAA209014}
SuoyouModel["进阶长眉灵猴"]     ={站立=0xAA209104,行走=0xAA209124,待战=0xAA209104,挨打=0xAA209102,防御=0xAA209106,施法=0xAA209118,倒地=0xAA209121,跑去=0xAA209124,跑回=0,攻击=0xAA209108,攻击B=0xAA209108,小图标=0xAA209100,大图标=0xAA209101,对话头像=0xAA209123}
SuoyouModel["进阶长眉灵猴_装饰"]={站立=0xAA209105,行走=0xAA209125,待战=0xAA209105,挨打=0xAA209103,防御=0xAA209107,施法=0xAA209119,倒地=0xAA209122,跑去=0xAA209125,跑回=0,攻击=0xAA209109,攻击B=0xAA209109}
SuoyouModel["进阶长眉灵猴_饰品"]={站立=0xAA209112,行走=0xAA209117,待战=0xAA209112,挨打=0xAA209111,防御=0xAA209113,施法=0xAA209115,倒地=0xAA209116,跑去=0xAA209117,跑回=0,攻击=0xAA209114,攻击B=0xAA209114}
SuoyouModel["进阶真陀护法"]     ={站立=0xAA209204,行走=0xAA209224,待战=0xAA209204,挨打=0xAA209202,防御=0xAA209206,施法=0xAA209218,倒地=0xAA209221,跑去=0xAA209224,跑回=0,攻击=0xAA209208,攻击B=0xAA209208,小图标=0xAA209200,大图标=0xAA209201,对话头像=0xAA209223}
SuoyouModel["进阶真陀护法_装饰"]={站立=0xAA209205,行走=0xAA209225,待战=0xAA209205,挨打=0xAA209203,防御=0xAA209207,施法=0xAA209219,倒地=0xAA209222,跑去=0xAA209225,跑回=0,攻击=0xAA209209,攻击B=0xAA209209}
SuoyouModel["进阶真陀护法_饰品"]={站立=0xAA209212,行走=0xAA209217,待战=0xAA209212,挨打=0xAA209211,防御=0xAA209213,施法=0xAA209215,倒地=0xAA209216,跑去=0xAA209217,跑回=0,攻击=0xAA209214,攻击B=0xAA209214}
SuoyouModel["进阶巴蛇"]     ={站立=0xAA210003,行走=0xAA210018,待战=0xAA210003,挨打=0xAA210002,防御=0xAA210004,施法=0xAA210014,倒地=0xAA210016,跑去=0xAA210018,跑回=0,攻击=0xAA210005,攻击B=0xAA210005,小图标=0xAA210000,大图标=0xAA210001,对话头像=0xAA210017}
SuoyouModel["进阶巴蛇_饰品"]={站立=0xAA210008,行走=0xAA210013,待战=0xAA210008,挨打=0xAA210007,防御=0xAA210009,施法=0xAA210011,倒地=0xAA210012,跑去=0xAA210013,跑回=0,攻击=0xAA210010,攻击B=0xAA210010}
SuoyouModel["进阶蚌精"]     ={站立=0xAA210103,行走=0xAA210118,待战=0xAA210103,挨打=0xAA210102,防御=0xAA210104,施法=0xAA210114,倒地=0xAA210116,跑去=0xAA210118,跑回=0,攻击=0xAA210105,攻击B=0xAA210105,小图标=0xAA210100,大图标=0xAA210101,对话头像=0xAA210117}
SuoyouModel["进阶蚌精_饰品"]={站立=0xAA210108,行走=0xAA210113,待战=0xAA210108,挨打=0xAA210107,防御=0xAA210109,施法=0xAA210111,倒地=0xAA210112,跑去=0xAA210113,跑回=0,攻击=0xAA210110,攻击B=0xAA210110}
SuoyouModel["进阶持国巡守"]     ={站立=0xAA210203,行走=0xAA210218,待战=0xAA210203,挨打=0xAA210202,防御=0xAA210204,施法=0xAA210214,倒地=0xAA210216,跑去=0xAA210218,跑回=0,攻击=0xAA210205,攻击B=0xAA210205,小图标=0xAA210200,大图标=0xAA210201,对话头像=0xAA210217}
SuoyouModel["进阶持国巡守_饰品"]={站立=0xAA210208,行走=0xAA210213,待战=0xAA210208,挨打=0xAA210207,防御=0xAA210209,施法=0xAA210211,倒地=0xAA210212,跑去=0xAA210213,跑回=0,攻击=0xAA210210,攻击B=0xAA210210}
SuoyouModel["进阶芙蓉仙子"]     ={站立=0xAA210303,行走=0xAA210318,待战=0xAA210303,挨打=0xAA210302,防御=0xAA210304,施法=0xAA210314,倒地=0xAA210316,跑去=0xAA210318,跑回=0,攻击=0xAA210305,攻击B=0xAA210305,小图标=0xAA210300,大图标=0xAA210301,对话头像=0xAA210317}
SuoyouModel["进阶芙蓉仙子_饰品"]={站立=0xAA210308,行走=0xAA210313,待战=0xAA210308,挨打=0xAA210307,防御=0xAA210309,施法=0xAA210311,倒地=0xAA210312,跑去=0xAA210313,跑回=0,攻击=0xAA210310,攻击B=0xAA210310}
SuoyouModel["进阶古代瑞兽"]     ={站立=0xAA210403,行走=0xAA210418,待战=0xAA210403,挨打=0xAA210402,防御=0xAA210404,施法=0xAA210414,倒地=0xAA210416,跑去=0xAA210418,跑回=0,攻击=0xAA210405,攻击B=0xAA210405,小图标=0xAA210400,大图标=0xAA210401,对话头像=0xAA210417}
SuoyouModel["进阶古代瑞兽_饰品"]={站立=0xAA210408,行走=0xAA210413,待战=0xAA210408,挨打=0xAA210407,防御=0xAA210409,施法=0xAA210411,倒地=0xAA210412,跑去=0xAA210413,跑回=0,攻击=0xAA210410,攻击B=0xAA210410}
SuoyouModel["进阶黑山老妖"]     ={站立=0xAA210503,行走=0xAA210518,待战=0xAA210503,挨打=0xAA210502,防御=0xAA210504,施法=0xAA210514,倒地=0xAA210516,跑去=0xAA210518,跑回=0,攻击=0xAA210505,攻击B=0xAA210505,小图标=0xAA210500,大图标=0xAA210501,对话头像=0xAA210517}
SuoyouModel["进阶黑山老妖_饰品"]={站立=0xAA210508,行走=0xAA210513,待战=0xAA210508,挨打=0xAA210507,防御=0xAA210509,施法=0xAA210511,倒地=0xAA210512,跑去=0xAA210513,跑回=0,攻击=0xAA210510,攻击B=0xAA210510}
SuoyouModel["进阶红萼仙子"]     ={站立=0xAA210603,行走=0xAA210618,待战=0xAA210603,挨打=0xAA210602,防御=0xAA210604,施法=0xAA210614,倒地=0xAA210616,跑去=0xAA210618,跑回=0,攻击=0xAA210605,攻击B=0xAA210605,小图标=0xAA210600,大图标=0xAA210601,对话头像=0xAA210617}
SuoyouModel["进阶红萼仙子_饰品"]={站立=0xAA210608,行走=0xAA210613,待战=0xAA210608,挨打=0xAA210607,防御=0xAA210609,施法=0xAA210611,倒地=0xAA210612,跑去=0xAA210613,跑回=0,攻击=0xAA210610,攻击B=0xAA210610}
SuoyouModel["进阶葫芦宝贝"]     ={站立=0xAA210703,行走=0xAA210718,待战=0xAA210703,挨打=0xAA210702,防御=0xAA210704,施法=0xAA210714,倒地=0xAA210716,跑去=0xAA210718,跑回=0,攻击=0xAA210705,攻击B=0xAA210705,小图标=0xAA210700,大图标=0xAA210701,对话头像=0xAA210717}
SuoyouModel["进阶葫芦宝贝_饰品"]={站立=0xAA210708,行走=0xAA210713,待战=0xAA210708,挨打=0xAA210707,防御=0xAA210709,施法=0xAA210711,倒地=0xAA210712,跑去=0xAA210713,跑回=0,攻击=0xAA210710,攻击B=0xAA210710}
SuoyouModel["进阶画魂"]     ={站立=0xAA210803,行走=0xAA210818,待战=0xAA210803,挨打=0xAA210802,防御=0xAA210804,施法=0xAA210814,倒地=0xAA210816,跑去=0xAA210818,跑回=0,攻击=0xAA210805,攻击B=0xAA210805,小图标=0xAA210800,大图标=0xAA210801,对话头像=0xAA210817}
SuoyouModel["进阶画魂_饰品"]={站立=0xAA210808,行走=0xAA210813,待战=0xAA210808,挨打=0xAA210807,防御=0xAA210809,施法=0xAA210811,倒地=0xAA210812,跑去=0xAA210813,跑回=0,攻击=0xAA210810,攻击B=0xAA210810}
SuoyouModel["进阶混沌兽"]     ={站立=0xAA210903,行走=0xAA210918,待战=0xAA210903,挨打=0xAA210902,防御=0xAA210904,施法=0xAA210914,倒地=0xAA210916,跑去=0xAA210918,跑回=0,攻击=0xAA210905,攻击B=0xAA210905,小图标=0xAA210900,大图标=0xAA210901,对话头像=0xAA210917}
SuoyouModel["进阶混沌兽_饰品"]={站立=0xAA210908,行走=0xAA210913,待战=0xAA210908,挨打=0xAA210907,防御=0xAA210909,施法=0xAA210911,倒地=0xAA210912,跑去=0xAA210913,跑回=0,攻击=0xAA210910,攻击B=0xAA210910}
SuoyouModel["进阶净瓶女娲"]     ={站立=0xAA211003,行走=0xAA211018,待战=0xAA211003,挨打=0xAA211002,防御=0xAA211004,施法=0xAA211014,倒地=0xAA211016,跑去=0xAA211018,跑回=0,攻击=0xAA211005,攻击B=0xAA211005,小图标=0xAA211000,大图标=0xAA211001,对话头像=0xAA211017}
SuoyouModel["进阶净瓶女娲_饰品"]={站立=0xAA211008,行走=0xAA211013,待战=0xAA211008,挨打=0xAA211007,防御=0xAA211009,施法=0xAA211011,倒地=0xAA211012,跑去=0xAA211013,跑回=0,攻击=0xAA211010,攻击B=0xAA211010}
SuoyouModel["进阶镜妖"]     ={站立=0xAA211103,行走=0xAA211118,待战=0xAA211103,挨打=0xAA211102,防御=0xAA211104,施法=0xAA211114,倒地=0xAA211116,跑去=0xAA211118,跑回=0,攻击=0xAA211105,攻击B=0xAA211105,小图标=0xAA211100,大图标=0xAA211101,对话头像=0xAA211117}
SuoyouModel["进阶镜妖_饰品"]={站立=0xAA211108,行走=0xAA211113,待战=0xAA211108,挨打=0xAA211107,防御=0xAA211109,施法=0xAA211111,倒地=0xAA211112,跑去=0xAA211113,跑回=0,攻击=0xAA211110,攻击B=0xAA211110}
SuoyouModel["进阶狂豹人形"]     ={站立=0xAA211203,行走=0xAA211218,待战=0xAA211203,挨打=0xAA211202,防御=0xAA211204,施法=0xAA211214,倒地=0xAA211216,跑去=0xAA211218,跑回=0,攻击=0xAA211205,攻击B=0xAA211205,小图标=0xAA211200,大图标=0xAA211201,对话头像=0xAA211217}
SuoyouModel["进阶狂豹人形_饰品"]={站立=0xAA211208,行走=0xAA211213,待战=0xAA211208,挨打=0xAA211207,防御=0xAA211209,施法=0xAA211211,倒地=0xAA211212,跑去=0xAA211213,跑回=0,攻击=0xAA211210,攻击B=0xAA211210}
SuoyouModel["进阶狂豹兽形"]     ={站立=0xAA211303,行走=0xAA211318,待战=0xAA211303,挨打=0xAA211302,防御=0xAA211304,施法=0xAA211314,倒地=0xAA211316,跑去=0xAA211318,跑回=0,攻击=0xAA211305,攻击B=0xAA211305,小图标=0xAA211300,大图标=0xAA211301,对话头像=0xAA211317}
SuoyouModel["进阶狂豹兽形_饰品"]={站立=0xAA211308,行走=0xAA211313,待战=0xAA211308,挨打=0xAA211307,防御=0xAA211309,施法=0xAA211311,倒地=0xAA211312,跑去=0xAA211313,跑回=0,攻击=0xAA211310,攻击B=0xAA211310}
SuoyouModel["进阶泪妖"]     ={站立=0xAA211403,行走=0xAA211418,待战=0xAA211403,挨打=0xAA211402,防御=0xAA211404,施法=0xAA211414,倒地=0xAA211416,跑去=0xAA211418,跑回=0,攻击=0xAA211405,攻击B=0xAA211405,小图标=0xAA211400,大图标=0xAA211401,对话头像=0xAA211417}
SuoyouModel["进阶泪妖_饰品"]={站立=0xAA211408,行走=0xAA211413,待战=0xAA211408,挨打=0xAA211407,防御=0xAA211409,施法=0xAA211411,倒地=0xAA211412,跑去=0xAA211413,跑回=0,攻击=0xAA211410,攻击B=0xAA211410}
SuoyouModel["进阶灵符女娲"]     ={站立=0xAA211503,行走=0xAA211518,待战=0xAA211503,挨打=0xAA211502,防御=0xAA211504,施法=0xAA211514,倒地=0xAA211516,跑去=0xAA211518,跑回=0,攻击=0xAA211505,攻击B=0xAA211505,小图标=0xAA211500,大图标=0xAA211501,对话头像=0xAA211517}
SuoyouModel["进阶灵符女娲_饰品"]={站立=0xAA211508,行走=0xAA211513,待战=0xAA211508,挨打=0xAA211507,防御=0xAA211509,施法=0xAA211511,倒地=0xAA211512,跑去=0xAA211513,跑回=0,攻击=0xAA211510,攻击B=0xAA211510}
SuoyouModel["进阶灵鹤"]     ={站立=0xAA211603,行走=0xAA211618,待战=0xAA211603,挨打=0xAA211602,防御=0xAA211604,施法=0xAA211614,倒地=0xAA211616,跑去=0xAA211618,跑回=0,攻击=0xAA211605,攻击B=0xAA211605,小图标=0xAA211600,大图标=0xAA211601,对话头像=0xAA211617}
SuoyouModel["进阶灵鹤_饰品"]={站立=0xAA211608,行走=0xAA211613,待战=0xAA211608,挨打=0xAA211607,防御=0xAA211609,施法=0xAA211611,倒地=0xAA211612,跑去=0xAA211613,跑回=0,攻击=0xAA211610,攻击B=0xAA211610}
SuoyouModel["进阶龙龟"]     ={站立=0xAA211703,行走=0xAA211718,待战=0xAA211703,挨打=0xAA211702,防御=0xAA211704,施法=0xAA211714,倒地=0xAA211716,跑去=0xAA211718,跑回=0,攻击=0xAA211705,攻击B=0xAA211705,小图标=0xAA211700,大图标=0xAA211701,对话头像=0xAA211717}
SuoyouModel["进阶龙龟_饰品"]={站立=0xAA211708,行走=0xAA211713,待战=0xAA211708,挨打=0xAA211707,防御=0xAA211709,施法=0xAA211711,倒地=0xAA211712,跑去=0xAA211713,跑回=0,攻击=0xAA211710,攻击B=0xAA211710}
SuoyouModel["进阶律法女娲"]     ={站立=0xAA211803,行走=0xAA211818,待战=0xAA211803,挨打=0xAA211802,防御=0xAA211804,施法=0xAA211814,倒地=0xAA211816,跑去=0xAA211818,跑回=0,攻击=0xAA211805,攻击B=0xAA211805,小图标=0xAA211800,大图标=0xAA211801,对话头像=0xAA211817}
SuoyouModel["进阶律法女娲_饰品"]={站立=0xAA211808,行走=0xAA211813,待战=0xAA211808,挨打=0xAA211807,防御=0xAA211809,施法=0xAA211811,倒地=0xAA211812,跑去=0xAA211813,跑回=0,攻击=0xAA211810,攻击B=0xAA211810}
SuoyouModel["进阶猫灵人形"]     ={站立=0xAA211903,行走=0xAA211918,待战=0xAA211903,挨打=0xAA211902,防御=0xAA211904,施法=0xAA211914,倒地=0xAA211916,跑去=0xAA211918,跑回=0,攻击=0xAA211905,攻击B=0xAA211905,小图标=0xAA211900,大图标=0xAA211901,对话头像=0xAA211917}
SuoyouModel["进阶猫灵人形_饰品"]={站立=0xAA211908,行走=0xAA211913,待战=0xAA211908,挨打=0xAA211907,防御=0xAA211909,施法=0xAA211911,倒地=0xAA211912,跑去=0xAA211913,跑回=0,攻击=0xAA211910,攻击B=0xAA211910}
SuoyouModel["进阶猫灵兽形"]     ={站立=0xAA212003,行走=0xAA212018,待战=0xAA212003,挨打=0xAA212002,防御=0xAA212004,施法=0xAA212014,倒地=0xAA212016,跑去=0xAA212018,跑回=0,攻击=0xAA212005,攻击B=0xAA212005,小图标=0xAA212000,大图标=0xAA212001,对话头像=0xAA212017}
SuoyouModel["进阶猫灵兽形_饰品"]={站立=0xAA212008,行走=0xAA212013,待战=0xAA212008,挨打=0xAA212007,防御=0xAA212009,施法=0xAA212011,倒地=0xAA212012,跑去=0xAA212013,跑回=0,攻击=0xAA212010,攻击B=0xAA212010}
SuoyouModel["进阶琴仙"]     ={站立=0xAA212103,行走=0xAA212118,待战=0xAA212103,挨打=0xAA212102,防御=0xAA212104,施法=0xAA212114,倒地=0xAA212116,跑去=0xAA212118,跑回=0,攻击=0xAA212105,攻击B=0xAA212105,小图标=0xAA212100,大图标=0xAA212101,对话头像=0xAA212117}
SuoyouModel["进阶琴仙_饰品"]={站立=0xAA212108,行走=0xAA212113,待战=0xAA212108,挨打=0xAA212107,防御=0xAA212109,施法=0xAA212111,倒地=0xAA212112,跑去=0xAA212113,跑回=0,攻击=0xAA212110,攻击B=0xAA212110}
SuoyouModel["进阶如意仙子"]     ={站立=0xAA212203,行走=0xAA212218,待战=0xAA212203,挨打=0xAA212207,防御=0xAA212204,施法=0xAA212214,倒地=0xAA212216,跑去=0xAA212218,跑回=0,攻击=0xAA212205,攻击B=0xAA212205,小图标=0xAA212200,大图标=0xAA212201,对话头像=0xAA212217}
SuoyouModel["进阶如意仙子_饰品"]={站立=0xAA212208,行走=0xAA212213,待战=0xAA212208,挨打=0xAA212202,防御=0xAA212209,施法=0xAA212211,倒地=0xAA212212,跑去=0xAA212213,跑回=0,攻击=0xAA212210,攻击B=0xAA212210}
SuoyouModel["进阶藤蔓妖花"]     ={站立=0xAA212303,行走=0xAA212318,待战=0xAA212303,挨打=0xAA212302,防御=0xAA212304,施法=0xAA212314,倒地=0xAA212316,跑去=0xAA212318,跑回=0,攻击=0xAA212305,攻击B=0xAA212305,小图标=0xAA212300,大图标=0xAA212301,对话头像=0xAA212317}
SuoyouModel["进阶藤蔓妖花_饰品"]={站立=0xAA212308,行走=0xAA212313,待战=0xAA212308,挨打=0xAA212307,防御=0xAA212309,施法=0xAA212311,倒地=0xAA212312,跑去=0xAA212313,跑回=0,攻击=0xAA212310,攻击B=0xAA212310}
SuoyouModel["进阶雾中仙"]     ={站立=0xAA212403,行走=0xAA212418,待战=0xAA212403,挨打=0xAA212402,防御=0xAA212404,施法=0xAA212414,倒地=0xAA212416,跑去=0xAA212418,跑回=0,攻击=0xAA212405,攻击B=0xAA212405,小图标=0xAA212400,大图标=0xAA212401,对话头像=0xAA212417}
SuoyouModel["进阶雾中仙_饰品"]={站立=0xAA212408,行走=0xAA212413,待战=0xAA212408,挨打=0xAA212407,防御=0xAA212409,施法=0xAA212411,倒地=0xAA212412,跑去=0xAA212413,跑回=0,攻击=0xAA212410,攻击B=0xAA212410}
SuoyouModel["进阶犀牛将军兽形"]     ={站立=0xAA212503,行走=0xAA212518,待战=0xAA212503,挨打=0xAA212502,防御=0xAA212504,施法=0xAA212514,倒地=0xAA212516,跑去=0xAA212518,跑回=0,攻击=0xAA212505,攻击B=0xAA212505,小图标=0xAA212500,大图标=0xAA212501,对话头像=0xAA212517}
SuoyouModel["进阶犀牛将军兽形_饰品"]={站立=0xAA212508,行走=0xAA212513,待战=0xAA212508,挨打=0xAA212507,防御=0xAA212509,施法=0xAA212511,倒地=0xAA212512,跑去=0xAA212513,跑回=0,攻击=0xAA212510,攻击B=0xAA212510}
SuoyouModel["进阶蝎子精"]     ={站立=0xAA212603,行走=0xAA212618,待战=0xAA212603,挨打=0xAA212602,防御=0xAA212604,施法=0xAA212614,倒地=0xAA212616,跑去=0xAA212618,跑回=0,攻击=0xAA212605,攻击B=0xAA212605,小图标=0xAA212600,大图标=0xAA212601,对话头像=0xAA212617}
SuoyouModel["进阶蝎子精_饰品"]={站立=0xAA212608,行走=0xAA212613,待战=0xAA212608,挨打=0xAA212607,防御=0xAA212609,施法=0xAA212611,倒地=0xAA212612,跑去=0xAA212613,跑回=0,攻击=0xAA212610,攻击B=0xAA212610}
SuoyouModel["进阶修罗傀儡鬼"]     ={站立=0xAA212703,行走=0xAA212718,待战=0xAA212703,挨打=0xAA212702,防御=0xAA212704,施法=0xAA212714,倒地=0xAA212716,跑去=0xAA212718,跑回=0,攻击=0xAA212705,攻击B=0xAA212705,小图标=0xAA212700,大图标=0xAA212701,对话头像=0xAA212717}
SuoyouModel["进阶修罗傀儡鬼_饰品"]={站立=0xAA212708,行走=0xAA212713,待战=0xAA212708,挨打=0xAA212707,防御=0xAA212709,施法=0xAA212711,倒地=0xAA212712,跑去=0xAA212713,跑回=0,攻击=0xAA212710,攻击B=0xAA212710}
SuoyouModel["进阶修罗傀儡妖"]     ={站立=0xAA212803,行走=0xAA212818,待战=0xAA212803,挨打=0xAA212802,防御=0xAA212804,施法=0xAA212814,倒地=0xAA212816,跑去=0xAA212818,跑回=0,攻击=0xAA212805,攻击B=0xAA212805,小图标=0xAA212800,大图标=0xAA212801,对话头像=0xAA212817}
SuoyouModel["进阶修罗傀儡妖_饰品"]={站立=0xAA212808,行走=0xAA212813,待战=0xAA212808,挨打=0xAA212807,防御=0xAA212809,施法=0xAA212811,倒地=0xAA212812,跑去=0xAA212813,跑回=0,攻击=0xAA212810,攻击B=0xAA212810}
SuoyouModel["进阶阴阳伞"]     ={站立=0xAA212903,行走=0xAA212918,待战=0xAA212903,挨打=0xAA212902,防御=0xAA212904,施法=0xAA212914,倒地=0xAA212916,跑去=0xAA212918,跑回=0,攻击=0xAA212905,攻击B=0xAA212905,小图标=0xAA212900,大图标=0xAA212901,对话头像=0xAA212917}
SuoyouModel["进阶阴阳伞_饰品"]={站立=0xAA212908,行走=0xAA212913,待战=0xAA212908,挨打=0xAA212907,防御=0xAA212909,施法=0xAA212911,倒地=0xAA212912,跑去=0xAA212913,跑回=0,攻击=0xAA212910,攻击B=0xAA212910}
SuoyouModel["进阶幽灵"]     ={站立=0xAA213003,行走=0xAA213018,待战=0xAA213003,挨打=0xAA213002,防御=0xAA213004,施法=0xAA213014,倒地=0xAA213016,跑去=0xAA213018,跑回=0,攻击=0xAA213005,攻击B=0xAA213005,小图标=0xAA213000,大图标=0xAA213001,对话头像=0xAA213017}
SuoyouModel["进阶幽灵_饰品"]={站立=0xAA213008,行走=0xAA213013,待战=0xAA213008,挨打=0xAA213007,防御=0xAA213009,施法=0xAA213011,倒地=0xAA213012,跑去=0xAA213013,跑回=0,攻击=0xAA213010,攻击B=0xAA213010}
SuoyouModel["进阶幽萤娃娃"]     ={站立=0xAA213103,行走=0xAA213118,待战=0xAA213103,挨打=0xAA213102,防御=0xAA213104,施法=0xAA213114,倒地=0xAA213116,跑去=0xAA213118,跑回=0,攻击=0xAA213105,攻击B=0xAA213105,小图标=0xAA213100,大图标=0xAA213101,对话头像=0xAA213117}
SuoyouModel["进阶幽萤娃娃_饰品"]={站立=0xAA213108,行走=0xAA213113,待战=0xAA213108,挨打=0xAA213107,防御=0xAA213109,施法=0xAA213111,倒地=0xAA213112,跑去=0xAA213113,跑回=0,攻击=0xAA213110,攻击B=0xAA213110}
SuoyouModel["进阶雨师"]     ={站立=0xAA213203,行走=0xAA213218,待战=0xAA213203,挨打=0xAA213202,防御=0xAA213204,施法=0xAA213214,倒地=0xAA213216,跑去=0xAA213218,跑回=0,攻击=0xAA213205,攻击B=0xAA213205,小图标=0xAA213200,大图标=0xAA213201,对话头像=0xAA213217}
SuoyouModel["进阶雨师_饰品"]={站立=0xAA213208,行走=0xAA213213,待战=0xAA213208,挨打=0xAA213207,防御=0xAA213209,施法=0xAA213211,倒地=0xAA213212,跑去=0xAA213213,跑回=0,攻击=0xAA213210,攻击B=0xAA213210}
SuoyouModel["进阶蜃气妖"]     ={站立=0xAA213303,行走=0xAA213316,待战=0xAA213303,挨打=0xAA213302,防御=0xAA213304,施法=0xAA213313,倒地=0xAA213314,跑去=0xAA213316,跑回=0,攻击=0xAA213305,攻击B=0xAA213305,小图标=0xAA213300,大图标=0xAA213301,对话头像=0xAA213315}
SuoyouModel["进阶蜃气妖_饰品"]={站立=0xAA213307,行走=0xAA213312,待战=0xAA213307,挨打=0xAA213306,防御=0xAA213308,施法=0xAA213310,倒地=0xAA213311,跑去=0xAA213312,跑回=0,攻击=0xAA213309,攻击B=0xAA213309}
SuoyouModel["般若天女"]     ={站立=0xAA213404,行走=0xAA213424,待战=0xAA213404,挨打=0xAA213402,防御=0xAA213406,施法=0xAA213418,倒地=0xAA213421,跑去=0xAA213424,跑回=0,攻击=0xAA213408,攻击B=0xAA213408,小图标=0xAA213400,大图标=0xAA213401,对话头像=0xAA213423}
SuoyouModel["般若天女_装饰"]={站立=0xAA213405,行走=0xAA213425,待战=0xAA213405,挨打=0xAA213403,防御=0xAA213407,施法=0xAA213419,倒地=0xAA213422,跑去=0xAA213425,跑回=0,攻击=0xAA213409,攻击B=0xAA213409}
SuoyouModel["般若天女_饰品"]={站立=0xAA213412,行走=0xAA213417,待战=0xAA213412,挨打=0xAA213411,防御=0xAA213413,施法=0xAA213415,倒地=0xAA213416,跑去=0xAA213417,跑回=0,攻击=0xAA213414,攻击B=0xAA213414}
SuoyouModel["持国巡守"]     ={站立=0xAA213504,行走=0xAA213524,待战=0xAA213504,挨打=0xAA213502,防御=0xAA213506,施法=0xAA213518,倒地=0xAA213521,跑去=0xAA213524,跑回=0,攻击=0xAA213508,攻击B=0xAA213508,小图标=0xAA213500,大图标=0xAA213501,对话头像=0xAA213523}
SuoyouModel["持国巡守_装饰"]={站立=0xAA213505,行走=0xAA213525,待战=0xAA213505,挨打=0xAA213503,防御=0xAA213507,施法=0xAA213519,倒地=0xAA213522,跑去=0xAA213525,跑回=0,攻击=0xAA213509,攻击B=0xAA213509}
SuoyouModel["持国巡守_饰品"]={站立=0xAA213512,行走=0xAA213517,待战=0xAA213512,挨打=0xAA213511,防御=0xAA213513,施法=0xAA213515,倒地=0xAA213516,跑去=0xAA213517,跑回=0,攻击=0xAA213514,攻击B=0xAA213514}
SuoyouModel["多闻巡守"]     ={站立=0xAA213604,行走=0xAA213624,待战=0xAA213604,挨打=0xAA213602,防御=0xAA213606,施法=0xAA213618,倒地=0xAA213621,跑去=0xAA213624,跑回=0,攻击=0xAA213608,攻击B=0xAA213608,小图标=0xAA213600,大图标=0xAA213601,对话头像=0xAA213623}
SuoyouModel["多闻巡守_装饰"]={站立=0xAA213605,行走=0xAA213625,待战=0xAA213605,挨打=0xAA213603,防御=0xAA213607,施法=0xAA213619,倒地=0xAA213622,跑去=0xAA213625,跑回=0,攻击=0xAA213609,攻击B=0xAA213609}
SuoyouModel["多闻巡守_饰品"]={站立=0xAA213612,行走=0xAA213617,待战=0xAA213612,挨打=0xAA213611,防御=0xAA213613,施法=0xAA213615,倒地=0xAA213616,跑去=0xAA213617,跑回=0,攻击=0xAA213614,攻击B=0xAA213614}
SuoyouModel["风伯"]     ={站立=0xAA213704,行走=0xAA213724,待战=0xAA213704,挨打=0xAA213702,防御=0xAA213706,施法=0xAA213718,倒地=0xAA213721,跑去=0xAA213724,跑回=0,攻击=0xAA213708,攻击B=0xAA213708,小图标=0xAA213700,大图标=0xAA213701,对话头像=0xAA213723}
SuoyouModel["风伯_装饰"]={站立=0xAA213705,行走=0xAA213725,待战=0xAA213705,挨打=0xAA213703,防御=0xAA213707,施法=0xAA213719,倒地=0xAA213722,跑去=0xAA213725,跑回=0,攻击=0xAA213709,攻击B=0xAA213709}
SuoyouModel["风伯_饰品"]={站立=0xAA213712,行走=0xAA213717,待战=0xAA213712,挨打=0xAA213711,防御=0xAA213713,施法=0xAA213715,倒地=0xAA213716,跑去=0xAA213717,跑回=0,攻击=0xAA213714,攻击B=0xAA213714}
SuoyouModel["红萼仙子"]     ={站立=0xAA213804,行走=0xAA213824,待战=0xAA213804,挨打=0xAA213802,防御=0xAA213806,施法=0xAA213818,倒地=0xAA213821,跑去=0xAA213824,跑回=0,攻击=0xAA213808,攻击B=0xAA213808,小图标=0xAA213800,大图标=0xAA213801,对话头像=0xAA213823}
SuoyouModel["红萼仙子_装饰"]={站立=0xAA213805,行走=0xAA213825,待战=0xAA213805,挨打=0xAA213803,防御=0xAA213807,施法=0xAA213819,倒地=0xAA213822,跑去=0xAA213825,跑回=0,攻击=0xAA213809,攻击B=0xAA213809}
SuoyouModel["红萼仙子_饰品"]={站立=0xAA213812,行走=0xAA213817,待战=0xAA213812,挨打=0xAA213811,防御=0xAA213813,施法=0xAA213815,倒地=0xAA213816,跑去=0xAA213817,跑回=0,攻击=0xAA213814,攻击B=0xAA213814}
SuoyouModel["狐不归"]     ={站立=0xAA213904,行走=0xAA213924,待战=0xAA213904,挨打=0xAA213902,防御=0xAA213906,施法=0xAA213918,倒地=0xAA213921,跑去=0xAA213924,跑回=0,攻击=0xAA213908,攻击B=0xAA213908,小图标=0xAA213900,大图标=0xAA213901,对话头像=0xAA213923}
SuoyouModel["狐不归_装饰"]={站立=0xAA213905,行走=0xAA213925,待战=0xAA213905,挨打=0xAA213903,防御=0xAA213907,施法=0xAA213919,倒地=0xAA213922,跑去=0xAA213925,跑回=0,攻击=0xAA213909,攻击B=0xAA213909}
SuoyouModel["狐不归_饰品"]={站立=0xAA213912,行走=0xAA213917,待战=0xAA213912,挨打=0xAA213911,防御=0xAA213913,施法=0xAA213915,倒地=0xAA213916,跑去=0xAA213917,跑回=0,攻击=0xAA213914,攻击B=0xAA213914}
SuoyouModel["蝴蝶仙子"]     ={站立=0xAA214004,行走=0xAA214024,待战=0xAA214004,挨打=0xAA214002,防御=0xAA214006,施法=0xAA214018,倒地=0xAA214021,跑去=0xAA214024,跑回=0,攻击=0xAA214008,攻击B=0xAA214008,小图标=0xAA214000,大图标=0xAA214001,对话头像=0xAA214023}
SuoyouModel["蝴蝶仙子_装饰"]={站立=0xAA214005,行走=0xAA214025,待战=0xAA214005,挨打=0xAA214003,防御=0xAA214007,施法=0xAA214019,倒地=0xAA214022,跑去=0xAA214025,跑回=0,攻击=0xAA214009,攻击B=0xAA214009}
SuoyouModel["蝴蝶仙子_饰品"]={站立=0xAA214012,行走=0xAA214017,待战=0xAA214012,挨打=0xAA214011,防御=0xAA214013,施法=0xAA214015,倒地=0xAA214016,跑去=0xAA214017,跑回=0,攻击=0xAA214014,攻击B=0xAA214014}
SuoyouModel["花铃"]     ={站立=0xAA214104,行走=0xAA214124,待战=0xAA214104,挨打=0xAA214102,防御=0xAA214106,施法=0xAA214118,倒地=0xAA214121,跑去=0xAA214124,跑回=0,攻击=0xAA214108,攻击B=0xAA214108,小图标=0xAA214100,大图标=0xAA214101,对话头像=0xAA214123}
SuoyouModel["花铃_装饰"]={站立=0xAA214105,行走=0xAA214125,待战=0xAA214105,挨打=0xAA214103,防御=0xAA214107,施法=0xAA214119,倒地=0xAA214122,跑去=0xAA214125,跑回=0,攻击=0xAA214109,攻击B=0xAA214109}
SuoyouModel["花铃_饰品"]={站立=0xAA214112,行走=0xAA214117,待战=0xAA214112,挨打=0xAA214111,防御=0xAA214113,施法=0xAA214115,倒地=0xAA214116,跑去=0xAA214117,跑回=0,攻击=0xAA214114,攻击B=0xAA214114}
SuoyouModel["金饶僧"]     ={站立=0xAA214204,行走=0xAA214224,待战=0xAA214204,挨打=0xAA214202,防御=0xAA214206,施法=0xAA214218,倒地=0xAA214221,跑去=0xAA214224,跑回=0,攻击=0xAA214208,攻击B=0xAA214208,小图标=0xAA214200,大图标=0xAA214201,对话头像=0xAA214223}
SuoyouModel["金饶僧_装饰"]={站立=0xAA214205,行走=0xAA214225,待战=0xAA214205,挨打=0xAA214203,防御=0xAA214207,施法=0xAA214219,倒地=0xAA214222,跑去=0xAA214225,跑回=0,攻击=0xAA214209,攻击B=0xAA214209}
SuoyouModel["金饶僧_饰品"]={站立=0xAA214212,行走=0xAA214217,待战=0xAA214212,挨打=0xAA214211,防御=0xAA214213,施法=0xAA214215,倒地=0xAA214216,跑去=0xAA214217,跑回=0,攻击=0xAA214214,攻击B=0xAA214214}
SuoyouModel["巨石守卫夜"]     ={站立=0xAA214304,行走=0xAA214324,待战=0xAA214304,挨打=0xAA214302,防御=0xAA214306,施法=0xAA214318,倒地=0xAA214321,跑去=0xAA214324,跑回=0,攻击=0xAA214308,攻击B=0xAA214308,小图标=0xAA214300,大图标=0xAA214301,对话头像=0xAA214323}
SuoyouModel["巨石守卫夜_装饰"]={站立=0xAA214305,行走=0xAA214325,待战=0xAA214305,挨打=0xAA214303,防御=0xAA214307,施法=0xAA214319,倒地=0xAA214322,跑去=0xAA214325,跑回=0,攻击=0xAA214309,攻击B=0xAA214309}
SuoyouModel["巨石守卫夜_饰品"]={站立=0xAA214312,行走=0xAA214317,待战=0xAA214312,挨打=0xAA214311,防御=0xAA214313,施法=0xAA214315,倒地=0xAA214316,跑去=0xAA214317,跑回=0,攻击=0xAA214314,攻击B=0xAA214314}
SuoyouModel["巨石守卫昼"]     ={站立=0xAA214404,行走=0xAA214424,待战=0xAA214404,挨打=0xAA214402,防御=0xAA214406,施法=0xAA214418,倒地=0xAA214421,跑去=0xAA214424,跑回=0,攻击=0xAA214408,攻击B=0xAA214408,小图标=0xAA214400,大图标=0xAA214401,对话头像=0xAA214423}
SuoyouModel["巨石守卫昼_装饰"]={站立=0xAA214405,行走=0xAA214425,待战=0xAA214405,挨打=0xAA214403,防御=0xAA214407,施法=0xAA214419,倒地=0xAA214422,跑去=0xAA214425,跑回=0,攻击=0xAA214409,攻击B=0xAA214409}
SuoyouModel["巨石守卫昼_饰品"]={站立=0xAA214412,行走=0xAA214417,待战=0xAA214412,挨打=0xAA214411,防御=0xAA214413,施法=0xAA214415,倒地=0xAA214416,跑去=0xAA214417,跑回=0,攻击=0xAA214414,攻击B=0xAA214414}
SuoyouModel["炼丹童子"]     ={站立=0xAA214504,行走=0xAA214524,待战=0xAA214504,挨打=0xAA214502,防御=0xAA214506,施法=0xAA214518,倒地=0xAA214521,跑去=0xAA214524,跑回=0,攻击=0xAA214508,攻击B=0xAA214508,小图标=0xAA214500,大图标=0xAA214501,对话头像=0xAA214523}
SuoyouModel["炼丹童子_装饰"]={站立=0xAA214505,行走=0xAA214525,待战=0xAA214505,挨打=0xAA214503,防御=0xAA214507,施法=0xAA214519,倒地=0xAA214522,跑去=0xAA214525,跑回=0,攻击=0xAA214509,攻击B=0xAA214509}
SuoyouModel["炼丹童子_饰品"]={站立=0xAA214512,行走=0xAA214517,待战=0xAA214512,挨打=0xAA214511,防御=0xAA214513,施法=0xAA214515,倒地=0xAA214516,跑去=0xAA214517,跑回=0,攻击=0xAA214514,攻击B=0xAA214514}
SuoyouModel["灵灯侍者"]     ={站立=0xAA214604,行走=0xAA214624,待战=0xAA214604,挨打=0xAA214602,防御=0xAA214606,施法=0xAA214618,倒地=0xAA214621,跑去=0xAA214624,跑回=0,攻击=0xAA214608,攻击B=0xAA214608,小图标=0xAA214600,大图标=0xAA214601,对话头像=0xAA214623}
SuoyouModel["灵灯侍者_装饰"]={站立=0xAA214605,行走=0xAA214625,待战=0xAA214605,挨打=0xAA214603,防御=0xAA214607,施法=0xAA214619,倒地=0xAA214622,跑去=0xAA214625,跑回=0,攻击=0xAA214609,攻击B=0xAA214609}
SuoyouModel["灵灯侍者_饰品"]={站立=0xAA214612,行走=0xAA214617,待战=0xAA214612,挨打=0xAA214611,防御=0xAA214613,施法=0xAA214615,倒地=0xAA214616,跑去=0xAA214617,跑回=0,攻击=0xAA214614,攻击B=0xAA214614}
SuoyouModel["魔化毗舍童子"]     ={站立=0xAA214704,行走=0xAA214724,待战=0xAA214704,挨打=0xAA214702,防御=0xAA214706,施法=0xAA214718,倒地=0xAA214721,跑去=0xAA214724,跑回=0,攻击=0xAA214708,攻击B=0xAA214708,小图标=0xAA214700,大图标=0xAA214701,对话头像=0xAA214723}
SuoyouModel["魔化毗舍童子_装饰"]={站立=0xAA214705,行走=0xAA214725,待战=0xAA214705,挨打=0xAA214703,防御=0xAA214707,施法=0xAA214719,倒地=0xAA214722,跑去=0xAA214725,跑回=0,攻击=0xAA214709,攻击B=0xAA214709}
SuoyouModel["魔化毗舍童子_饰品"]={站立=0xAA214712,行走=0xAA214717,待战=0xAA214712,挨打=0xAA214711,防御=0xAA214713,施法=0xAA214715,倒地=0xAA214716,跑去=0xAA214717,跑回=0,攻击=0xAA214714,攻击B=0xAA214714}
SuoyouModel["日游神"]     ={站立=0xAA214804,行走=0xAA214824,待战=0xAA214804,挨打=0xAA214802,防御=0xAA214806,施法=0xAA214818,倒地=0xAA214821,跑去=0xAA214824,跑回=0,攻击=0xAA214808,攻击B=0xAA214808,小图标=0xAA214800,大图标=0xAA214801,对话头像=0xAA214823}
SuoyouModel["日游神_装饰"]={站立=0xAA214805,行走=0xAA214825,待战=0xAA214805,挨打=0xAA214803,防御=0xAA214807,施法=0xAA214819,倒地=0xAA214822,跑去=0xAA214825,跑回=0,攻击=0xAA214809,攻击B=0xAA214809}
SuoyouModel["日游神_饰品"]={站立=0xAA214812,行走=0xAA214817,待战=0xAA214812,挨打=0xAA214811,防御=0xAA214813,施法=0xAA214815,倒地=0xAA214816,跑去=0xAA214817,跑回=0,攻击=0xAA214814,攻击B=0xAA214814}
SuoyouModel["无常鬼差白"]     ={站立=0xAA214904,行走=0xAA214924,待战=0xAA214904,挨打=0xAA214902,防御=0xAA214906,施法=0xAA214918,倒地=0xAA214921,跑去=0xAA214924,跑回=0,攻击=0xAA214908,攻击B=0xAA214908,小图标=0xAA214900,大图标=0xAA214901,对话头像=0xAA214923}
SuoyouModel["无常鬼差白_装饰"]={站立=0xAA214905,行走=0xAA214925,待战=0xAA214905,挨打=0xAA214903,防御=0xAA214907,施法=0xAA214919,倒地=0xAA214922,跑去=0xAA214925,跑回=0,攻击=0xAA214909,攻击B=0xAA214909}
SuoyouModel["无常鬼差白_饰品"]={站立=0xAA214912,行走=0xAA214917,待战=0xAA214912,挨打=0xAA214911,防御=0xAA214913,施法=0xAA214915,倒地=0xAA214916,跑去=0xAA214917,跑回=0,攻击=0xAA214914,攻击B=0xAA214914}
SuoyouModel["无常鬼差黑"]     ={站立=0xAA215004,行走=0xAA215024,待战=0xAA215004,挨打=0xAA215002,防御=0xAA215006,施法=0xAA215018,倒地=0xAA215021,跑去=0xAA215024,跑回=0,攻击=0xAA215008,攻击B=0xAA215008,小图标=0xAA215000,大图标=0xAA215001,对话头像=0xAA215023}
SuoyouModel["无常鬼差黑_装饰"]={站立=0xAA215005,行走=0xAA215025,待战=0xAA215005,挨打=0xAA215003,防御=0xAA215007,施法=0xAA215019,倒地=0xAA215022,跑去=0xAA215025,跑回=0,攻击=0xAA215009,攻击B=0xAA215009}
SuoyouModel["无常鬼差黑_饰品"]={站立=0xAA215012,行走=0xAA215017,待战=0xAA215012,挨打=0xAA215011,防御=0xAA215013,施法=0xAA215015,倒地=0xAA215016,跑去=0xAA215017,跑回=0,攻击=0xAA215014,攻击B=0xAA215014}
SuoyouModel["玄珠灵仙"]     ={站立=0xAA215104,行走=0xAA215124,待战=0xAA215104,挨打=0xAA215102,防御=0xAA215106,施法=0xAA215118,倒地=0xAA215121,跑去=0xAA215124,跑回=0,攻击=0xAA215108,攻击B=0xAA215108,小图标=0xAA215100,大图标=0xAA215101,对话头像=0xAA215123}
SuoyouModel["玄珠灵仙_装饰"]={站立=0xAA215105,行走=0xAA215125,待战=0xAA215105,挨打=0xAA215103,防御=0xAA215107,施法=0xAA215119,倒地=0xAA215122,跑去=0xAA215125,跑回=0,攻击=0xAA215109,攻击B=0xAA215109}
SuoyouModel["玄珠灵仙_饰品"]={站立=0xAA215112,行走=0xAA215117,待战=0xAA215112,挨打=0xAA215111,防御=0xAA215113,施法=0xAA215115,倒地=0xAA215116,跑去=0xAA215117,跑回=0,攻击=0xAA215114,攻击B=0xAA215114}
SuoyouModel["炎魔神"]     ={站立=0xAA215204,行走=0xAA215224,待战=0xAA215204,挨打=0xAA215202,防御=0xAA215206,施法=0xAA215218,倒地=0xAA215221,跑去=0xAA215224,跑回=0,攻击=0xAA215208,攻击B=0xAA215208,小图标=0xAA215200,大图标=0xAA215201,对话头像=0xAA215223}
SuoyouModel["炎魔神_装饰"]={站立=0xAA215205,行走=0xAA215225,待战=0xAA215205,挨打=0xAA215203,防御=0xAA215207,施法=0xAA215219,倒地=0xAA215222,跑去=0xAA215225,跑回=0,攻击=0xAA215209,攻击B=0xAA215209}
SuoyouModel["炎魔神_饰品"]={站立=0xAA215212,行走=0xAA215217,待战=0xAA215212,挨打=0xAA215211,防御=0xAA215213,施法=0xAA215215,倒地=0xAA215216,跑去=0xAA215217,跑回=0,攻击=0xAA215214,攻击B=0xAA215214}
SuoyouModel["野猪精"]     ={站立=0xAA215304,行走=0xAA215324,待战=0xAA215304,挨打=0xAA215302,防御=0xAA215306,施法=0xAA215318,倒地=0xAA215321,跑去=0xAA215324,跑回=0,攻击=0xAA215308,攻击B=0xAA215308,小图标=0xAA215300,大图标=0xAA215301,对话头像=0xAA215323}
SuoyouModel["野猪精_装饰"]={站立=0xAA215305,行走=0xAA215325,待战=0xAA215305,挨打=0xAA215303,防御=0xAA215307,施法=0xAA215319,倒地=0xAA215322,跑去=0xAA215325,跑回=0,攻击=0xAA215309,攻击B=0xAA215309}
SuoyouModel["野猪精_饰品"]={站立=0xAA215312,行走=0xAA215317,待战=0xAA215312,挨打=0xAA215311,防御=0xAA215313,施法=0xAA215315,倒地=0xAA215316,跑去=0xAA215317,跑回=0,攻击=0xAA215314,攻击B=0xAA215314}
SuoyouModel["夜游神"]     ={站立=0xAA215404,行走=0xAA215424,待战=0xAA215404,挨打=0xAA215402,防御=0xAA215406,施法=0xAA215418,倒地=0xAA215421,跑去=0xAA215424,跑回=0,攻击=0xAA215408,攻击B=0xAA215408,小图标=0xAA215400,大图标=0xAA215401,对话头像=0xAA215423}
SuoyouModel["夜游神_装饰"]={站立=0xAA215405,行走=0xAA215425,待战=0xAA215405,挨打=0xAA215403,防御=0xAA215407,施法=0xAA215419,倒地=0xAA215422,跑去=0xAA215425,跑回=0,攻击=0xAA215409,攻击B=0xAA215409}
SuoyouModel["夜游神_饰品"]={站立=0xAA215412,行走=0xAA215417,待战=0xAA215412,挨打=0xAA215411,防御=0xAA215413,施法=0xAA215415,倒地=0xAA215416,跑去=0xAA215417,跑回=0,攻击=0xAA215414,攻击B=0xAA215414}
SuoyouModel["幽灵"]     ={站立=0xAA215504,行走=0xAA215524,待战=0xAA215504,挨打=0xAA215502,防御=0xAA215506,施法=0xAA215518,倒地=0xAA215521,跑去=0xAA215524,跑回=0,攻击=0xAA215508,攻击B=0xAA215508,小图标=0xAA215500,大图标=0xAA215501,对话头像=0xAA215523}
SuoyouModel["幽灵_装饰"]={站立=0xAA215505,行走=0xAA215525,待战=0xAA215505,挨打=0xAA215503,防御=0xAA215507,施法=0xAA215519,倒地=0xAA215522,跑去=0xAA215525,跑回=0,攻击=0xAA215509,攻击B=0xAA215509}
SuoyouModel["幽灵_饰品"]={站立=0xAA215512,行走=0xAA215517,待战=0xAA215512,挨打=0xAA215511,防御=0xAA215513,施法=0xAA215515,倒地=0xAA215516,跑去=0xAA215517,跑回=0,攻击=0xAA215514,攻击B=0xAA215514}
SuoyouModel["有苏鸩"]     ={站立=0xAA215604,行走=0xAA215624,待战=0xAA215604,挨打=0xAA215602,防御=0xAA215606,施法=0xAA215618,倒地=0xAA215621,跑去=0xAA215624,跑回=0,攻击=0xAA215608,攻击B=0xAA215608,小图标=0xAA215600,大图标=0xAA215601,对话头像=0xAA215623}
SuoyouModel["有苏鸩_装饰"]={站立=0xAA215605,行走=0xAA215625,待战=0xAA215605,挨打=0xAA215603,防御=0xAA215607,施法=0xAA215619,倒地=0xAA215622,跑去=0xAA215625,跑回=0,攻击=0xAA215609,攻击B=0xAA215609}
SuoyouModel["有苏鸩_饰品"]={站立=0xAA215612,行走=0xAA215617,待战=0xAA215612,挨打=0xAA215611,防御=0xAA215613,施法=0xAA215615,倒地=0xAA215616,跑去=0xAA215617,跑回=0,攻击=0xAA215614,攻击B=0xAA215614}
SuoyouModel["月魅"]     ={站立=0xAA215704,行走=0xAA215724,待战=0xAA215704,挨打=0xAA215702,防御=0xAA215706,施法=0xAA215718,倒地=0xAA215721,跑去=0xAA215724,跑回=0,攻击=0xAA215708,攻击B=0xAA215708,小图标=0xAA215700,大图标=0xAA215701,对话头像=0xAA215723}
SuoyouModel["月魅_装饰"]={站立=0xAA215705,行走=0xAA215725,待战=0xAA215705,挨打=0xAA215703,防御=0xAA215707,施法=0xAA215719,倒地=0xAA215722,跑去=0xAA215725,跑回=0,攻击=0xAA215709,攻击B=0xAA215709}
SuoyouModel["月魅_饰品"]={站立=0xAA215712,行走=0xAA215717,待战=0xAA215712,挨打=0xAA215711,防御=0xAA215713,施法=0xAA215715,倒地=0xAA215716,跑去=0xAA215717,跑回=0,攻击=0xAA215714,攻击B=0xAA215714}
SuoyouModel["月影仙"]     ={站立=0xAA215804,行走=0xAA215824,待战=0xAA215804,挨打=0xAA215802,防御=0xAA215806,施法=0xAA215818,倒地=0xAA215821,跑去=0xAA215824,跑回=0,攻击=0xAA215808,攻击B=0xAA215808,小图标=0xAA215800,大图标=0xAA215801,对话头像=0xAA215823}
SuoyouModel["月影仙_装饰"]={站立=0xAA215805,行走=0xAA215825,待战=0xAA215805,挨打=0xAA215803,防御=0xAA215807,施法=0xAA215819,倒地=0xAA215822,跑去=0xAA215825,跑回=0,攻击=0xAA215809,攻击B=0xAA215809}
SuoyouModel["月影仙_饰品"]={站立=0xAA215812,行走=0xAA215817,待战=0xAA215812,挨打=0xAA215811,防御=0xAA215813,施法=0xAA215815,倒地=0xAA215816,跑去=0xAA215817,跑回=0,攻击=0xAA215814,攻击B=0xAA215814}
SuoyouModel["云游火"]     ={站立=0xAA215904,行走=0xAA215924,待战=0xAA215904,挨打=0xAA215902,防御=0xAA215906,施法=0xAA215918,倒地=0xAA215921,跑去=0xAA215924,跑回=0,攻击=0xAA215908,攻击B=0xAA215908,小图标=0xAA215900,大图标=0xAA215901,对话头像=0xAA215923}
SuoyouModel["云游火_装饰"]={站立=0xAA215905,行走=0xAA215925,待战=0xAA215905,挨打=0xAA215903,防御=0xAA215907,施法=0xAA215919,倒地=0xAA215922,跑去=0xAA215925,跑回=0,攻击=0xAA215909,攻击B=0xAA215909}
SuoyouModel["云游火_饰品"]={站立=0xAA215912,行走=0xAA215917,待战=0xAA215912,挨打=0xAA215911,防御=0xAA215913,施法=0xAA215915,倒地=0xAA215916,跑去=0xAA215917,跑回=0,攻击=0xAA215914,攻击B=0xAA215914}
SuoyouModel["增长巡守"]     ={站立=0xAA216004,行走=0xAA216024,待战=0xAA216004,挨打=0xAA216002,防御=0xAA216006,施法=0xAA216018,倒地=0xAA216021,跑去=0xAA216024,跑回=0,攻击=0xAA216008,攻击B=0xAA216008,小图标=0xAA216000,大图标=0xAA216001,对话头像=0xAA216023}
SuoyouModel["增长巡守_装饰"]={站立=0xAA216005,行走=0xAA216025,待战=0xAA216005,挨打=0xAA216003,防御=0xAA216007,施法=0xAA216019,倒地=0xAA216022,跑去=0xAA216025,跑回=0,攻击=0xAA216009,攻击B=0xAA216009}
SuoyouModel["增长巡守_饰品"]={站立=0xAA216012,行走=0xAA216017,待战=0xAA216012,挨打=0xAA216011,防御=0xAA216013,施法=0xAA216015,倒地=0xAA216016,跑去=0xAA216017,跑回=0,攻击=0xAA216014,攻击B=0xAA216014}
SuoyouModel["雨师妾"]       ={站立=0x01010003,行走=0x01010011,待战=0x01010003,挨打=0x01010002,防御=0x01010004,施法=0x01010007,倒地=0x01010009,跑去=0x01010011,跑回=0,攻击=0x01010005,攻击B=0x01010005,小图标=0x01010000,大图标=0x01010001,对话头像=0x01010010}
--中头
SuoyouModel["超级鲲鹏"]     ={站立=0x01010015,行走=0x01010023,待战=0x01010015,挨打=0x01010014,防御=0x01010016,施法=0x01010019,倒地=0x01010021,跑去=0x01010023,跑回=0,攻击=0x01010017,攻击B=0x01010017,小图标=0x01010012,大图标=0x01010013,对话头像=0x01010022}
SuoyouModel["进阶超级鲲鹏"]     ={站立=0x01010015,行走=0x01010023,待战=0x01010015,挨打=0x01010014,防御=0x01010016,施法=0x01010019,倒地=0x01010021,跑去=0x01010023,跑回=0,攻击=0x01010017,攻击B=0x01010017,小图标=0x01010012,大图标=0x01010013,对话头像=0x01010022}
SuoyouModel["天机虫"]       ={站立=0x01010027,行走=0x01010035,待战=0x01010027,挨打=0x01010026,防御=0x01010028,施法=0x01010031,倒地=0x01010033,跑去=0x01010035,跑回=0,攻击=0x01010029,攻击B=0x01010029,小图标=0x01010024,大图标=0x01010025,对话头像=0x01010034}
SuoyouModel["天将"]         ={站立=0x01010039,行走=0x01010047,待战=0x01010039,挨打=0x01010038,防御=0x01010040,施法=0x01010043,倒地=0x01010045,跑去=0x01010047,跑回=0,攻击=0x01010041,攻击B=0x01010041,小图标=0x01010036,大图标=0x01010037,对话头像=0x01010046}
SuoyouModel["程咬金"]     ={站立=0x01010051,行走=0x01010059,待战=0x01010051,挨打=0x01010050,防御=0x01010052,施法=0x01010055,倒地=0x01010057,跑去=0x01010059,跑回=0,攻击=0x01010053,攻击B=0x01010053,小图标=0x01010048,大图标=0x01010049,对话头像=0x01010058}
SuoyouModel["男人_程咬金"]     ={站立=0x01010051,行走=0x01010059,待战=0x01010051,挨打=0x01010050,防御=0x01010052,施法=0x01010055,倒地=0x01010057,跑去=0x01010059,跑回=0,攻击=0x01010053,攻击B=0x01010053,小图标=0x01010048,大图标=0x01010049,对话头像=0x01010058}
SuoyouModel["元宝龟"]       ={站立=0x01010063,行走=0x01010071,待战=0x01010063,挨打=0x01010062,防御=0x01010064,施法=0x01010067,倒地=0x01010069,跑去=0x01010071,跑回=0,攻击=0x01010065,攻击B=0x01010065,小图标=0x01010060,大图标=0x01010061,对话头像=0x01010070}
SuoyouModel["月光虫"]       ={站立=0x01010075,行走=0x01010083,待战=0x01010075,挨打=0x01010074,防御=0x01010076,施法=0x01010079,倒地=0x01010081,跑去=0x01010083,跑回=0,攻击=0x01010077,攻击B=0x01010077,小图标=0x01010072,大图标=0x01010073,对话头像=0x01010082}
SuoyouModel["月光金乌虫"]   ={站立=0x01010087,行走=0x01010095,待战=0x01010087,挨打=0x01010086,防御=0x01010088,施法=0x01010091,倒地=0x01010093,跑去=0x01010095,跑回=0,攻击=0x01010089,攻击B=0x01010089,小图标=0x01010084,大图标=0x01010085,对话头像=0x01010094}
SuoyouModel["月光雪蛙"]     ={站立=0x01010099,行走=0x01010107,待战=0x01010099,挨打=0x01010098,防御=0x01010100,施法=0x01010103,倒地=0x01010105,跑去=0x01010107,跑回=0,攻击=0x01010101,攻击B=0x01010101,小图标=0x01010096,大图标=0x01010097,对话头像=0x01010106}
SuoyouModel["云龟"]         ={站立=0x01010111,行走=0x01010119,待战=0x01010111,挨打=0x01010110,防御=0x01010112,施法=0x01010115,倒地=0x01010117,跑去=0x01010119,跑回=0,攻击=0x01010113,攻击B=0x01010113,小图标=0x01010108,大图标=0x01010109,对话头像=0x01010118}
SuoyouModel["红衣女鬼"]     ={站立=0x01010123,行走=0x01010131,待战=0x01010123,挨打=0x01010122,防御=0x01010124,施法=0x01010127,倒地=0x01010129,跑去=0x01010131,跑回=0,攻击=0x01010125,攻击B=0x01010125,小图标=0x01010120,大图标=0x01010121,对话头像=0x01010130}
--小中头像
SuoyouModel["薛礼"]         ={站立=0x01010135,行走=0x01010143,待战=0x01010135,挨打=0x01010134,防御=0x01010136,施法=0x01010139,倒地=0x01010141,跑去=0x01010143,跑回=0,攻击=0x01010137,攻击B=0x01010137,小图标=0x01010132,大图标=0x01010133,对话头像=0x01010142}
--小中头像
SuoyouModel["赌徒"]         ={站立=0x01010147,行走=0x01010154,待战=0x01010147,挨打=0x01010146,防御=0x01010148,施法=0x01010150,倒地=0x01010152,跑去=0x01010154,跑回=0,攻击=0x01010149,攻击B=0x01010149,小图标=0x01010144,大图标=0x01010145,对话头像=0x01010153}

SuoyouModel["龟丞相"]       ={站立=0x01010158,行走=0x01010165,待战=0x01010158,挨打=0x01010157,防御=0x01010159,施法=0x01010161,倒地=0x01010163,跑去=0x01010165,跑回=0,攻击=0x01010160,攻击B=0x01010160,小图标=0x01010155,大图标=0x01010156,对话头像=0x01010164}

SuoyouModel["虾兵"]         ={站立=0x01010169,行走=0x01010176,待战=0x01010169,挨打=0x01010168,防御=0x01010170,施法=0x01010172,倒地=0x01010174,跑去=0x01010176,跑回=0,攻击=0x01010171,攻击B=0x01010171,小图标=0x01010166,大图标=0x01010167,对话头像=0x01010175}

SuoyouModel["黑熊"]         ={站立=0x01010180,行走=0x01010187,待战=0x01010180,挨打=0x01010179,防御=0x01010181,施法=0x01010184,倒地=0x01010185,跑去=0x01010187,跑回=0,攻击=0x01010182,攻击B=0x01010182,小图标=0x01010177,大图标=0x01010178,对话头像=0x01010186}

SuoyouModel["强盗"]         ={站立=0x01010191,行走=0x01010198,待战=0x01010191,挨打=0x01010190,防御=0x01010192,施法=0x01010195,倒地=0x01010196,跑去=0x01010198,跑回=0,攻击=0x01010193,攻击B=0x01010193,小图标=0x01010188,大图标=0x01010189,对话头像=0x01010197}

SuoyouModel["蜘蛛精"]       ={站立=0x01010202,行走=0x01010209,待战=0x01010202,挨打=0x01010201,防御=0x01010203,施法=0x01010206,倒地=0x01010207,跑去=0x01010209,跑回=0,攻击=0x01010204,攻击B=0x01010204,小图标=0x01010199,大图标=0x01010200,对话头像=0x01010208}

SuoyouModel["大海龟"]       ={站立=0x01010213,行走=0x01010219,待战=0x01010213,挨打=0x01010212,防御=0x01010214,施法=0x01010216,倒地=0x01010217,跑去=0x01010219,跑回=0,攻击=0x01010215,攻击B=0x01010215,小图标=0x01010210,大图标=0x01010211,对话头像=0x01010218}

SuoyouModel["蛤蟆精"]       ={站立=0x01010223,行走=0x01010229,待战=0x01010223,挨打=0x01010222,防御=0x01010224,施法=0x01010226,倒地=0x01010227,跑去=0x01010229,跑回=0,攻击=0x01010225,攻击B=0x01010225,小图标=0x01010220,大图标=0x01010221,对话头像=0x01010228}

SuoyouModel["海毛虫"]       ={站立=0x01010233,行走=0x01010239,待战=0x01010233,挨打=0x01010232,防御=0x01010234,施法=0x01010236,倒地=0x01010237,跑去=0x01010239,跑回=0,攻击=0x01010235,攻击B=0x01010235,小图标=0x01010230,大图标=0x01010231,对话头像=0x01010238}

SuoyouModel["黑熊精"]       ={站立=0x01010243,行走=0x01010249,待战=0x01010243,挨打=0x01010242,防御=0x01010244,施法=0x01010246,倒地=0x01010247,跑去=0x01010249,跑回=0,攻击=0x01010245,攻击B=0x01010245,小图标=0x01010240,大图标=0x01010241,对话头像=0x01010248}--

SuoyouModel["狐狸精"]       ={站立=0x01010253,行走=0x01010259,待战=0x01010253,挨打=0x01010252,防御=0x01010254,施法=0x01010256,倒地=0x01010257,跑去=0x01010259,跑回=0,攻击=0x01010255,攻击B=0x01010255,小图标=0x01010250,大图标=0x01010251,对话头像=0x01010258}

SuoyouModel["护卫"]         ={站立=0x01010263,行走=0x01010269,待战=0x01010263,挨打=0x01010262,防御=0x01010264,施法=0x01010266,倒地=0x01010267,跑去=0x01010269,跑回=0,攻击=0x01010265,攻击B=0x01010265,小图标=0x01010260,大图标=0x01010261,对话头像=0x01010268}

SuoyouModel["巨蛙"]         ={站立=0x01010273,行走=0x01010279,待战=0x01010273,挨打=0x01010272,防御=0x01010274,施法=0x01010276,倒地=0x01010277,跑去=0x01010279,跑回=0,攻击=0x01010275,攻击B=0x01010275,小图标=0x01010270,大图标=0x01010271,对话头像=0x01010278}

SuoyouModel["骷髅怪"]      ={站立=0x01010283,行走=0x01010289,待战=0x01010283,挨打=0x01010282,防御=0x01010284,施法=0x01010286,倒地=0x01010287,跑去=0x01010289,跑回=0,攻击=0x01010285,攻击B=0x01010285,小图标=0x01010280,大图标=0x01010281,对话头像=0x01010288}

SuoyouModel["连弩车"]       ={站立=0x01010293,行走=0x01010299,待战=0x01010293,挨打=0x01010292,防御=0x01010294,施法=0x01010296,倒地=0x01010297,跑去=0x01010299,跑回=0,攻击=0x01010295,攻击B=0x01010295,小图标=0x01010290,大图标=0x01010291,对话头像=0x01010298}

SuoyouModel["牛妖"]         ={站立=0x01010303,行走=0x01010309,待战=0x01010303,挨打=0x01010302,防御=0x01010304,施法=0x01010306,倒地=0x01010307,跑去=0x01010309,跑回=0,攻击=0x01010305,攻击B=0x01010305,小图标=0x01010300,大图标=0x01010301,对话头像=0x01010308}

SuoyouModel["山贼"]         ={站立=0x01010313,行走=0x01010319,待战=0x01010313,挨打=0x01010312,防御=0x01010314,施法=0x01010316,倒地=0x01010317,跑去=0x01010319,跑回=0,攻击=0x01010315,攻击B=0x01010315,小图标=0x01010310,大图标=0x01010311,对话头像=0x01010318}

SuoyouModel["树怪"]         ={站立=0x01010323,行走=0x01010329,待战=0x01010323,挨打=0x01010322,防御=0x01010324,施法=0x01010326,倒地=0x01010327,跑去=0x01010329,跑回=0,攻击=0x01010325,攻击B=0x01010325,小图标=0x01010320,大图标=0x01010321,对话头像=0x01010328}

SuoyouModel["蟹将"]         ={站立=0x01010333,行走=0x01010339,待战=0x01010333,挨打=0x01010332,防御=0x01010334,施法=0x01010336,倒地=0x01010337,跑去=0x01010339,跑回=0,攻击=0x01010335,攻击B=0x01010335,小图标=0x01010330,大图标=0x01010331,对话头像=0x01010338}

SuoyouModel["兔子怪"]       ={站立=0x01010359,行走=0x01010369,待战=0x01010359,挨打=0x01010357,防御=0x01010360,施法=0x01010364,倒地=0x01010366,跑去=0x01010369,跑回=0,攻击=0x01010362,攻击B=0x01010362,小图标=0x01010355,大图标=0x01010356,对话头像=0x01010368}
SuoyouModel["兔子怪_装饰"]  ={站立=0x01010359,行走=0x01010370,待战=0x01010359,挨打=0x01010358,防御=0x01010361,施法=0x01010365,倒地=0x01010367,跑去=0x01010370,跑回=0,攻击=0x01010363,攻击B=0x01010363}

SuoyouModel["善财童子"]     ={站立=0x01010375,行走=0x01010386,待战=0x01010375,挨打=0x01010357,防御=0x01010373,施法=0x01010381,倒地=0x01010383,跑去=0x01010386,跑回=0,攻击=0x01010379,攻击B=0x01010379,小图标=0x01010371,大图标=0x01010372,对话头像=0x01010385}
SuoyouModel["善财童子_装饰"]={站立=0x01010376,行走=0x01010387,待战=0x01010376,挨打=0x01010358,防御=0x01010374,施法=0x01010382,倒地=0x01010384,跑去=0x01010387,跑回=0,攻击=0x01010380,攻击B=0x01010380}
SuoyouModel["进阶善财童子"]     ={站立=0x01010375,行走=0x01010386,待战=0x01010375,挨打=0x01010357,防御=0x01010373,施法=0x01010381,倒地=0x01010383,跑去=0x01010386,跑回=0,攻击=0x01010379,攻击B=0x01010379,小图标=0x01010371,大图标=0x01010372,对话头像=0x01010385}
SuoyouModel["进阶善财童子_装饰"]={站立=0x01010376,行走=0x01010387,待战=0x01010376,挨打=0x01010358,防御=0x01010374,施法=0x01010382,倒地=0x01010384,跑去=0x01010387,跑回=0,攻击=0x01010380,攻击B=0x01010380}

SuoyouModel["小龙女"]       ={站立=0x01010392,行走=0x01010403,待战=0x01010392,挨打=0x01010390,防御=0x01010394,施法=0x01010398,倒地=0x01010400,跑去=0x01010403,跑回=0,攻击=0x01010396,攻击B=0x01010396,小图标=0x01010388,大图标=0x01010389,对话头像=0x01010402}
SuoyouModel["小龙女_装饰"]  ={站立=0x01010393,行走=0x01010404,待战=0x01010393,挨打=0x01010391,防御=0x01010395,施法=0x01010399,倒地=0x01010401,跑去=0x01010404,跑回=0,攻击=0x01010397,攻击B=0x01010397}

SuoyouModel["小精灵"]       ={站立=0x01010409,行走=0x01010421,待战=0x01010409,挨打=0x01010407,防御=0x01010411,施法=0x01010415,倒地=0x01010418,跑去=0x01010421,跑回=0,攻击=0x01010413,攻击B=0x01010413,小图标=0x01010405,大图标=0x01010406,对话头像=0x01010420}
SuoyouModel["小精灵_装饰"]  ={站立=0x01010410,行走=0x01010422,待战=0x01010410,挨打=0x01010408,防御=0x01010412,施法=0x01010416,倒地=0x01010419,跑去=0x01010422,跑回=0,攻击=0x01010414,攻击B=0x01010414}

SuoyouModel["小毛头"]       ={站立=0x01010427,行走=0x01010439,待战=0x01010427,挨打=0x01010425,防御=0x01010429,施法=0x01010433,倒地=0x01010436,跑去=0x01010439,跑回=0,攻击=0x01010431,攻击B=0x01010431,小图标=0x01010423,大图标=0x01010424,对话头像=0x01010438}
SuoyouModel["小毛头_装饰"]  ={站立=0x01010428,行走=0x01010440,待战=0x01010428,挨打=0x01010426,防御=0x01010430,施法=0x01010434,倒地=0x01010437,跑去=0x01010440,跑回=0,攻击=0x01010432,攻击B=0x01010432}

SuoyouModel["小魔头"]       ={站立=0x01010445,行走=0x01010457,待战=0x01010445,挨打=0x01010443,防御=0x01010447,施法=0x01010451,倒地=0x01010454,跑去=0x01010457,跑回=0,攻击=0x01010449,攻击B=0x01010449,小图标=0x01010441,大图标=0x01010442,对话头像=0x01010456}
SuoyouModel["小魔头_装饰"]  ={站立=0x01010446,行走=0x01010458,待战=0x01010446,挨打=0x01010444,防御=0x01010448,施法=0x01010452,倒地=0x01010455,跑去=0x01010458,跑回=0,攻击=0x01010450,攻击B=0x01010450}

SuoyouModel["小丫丫"]       ={站立=0x01010463,行走=0x01010475,待战=0x01010463,挨打=0x01010461,防御=0x01010465,施法=0x01010469,倒地=0x01010472,跑去=0x01010475,跑回=0,攻击=0x01010467,攻击B=0x01010467,小图标=0x01010459,大图标=0x01010460,对话头像=0x01010474}
SuoyouModel["小丫丫_装饰"]  ={站立=0x01010464,行走=0x01010476,待战=0x01010464,挨打=0x01010462,防御=0x01010466,施法=0x01010470,倒地=0x01010473,跑去=0x01010476,跑回=0,攻击=0x01010468,攻击B=0x01010468}

SuoyouModel["鬼火狸"]       ={站立=0x01010481,行走=0x01010494,待战=0x01010481,挨打=0x01010479,防御=0x01010483,施法=0x01010488,倒地=0x01010491,跑去=0x01010494,跑回=0,攻击=0x01010485,攻击B=0x01010485,小图标=0x01010477,大图标=0x01010478,对话头像=0x01010493}
SuoyouModel["鬼火狸_装饰"]  ={站立=0x01010482,行走=0x01010495,待战=0x01010482,挨打=0x01010480,防御=0x01010484,施法=0x01010489,倒地=0x01010492,跑去=0x01010495,跑回=0,攻击=0x01010486,攻击B=0x01010486}

SuoyouModel["小仙灵"]       ={站立=0x01010500,行走=0x01010513,待战=0x01010500,挨打=0x01010498,防御=0x01010502,施法=0x01010507,倒地=0x01010510,跑去=0x01010513,跑回=0,攻击=0x01010504,攻击B=0x01010504,小图标=0x01010496,大图标=0x01010497,对话头像=0x01010512}
SuoyouModel["小仙灵_装饰"]  ={站立=0x01010501,行走=0x01010514,待战=0x01010501,挨打=0x01010499,防御=0x01010503,施法=0x01010508,倒地=0x01010511,跑去=0x01010514,跑回=0,攻击=0x01010505,攻击B=0x01010505}

SuoyouModel["小仙女"]       ={站立=0x01010519,行走=0x01010532,待战=0x01010519,挨打=0x01010517,防御=0x01010521,施法=0x01010526,倒地=0x01010529,跑去=0x01010532,跑回=0,攻击=0x01010523,攻击B=0x01010523,小图标=0x01010515,大图标=0x01010516,对话头像=0x01010531}
SuoyouModel["小仙女_装饰"]  ={站立=0x01010520,行走=0x01010533,待战=0x01010520,挨打=0x01010518,防御=0x01010522,施法=0x01010527,倒地=0x01010530,跑去=0x01010533,跑回=0,攻击=0x01010524,攻击B=0x01010524}

SuoyouModel["巴蛇"]         ={站立=0x01010544,行走=0x01010550,待战=0x01010544,挨打=0x01010543,防御=0x01010545,施法=0x01010547,倒地=0x01010548,跑去=0x01010550,跑回=0,攻击=0x01010546,攻击B=0x01010546,小图标=0x01010541,大图标=0x01010542,对话头像=0x01010549}
SuoyouModel["巴蛇_饰品"]    ={站立=0x01010535,行走=0x01010540,待战=0x01010535,挨打=0x01010534,防御=0x01010536,施法=0x01010538,倒地=0x01010539,跑去=0x01010540,跑回=0,攻击=0x01010537,攻击B=0x01010537}

SuoyouModel["白熊"]         ={站立=0x01010561,行走=0x01010567,待战=0x01010561,挨打=0x01010560,防御=0x01010562,施法=0x01010564,倒地=0x01010565,跑去=0x01010567,跑回=0,攻击=0x01010563,攻击B=0x01010563,小图标=0x01010558,大图标=0x01010559,对话头像=0x01010566}
SuoyouModel["白熊_饰品"]    ={站立=0x01010552,行走=0x01010557,待战=0x01010552,挨打=0x01010551,防御=0x01010553,施法=0x01010555,倒地=0x01010556,跑去=0x01010557,跑回=0,攻击=0x01010554,攻击B=0x01010554}

SuoyouModel["蚌精"]         ={站立=0x01010578,行走=0x01010584,待战=0x01010578,挨打=0x01010577,防御=0x01010579,施法=0x01010581,倒地=0x01010582,跑去=0x01010584,跑回=0,攻击=0x01010580,攻击B=0x01010580,小图标=0x01010575,大图标=0x01010576,对话头像=0x01010583}
SuoyouModel["蚌精_饰品"]    ={站立=0x01010569,行走=0x01010574,待战=0x01010569,挨打=0x01010568,防御=0x01010570,施法=0x01010572,倒地=0x01010573,跑去=0x01010574,跑回=0,攻击=0x01010571,攻击B=0x01010571}

SuoyouModel["碧水夜叉"]     ={站立=0x01010595,行走=0x01010601,待战=0x01010595,挨打=0x01010594,防御=0x01010596,施法=0x01010598,倒地=0x01010599,跑去=0x01010601,跑回=0,攻击=0x01010597,攻击B=0x01010597,小图标=0x01010592,大图标=0x01010593,对话头像=0x01010600}
SuoyouModel["碧水夜叉_饰品"]={站立=0x01010586,行走=0x01010591,待战=0x01010586,挨打=0x01010585,防御=0x01010587,施法=0x01010589,倒地=0x01010590,跑去=0x01010591,跑回=0,攻击=0x01010588,攻击B=0x01010588}

SuoyouModel["大蝙蝠"]       ={站立=0x01010612,行走=0x01010618,待战=0x01010612,挨打=0x01010611,防御=0x01010613,施法=0x01010615,倒地=0x01010616,跑去=0x01010618,跑回=0,攻击=0x01010614,攻击B=0x01010614,小图标=0x01010609,大图标=0x01010610,对话头像=0x01010617}
SuoyouModel["大蝙蝠_饰品"]  ={站立=0x01010603,行走=0x01010608,待战=0x01010603,挨打=0x01010602,防御=0x01010604,施法=0x01010606,倒地=0x01010607,跑去=0x01010608,跑回=0,攻击=0x01010605,攻击B=0x01010605}

SuoyouModel["凤凰"]         ={站立=0x01010629,行走=0x01010635,待战=0x01010629,挨打=0x01010628,防御=0x01010630,施法=0x01010632,倒地=0x01010633,跑去=0x01010635,跑回=0,攻击=0x01010631,攻击B=0x01010631,小图标=0x01010626,大图标=0x01010627,对话头像=0x01010634}
SuoyouModel["凤凰_饰品"]    ={站立=0x01010620,行走=0x01010625,待战=0x01010620,挨打=0x01010619,防御=0x01010621,施法=0x01010623,倒地=0x01010624,跑去=0x01010625,跑回=0,攻击=0x01010622,攻击B=0x01010622}

SuoyouModel["海星"]         ={站立=0x01010650,行走=0x01010656,待战=0x01010650,挨打=0x01010649,防御=0x01010651,施法=0x01010653,倒地=0x01010654,跑去=0x01010656,跑回=0,攻击=0x01010652,攻击B=0x01010652,小图标=0x01010647,大图标=0x01010648,对话头像=0x01010655}
SuoyouModel["海星_饰品"]    ={站立=0x01010641,行走=0x01010646,待战=0x01010641,挨打=0x01010640,防御=0x01010642,施法=0x01010644,倒地=0x01010645,跑去=0x01010646,跑回=0,攻击=0x01010643,攻击B=0x01010643}

SuoyouModel["画魂"]         ={站立=0x01010667,行走=0x01010673,待战=0x01010667,挨打=0x01010666,防御=0x01010668,施法=0x01010670,倒地=0x01010671,跑去=0x01010673,跑回=0,攻击=0x01010669,攻击B=0x01010669,小图标=0x01010664,大图标=0x01010665,对话头像=0x01010672}
SuoyouModel["画魂_饰品"]    ={站立=0x01010658,行走=0x01010663,待战=0x01010658,挨打=0x01010657,防御=0x01010659,施法=0x01010661,倒地=0x01010662,跑去=0x01010663,跑回=0,攻击=0x01010660,攻击B=0x01010660}

SuoyouModel["机关人车形"]       ={站立=0x01010684,行走=0x01010690,待战=0x01010684,挨打=0x01010683,防御=0x01010685,施法=0x01010687,倒地=0x01010688,跑去=0x01010690,跑回=0,攻击=0x01010686,攻击B=0x01010686,小图标=0x01010681,大图标=0x01010682,对话头像=0x01010689}
SuoyouModel["机关人车形_饰品"]  ={站立=0x01010675,行走=0x01010680,待战=0x01010675,挨打=0x01010674,防御=0x01010676,施法=0x01010678,倒地=0x01010679,跑去=0x01010680,跑回=0,攻击=0x01010677,攻击B=0x01010677}

SuoyouModel["机关鸟"]       ={站立=0x01010701,行走=0x01010707,待战=0x01010701,挨打=0x01010700,防御=0x01010702,施法=0x01010704,倒地=0x01010705,跑去=0x01010707,跑回=0,攻击=0x01010703,攻击B=0x01010703,小图标=0x01010698,大图标=0x01010699,对话头像=0x01010706}
SuoyouModel["机关鸟_饰品"]  ={站立=0x01010692,行走=0x01010697,待战=0x01010692,挨打=0x01010691,防御=0x01010693,施法=0x01010695,倒地=0x01010696,跑去=0x01010697,跑回=0,攻击=0x01010694,攻击B=0x01010694}

SuoyouModel["机关人人形"]       ={站立=0x01010718,行走=0x01010724,待战=0x01010718,挨打=0x01010717,防御=0x01010719,施法=0x01010721,倒地=0x01010722,跑去=0x01010724,跑回=0,攻击=0x01010720,攻击B=0x01010720,小图标=0x01010715,大图标=0x01010716,对话头像=0x01010723}
SuoyouModel["机关人人形_饰品"]  ={站立=0x01010709,行走=0x01010714,待战=0x01010709,挨打=0x01010708,防御=0x01010710,施法=0x01010712,倒地=0x01010713,跑去=0x01010714,跑回=0,攻击=0x01010711,攻击B=0x01010711}

SuoyouModel["机关兽"]       ={站立=0x01010735,行走=0x01010741,待战=0x01010735,挨打=0x01010734,防御=0x01010736,施法=0x01010738,倒地=0x01010739,跑去=0x01010741,跑回=0,攻击=0x01010737,攻击B=0x01010737,小图标=0x01010732,大图标=0x01010733,对话头像=0x01010740}
SuoyouModel["机关兽_饰品"]  ={站立=0x01010726,行走=0x01010731,待战=0x01010726,挨打=0x01010725,防御=0x01010727,施法=0x01010729,倒地=0x01010730,跑去=0x01010731,跑回=0,攻击=0x01010728,攻击B=0x01010728}

SuoyouModel["僵尸"]         ={站立=0x01010752,行走=0x01010758,待战=0x01010752,挨打=0x01010751,防御=0x01010753,施法=0x01010755,倒地=0x01010756,跑去=0x01010758,跑回=0,攻击=0x01010754,攻击B=0x01010754,小图标=0x01010749,大图标=0x01010750,对话头像=0x01010757}
SuoyouModel["僵尸_饰品"]    ={站立=0x01010743,行走=0x01010748,待战=0x01010743,挨打=0x01010742,防御=0x01010744,施法=0x01010746,倒地=0x01010747,跑去=0x01010748,跑回=0,攻击=0x01010745,攻击B=0x01010745}

SuoyouModel["鲛人"]         ={站立=0x01010769,行走=0x01010775,待战=0x01010769,挨打=0x01010768,防御=0x01010770,施法=0x01010772,倒地=0x01010773,跑去=0x01010775,跑回=0,攻击=0x01010771,攻击B=0x01010771,小图标=0x01010766,大图标=0x01010767,对话头像=0x01010774}
SuoyouModel["鲛人_饰品"]    ={站立=0x01010760,行走=0x01010765,待战=0x01010760,挨打=0x01010759,防御=0x01010761,施法=0x01010763,倒地=0x01010764,跑去=0x01010765,跑回=0,攻击=0x01010762,攻击B=0x01010762}

SuoyouModel["锦毛貂精"]     ={站立=0x01010786,行走=0x01010792,待战=0x01010786,挨打=0x01010785,防御=0x01010787,施法=0x01010789,倒地=0x01010790,跑去=0x01010792,跑回=0,攻击=0x01010788,攻击B=0x01010788,小图标=0x01010783,大图标=0x01010784,对话头像=0x01010791}
SuoyouModel["锦毛貂精_饰品"]={站立=0x01010777,行走=0x01010782,待战=0x01010777,挨打=0x01010776,防御=0x01010778,施法=0x01010780,倒地=0x01010781,跑去=0x01010782,跑回=0,攻击=0x01010779,攻击B=0x01010779}

SuoyouModel["净瓶女娲"]     ={站立=0x01010803,行走=0x01010809,待战=0x01010803,挨打=0x01010802,防御=0x01010804,施法=0x01010806,倒地=0x01010807,跑去=0x01010809,跑回=0,攻击=0x01010805,攻击B=0x01010805,小图标=0x01010800,大图标=0x01010801,对话头像=0x01010808}
SuoyouModel["净瓶女娲_饰品"]={站立=0x01010794,行走=0x01010799,待战=0x01010794,挨打=0x01010793,防御=0x01010795,施法=0x01010797,倒地=0x01010798,跑去=0x01010799,跑回=0,攻击=0x01010796,攻击B=0x01010796}

SuoyouModel["巨力神猿"]     ={站立=0x01010820,行走=0x01010826,待战=0x01010820,挨打=0x01010819,防御=0x01010821,施法=0x01010823,倒地=0x01010824,跑去=0x01010826,跑回=0,攻击=0x01010822,攻击B=0x01010822,小图标=0x01010817,大图标=0x01010818,对话头像=0x01010825}
SuoyouModel["巨力神猿_饰品"]={站立=0x01010811,行走=0x01010816,待战=0x01010811,挨打=0x01010810,防御=0x01010812,施法=0x01010814,倒地=0x01010815,跑去=0x01010816,跑回=0,攻击=0x01010813,攻击B=0x01010813}

SuoyouModel["狼"]           ={站立=0x01010837,行走=0x01010843,待战=0x01010837,挨打=0x01010836,防御=0x01010838,施法=0x01010840,倒地=0x01010841,跑去=0x01010843,跑回=0,攻击=0x01010839,攻击B=0x01010839,小图标=0x01010834,大图标=0x01010835,对话头像=0x01010842}
SuoyouModel["狼_饰品"]      ={站立=0x01010828,行走=0x01010833,待战=0x01010828,挨打=0x01010827,防御=0x01010829,施法=0x01010831,倒地=0x01010832,跑去=0x01010833,跑回=0,攻击=0x01010830,攻击B=0x01010830}

SuoyouModel["老虎"]         ={站立=0x01010854,行走=0x01010860,待战=0x01010854,挨打=0x01010853,防御=0x01010855,施法=0x01010857,倒地=0x01010858,跑去=0x01010860,跑回=0,攻击=0x01010856,攻击B=0x01010856,小图标=0x01010851,大图标=0x01010852,对话头像=0x01010859}
SuoyouModel["老虎_饰品"]    ={站立=0x01010845,行走=0x01010850,待战=0x01010845,挨打=0x01010844,防御=0x01010846,施法=0x01010848,倒地=0x01010849,跑去=0x01010850,跑回=0,攻击=0x01010847,攻击B=0x01010847}

SuoyouModel["雷鸟人"]       ={站立=0x01010871,行走=0x01010877,待战=0x01010871,挨打=0x01010870,防御=0x01010872,施法=0x01010874,倒地=0x01010875,跑去=0x01010877,跑回=0,攻击=0x01010873,攻击B=0x01010873,小图标=0x01010868,大图标=0x01010869,对话头像=0x01010876}
SuoyouModel["雷鸟人_饰品"]  ={站立=0x01010862,行走=0x01010867,待战=0x01010862,挨打=0x01010861,防御=0x01010863,施法=0x01010865,倒地=0x01010866,跑去=0x01010867,跑回=0,攻击=0x01010864,攻击B=0x01010864}

SuoyouModel["狸"]           ={站立=0x01010888,行走=0x01010894,待战=0x01010888,挨打=0x01010887,防御=0x01010889,施法=0x01010891,倒地=0x01010892,跑去=0x01010894,跑回=0,攻击=0x01010890,攻击B=0x01010890,小图标=0x01010885,大图标=0x01010886,对话头像=0x01010893}
SuoyouModel["狸_饰品"]      ={站立=0x01010879,行走=0x01010884,待战=0x01010879,挨打=0x01010878,防御=0x01010880,施法=0x01010882,倒地=0x01010883,跑去=0x01010884,跑回=0,攻击=0x01010881,攻击B=0x01010881}

SuoyouModel["灵符女娲"]     ={站立=0x01010905,行走=0x01010911,待战=0x01010905,挨打=0x01010904,防御=0x01010906,施法=0x01010908,倒地=0x01010909,跑去=0x01010911,跑回=0,攻击=0x01010907,攻击B=0x01010907,小图标=0x01010902,大图标=0x01010903,对话头像=0x01010910}
SuoyouModel["灵符女娲_饰品"]={站立=0x01010896,行走=0x01010901,待战=0x01010896,挨打=0x01010895,防御=0x01010897,施法=0x01010899,倒地=0x01010900,跑去=0x01010901,跑回=0,攻击=0x01010898,攻击B=0x01010898}

SuoyouModel["律法女娲"]     ={站立=0x01010922,行走=0x01010928,待战=0x01010922,挨打=0x01010921,防御=0x01010923,施法=0x01010925,倒地=0x01010926,跑去=0x01010928,跑回=0,攻击=0x01010924,攻击B=0x01010924,小图标=0x01010919,大图标=0x01010920,对话头像=0x01010927}
SuoyouModel["律法女娲_饰品"]={站立=0x01010913,行走=0x01010918,待战=0x01010913,挨打=0x01010912,防御=0x01010914,施法=0x01010916,倒地=0x01010917,跑去=0x01010918,跑回=0,攻击=0x01010915,攻击B=0x01010915}

SuoyouModel["马面"]         ={站立=0x01010939,行走=0x01010945,待战=0x01010939,挨打=0x01010938,防御=0x01010940,施法=0x01010942,倒地=0x01010943,跑去=0x01010945,跑回=0,攻击=0x01010941,攻击B=0x01010941,小图标=0x01010936,大图标=0x01010937,对话头像=0x01010944}
SuoyouModel["马面_饰品"]    ={站立=0x01010930,行走=0x01010935,待战=0x01010930,挨打=0x01010929,防御=0x01010931,施法=0x01010933,倒地=0x01010934,跑去=0x01010935,跑回=0,攻击=0x01010932,攻击B=0x01010932}

SuoyouModel["曼珠沙华"]     ={站立=0x01010956,行走=0x01010962,待战=0x01010956,挨打=0x01010955,防御=0x01010957,施法=0x01010959,倒地=0x01010960,跑去=0x01010962,跑回=0,攻击=0x01010958,攻击B=0x01010958,小图标=0x01010953,大图标=0x01010954,对话头像=0x01010961}
SuoyouModel["曼珠沙华_饰品"]={站立=0x01010947,行走=0x01010952,待战=0x01010947,挨打=0x01010946,防御=0x01010948,施法=0x01010950,倒地=0x01010951,跑去=0x01010952,跑回=0,攻击=0x01010949,攻击B=0x01010949}

SuoyouModel["牛头"]         ={站立=0x01010973,行走=0x01010979,待战=0x01010973,挨打=0x01010972,防御=0x01010974,施法=0x01010976,倒地=0x01010977,跑去=0x01010979,跑回=0,攻击=0x01010975,攻击B=0x01010975,小图标=0x01010970,大图标=0x01010971,对话头像=0x01010978}
SuoyouModel["牛头_饰品"]    ={站立=0x01010964,行走=0x01010969,待战=0x01010964,挨打=0x01010963,防御=0x01010965,施法=0x01010967,倒地=0x01010968,跑去=0x01010969,跑回=0,攻击=0x01010966,攻击B=0x01010966}

SuoyouModel["泡泡"]         ={站立=0x01010990,行走=0x01010996,待战=0x01010990,挨打=0x01010989,防御=0x01010991,施法=0x01010993,倒地=0x01010994,跑去=0x01010996,跑回=0,攻击=0x01010992,攻击B=0x01010992,小图标=0x01010987,大图标=0x01010988,对话头像=0x01010995}
SuoyouModel["泡泡_饰品"]    ={站立=0x01010981,行走=0x01010986,待战=0x01010981,挨打=0x01010980,防御=0x01010982,施法=0x01010984,倒地=0x01010985,跑去=0x01010986,跑回=0,攻击=0x01010983,攻击B=0x01010983}

SuoyouModel["蜃气妖"]       ={站立=0x01011007,行走=0x01011013,待战=0x01011007,挨打=0x01011006,防御=0x01011008,施法=0x01011010,倒地=0x01011011,跑去=0x01011013,跑回=0,攻击=0x01011009,攻击B=0x01011009,小图标=0x01011004,大图标=0x01011005,对话头像=0x01011012}
SuoyouModel["蜃气妖_饰品"]  ={站立=0x01010998,行走=0x01011003,待战=0x01010998,挨打=0x01010997,防御=0x01010999,施法=0x01011001,倒地=0x01011002,跑去=0x01011003,跑回=0,攻击=0x01011000,攻击B=0x01011000}

SuoyouModel["噬天虎"]       ={站立=0x01011024,行走=0x01011030,待战=0x01011024,挨打=0x01011023,防御=0x01011025,施法=0x01011027,倒地=0x01011028,跑去=0x01011030,跑回=0,攻击=0x01011026,攻击B=0x01011026,小图标=0x01011021,大图标=0x01011022,对话头像=0x01011029}
SuoyouModel["噬天虎_饰品"]  ={站立=0x01011015,行走=0x01011020,待战=0x01011015,挨打=0x01011014,防御=0x01011016,施法=0x01011018,倒地=0x01011019,跑去=0x01011020,跑回=0,攻击=0x01011017,攻击B=0x01011017}

SuoyouModel["藤蔓妖花"]     ={站立=0x01011041,行走=0x01011047,待战=0x01011041,挨打=0x01011040,防御=0x01011042,施法=0x01011044,倒地=0x01011045,跑去=0x01011047,跑回=0,攻击=0x01011043,攻击B=0x01011043,小图标=0x01011038,大图标=0x01011039,对话头像=0x01011046}
SuoyouModel["藤蔓妖花_饰品"]={站立=0x01011032,行走=0x01011037,待战=0x01011032,挨打=0x01011031,防御=0x01011033,施法=0x01011035,倒地=0x01011036,跑去=0x01011037,跑回=0,攻击=0x01011034,攻击B=0x01011034}

SuoyouModel["犀牛将军兽形"]     ={站立=0x01011058,行走=0x01011064,待战=0x01011058,挨打=0x01011057,防御=0x01011059,施法=0x01011061,倒地=0x01011062,跑去=0x01011064,跑回=0,攻击=0x01011060,攻击B=0x01011060,小图标=0x01011055,大图标=0x01011056,对话头像=0x01011063}
SuoyouModel["犀牛将军兽形_饰品"]={站立=0x01011049,行走=0x01011054,待战=0x01011049,挨打=0x01011048,防御=0x01011050,施法=0x01011052,倒地=0x01011053,跑去=0x01011054,跑回=0,攻击=0x01011051,攻击B=0x01011051}

SuoyouModel["犀牛将军人形"]     ={站立=0x01011075,行走=0x01011081,待战=0x01011075,挨打=0x01011074,防御=0x01011076,施法=0x01011078,倒地=0x01011079,跑去=0x01011081,跑回=0,攻击=0x01011077,攻击B=0x01011077,小图标=0x01011072,大图标=0x01011073,对话头像=0x01011080}
SuoyouModel["犀牛将军人形_饰品"]={站立=0x01011066,行走=0x01011071,待战=0x01011066,挨打=0x01011065,防御=0x01011067,施法=0x01011069,倒地=0x01011070,跑去=0x01011071,跑回=0,攻击=0x01011068,攻击B=0x01011068}

SuoyouModel["星灵仙子"]     ={站立=0x01011092,行走=0x01011098,待战=0x01011092,挨打=0x01011091,防御=0x01011093,施法=0x01011095,倒地=0x01011096,跑去=0x01011098,跑回=0,攻击=0x01011094,攻击B=0x01011094,小图标=0x01011089,大图标=0x01011090,对话头像=0x01011097}
SuoyouModel["星灵仙子_饰品"]={站立=0x01011083,行走=0x01011088,待战=0x01011083,挨打=0x01011082,防御=0x01011084,施法=0x01011086,倒地=0x01011087,跑去=0x01011088,跑回=0,攻击=0x01011085,攻击B=0x01011085}

SuoyouModel["修罗傀儡鬼"]     ={站立=0x01011109,行走=0x01011115,待战=0x01011109,挨打=0x01011108,防御=0x01011110,施法=0x01011112,倒地=0x01011113,跑去=0x01011115,跑回=0,攻击=0x01011111,攻击B=0x01011111,小图标=0x01011106,大图标=0x01011107,对话头像=0x01011114}
SuoyouModel["修罗傀儡鬼_饰品"]={站立=0x01011100,行走=0x01011105,待战=0x01011100,挨打=0x01011099,防御=0x01011101,施法=0x01011103,倒地=0x01011104,跑去=0x01011105,跑回=0,攻击=0x01011102,攻击B=0x01011102}

SuoyouModel["巡游天神"]     ={站立=0x01011126,行走=0x01011132,待战=0x01011126,挨打=0x01011125,防御=0x01011127,施法=0x01011129,倒地=0x01011130,跑去=0x01011132,跑回=0,攻击=0x01011128,攻击B=0x01011128,小图标=0x01011123,大图标=0x01011124,对话头像=0x01011131}
SuoyouModel["巡游天神_饰品"]={站立=0x01011117,行走=0x01011122,待战=0x01011117,挨打=0x01011116,防御=0x01011118,施法=0x01011120,倒地=0x01011121,跑去=0x01011122,跑回=0,攻击=0x01011119,攻击B=0x01011119}

SuoyouModel["羊头怪"]     ={站立=0x01011143,行走=0x01011149,待战=0x01011143,挨打=0x01011142,防御=0x01011144,施法=0x01011146,倒地=0x01011147,跑去=0x01011149,跑回=0,攻击=0x01011145,攻击B=0x01011145,小图标=0x01011140,大图标=0x01011141,对话头像=0x01011148}
SuoyouModel["羊头怪_饰品"]={站立=0x01011134,行走=0x01011139,待战=0x01011134,挨打=0x01011133,防御=0x01011135,施法=0x01011137,倒地=0x01011138,跑去=0x01011139,跑回=0,攻击=0x01011136,攻击B=0x01011136}

SuoyouModel["野猪"]     ={站立=0x01011160,行走=0x01011166,待战=0x01011160,挨打=0x01011159,防御=0x01011161,施法=0x01011163,倒地=0x01011164,跑去=0x01011166,跑回=0,攻击=0x01011162,攻击B=0x01011162,小图标=0x01011157,大图标=0x01011158,对话头像=0x01011165}
SuoyouModel["野猪_饰品"]={站立=0x01011151,行走=0x01011156,待战=0x01011151,挨打=0x01011150,防御=0x01011152,施法=0x01011154,倒地=0x01011155,跑去=0x01011156,跑回=0,攻击=0x01011153,攻击B=0x01011153}

SuoyouModel["阴阳伞"]     ={站立=0x01011177,行走=0x01011183,待战=0x01011177,挨打=0x01011176,防御=0x01011178,施法=0x01011180,倒地=0x01011181,跑去=0x01011183,跑回=0,攻击=0x01011179,攻击B=0x01011179,小图标=0x01011174,大图标=0x01011175,对话头像=0x01011182}
SuoyouModel["阴阳伞_饰品"]={站立=0x01011168,行走=0x01011173,待战=0x01011168,挨打=0x01011167,防御=0x01011169,施法=0x01011171,倒地=0x01011172,跑去=0x01011173,跑回=0,攻击=0x01011170,攻击B=0x01011170}

SuoyouModel["幽萤娃娃"]     ={站立=0x01011194,行走=0x01011200,待战=0x01011194,挨打=0x01011193,防御=0x01011195,施法=0x01011197,倒地=0x01011198,跑去=0x01011200,跑回=0,攻击=0x01011196,攻击B=0x01011196,小图标=0x01011191,大图标=0x01011192,对话头像=0x01011199}
SuoyouModel["幽萤娃娃_饰品"]={站立=0x01011185,行走=0x01011190,待战=0x01011185,挨打=0x01011184,防御=0x01011186,施法=0x01011188,倒地=0x01011189,跑去=0x01011190,跑回=0,攻击=0x01011187,攻击B=0x01011187}

SuoyouModel["章鱼"]     ={站立=0x01011211,行走=0x01011217,待战=0x01011211,挨打=0x01011210,防御=0x01011212,施法=0x01011214,倒地=0x01011215,跑去=0x01011217,跑回=0,攻击=0x01011213,攻击B=0x01011213,小图标=0x01011208,大图标=0x01011209,对话头像=0x01011216}
SuoyouModel["章鱼_饰品"]={站立=0x01011202,行走=0x01011207,待战=0x01011202,挨打=0x01011201,防御=0x01011203,施法=0x01011205,倒地=0x01011206,跑去=0x01011207,跑回=0,攻击=0x01011204,攻击B=0x01011204}

SuoyouModel["长眉灵猴"]     ={站立=0x01011228,行走=0x01011234,待战=0x01011228,挨打=0x01011227,防御=0x01011229,施法=0x01011231,倒地=0x01011232,跑去=0x01011234,跑回=0,攻击=0x01011230,攻击B=0x01011230,小图标=0x01011225,大图标=0x01011226,对话头像=0x01011233}
SuoyouModel["长眉灵猴_饰品"]={站立=0x01011219,行走=0x01011224,待战=0x01011219,挨打=0x01011218,防御=0x01011220,施法=0x01011222,倒地=0x01011223,跑去=0x01011224,跑回=0,攻击=0x01011221,攻击B=0x01011221}

SuoyouModel["如意仙子"]       ={站立=0x01011246,行走=0x01011258,待战=0x01011246,挨打=0x01011244,防御=0x01011248,施法=0x01011253,倒地=0x01011255,跑去=0x01011258,跑回=0,攻击=0x01011250,攻击B=0x01011250,小图标=0x01011242,大图标=0x01011243,对话头像=0x01011257}
SuoyouModel["如意仙子_装饰"]  ={站立=0x01011247,行走=0x01011259,待战=0x01011247,挨打=0x01011245,防御=0x01011249,施法=0x01011254,倒地=0x01011256,跑去=0x01011259,跑回=0,攻击=0x01011251,攻击B=0x01011251}
SuoyouModel["如意仙子_饰品"]  ={站立=0x01011236,行走=0x01011241,待战=0x01011236,挨打=0x01011235,防御=0x01011237,施法=0x01011239,倒地=0x01011240,跑去=0x01011241,跑回=0,攻击=0x01011238,攻击B=0x01011238}

SuoyouModel["百足将军"]     ={站立=0x01011270,行走=0x01011278,待战=0x01011270,挨打=0x01011269,防御=0x01011271,施法=0x01011274,倒地=0x01011276,跑去=0x01011278,跑回=0,攻击=0x01011272,攻击B=0x01011272,小图标=0x01011267,大图标=0x01011268,对话头像=0x01011277}
SuoyouModel["百足将军_饰品"]={站立=0x01011261,行走=0x01011266,待战=0x01011261,挨打=0x01011260,防御=0x01011262,施法=0x01011264,倒地=0x01011265,跑去=0x01011266,跑回=0,攻击=0x01011263,攻击B=0x01011263}

SuoyouModel["地狱战神"]     ={站立=0x01011289,行走=0x01011297,待战=0x01011289,挨打=0x01011288,防御=0x01011290,施法=0x01011293,倒地=0x01011295,跑去=0x01011297,跑回=0,攻击=0x01011291,攻击B=0x01011291,小图标=0x01011286,大图标=0x01011287,对话头像=0x01011296}
SuoyouModel["地狱战神_饰品"]={站立=0x01011280,行走=0x01011285,待战=0x01011280,挨打=0x01011279,防御=0x01011281,施法=0x01011283,倒地=0x01011284,跑去=0x01011285,跑回=0,攻击=0x01011282,攻击B=0x01011282}

SuoyouModel["古代瑞兽"]     ={站立=0x01011308,行走=0x01011316,待战=0x01011308,挨打=0x01011307,防御=0x01011309,施法=0x01011312,倒地=0x01011314,跑去=0x01011316,跑回=0,攻击=0x01011310,攻击B=0x01011310,小图标=0x01011305,大图标=0x01011306,对话头像=0x01011315}
SuoyouModel["古代瑞兽_饰品"]={站立=0x01011299,行走=0x01011304,待战=0x01011299,挨打=0x01011298,防御=0x01011300,施法=0x01011302,倒地=0x01011303,跑去=0x01011304,跑回=0,攻击=0x01011301,攻击B=0x01011301}

SuoyouModel["混沌兽"]     ={站立=0x01011327,行走=0x01011335,待战=0x01011327,挨打=0x01011326,防御=0x01011328,施法=0x01011331,倒地=0x01011333,跑去=0x01011335,跑回=0,攻击=0x01011329,攻击B=0x01011329,小图标=0x01011324,大图标=0x01011325,对话头像=0x01011334}
SuoyouModel["混沌兽_饰品"]={站立=0x01011318,行走=0x01011323,待战=0x01011318,挨打=0x01011317,防御=0x01011319,施法=0x01011321,倒地=0x01011322,跑去=0x01011323,跑回=0,攻击=0x01011320,攻击B=0x01011320}

SuoyouModel["镜妖"]     ={站立=0x01011346,行走=0x01011354,待战=0x01011346,挨打=0x01011345,防御=0x01011347,施法=0x01011350,倒地=0x01011352,跑去=0x01011354,跑回=0,攻击=0x01011348,攻击B=0x01011348,小图标=0x01011343,大图标=0x01011344,对话头像=0x01011353}
SuoyouModel["镜妖_饰品"]={站立=0x01011337,行走=0x01011342,待战=0x01011337,挨打=0x01011336,防御=0x01011338,施法=0x01011340,倒地=0x01011341,跑去=0x01011342,跑回=0,攻击=0x01011339,攻击B=0x01011339}

SuoyouModel["狂豹兽形"]     ={站立=0x01011365,行走=0x01011373,待战=0x01011365,挨打=0x01011364,防御=0x01011366,施法=0x01011369,倒地=0x01011371,跑去=0x01011373,跑回=0,攻击=0x01011367,攻击B=0x01011367,小图标=0x01011362,大图标=0x01011363,对话头像=0x01011372}
SuoyouModel["狂豹兽形_饰品"]={站立=0x01011356,行走=0x01011361,待战=0x01011356,挨打=0x01011355,防御=0x01011357,施法=0x01011359,倒地=0x01011360,跑去=0x01011361,跑回=0,攻击=0x01011358,攻击B=0x01011358}

SuoyouModel["泪妖"]     ={站立=0x01011384,行走=0x01011392,待战=0x01011384,挨打=0x01011383,防御=0x01011385,施法=0x01011388,倒地=0x01011390,跑去=0x01011392,跑回=0,攻击=0x01011386,攻击B=0x01011386,小图标=0x01011381,大图标=0x01011382,对话头像=0x01011391}
SuoyouModel["泪妖_饰品"]={站立=0x01011375,行走=0x01011380,待战=0x01011375,挨打=0x01011374,防御=0x01011376,施法=0x01011378,倒地=0x01011379,跑去=0x01011380,跑回=0,攻击=0x01011377,攻击B=0x01011377}

SuoyouModel["灵鹤"]     ={站立=0x01011403,行走=0x01011411,待战=0x01011403,挨打=0x01011402,防御=0x01011404,施法=0x01011407,倒地=0x01011409,跑去=0x01011411,跑回=0,攻击=0x01011405,攻击B=0x01011405,小图标=0x01011400,大图标=0x01011401,对话头像=0x01011410}
SuoyouModel["灵鹤_饰品"]={站立=0x01011394,行走=0x01011399,待战=0x01011394,挨打=0x01011393,防御=0x01011395,施法=0x01011397,倒地=0x01011398,跑去=0x01011399,跑回=0,攻击=0x01011396,攻击B=0x01011396}

SuoyouModel["龙龟"]     ={站立=0x01011422,行走=0x01011430,待战=0x01011422,挨打=0x01011421,防御=0x01011423,施法=0x01011426,倒地=0x01011428,跑去=0x01011430,跑回=0,攻击=0x01011424,攻击B=0x01011424,小图标=0x01011419,大图标=0x01011420,对话头像=0x01011429}
SuoyouModel["龙龟_饰品"]={站立=0x01011413,行走=0x01011418,待战=0x01011413,挨打=0x01011412,防御=0x01011414,施法=0x01011416,倒地=0x01011417,跑去=0x01011418,跑回=0,攻击=0x01011415,攻击B=0x01011415}

SuoyouModel["毗舍童子"]     ={站立=0x01011441,行走=0x01011449,待战=0x01011441,挨打=0x01011440,防御=0x01011442,施法=0x01011445,倒地=0x01011447,跑去=0x01011449,跑回=0,攻击=0x01011443,攻击B=0x01011443,小图标=0x01011438,大图标=0x01011439,对话头像=0x01011448}
SuoyouModel["毗舍童子_饰品"]={站立=0x01011432,行走=0x01011437,待战=0x01011432,挨打=0x01011431,防御=0x01011433,施法=0x01011435,倒地=0x01011436,跑去=0x01011437,跑回=0,攻击=0x01011434,攻击B=0x01011434}

SuoyouModel["琴仙"]     ={站立=0x01011460,行走=0x01011468,待战=0x01011460,挨打=0x01011459,防御=0x01011461,施法=0x01011464,倒地=0x01011466,跑去=0x01011468,跑回=0,攻击=0x01011462,攻击B=0x01011462,小图标=0x01011457,大图标=0x01011458,对话头像=0x01011467}
SuoyouModel["琴仙_饰品"]={站立=0x01011451,行走=0x01011456,待战=0x01011451,挨打=0x01011450,防御=0x01011452,施法=0x01011454,倒地=0x01011455,跑去=0x01011456,跑回=0,攻击=0x01011453,攻击B=0x01011453}

SuoyouModel["鼠先锋"]     ={站立=0x01011479,行走=0x01011487,待战=0x01011479,挨打=0x01011478,防御=0x01011480,施法=0x01011483,倒地=0x01011485,跑去=0x01011487,跑回=0,攻击=0x01011481,攻击B=0x01011481,小图标=0x01011476,大图标=0x01011477,对话头像=0x01011486}
SuoyouModel["鼠先锋_饰品"]={站立=0x01011470,行走=0x01011475,待战=0x01011470,挨打=0x01011469,防御=0x01011471,施法=0x01011473,倒地=0x01011474,跑去=0x01011475,跑回=0,攻击=0x01011472,攻击B=0x01011472}

SuoyouModel["踏云兽"]     ={站立=0x01011498,行走=0x01011506,待战=0x01011498,挨打=0x01011497,防御=0x01011499,施法=0x01011502,倒地=0x01011504,跑去=0x01011506,跑回=0,攻击=0x01011500,攻击B=0x01011500,小图标=0x01011495,大图标=0x01011496,对话头像=0x01011505}
SuoyouModel["踏云兽_饰品"]={站立=0x01011489,行走=0x01011494,待战=0x01011489,挨打=0x01011488,防御=0x01011490,施法=0x01011492,倒地=0x01011493,跑去=0x01011494,跑回=0,攻击=0x01011491,攻击B=0x01011491}

SuoyouModel["雾中仙"]     ={站立=0x01011517,行走=0x01011525,待战=0x01011517,挨打=0x01011516,防御=0x01011518,施法=0x01011521,倒地=0x01011523,跑去=0x01011525,跑回=0,攻击=0x01011519,攻击B=0x01011519,小图标=0x01011514,大图标=0x01011515,对话头像=0x01011524}
SuoyouModel["雾中仙_饰品"]={站立=0x01011508,行走=0x01011513,待战=0x01011508,挨打=0x01011507,防御=0x01011509,施法=0x01011511,倒地=0x01011512,跑去=0x01011513,跑回=0,攻击=0x01011510,攻击B=0x01011510}

SuoyouModel["吸血鬼"]     ={站立=0x01011536,行走=0x01011544,待战=0x01011536,挨打=0x01011535,防御=0x01011537,施法=0x01011540,倒地=0x01011542,跑去=0x01011544,跑回=0,攻击=0x01011538,攻击B=0x01011538,小图标=0x01011533,大图标=0x01011534,对话头像=0x01011543}
SuoyouModel["吸血鬼_饰品"]={站立=0x01011527,行走=0x01011532,待战=0x01011527,挨打=0x01011526,防御=0x01011528,施法=0x01011530,倒地=0x01011531,跑去=0x01011532,跑回=0,攻击=0x01011529,攻击B=0x01011529}

SuoyouModel["野鬼"]     ={站立=0x01011555,行走=0x01011563,待战=0x01011555,挨打=0x01011554,防御=0x01011556,施法=0x01011559,倒地=0x01011561,跑去=0x01011563,跑回=0,攻击=0x01011557,攻击B=0x01011557,小图标=0x01011552,大图标=0x01011553,对话头像=0x01011562}
SuoyouModel["野鬼_饰品"]={站立=0x01011546,行走=0x01011551,待战=0x01011546,挨打=0x01011545,防御=0x01011547,施法=0x01011549,倒地=0x01011550,跑去=0x01011551,跑回=0,攻击=0x01011548,攻击B=0x01011548}

SuoyouModel["夜罗刹"]     ={站立=0x01011574,行走=0x01011582,待战=0x01011574,挨打=0x01011573,防御=0x01011575,施法=0x01011578,倒地=0x01011580,跑去=0x01011582,跑回=0,攻击=0x01011576,攻击B=0x01011576,小图标=0x01011571,大图标=0x01011572,对话头像=0x01011581}
SuoyouModel["夜罗刹_饰品"]={站立=0x01011565,行走=0x01011570,待战=0x01011565,挨打=0x01011564,防御=0x01011566,施法=0x01011568,倒地=0x01011569,跑去=0x01011570,跑回=0,攻击=0x01011567,攻击B=0x01011567}

SuoyouModel["雨师"]     ={站立=0x01011593,行走=0x01011601,待战=0x01011593,挨打=0x01011592,防御=0x01011594,施法=0x01011597,倒地=0x01011599,跑去=0x01011601,跑回=0,攻击=0x01011595,攻击B=0x01011595,小图标=0x01011590,大图标=0x01011591,对话头像=0x01011600}
SuoyouModel["雨师_饰品"]={站立=0x01011584,行走=0x01011589,待战=0x01011584,挨打=0x01011583,防御=0x01011585,施法=0x01011587,倒地=0x01011588,跑去=0x01011589,跑回=0,攻击=0x01011586,攻击B=0x01011586}

SuoyouModel["花妖"]       ={站立=0x01011613,行走=0x01011624,待战=0x01011613,挨打=0x01011611,防御=0x01011615,施法=0x01011619,倒地=0x01011621,跑去=0x01011624,跑回=0,攻击=0x01011617,攻击B=0x01011617,小图标=0x01011609,大图标=0x01011610,对话头像=0x01011623}
SuoyouModel["花妖_装饰"]  ={站立=0x01011614,行走=0x01011625,待战=0x01011614,挨打=0x01011612,防御=0x01011616,施法=0x01011620,倒地=0x01011622,跑去=0x01011625,跑回=0,攻击=0x01011618,攻击B=0x01011618}
SuoyouModel["花妖_饰品"]  ={站立=0x01011603,行走=0x01011608,待战=0x01011603,挨打=0x01011602,防御=0x01011604,施法=0x01011606,倒地=0x01011607,跑去=0x01011608,跑回=0,攻击=0x01011605,攻击B=0x01011605}

SuoyouModel["金身罗汉"]       ={站立=0x01011637,行走=0x01011648,待战=0x01011637,挨打=0x01011635,防御=0x01011639,施法=0x01011643,倒地=0x01011645,跑去=0x01011648,跑回=0,攻击=0x01011641,攻击B=0x01011641,小图标=0x01011633,大图标=0x01011634,对话头像=0x01011647}
SuoyouModel["金身罗汉_装饰"]  ={站立=0x01011638,行走=0x01011649,待战=0x01011638,挨打=0x01011636,防御=0x01011640,施法=0x01011644,倒地=0x01011646,跑去=0x01011649,跑回=0,攻击=0x01011642,攻击B=0x01011642}
SuoyouModel["金身罗汉_饰品"]  ={站立=0x01011627,行走=0x01011632,待战=0x01011627,挨打=0x01011626,防御=0x01011628,施法=0x01011630,倒地=0x01011631,跑去=0x01011632,跑回=0,攻击=0x01011629,攻击B=0x01011629}

SuoyouModel["狂豹人形"]       ={站立=0xAAAA1111,行走=0xAAAA1116,待战=0xAAAA1111,挨打=0xAAAA1110,防御=0xAAAA1112,施法=0xAAAA1114,倒地=0xAAAA1115,跑去=0xAAAA1116,跑回=0,攻击=0xAAAA1113,攻击B=0xAAAA1113,小图标=0x01011657,大图标=0x01011658,对话头像=0x01011671}
-- SuoyouModel["狂豹人形_装饰"]  ={站立=0x01011662,行走=0x01011673,待战=0x01011662,挨打=0x01011660,防御=0x01011664,施法=0x01011668,倒地=0x01011670,跑去=0x01011673,跑回=0,攻击=0x01011666,攻击B=0x01011666}
SuoyouModel["狂豹人形_饰品"]  ={站立=0x01011651,行走=0x01011656,待战=0x01011651,挨打=0x01011650,防御=0x01011652,施法=0x01011654,倒地=0x01011655,跑去=0x01011656,跑回=0,攻击=0x01011653,攻击B=0x01011653}

SuoyouModel["猫灵人形"]       ={站立=0x01011685,行走=0x01011696,待战=0x01011685,挨打=0x01011683,防御=0x01011687,施法=0x01011691,倒地=0x01011693,跑去=0x01011696,跑回=0,攻击=0x01011689,攻击B=0x01011689,小图标=0x01011681,大图标=0x01011682,对话头像=0x01011695}
SuoyouModel["猫灵人形_装饰"]  ={站立=0x01011686,行走=0x01011697,待战=0x01011686,挨打=0x01011684,防御=0x01011688,施法=0x01011692,倒地=0x01011694,跑去=0x01011697,跑回=0,攻击=0x01011690,攻击B=0x01011690}
SuoyouModel["猫灵人形_饰品"]  ={站立=0x01011675,行走=0x01011680,待战=0x01011675,挨打=0x01011674,防御=0x01011676,施法=0x01011678,倒地=0x01011679,跑去=0x01011680,跑回=0,攻击=0x01011677,攻击B=0x01011677}

SuoyouModel["猫灵兽形"]       ={站立=0x01011709,行走=0x01011720,待战=0x01011709,挨打=0x01011707,防御=0x01011711,施法=0x01011715,倒地=0x01011717,跑去=0x01011720,跑回=0,攻击=0x01011713,攻击B=0x01011713,小图标=0x01011705,大图标=0x01011706,对话头像=0x01011719}
SuoyouModel["猫灵兽形_装饰"]  ={站立=0x01011710,行走=0x01011721,待战=0x01011710,挨打=0x01011708,防御=0x01011712,施法=0x01011716,倒地=0x01011718,跑去=0x01011721,跑回=0,攻击=0x01011714,攻击B=0x01011714}
SuoyouModel["猫灵兽形_饰品"]  ={站立=0x01011699,行走=0x01011704,待战=0x01011699,挨打=0x01011698,防御=0x01011700,施法=0x01011702,倒地=0x01011703,跑去=0x01011704,跑回=0,攻击=0x01011701,攻击B=0x01011701}

SuoyouModel["天兵"]       ={站立=0x01011733,行走=0x01011744,待战=0x01011733,挨打=0x01011731,防御=0x01011735,施法=0x01011739,倒地=0x01011741,跑去=0x01011744,跑回=0,攻击=0x01011737,攻击B=0x01011737,小图标=0x01011729,大图标=0x01011730,对话头像=0x01011743}
SuoyouModel["天兵_装饰"]  ={站立=0x01011734,行走=0x01011745,待战=0x01011734,挨打=0x01011732,防御=0x01011736,施法=0x01011740,倒地=0x01011742,跑去=0x01011745,跑回=0,攻击=0x01011738,攻击B=0x01011738}
SuoyouModel["天兵_饰品"]  ={站立=0x01011723,行走=0x01011728,待战=0x01011723,挨打=0x01011722,防御=0x01011724,施法=0x01011726,倒地=0x01011727,跑去=0x01011728,跑回=0,攻击=0x01011725,攻击B=0x01011725}

SuoyouModel["蝎子精"]       ={站立=0xAAAA1121,行走=0xAAAA1126,待战=0xAAAA1121,挨打=0xAAAA1120,防御=0xAAAA1122,施法=0xAAAA1124,倒地=0xAAAA1125,跑去=0xAAAA1126,跑回=0,攻击=0xAAAA1123,攻击B=0xAAAA1123,小图标=0x01011753,大图标=0x01011754,对话头像=0x01011767}
-- SuoyouModel["蝎子精_装饰"]  ={站立=0x01011758,行走=0x01011769,待战=0x01011758,挨打=0x01011756,防御=0x01011760,施法=0x01011764,倒地=0x01011766,跑去=0x01011769,跑回=0,攻击=0x01011762,攻击B=0x01011762}
SuoyouModel["蝎子精_饰品"]  ={站立=0x01011747,行走=0x01011752,待战=0x01011747,挨打=0x01011746,防御=0x01011748,施法=0x01011750,倒地=0x01011751,跑去=0x01011752,跑回=0,攻击=0x01011749,攻击B=0x01011749}

SuoyouModel["修罗傀儡妖"]     ={站立=0xAAA10603,行走=0xAAA10616,待战=0xAAA10603,挨打=0xAAA10602,防御=0xAAA10604,施法=0xAAA10613,倒地=0xAAA10614,跑去=0xAAA10616,跑回=0,攻击=0xAAA10605,攻击B=0xAAA10605,小图标=0xAAA10600,大图标=0xAAA10601,对话头像=0xAAA10615}
SuoyouModel["修罗傀儡妖_饰品"]={站立=0xAAA10607,行走=0xAAA10612,待战=0xAAA10608,挨打=0xAAA10606,防御=0xAAA10608,施法=0xAAA10610,倒地=0xAAA10611,跑去=0xAAA10612,跑回=0,攻击=0xAAA10609,攻击B=0xAAA10610}

SuoyouModel["蛟龙"]     ={站立=0x01003001,行走=0x01003007,待战=0x01003001,挨打=0x01003000,防御=0x01003002,施法=0x01003004,倒地=0x01003006,跑去=0x01003007,跑回=0,攻击=0x01003003,攻击B=0x01003003,小图标=0xA1000027,大图标=0xA1000028,对话头像=0xA1000029}
SuoyouModel["蛟龙_饰品"]={站立=0x0100AD01,行走=0x0100AD07,待战=0x0100AD01,挨打=0x0100AD00,防御=0x0100AD02,施法=0x0100AD04,倒地=0x0100AD06,跑去=0x0100AD07,跑回=0,攻击=0x0100AD03,攻击B=0x0100AD03}


SuoyouModel["千年蛇魅"]     ={站立=0x01010348,行走=0x01010354,待战=0x01010348,挨打=0x01010347,防御=0x01010349,施法=0x01010351,倒地=0x01010352,跑去=0x01010354,跑回=0,攻击=0x01010350,攻击B=0x01010350,小图标=0x01010345,大图标=0x01010346,对话头像=0x01010353}
SuoyouModel["千年蛇魅_饰品"]={站立=0x01010341,行走=0x01010354,待战=0x01010341,挨打=0x01010340,防御=0x01010342,施法=0x01010343,倒地=0x01010344,跑去=0x01010354,跑回=0,攻击=0x01010350,攻击B=0x01010350}

SuoyouModel["超级红孩儿"]     ={站立=0xAAAA2001,行走=0xAAAA2002,待战=0xAAAA2003,挨打=0xAAAA2004,防御=0xAAAA2005,施法=0xAAAA2006,倒地=0xAAAA2008,跑去=0xAAAA2009,跑回=0xAAAA2010,攻击=0xAAAA2011,攻击B=0xAAAA2013,小图标=0xAAAA2015,大图标=0xAAAA2016,对话头像=0x01010353}
SuoyouModel["进阶超级红孩儿"]     ={站立=0xAAAA2017,行走=0xAAAA2018,待战=0xAAAA2019,挨打=0xAAAA2020,防御=0xAAAA2021,施法=0xAAAA2022,倒地=0xAAAA2024,跑去=0xAAAA2025,跑回=0xAAAA2026,攻击=0xAAAA2027,攻击B=0xAAAA2029,小图标=0xAAAA2015,大图标=0xAAAA2016,对话头像=0x01010353}

SuoyouModel["超级飞天"]     =  {站立=0xAAAA2031,行走=0xAAAA2032,待战=0xAAAA2033,挨打=0xAAAA2034,防御=0xAAAA2035,施法=0xAAAA2036,倒地=0xAAAA2038,跑去=0xAAAA2039,跑回=0xAAAA2040,攻击=0xAAAA2041,攻击B=0xAAAA2043,小图标=0xAAAA2045,大图标=0xAAAA2046,对话头像=0xAAAA2047}
SuoyouModel["进阶超级飞天"]     =  {站立=0xAAAA2031,行走=0xAAAA2032,待战=0xAAAA2033,挨打=0xAAAA2034,防御=0xAAAA2035,施法=0xAAAA2036,倒地=0xAAAA2038,跑去=0xAAAA2039,跑回=0xAAAA2040,攻击=0xAAAA2041,攻击B=0xAAAA2043,小图标=0xAAAA2045,大图标=0xAAAA2046,对话头像=0xAAAA2047}

SuoyouModel["超级神狗"]     =  {站立=0xAAAA2048,行走=0xAAAA2049,待战=0xAAAA2050,挨打=0xAAAA2051,防御=0xAAAA2052,施法=0xAAAA2053,倒地=0xAAAA2055,跑去=0xAAAA2056,跑回=0xAAAA2057,攻击=0xAAAA2058,攻击B=0xAAAA2060,小图标=0xAAAA2062,大图标=0xAAAA2063,对话头像=0xAAAA2064}
SuoyouModel["进阶超级神狗"]     =  {站立=0xAAAA2065,行走=0xAAAA2066,待战=0xAAAA2067,挨打=0xAAAA2068,防御=0xAAAA2069,施法=0xAAAA2070,倒地=0xAAAA2072,跑去=0xAAAA2073,跑回=0xAAAA2074,攻击=0xAAAA2075,攻击B=0xAAAA2077,小图标=0xAAAA2062,大图标=0xAAAA2063,对话头像=0xAAAA2064}

SuoyouModel["超级神虎(壬寅)"]     =  {站立=0xAAAA2079,行走=0xAAAA2080,待战=0xAAAA2081,挨打=0xAAAA2082,防御=0xAAAA2083,施法=0xAAAA2084,倒地=0xAAAA2086,跑去=0xAAAA2087,跑回=0xAAAA2088,攻击=0xAAAA2089,攻击B=0xAAAA2091,小图标=0xAAAA2093,大图标=0xAAAA2094,对话头像=0xAAAA2095}
SuoyouModel["进阶超级神虎(壬寅)"]     =  {站立=0xAAAA2096,行走=0xAAAA2097,待战=0xAAAA2098,挨打=0xAAAA2099,防御=0xAAAA2100,施法=0xAAAA2101,倒地=0xAAAA2103,跑去=0xAAAA2104,跑回=0xAAAA2105,攻击=0xAAAA2106,攻击B=0xAAAA2108,小图标=0xAAAA2093,大图标=0xAAAA2094,对话头像=0xAAAA2095}

SuoyouModel["超级神龙(甲辰)"]     =  {站立=0xAAAA2110,行走=0xAAAA2111,待战=0xAAAA2112,挨打=0xAAAA2113,防御=0xAAAA2114,施法=0xAAAA2115,倒地=0xAAAA2117,跑去=0xAAAA2118,跑回=0xAAAA219,攻击=0xAAAA2120,攻击B=0xAAAA2122,小图标=0xAAAA2124,大图标=0xAAAA2125,对话头像=0xAAAA2095}
SuoyouModel["进阶超级神龙(甲辰)"]     =  {站立=0xAAAA2126,行走=0xAAAA2127,待战=0xAAAA2128,挨打=0xAAAA2129,防御=0xAAAA2130,施法=0xAAAA2131,倒地=0xAAAA2133,跑去=0xAAAA2134,跑回=0xAAAA2135,攻击=0xAAAA2136,攻击B=0xAAAA2138,小图标=0xAAAA2124,大图标=0xAAAA2125,对话头像=0xAAAA2095}

SuoyouModel["超级神牛(辛丑)"]     =  {站立=0xAAAA2140,行走=0xAAAA2141,待战=0xAAAA2142,挨打=0xAAAA2143,防御=0xAAAA2144,施法=0xAAAA2145,倒地=0xAAAA2147,跑去=0xAAAA2148,跑回=0xAAAA2149,攻击=0xAAAA2150,攻击B=0xAAAA2152,小图标=0xAAAA2154,大图标=0xAAAA2155,对话头像=0xAAAA2156}
SuoyouModel["进阶超级神牛(辛丑)"]     =  {站立=0xAAAA2157,行走=0xAAAA2158,待战=0xAAAA2159,挨打=0xAAAA2160,防御=0xAAAA2161,施法=0xAAAA2162,倒地=0xAAAA2164,跑去=0xAAAA2165,跑回=0xAAAA2166,攻击=0xAAAA2167,攻击B=0xAAAA2169,小图标=0xAAAA2154,大图标=0xAAAA2155,对话头像=0xAAAA2156}

SuoyouModel["超级神鼠"]     =  {站立=0xAAAA2171,行走=0xAAAA2172,待战=0xAAAA2173,挨打=0xAAAA2174,防御=0xAAAA2175,施法=0xAAAA2176,倒地=0xAAAA2178,跑去=0xAAAA2179,跑回=0xAAAA2180,攻击=0xAAAA2181,攻击B=0xAAAA2183,小图标=0xAAAA2185,大图标=0xAAAA2186,对话头像=0xAAAA2187}
SuoyouModel["进阶超级神鼠"]     =  {站立=0xAAAA2188,行走=0xAAAA2189,待战=0xAAAA2190,挨打=0xAAAA2191,防御=0xAAAA2192,施法=0xAAAA2193,倒地=0xAAAA2195,跑去=0xAAAA2196,跑回=0xAAAA2197,攻击=0xAAAA2198,攻击B=0xAAAA2200,小图标=0xAAAA2185,大图标=0xAAAA2186,对话头像=0xAAAA2187}

SuoyouModel["超级神兔(癸卯)"]     =  {站立=0xAAAA2202,行走=0xAAAA2203,待战=0xAAAA2204,挨打=0xAAAA2205,防御=0xAAAA2206,施法=0xAAAA2207,倒地=0xAAAA2209,跑去=0xAAAA2210,跑回=0xAAAA2211,攻击=0xAAAA2212,攻击B=0xAAAA2212,小图标=0xAAAA2214,大图标=0xAAAA2215,对话头像=0xAAAA2216}
SuoyouModel["进阶超级神兔(癸卯)"]     =  {站立=0xAAAA2217,行走=0xAAAA2218,待战=0xAAAA2219,挨打=0xAAAA2220,防御=0xAAAA2221,施法=0xAAAA2222,倒地=0xAAAA2224,跑去=0xAAAA2225,跑回=0xAAAA2226,攻击=0xAAAA2227,攻击B=0xAAAA2227,小图标=0xAAAA2214,大图标=0xAAAA2215,对话头像=0xAAAA2216}

SuoyouModel["超级神兔(癸卯)睡梦"]     =  {站立=0xAAAA2229,行走=0xAAAA2230,待战=0xAAAA2231,挨打=0xAAAA2232,防御=0xAAAA2233,施法=0xAAAA2234,倒地=0xAAAA2236,跑去=0xAAAA2237,跑回=0xAAAA2238,攻击=0xAAAA2239,攻击B=0xAAAA2239,小图标=0xAAAA2241,大图标=0xAAAA2242,对话头像=0xAAAA2243}
SuoyouModel["进阶超级神兔(癸卯)睡梦"]     =  {站立=0xAAAA2244,行走=0xAAAA2245,待战=0xAAAA2246,挨打=0xAAAA2247,防御=0xAAAA2248,施法=0xAAAA2249,倒地=0xAAAA2251,跑去=0xAAAA2252,跑回=0xAAAA2253,攻击=0xAAAA2254,攻击B=0xAAAA2254,小图标=0xAAAA2241,大图标=0xAAAA2242,对话头像=0xAAAA2243}

SuoyouModel["超级神猪"]     =  {站立=0xAAAA2256,行走=0xAAAA2257,待战=0xAAAA2258,挨打=0xAAAA2259,防御=0xAAAA2260,施法=0xAAAA2261,倒地=0xAAAA2263,跑去=0xAAAA2264,跑回=0xAAAA2265,攻击=0xAAAA2266,攻击B=0xAAAA2268,小图标=0xAAAA2270,大图标=0xAAAA2271,对话头像=0xAAAA2272}
SuoyouModel["进阶超级神猪"]     =  {站立=0xAAAA2256,行走=0xAAAA2257,待战=0xAAAA2258,挨打=0xAAAA2259,防御=0xAAAA2260,施法=0xAAAA2261,倒地=0xAAAA2263,跑去=0xAAAA2264,跑回=0xAAAA2265,攻击=0xAAAA2266,攻击B=0xAAAA2268,小图标=0xAAAA2270,大图标=0xAAAA2271,对话头像=0xAAAA2272}

SuoyouModel["超级小白龙"]     =  {站立=0xAAAA2273,行走=0xAAAA2274,待战=0xAAAA2275,挨打=0xAAAA2276,防御=0xAAAA2277,施法=0xAAAA2278,倒地=0xAAAA2279,跑去=0xAAAA2280,跑回=0xAAAA2281,攻击=0xAAAA2282,攻击B=0xAAAA2284,小图标=0xAAAA2286,大图标=0xAAAA2287,对话头像=0xAAAA2288}
SuoyouModel["进阶超级小白龙"]     =  {站立=0xAAAA2289,行走=0xAAAA2290,待战=0xAAAA2291,挨打=0xAAAA2292,防御=0xAAAA2293,施法=0xAAAA2294,倒地=0xAAAA2295,跑去=0xAAAA2296,跑回=0xAAAA2297,攻击=0xAAAA2298,攻击B=0xAAAA2300,小图标=0xAAAA2286,大图标=0xAAAA2287,对话头像=0xAAAA2288}

SuoyouModel["超级有熊"]     =  {站立=0xAAAA2302,行走=0xAAAA2303,待战=0xAAAA2304,挨打=0xAAAA2305,防御=0xAAAA2306,施法=0xAAAA2307,倒地=0xAAAA2309,跑去=0xAAAA2310,跑回=0xAAAA2311,攻击=0xAAAA2312,攻击B=0xAAAA2314,小图标=0xAAAA2316,大图标=0xAAAA2317,对话头像=0xAAAA2318}
SuoyouModel["进阶超级有熊"]     =  {站立=0xAAAA2319,行走=0xAAAA2320,待战=0xAAAA2321,挨打=0xAAAA2322,防御=0xAAAA2323,施法=0xAAAA2324,倒地=0xAAAA2326,跑去=0xAAAA2327,跑回=0xAAAA2328,攻击=0xAAAA2329,攻击B=0xAAAA2331,小图标=0xAAAA2316,大图标=0xAAAA2317,对话头像=0xAAAA2318}

SuoyouModel["超级猪小戒"]     =  {站立=0xAAAA2333,行走=0xAAAA2334,待战=0xAAAA2335,挨打=0xAAAA2336,防御=0xAAAA2337,施法=0xAAAA2338,倒地=0xAAAA2340,跑去=0xAAAA2341,跑回=0xAAAA2342,攻击=0xAAAA2343,攻击B=0xAAAA2345,小图标=0xAAAA2347,大图标=0xAAAA2348,对话头像=0xAAAA2349}
SuoyouModel["进阶超级猪小戒"]     =  {站立=0xAAAA2350,行走=0xAAAA2351,待战=0xAAAA2352,挨打=0xAAAA2353,防御=0xAAAA2354,施法=0xAAAA2355,倒地=0xAAAA2357,跑去=0xAAAA2358,跑回=0xAAAA2359,攻击=0xAAAA2360,攻击B=0xAAAA2362,小图标=0xAAAA2347,大图标=0xAAAA2348,对话头像=0xAAAA2349}

SuoyouModel["超级神柚"]     =  {站立=0xAAAA2364,行走=0xAAAA2365,待战=0xAAAA2364,挨打=0xAAAA2366,防御=0xAAAA2367,施法=0xAAAA2368,倒地=0xAAAA2369,跑去=0xAAAA2365,跑回=0xAAAA2365,攻击=0xAAAA2370,攻击B=0xAAAA2370,小图标=0xAAAA2371,大图标=0xAAAA2372,对话头像=0xAAAA2373}
SuoyouModel["进阶超级神柚"]     =  {站立=0xAAAA2364,行走=0xAAAA2365,待战=0xAAAA2364,挨打=0xAAAA2366,防御=0xAAAA2367,施法=0xAAAA2368,倒地=0xAAAA2369,跑去=0xAAAA2365,跑回=0xAAAA2365,攻击=0xAAAA2370,攻击B=0xAAAA2370,小图标=0xAAAA2371,大图标=0xAAAA2372,对话头像=0xAAAA2373}

SuoyouModel["恶魔泡泡"]={站立=0xCFC00622,行走=0xCFC00623,待战=0xCFC00622,挨打=0xCFC00627,防御=0xCFC00627,施法=0xCFC00626,倒地=0xCFC00625,跑去=0xCFC00623,跑回=0xCFC00623,攻击=0xCFC00624,攻击B=0xCFC00624,小图标=0xCFC00629,大图标=0xCFC00629,对话头像=0xCFC00628}
SuoyouModel["蛟魔王"]={小图标=0xBABABA13,大图标=0xBABABA15,对话头像=0xBABABA14,站立=0xBABABA12,行走=0xBABABA10,待战=0xBABABA12,挨打=0xBABABA01,防御=0xBABABA03,施法=0xBABABA04,倒地=0xBABABA09,跑去=0xBABABA11,跑回=0xBABABA11,攻击=0xBABABA06,攻击B=0xBABABA06}
SuoyouModel["进阶蛟魔王"]={小图标=0xBABABA13,大图标=0xBABABA15,对话头像=0xBABABA14,站立=0xBABABA12,行走=0xBABABA10,待战=0xBABABA12,挨打=0xBABABA01,防御=0xBABABA03,施法=0xBABABA04,倒地=0xBABABA09,跑去=0xBABABA11,跑回=0xBABABA11,攻击=0xBABABA06,攻击B=0xBABABA06}

SuoyouModel["怒蛟BOSS"]={小图标=0,大图标=0,对话头像=0,站立=0xA1005212,行走=0xA1005212,待战=0xA1005212,挨打=0xA1005210,防御=0xA1005214,施法=0xA1005222,倒地=0xA1005225,跑去=0xA1005212,跑回=0xA1005212,攻击=0xA1005216,攻击B=0xA1005216}
SuoyouModel["怒蛟"]={小图标=0,大图标=0,对话头像=0,站立=0xA1105212,行走=0xA1105212,待战=0xA1105212,挨打=0xA1105210,防御=0xA1105214,施法=0xA1105222,倒地=0xA1105225,跑去=0xA1105212,跑回=0xA1105212,攻击=0xA1105216,攻击B=0xA1105216}


SuoyouModel["锦衣鬼将"]={
	小图标=0x01008254,大图标=0xABBBA004,对话头像=0x01008253,
	攻击=0xFA00AA01,
	攻击B=0xFA00AA02,
	倒地=0xFA00AA03,
	行走=0xFA00AA04,
	跑去=0xFA00AA05,
	跑回=0xFA00AA06,
	站立=0xFA00AA07,--3
	施法=0xFA00AA08,
	防御=0xFA00AA09,
	待战=0xFA00AA10,--1
	挨打=0xFA00AA11--2
	}
SuoyouModel["锦衣鬼将_装饰"]={
	攻击=0xFA00AB01,
	攻击B=0xFA00AB02,
	倒地=0xFA00AB03,
	行走=0xFA00AB04,
	跑去=0xFA00AB05,
	跑回=0xFA00AB06,
	站立=0xFA00AB07,--3
	施法=0xFA00AB08,
	防御=0xFA00AB09,
	待战=0xFA00AB10,--1
	挨打=0xFA00AB11--2
	}
SuoyouModel["锦衣鬼将_饰品"]={
	攻击=0xFA00AC01,
	攻击B=0xFA00AC02,
	倒地=0xFA00AC03,
	行走=0xFA00AC04,
	跑去=0xFA00AC05,
	跑回=0xFA00AC06,
	站立=0xFA00AC07,--3
	施法=0xFA00AC08,
	防御=0xFA00AC09,
	待战=0xFA00AC10,--1
	挨打=0xFA00AC11--2
	}
SuoyouModel["锦衣谛听"]={
	小图标=0xAA200200,大图标=0xAA200201,对话头像=0xAA200223,
	攻击=0xFA01AA01,
	攻击B=0xFA01AA02,
	倒地=0xFA01AA03,
	行走=0xFA01AA04,
	跑去=0xFA01AA05,
	跑回=0xFA01AA06,
	站立=0xFA01AA07,--3
	施法=0xFA01AA08,
	防御=0xFA01AA09,
	待战=0xFA01AA10,--1
	挨打=0xFA01AA11--2
	}
SuoyouModel["锦衣谛听_装饰"]={
	攻击=0xFA01AB01,
	攻击B=0xFA01AB02,
	倒地=0xFA01AB03,
	行走=0xFA01AB04,
	跑去=0xFA01AB05,
	跑回=0xFA01AB06,
	站立=0xFA01AB07,--3
	施法=0xFA01AB08,
	防御=0xFA01AB09,
	待战=0xFA01AB10,--1
	挨打=0xFA01AB11--2
	}
SuoyouModel["锦衣谛听_饰品"]={
	攻击=0xFA01AC01,
	攻击B=0xFA01AC02,
	倒地=0xFA01AC03,
	行走=0xFA01AC04,
	跑去=0xFA01AC05,
	跑回=0xFA01AC06,
	站立=0xFA01AC07,--3
	施法=0xFA01AC08,
	防御=0xFA01AC09,
	待战=0xFA01AC10,--1
	挨打=0xFA01AC11--2
	}
SuoyouModel["锦衣画魂"]={
	小图标=0xAA210800,大图标=0xABBBA003,对话头像=0xAA210817,
	攻击=0xFA02AA01,
	攻击B=0xFA02AA02,
	倒地=0xFA02AA03,
	行走=0xFA02AA04,
	跑去=0xFA02AA05,
	跑回=0xFA02AA06,
	站立=0xFA02AA07,--3
	施法=0xFA02AA08,
	防御=0xFA02AA09,
	待战=0xFA02AA10,--1
	挨打=0xFA02AA11--2
	}
SuoyouModel["锦衣画魂_装饰"]={
	攻击=0xFA02AB01,
	攻击B=0xFA02AB02,
	倒地=0xFA02AB03,
	行走=0xFA02AB04,
	跑去=0xFA02AB05,
	跑回=0xFA02AB06,
	站立=0xFA02AB07,--3
	施法=0xFA02AB08,
	防御=0xFA02AB09,
	待战=0xFA02AB10,--1
	挨打=0xFA02AB11--2
	}
SuoyouModel["锦衣画魂_饰品"]={
	攻击=0xFA02AB01,
	攻击B=0xFA02AB02,
	倒地=0xFA02AB03,
	行走=0xFA02AB04,
	跑去=0xFA02AB05,
	跑回=0xFA02AB06,
	站立=0xFA02AB07,--3
	施法=0xFA02AB08,
	防御=0xFA02AB09,
	待战=0xFA02AB10,--1
	挨打=0xFA02AB11--2
	}
SuoyouModel["锦衣雷鸟人"]={
	小图标=0xAA204400,大图标=0xABBBA006,对话头像=0xAA204423,
	攻击=0xFA03AA01,
	攻击B=0xFA03AA02,
	倒地=0xFA03AA03,
	行走=0xFA03AA04,
	跑去=0xFA03AA05,
	跑回=0xFA03AA06,
	站立=0xFA03AA07,--3
	施法=0xFA03AA08,
	防御=0xFA03AA09,
	待战=0xFA03AA10,--1
	挨打=0xFA03AA11--2
	}
SuoyouModel["锦衣雷鸟人_装饰"]={
	攻击=0xFA03AB01,
	攻击B=0xFA03AB02,
	倒地=0xFA03AB03,
	行走=0xFA03AB04,
	跑去=0xFA03AB05,
	跑回=0xFA03AB06,
	站立=0xFA03AB07,--3
	施法=0xFA03AB08,
	防御=0xFA03AB09,
	待战=0xFA03AB10,--1
	挨打=0xFA03AB11--2
	}
SuoyouModel["锦衣雷鸟人_饰品"]={
	攻击=0xFA03AB01,
	攻击B=0xFA03AB02,
	倒地=0xFA03AB03,
	行走=0xFA03AB04,
	跑去=0xFA03AB05,
	跑回=0xFA03AB06,
	站立=0xFA03AB07,--3
	施法=0xFA03AB08,
	防御=0xFA03AB09,
	待战=0xFA03AB10,--1
	挨打=0xFA03AB11--2
	}
SuoyouModel["锦衣龙鲤"]={
	小图标=0xAA204700,大图标=0xABBBA007,对话头像=0xAA204723,
	攻击=0xFA04AA01,
	攻击B=0xFA04AA02,
	倒地=0xFA04AA03,
	行走=0xFA04AA04,
	跑去=0xFA04AA05,
	跑回=0xFA04AA06,
	站立=0xFA04AA07,--3
	施法=0xFA04AA08,
	防御=0xFA04AA09,
	待战=0xFA04AA10,--1
	挨打=0xFA04AA11--2
	}
SuoyouModel["锦衣龙鲤_装饰"]={
	攻击=0xFA04AB01,
	攻击B=0xFA04AB02,
	倒地=0xFA04AB03,
	行走=0xFA04AB04,
	跑去=0xFA04AB05,
	跑回=0xFA04AB06,
	站立=0xFA04AB07,--3
	施法=0xFA04AB08,
	防御=0xFA04AB09,
	待战=0xFA04AB10,--1
	挨打=0xFA04AB11--2
	}
SuoyouModel["锦衣龙鲤_饰品"]={
	攻击=0xFA04AB01,
	攻击B=0xFA04AB02,
	倒地=0xFA04AB03,
	行走=0xFA04AB04,
	跑去=0xFA04AB05,
	跑回=0xFA04AB06,
	站立=0xFA04AB07,--3
	施法=0xFA04AB08,
	防御=0xFA04AB09,
	待战=0xFA04AB10,--1
	挨打=0xFA04AB11--2
	}
SuoyouModel["锦衣持国巡守"]={
	小图标=0xAA210200,大图标=0xABBBA012,对话头像=0xAA210217,
	攻击=0xFA05AA01,
	攻击B=0xFA05AA02,
	倒地=0xFA05AA03,
	行走=0xFA05AA04,
	跑去=0xFA05AA05,
	跑回=0xFA05AA06,
	站立=0xFA05AA07,--3
	施法=0xFA05AA08,
	防御=0xFA05AA09,
	待战=0xFA05AA10,--1
	挨打=0xFA05AA11--2
	}
SuoyouModel["锦衣持国巡守_装饰"]={
	攻击=0xFA05AB01,
	攻击B=0xFA05AB02,
	倒地=0xFA05AB03,
	行走=0xFA05AB04,
	跑去=0xFA05AB05,
	跑回=0xFA05AB06,
	站立=0xFA05AB07,--3
	施法=0xFA05AB08,
	防御=0xFA05AB09,
	待战=0xFA05AB10,--1
	挨打=0xFA05AB11--2
	}
SuoyouModel["锦衣持国巡守_饰品"]={
	攻击=0xFA05AB01,
	攻击B=0xFA05AB02,
	倒地=0xFA05AB03,
	行走=0xFA05AB04,
	跑去=0xFA05AB05,
	跑回=0xFA05AB06,
	站立=0xFA05AB07,--3
	施法=0xFA05AB08,
	防御=0xFA05AB09,
	待战=0xFA05AB10,--1
	挨打=0xFA05AB11--2
	}
SuoyouModel["锦衣月魅"]={
	小图标=0xAA206800,大图标=0xABBBA005,对话头像=0xAA206823,
	攻击=0xFA06AA01,
	攻击B=0xFA06AA02,
	倒地=0xFA06AA03,
	行走=0xFA06AA04,
	跑去=0xFA06AA05,
	跑回=0xFA06AA06,
	站立=0xFA06AA07,--3
	施法=0xFA06AA08,
	防御=0xFA06AA09,
	待战=0xFA06AA10,--1
	挨打=0xFA06AA11--2
	}
SuoyouModel["锦衣月魅_装饰"]={
	攻击=0xFA06AB01,
	攻击B=0xFA06AB02,
	倒地=0xFA06AB03,
	行走=0xFA06AB04,
	跑去=0xFA06AB05,
	跑回=0xFA06AB06,
	站立=0xFA06AB07,--3
	施法=0xFA06AB08,
	防御=0xFA06AB09,
	待战=0xFA06AB10,--1
	挨打=0xFA06AB11--2
	}
SuoyouModel["锦衣月魅_饰品"]={
	攻击=0xFA06AC01,
	攻击B=0xFA06AC02,
	倒地=0xFA06AC03,
	行走=0xFA06AC04,
	跑去=0xFA06AC05,
	跑回=0xFA06AC06,
	站立=0xFA06AC07,--3
	施法=0xFA06AC08,
	防御=0xFA06AC09,
	待战=0xFA06AC10,--1
	挨打=0xFA06AC11--2
	}
SuoyouModel["锦衣涂山瞳"]={
	小图标=0xAA100000,大图标=0xABBBA009,对话头像=0xAA100027,
	攻击=0xFA07AA01,
	攻击B=0xFA07AA02,
	倒地=0xFA07AA03,
	行走=0xFA07AA04,
	跑去=0xFA07AA05,
	跑回=0xFA07AA06,
	站立=0xFA07AA07,--3
	施法=0xFA07AA08,
	防御=0xFA07AA09,
	待战=0xFA07AA10,--1
	挨打=0xFA07AA11--2
	}
SuoyouModel["锦衣涂山瞳_装饰"]={
	攻击=0xFA07AB01,
	攻击B=0xFA07AB02,
	倒地=0xFA07AB03,
	行走=0xFA07AB04,
	跑去=0xFA07AB05,
	跑回=0xFA07AB06,
	站立=0xFA07AB07,--3
	施法=0xFA07AB08,
	防御=0xFA07AB09,
	待战=0xFA07AB10,--1
	挨打=0xFA07AB11--2
	}
SuoyouModel["锦衣涂山瞳_饰品"]={
	攻击=0xFA07AC01,
	攻击B=0xFA07AC02,
	倒地=0xFA07AC03,
	行走=0xFA07AC04,
	跑去=0xFA07AC05,
	跑回=0xFA07AC06,
	站立=0xFA07AC07,--3
	施法=0xFA07AC08,
	防御=0xFA07AC09,
	待战=0xFA07AC10,--1
	挨打=0xFA07AC11--2
	}
SuoyouModel["锦衣涂山雪"]={
	小图标=0xAAA10100,大图标=0xABBBA010,对话头像=0xAAA10123,
	攻击=0xFA08AA01,
	攻击B=0xFA08AA02,
	倒地=0xFA08AA03,
	行走=0xFA08AA04,
	跑去=0xFA08AA05,
	跑回=0xFA08AA06,
	站立=0xFA08AA07,--3
	施法=0xFA08AA08,
	防御=0xFA08AA09,
	待战=0xFA08AA10,--1
	挨打=0xFA08AA11--2
	}
SuoyouModel["锦衣涂山雪_装饰"]={
	攻击=0xFA08AB01,
	攻击B=0xFA08AB02,
	倒地=0xFA08AB03,
	行走=0xFA08AB04,
	跑去=0xFA08AB05,
	跑回=0xFA08AB06,
	站立=0xFA08AB07,--3
	施法=0xFA08AB08,
	防御=0xFA08AB09,
	待战=0xFA08AB10,--1
	挨打=0xFA08AB11--2
	}
SuoyouModel["锦衣涂山雪_饰品"]={
	攻击=0xFA08AC01,
	攻击B=0xFA08AC02,
	倒地=0xFA08AC03,
	行走=0xFA08AC04,
	跑去=0xFA08AC05,
	跑回=0xFA08AC06,
	站立=0xFA08AC07,--3
	施法=0xFA08AC08,
	防御=0xFA08AC09,
	待战=0xFA08AC10,--1
	挨打=0xFA08AC11--2
	}
SuoyouModel["锦衣吸血鬼"]={
	小图标=0xAA205600,大图标=0xABBBA008,对话头像=0xAA205623,
	攻击=0xFA09AA01,
	攻击B=0xFA09AA02,
	倒地=0xFA09AA03,
	行走=0xFA09AA04,
	跑去=0xFA09AA05,
	跑回=0xFA09AA06,
	站立=0xFA09AA07,--3
	施法=0xFA09AA08,
	防御=0xFA09AA09,
	待战=0xFA09AA10,--1
	挨打=0xFA09AA11--2
	}
SuoyouModel["锦衣吸血鬼_装饰"]={
	攻击=0xFA09AB01,
	攻击B=0xFA09AB02,
	倒地=0xFA09AA03,
	行走=0xFA09AB04,
	跑去=0xFA09AB05,
	跑回=0xFA09AB06,
	站立=0xFA09AB07,--3
	施法=0xFA09AB08,
	防御=0xFA09AB09,
	待战=0xFA09AB07,--1
	挨打=0xFA09AB10--2
	}
SuoyouModel["锦衣吸血鬼_饰品"]={
	攻击=0xFA09AB01,
	攻击B=0xFA09AB02,
	倒地=0xFA09AA03,
	行走=0xFA09AB04,
	跑去=0xFA09AB05,
	跑回=0xFA09AB06,
	站立=0xFA09AB07,--3
	施法=0xFA09AB08,
	防御=0xFA09AB09,
	待战=0xFA09AB07,--1
	挨打=0xFA09AB10--2
	}
SuoyouModel["锦衣毗舍童子"]={
	小图标=0xAA201600,大图标=0xABBBA011,对话头像=0xAA201623,
	攻击=0xFA10AA01,
	攻击B=0xFA10AA02,
	倒地=0xFA10AA03,
	行走=0xFA10AA04,
	跑去=0xFA10AA05,
	跑回=0xFA10AA06,
	站立=0xFA10AA07,--3
	施法=0xFA10AA08,
	防御=0xFA10AA09,
	待战=0xFA10AA10,--1
	挨打=0xFA10AA11--2
	}
SuoyouModel["锦衣毗舍童子_装饰"]={
	攻击=0xFA10AB01,
	攻击B=0xFA10AB02,
	倒地=0xFA10AB03,
	行走=0xFA10AB04,
	跑去=0xFA10AB05,
	跑回=0xFA10AB06,
	站立=0xFA10AB07,--3
	施法=0xFA10AB08,
	防御=0xFA10AB09,
	待战=0xFA10AB10,--1
	挨打=0xFA10AB11--2
	}
SuoyouModel["锦衣毗舍童子_饰品"]={
	攻击=0xFA10AC01,
	攻击B=0xFA10AC02,
	倒地=0xFA10AC03,
	行走=0xFA10AC04,
	跑去=0xFA10AC05,
	跑回=0xFA10AC06,
	站立=0xFA10AC07,--3
	施法=0xFA10AC08,
	防御=0xFA10AC09,
	待战=0xFA10AC10,--1
	挨打=0xFA10AC11--2
	}
SuoyouModel["锦衣狂豹人形"]={
	小图标=0xAA211200,大图标=0xABBBA001,对话头像=0xAA211217,
	攻击=0xFA11AA01,
	攻击B=0xFA11AA02,
	倒地=0xFA11AA03,
	行走=0xFA11AA04,
	跑去=0xFA11AA05,
	跑回=0xFA11AA06,
	站立=0xFA11AA07,--3
	施法=0xFA11AA08,
	防御=0xFA11AA09,
	待战=0xFA11AA10,--1
	挨打=0xFA11AA11--2
	}
SuoyouModel["锦衣狂豹人形_装饰"]={
	攻击=0xFA11AB01,
	攻击B=0xFA11AB02,
	倒地=0xFA11AB03,
	行走=0xFA11AB04,
	跑去=0xFA11AB05,
	跑回=0xFA11AB06,
	站立=0xFA11AB07,--3
	施法=0xFA11AB08,
	防御=0xFA11AB09,
	待战=0xFA11AB10,--1
	挨打=0xFA11AB11--2
	}
SuoyouModel["锦衣狂豹人形_饰品"]={
	攻击=0xFA11AB01,
	攻击B=0xFA11AB02,
	倒地=0xFA11AB03,
	行走=0xFA11AB04,
	跑去=0xFA11AB05,
	跑回=0xFA11AB06,
	站立=0xFA11AB07,--3
	施法=0xFA11AB08,
	防御=0xFA11AB09,
	待战=0xFA11AB10,--1
	挨打=0xFA11AB11--2
	}
SuoyouModel["锦衣猫灵人形"]={
	小图标=0xAA211900,大图标=0xABBBA013,对话头像=0xAA211917,
	攻击=0xFA12AA01,
	攻击B=0xFA12AA02,
	倒地=0xFA12AA03,
	行走=0xFA12AA04,
	跑去=0xFA12AA05,
	跑回=0xFA12AA06,
	站立=0xFA12AA07,--3
	施法=0xFA12AA08,
	防御=0xFA12AA09,
	待战=0xFA12AA10,--1
	挨打=0xFA12AA11--2
	}
SuoyouModel["锦衣猫灵人形_装饰"]={
	攻击=0xFA12AB01,
	攻击B=0xFA12AB02,
	倒地=0xFA12AB03,
	行走=0xFA12AB04,
	跑去=0xFA12AB05,
	跑回=0xFA12AB06,
	站立=0xFA12AB07,--3
	施法=0xFA12AB08,
	防御=0xFA12AB09,
	待战=0xFA12AB10,--1
	挨打=0xFA12AB11--2
	}
SuoyouModel["锦衣猫灵人形_饰品"]={
	攻击=0xFA12AB01,
	攻击B=0xFA12AB02,
	倒地=0xFA12AB03,
	行走=0xFA12AB04,
	跑去=0xFA12AB05,
	跑回=0xFA12AB06,
	站立=0xFA12AB07,--3
	施法=0xFA12AB08,
	防御=0xFA12AB09,
	待战=0xFA12AB10,--1
	挨打=0xFA12AB11--2
	}
SuoyouModel["锦衣日游神"]={
	小图标=0xAA205100,大图标=0xABBBA002,对话头像=0xAA205123,
	攻击=0xFA13AA01,
	攻击B=0xFA13AA02,
	倒地=0xFA13AA03,
	行走=0xFA13AA04,
	跑去=0xFA13AA05,
	跑回=0xFA13AA06,
	站立=0xFA13AA07,--3
	施法=0xFA13AA08,
	防御=0xFA13AA09,
	待战=0xFA13AA10,--1
	挨打=0xFA13AA11--2
	}
SuoyouModel["锦衣日游神_装饰"]={
	攻击=0xFA13AB01,
	攻击B=0xFA13AB02,
	倒地=0xFA13AB03,
	行走=0xFA13AB04,
	跑去=0xFA13AB05,
	跑回=0xFA13AB06,
	站立=0xFA13AB07,--3
	施法=0xFA13AB08,
	防御=0xFA13AB09,
	待战=0xFA13AB10,--1
	挨打=0xFA13AB11--2
	}
SuoyouModel["锦衣日游神_饰品"]={
	攻击=0xFA13AC01,
	攻击B=0xFA13AC02,
	倒地=0xFA13AC03,
	行走=0xFA13AC04,
	跑去=0xFA13AC05,
	跑回=0xFA13AC06,
	站立=0xFA13AC07,--3
	施法=0xFA13AC08,
	防御=0xFA13AC09,
	待战=0xFA13AC10,--1
	挨打=0xFA13AC11--2
	}

function 取头像(jp)
	local jps = {}
	if jp == "影精灵" then
		jps[2] = "yjlx44"
		jps[3] = "yjlbb"
		jps[4] = "yjltx"
		jps[5] = "yjlx65"
		jps[6] = "yjlsx"
		jps[7] = "影精灵.dll"
	  elseif jp == "虎头怪" then
		jps[2] = 1845064969
		jps[3] = 2571786186
		jps[4] = 1584078605
		jps[5] = 3359055550
		jps[6] = 865988562
		jps[7] = "wzife.wdf"
	elseif jp == "舞天姬" then
		jps[2] = 4183923439
		jps[3] = 837105923
		jps[4] = 3547289847
		jps[5] = 2410388328
		jps[6] = 783365583
		jps[7] = "wzife.wdf"
	elseif jp == "龙太子" then
		jps[2] = 2968964991
		jps[3] = 3724855951
		jps[4] = 269238848
		jps[5] = 1570362097
		jps[6] = 2585947038
		jps[7] = "wzife.wdf"
	elseif jp == "神天兵" then
		jps[2] = 3633356312
		jps[3] = 2078571550
		jps[4] = 419903813
		jps[5] = 3805405383
		jps[6] = 2041810656
		jps[7] = "wzife.wdf"
	elseif jp == "逍遥生" then
		jps[2] = 3988784113
		jps[3] = 2557559806
		jps[4] = 4177070114
		jps[5] = 3996010872
		jps[6] = 92987728
		jps[7] = "wzife.wdf"
	elseif jp == "偃无师" then
		jps[2] = 10559816
		jps[3] = 10559817
		jps[4] = 10559815
		jps[5] = 10559824
		jps[6] = 10559814
		jps[7] = "wzife.wd5"
	elseif jp == "玄彩娥" then
		jps[2] = 1823274963
		jps[3] = 1560323955
		jps[4] = 2423018618
		jps[5] = 947503475
		jps[6] = 838654255
		jps[7] = "wzife.wdf"
	elseif jp == "杀破狼" then
		jps[2] = 2873683137
		jps[3] = 2518794069
		jps[4] = 3753428933
		jps[5] = 1033988096
		jps[6] = 1978306148
		jps[7] = "wzife.wdf"
	elseif jp == "鬼潇潇" then
		jps[2] = 10559800
		jps[3] = 10559809
		jps[4] = 10559801
		jps[5] = 10559826
		jps[6] = 10559808
		jps[7] = "wzife.wd5"
	elseif jp == "桃夭夭" then
		jps[2] = 10559810
		jps[3] = 10559813
		jps[4] = 10559811
		jps[5] = 10559825
		jps[6] = 10559812
		jps[7] = "wzife.wd5"
	elseif jp == "巫蛮儿" then
		jps[2] = 1969001626
		jps[3] = 4127390861
		jps[4] = 1288146214
		jps[5] = 2569948308
		jps[6] = 2921462013
		jps[7] = "wzife.wdf"
	elseif jp == "英女侠" then
		jps[2] = 4082176052
		jps[3] = 1714055813
		jps[4] = 112453972
		jps[5] = 1619905405
		jps[6] = 3703514110
		jps[7] = "wzife.wdf"
	elseif jp == "狐美人" then
		jps[2] = 193125810
		jps[3] = 1337913854
		jps[4] = 3274417234
		jps[5] = 764631086
		jps[6] = 507487855
		jps[7] = "wzife.wdf"
	elseif jp == "剑侠客" then
		jps[2] = 3615876352
		jps[3] = 3402595886
		jps[4] = 1410056737
		jps[5] = 366914688
		jps[6] = 485626985
		jps[7] = "wzife.wdf"
	elseif jp == "羽灵神" then
		jps[2] = 4194685178
		jps[3] = 983360139
		jps[4] = 1939929797
		jps[5] = 311711491
		jps[6] = 415704253
		jps[7] = "wzife.wdf"
	elseif jp == "飞燕女" then
		jps[2] = 343987807
		jps[3] = 2821539099
		jps[4] = 1784035300
		jps[5] = 819471807
		jps[6] = 3149034421
		jps[7] = "wzife.wdf"
	elseif jp == "巨魔王" then
		jps[2] = 1285321634
		jps[3] = 2476120802
		jps[4] = 3683691832
		jps[5] = 4077790929
		jps[6] = 3295538630
		jps[7] = "wzife.wdf"
	elseif jp == "骨精灵" then
		jps[2] = 1580183394
		jps[3] = 2126719765
		jps[4] = 3992137269
		jps[5] = 1433642861
		jps[6] = 2072196139
		jps[7] = "wzife.wdf"

	elseif jp == "战火穷奇" or jp=="鲲·霓云" or jp == "萤火霜兔" or jp == "九尾冰狐" or jp == "天使猪猪" or jp == "无名"  or jp == "避水金睛兽·钻白" or jp == "避水金睛兽·黑石" or jp == "没牙仔" or jp == "玉龙临" or jp == "光煞" or jp == "霆云飞廉" then
		jps[2] = 0xB14AAD46
		jps[3] = 0xB14AAD46
		jps[4] = 0xB14AAD46
		jps[5] = 0xB14AAD46
		jps[6] = 0xB14AAD46
		jps[7] = "wzife.wdf"
	elseif jp == "系统" then
		jps[2] = 3615876352
		jps[3] = 3402595886
		jps[4] = 1410056737
		jps[5] = 366914688
		jps[6] = 485626985
		jps[7] = "wzife.wdf"
		--########################################################?自己修改?##########################################
	elseif jp == "巫奎虎_助战" then
		jps[1] = 16777298
		jps[7] = "zdy.rpk"
	elseif jp == "二郎神_助战" then
		jps[1] = 16777237
		jps[7] = "zdy.rpk"
	elseif jp == "地涌夫人_助战" then
		jps[1] = 16777232
		jps[7] = "zdy.rpk"
	elseif jp == "晶晶姑娘_助战" then
		jps[1] = 16777249
		jps[7] = "zdy.rpk"
	elseif jp == "九灵元圣_助战" then
		jps[1] = 16777283
		jps[7] = "zdy.rpk"
	elseif jp == "程咬金_助战" then
		jps[1] = 16777220
		jps[7] = "zdy.rpk"
	elseif jp == "青狮精_助战" then
		jps[1] = 16777252
		jps[7] = "zdy.rpk"
	elseif jp == "地藏菩萨_助战" then
		jps[1] = 16777223
		jps[7] = "zdy.rpk"
	elseif jp == "观音菩萨_助战" then
		jps[1] = 16777240
		jps[7] = "zdy.rpk"
	elseif jp == "李天王_助战" then
		jps[1] = 16777264
		jps[7] = "zdy.rpk"
	elseif jp == "东海龙王_助战" then
		jps[1] = 16777267
		jps[7] = "zdy.rpk"
	elseif jp == "牛魔王_助战" then
		jps[1] = 16777268
		jps[7] = "zdy.rpk"
	elseif jp == "菩提老祖_助战" then
		jps[1] = 16777271
		jps[7] = "zdy.rpk"
	elseif jp == "沙和尚_助战" then
		jps[1] = 16777286
		jps[7] = "zdy.rpk"
	elseif jp == "孙婆婆_助战" then
		jps[1] = 16777289
		jps[7] = "zdy.rpk"
	elseif jp == "齐天大圣_助战" then
		jps[1] = 16777280
		jps[7] = "zdy.rpk"
	elseif jp == "阎罗王_助战" then
		jps[1] = 16777301
		jps[7] = "zdy.rpk"
	elseif jp == "镇元子_助战" then
		jps[1] = 16777304
		jps[7] = "zdy.rpk"
	elseif jp == "成周妖皇_助战" then
		jps[1] = 16777217
		jps[7] = "zdy.rpk"
	elseif jp == "猪八戒_助战" then
		jps[1] = 16777313
		jps[7] = "zdy.rpk"
	elseif jp == "九头虫_助战" then
		jps[1] = 16777255
		jps[7] = "zdy.rpk"
	elseif jp == "梦幻精灵" then
		jps[2] = 0x4f8bd202
		jps[7] = "wzife.wdf"
	elseif jp == "系统" then
		jps[2] = 0x28a47088
		jps[7] = "common/wzife.wdf"
		---------------------
	
	end
	------------梦战头像结束
	--########################################################?自己修改?##########################################
	if jps[7] == nil and jps[4] == nil then
		local jps0 = 取所有模型(jp)
		if jps0 ~= nil then
			if jps0.大图标 ~= nil and jps0.大图标 ~= "" then
				jps[1] = jps0.小图标
			end
			if jps0.小图标 ~= nil and jps0.小图标 ~= "" then
				if jps0.大图标 == 0 and jps0.小图标 ~= 0 then
					jps[2] = jps0.小图标
				else
					jps[2] = jps0.大图标
				end
			end
			if jps0.对话头像 ~= nil and jps0.对话头像 ~= "" then
				jps[4] = jps0.对话头像
			end
			jps[7] = ""
			jps[8] = ""
			jps[10] = ""
		end
	end
	if jps[1] == nil or jps[1] == 0 then
		jps[1] = 0xB56ECBA9
	end
	if jps[2] == nil or jps[2] == 0 then
		jps[2] = 0x338A1A07
	end
	if jps[4] == nil or jps[4] == 0 then
		jps[4] = 0xF14B1666
	end
	return jps
end

-- local 新锦衣 = {
-- 	影精灵 = {
-- 		挨打 = 0x4,  --站立
-- 		行走 = 0x3,  --移动
-- 		跑去 = 0x3,  --移动
-- 		防御 = 0x4,  --站立
-- 		攻击 = 0x1,  --攻击
-- 		死亡 = 0,
-- 		施法 = 0x2,  --施法--素材施法卡
-- 		静立 = 0x4,  --站立
-- },
-- }
PutongModel={}
PutongModel["怒蛟BOSS"]={
    chs_1 = 0xA1005228
    ,chs_2 = 0xA1005228
    ,chs_3 = "nujiao.wdf"
    }

PutongModel["新蟠桃"]={
	chs_1 = 0x23b33d3d
	,chs_2 = 0x23b33d3d
	,chs_3 =  "自用图标.wdf"
}
PutongModel["金宝箱"]={
	chs_1 = 0x7F5B7CB4
	,chs_2 = 0x7F5B7CB4
	,chs_3 = "shape.wdc"
	}
PutongModel["木宝箱"]={
	chs_1 = 0x7F5B7CB4
	,chs_2 = 0x7F5B7CB4
	,chs_3 = "shape.wdc"
	}
PutongModel["阵眼"]={
	chs_1 = 0x7F5B7CB4
	,chs_2 = nil
	,chs_3 = "shape.wdc"

	}
PutongModel["灵木宝树"]={
	chs_1 = 0xF972D8EF
	,chs_2 = nil
	,chs_3 = "common/shape.wdf"
	}

PutongModel["裂缝"]={ --青丘迷雾
	chs_1 = 0x78044D48
	,chs_2 = 0x78044D48
	,chs_3 = "shape.wda"
	}
PutongModel["龙行玉泽"]={
	chs_1 = 0xBDE23003
	,chs_2 = 0xBDE23002
	,chs_3 = "audio/1179.mp3"
	}
	
PutongModel["风祖飞廉"]={
    chs_1 = 0x00001005
    ,chs_2 = 0x00001004
    ,chs_3 = "影精灵.wdf"
    }
	
PutongModel["刑天"]={
    chs_1 = 0x00001003
    ,chs_2 = 0x00001002
    ,chs_3 = "影精灵.wdf"
    }
PutongModel["影精灵"]={
    chs_1 = 0xfafe0921
    ,chs_2 =0xfafe0922
    ,chs_3 = "cwmx.wdf"
    }
 PutongModel["影精灵_爪刺"]={
     chs_1 = 0xfafe0955
     ,chs_2 =0xfafe0956
     ,chs_3 = "cwmx.wdf"
     }
PutongModel["贵霜之牙_影精灵"]={
       chs_1 = 0xA1000414--站立
       ,chs_2 = 0xA1000415--行走
       ,chs_3 = "影精灵.wdf"
       }
PutongModel["九阴勾魂_影精灵"]={
       chs_1 = 0xABA00069--站立
       ,chs_2 = 0xABA00070--行走
       ,chs_3 = "影精灵.wdf"
       }
PutongModel["忘川三途_影精灵"]={
       chs_1 = 0xABAB0174--站立
       ,chs_2 = 0xABAB0175--行走
       ,chs_3 = "影精灵.wdf"
       }
PutongModel["撕天_影精灵"]={
       chs_1 = 0xABAB0210--站立
       ,chs_2 = 0xABAB0211--行走
       ,chs_3 = "影精灵.wdf"
       }
PutongModel["毒牙_影精灵"]={
       chs_1 = 0xABAB0220--站立
       ,chs_2 = 0xABAB0221--行走
       ,chs_3 = "影精灵.wdf"
       }
PutongModel["离钩_影精灵"]={
       chs_1 = 0xABAB0322--站立
       ,chs_2 = 0xABAB0323--行走
       ,chs_3 = "影精灵.wdf"
       }
PutongModel["铁爪_影精灵"]={
       chs_1 = 0xABAB0434--站立
       ,chs_2 = 0xABAB0435--行走
       ,chs_3 = "影精灵.wdf"
       }
PutongModel["雪蚕之刺_影精灵"]={
       chs_1 = 0xABAB0454--站立
       ,chs_2 = 0xABAB0455--行走
       ,chs_3 = "影精灵.wdf"
       }
PutongModel["青刚刺_影精灵"]={
       chs_1 = 0xABAB0464--站立
       ,chs_2 = 0xABAB0465--行走
       ,chs_3 = "影精灵.wdf"
       }
PutongModel["青龙牙_影精灵"]={
       chs_1 = 0xABAB0484--站立
       ,chs_2 = 0xABAB0485--行走
       ,chs_3 = "影精灵.wdf"
       }


PutongModel["影精灵_魔棒"]={
     chs_1 = 0xfafe0939
     ,chs_2 =0xfafe0940
     ,chs_3 = "cwmx.wdf"
     }
PutongModel["丝萝乔木_影精灵"]={
       chs_1 = 0xABAB0007--站立
       ,chs_2 = 0xABAB0008--行走
       ,chs_3 = "影精灵.wdf"
       }
PutongModel["墨玉骷髅_影精灵"]={
       chs_1 = 0xABAB0131--站立
       ,chs_2 = 0xABAB0132--行走
       ,chs_3 = "影精灵.wdf"
       }
PutongModel["沧海_影精灵"]={
       chs_1 = 0xABAB0230--站立
       ,chs_2 = 0xABAB0231--行走
       ,chs_3 = "影精灵.wdf"
       }
PutongModel["满天星_影精灵"]={
       chs_1 = 0xABAB0240--站立
       ,chs_2 = 0xABAB0241--行走
       ,chs_3 = "影精灵.wdf"
       }
PutongModel["点金棒_影精灵"]={
       chs_1 = 0xABAB0250--站立
       ,chs_2 = 0xABAB0251--行走
       ,chs_3 = "影精灵.wdf"
       }
PutongModel["盘龙_影精灵"]={
       chs_1 = 0xABAB0286--站立
       ,chs_2 = 0xABAB0287--行走
       ,chs_3 = "影精灵.wdf"
       }
PutongModel["红莲_影精灵"]={
       chs_1 = 0xABAB0358--站立
       ,chs_2 = 0xABAB0359--行走
       ,chs_3 = "影精灵.wdf"
       }
PutongModel["细木棒_影精灵"]={
       chs_1 = 0xABAB0368--站立
       ,chs_2 = 0xABAB0369--行走
       ,chs_3 = "影精灵.wdf"
       }
PutongModel["醍醐_影精灵"]={
       chs_1 = 0xABAB0424--站立
       ,chs_2 = 0xABAB0425--行走
       ,chs_3 = "影精灵.wdf"
       }

PutongModel["降魔玉杵_影精灵"]={
       chs_1 = 0xABAB0444--站立
       ,chs_2 = 0xABAB0445--行走
       ,chs_3 = "影精灵.wdf"
       }
PutongModel["青藤玉树_影精灵"]={
       chs_1 = 0xABAB0474--站立
       ,chs_2 = 0xABAB0475--行走
       ,chs_3 = "影精灵.wdf"
       }

PutongModel["影精灵_双斧乾"]={
        chs_1 = 0xfafe0921
        ,chs_2 =0xfafe0922
        ,chs_3 = "cwmx.wdf"
        }
PutongModel["影精灵_双斧坤"]={
        chs_1 = 0xfafe0921
        ,chs_2 =0xfafe0922
        ,chs_3 = "cwmx.wdf"
        }
 PutongModel["影精灵坐下"]={
    chs_1 = 0xfafe0933
    ,chs_2 = 0xfafe0933
    ,chs_3 = "cwmx.wdf"
    }
 PutongModel["影精灵悲伤"]={
    chs_1 = 0xfafe0934
    ,chs_2 = 0xfafe0934
    ,chs_3 = "cwmx.wdf"
    }
 PutongModel["影精灵发怒"]={
    chs_1 = 0xfafe0935
    ,chs_2 = 0xfafe0935
    ,chs_3 = "cwmx.wdf"
    }
 PutongModel["影精灵舞蹈"]={
    chs_1 = 0xfafe0936
    ,chs_2 = 0xfafe0936
    ,chs_3 = "cwmx.wdf"
    }
 PutongModel["影精灵行礼"]={
    chs_1 = 0xfafe0937
    ,chs_2 = 0xfafe0937
    ,chs_3 = "cwmx.wdf"
    }
 PutongModel["影精灵休息"]={
    chs_1 = 0xfafe0933
    ,chs_2 = 0xfafe0933
    ,chs_3 = "cwmx.wdf"
    }
 PutongModel["影精灵招手"]={
    chs_1 = 0xfafe0938
    ,chs_2 = 0xfafe0938
    ,chs_3 = "cwmx.wdf"
    }
 PutongModel["影精灵倒地"]={
    chs_1 = 0xfafe0924
    ,chs_2 = 0xfafe0924
    ,chs_3 = "cwmx.wdf"
    }
  ---双斧
 PutongModel["顽石双斧(坤)_影精灵"]={
     chs_1 = 0xfafe0964
     ,chs_2 = 0xfafe0965
     ,chs_3 = "cwmx.wdf"
     }
 PutongModel["顽石双斧(乾)_影精灵"]={
     chs_1 = 0xfafe0972
     ,chs_2 = 0xfafe0973
     ,chs_3 = "cwmx.wdf"
     }

 PutongModel["镔铁双斧(坤)_影精灵"]={
     chs_1 = 0xfafe0964
     ,chs_2 = 0xfafe0965
     ,chs_3 = "cwmx.wdf"
     }
 PutongModel["镔铁双斧(乾)_影精灵"]={
     chs_1 = 0xfafe0972
     ,chs_2 = 0xfafe0973
     ,chs_3 = "cwmx.wdf"
     }
 PutongModel["黑曜双斧(坤)_影精灵"]={
     chs_1 = 0xfafe0964
     ,chs_2 = 0xfafe0965
     ,chs_3 = "cwmx.wdf"
     }
 PutongModel["黑曜双斧(乾)_影精灵"]={
     chs_1 = 0xfafe0972
     ,chs_2 = 0xfafe0973
     ,chs_3 = "cwmx.wdf"
     }
 PutongModel["枭首双斧(坤)_影精灵"]={
      chs_1 = 0xfafe0991
     ,chs_2 = 0xfafe0992
     ,chs_3 = "cwmx.wdf"
      }
 PutongModel["枭首双斧(乾)_影精灵"]={
      chs_1 = 0xfafe0993
     ,chs_2 = 0xfafe0994
     ,chs_3 = "cwmx.wdf"
     }

 PutongModel["破军双斧(坤)_影精灵"]={
      chs_1 = 0xfafe0991
     ,chs_2 = 0xfafe0992
     ,chs_3 = "cwmx.wdf"
     }
 PutongModel["破军双斧(乾)_影精灵"]={
     chs_1 = 0xfafe0993
     ,chs_2 = 0xfafe0994
     ,chs_3 = "cwmx.wdf"
     }
 PutongModel["隳城双戚(坤)_影精灵"]={
      chs_1 = 0xfafe0991
     ,chs_2 = 0xfafe0992
     ,chs_3 = "cwmx.wdf"
     }
 PutongModel["隳城双戚(乾)_影精灵"]={
     chs_1 = 0xfafe0993
     ,chs_2 = 0xfafe0994
     ,chs_3 = "cwmx.wdf"
     }
 PutongModel["飞头蛮(坤)_影精灵"]={
     chs_1 = 0xfafe1005
     ,chs_2 = 0xfafe1006
     ,chs_3 = "cwmx.wdf"
     }
 PutongModel["飞头蛮(乾)_影精灵"]={
     chs_1 = 0xfafe1017
     ,chs_2 = 0xfafe1018
     ,chs_3 = "cwmx.wdf"
     }
 PutongModel["竹叶青(坤)_影精灵"]={
     chs_1 = 0xfafe1029
     ,chs_2 = 0xfafe1030
     ,chs_3 = "cwmx.wdf"
     }
 PutongModel["竹叶青(乾)_影精灵"]={
     chs_1 = 0xfafe1041
     ,chs_2 = 0xfafe1042
     ,chs_3 = "cwmx.wdf"
     }
 PutongModel["鲛煞(坤)_影精灵"]={
     chs_1 = 0xfafe1053
     ,chs_2 = 0xfafe1054
     ,chs_3 = "cwmx.wdf"
     }
 PutongModel["鲛煞(乾)_影精灵"]={
     chs_1 = 0xfafe1065
     ,chs_2 = 0xfafe1066
     ,chs_3 = "cwmx.wdf"
     }
 PutongModel["啖月(坤)_影精灵"]={
     chs_1 = 0xfafe1077
     ,chs_2 = 0xfafe1078
     ,chs_3 = "cwmx.wdf"
     }
 PutongModel["啖月(乾)_影精灵"]={
     chs_1 = 0xfafe1089
     ,chs_2 = 0xfafe1090
     ,chs_3 = "cwmx.wdf"
     }
 PutongModel["义战(坤)_影精灵"]={
     chs_1 = 0xfafe1101
     ,chs_2 = 0xfafe1102
     ,chs_3 = "cwmx.wdf"
     }
 PutongModel["义战(乾)_影精灵"]={
     chs_1 = 0xfafe1113
     ,chs_2 = 0xfafe1114
     ,chs_3 = "cwmx.wdf"
     }
 PutongModel["恶来(坤)_影精灵"]={
     chs_1 = 0xfafe1125
     ,chs_2 = 0xfafe1126
     ,chs_3 = "cwmx.wdf"
     }
 PutongModel["恶来(乾)_影精灵"]={
     chs_1 = 0xfafe1140
     ,chs_2 = 0xfafe1141
     ,chs_3 = "cwmx.wdf"
     }
 PutongModel["烬世野火(坤)_影精灵"]={
     chs_1 = 0xfafe1153
     ,chs_2 = 0xfafe1154
     ,chs_3 = "cwmx.wdf"
     }
 PutongModel["烬世野火(乾)_影精灵"]={
     chs_1 = 0xfafe1162
     ,chs_2 = 0xfafe1163
     ,chs_3 = "cwmx.wdf"
     }

 PutongModel["八狱末劫(坤)_影精灵"]={
     chs_1 = 0xfafe1198
     ,chs_2 = 0xfafe1199
     ,chs_3 = "cwmx.wdf"
     }
 PutongModel["八狱末劫(乾)_影精灵"]={
     chs_1 = 0xfafe1210
     ,chs_2 = 0xfafe1211
     ,chs_3 = "cwmx.wdf"
     }
 PutongModel["九州海沸(坤)_影精灵"]={
     chs_1 = 0xfafe1174
     ,chs_2 = 0xfafe1175
     ,chs_3 = "cwmx.wdf"
     }
 PutongModel["九州海沸(乾)_影精灵"]={
     chs_1 = 0xfafe1186
     ,chs_2 = 0xfafe1187
     ,chs_3 = "cwmx.wdf"
     }
 PutongModel["罗喉计都(坤)_影精灵"]={
     chs_1 = 0xfafe1222
     ,chs_2 = 0xfafe1223
     ,chs_3 = "cwmx.wdf"
     }
 PutongModel["罗喉计都(乾)_影精灵"]={
    chs_1 = 0xfafe1234
     ,chs_2 = 0xfafe1235
     ,chs_3 = "cwmx.wdf"
     }
 PutongModel["非天(坤)_影精灵"]={
     chs_1 = 0xfafe1247
     ,chs_2 = 0xfafe1248
     ,chs_3 = "cwmx.wdf"
     }
 PutongModel["非天(乾)_影精灵"]={
     chs_1 = 0xfafe1262
     ,chs_2 = 0xfafe1263
     ,chs_3 = "cwmx.wdf"
     }


function 取模型(ch, wq, qw, 锦衣, 武器类型)
	if ch == nil then ch = "火星人" end
	local chs = {}
	local ch2 = ch
	if wq ~= nil then
		wq = "_" .. wq
	else
		wq = ""
	end
	if ch == "巫蛮儿" or ch == "杀破狼" or ch == "羽灵神" or ch == "偃无师" or ch == "桃夭夭" or ch == "鬼潇潇" or ch == "逍遥生" or ch == "舞天姬" or ch == "影精灵" then
		s = wq
	else
		s = ""
	end
	ch = ch .. s
	
	if 锦衣 ~= nil then
		ch = 锦衣 .. "_" .. ch2
		-- if ch2 =="影精灵" then
		-- 	ch ="影精灵"
		-- end
		-- if 新锦衣[ch] then
		-- 	chs[1]=新锦衣[ch]["静立"]
		-- 	chs[2]=新锦衣[ch]["行走"]
		-- 	chs[3]="白色斗战.wdf"
		-- 	return chs
		-- end
	end
	if PutongModel[ch] then
	    for i=1,3 do
	    	if PutongModel[ch]["chs_"..i] then
	    	    chs[i]=PutongModel[ch]["chs_"..i]
	    	end
	    end
		return chs
	end
if ch =="剑侠客"  then                    ---------------迭代剑侠客
               chs[1]=0xABCAB008
               chs[2]=0xABCAB009
               chs[3]="剑侠客素材.wdf"

elseif ch =="剑侠客_刀"  then
               chs[1]=0xABCAB008
               chs[2]=0xABCAB009
               chs[3]="剑侠客素材.wdf"
elseif ch =="柳叶刀_剑侠客"  then
               chs[1]=0xABCAB018
               chs[2]=0xABCAB016
               chs[3]="剑侠客素材.wdf"
elseif ch =="金背大砍刀_剑侠客"  then
               chs[1]=0xABCAB027
               chs[2]=0xABCAB025
               chs[3]="剑侠客素材.wdf"
elseif ch =="狼牙刀_剑侠客"  then
               chs[1]=0xABCAB036
               chs[2]=0xABCAB034
               chs[3]="剑侠客素材.wdf"
elseif ch =="冷月_剑侠客"  then
               chs[1]=0xABCAB045
               chs[2]=0xABCAB043
               chs[3]="剑侠客素材.wdf"
elseif ch =="屠龙_剑侠客"  then
               chs[1]=0xABCAB054
               chs[2]=0xABCAB052
               chs[3]="剑侠客素材.wdf"
elseif ch =="血刃_剑侠客"  then
               chs[1]=0xABCAB063
               chs[2]=0xABCAB061
               chs[3]="剑侠客素材.wdf"
elseif ch =="偃月青龙_剑侠客"  then
               chs[1]=0xABCAB072
               chs[2]=0xABCAB070
               chs[3]="剑侠客素材.wdf"
elseif ch =="晓风残月_剑侠客"  then
               chs[1]=0xABCAB081
               chs[2]=0xABCAB079
               chs[3]="剑侠客素材.wdf"
elseif ch =="斩妖泣血_剑侠客"  then
               chs[1]=0xABCAB090
               chs[2]=0xABCAB088
               chs[3]="剑侠客素材.wdf"
elseif ch =="业火三灾_剑侠客"  then
               chs[1]=0xABCAB099
               chs[2]=0xABCAB097
               chs[3]="剑侠客素材.wdf"
elseif ch =="鸣鸿_剑侠客"  then
               chs[1]=0xABCAB108
               chs[2]=0xABCAB106
               chs[3]="剑侠客素材.wdf"
---=================================================================================================
elseif ch =="剑侠客_剑"  then
               chs[1]=0xABCAB116
               chs[2]=0xABCAB115
               chs[3]="剑侠客素材.wdf"
elseif ch =="青铜短剑_剑侠客"  then
               chs[1]=0xABCAB124
               chs[2]=0xABCAB123
               chs[3]="剑侠客素材.wdf"

elseif ch =="青锋剑_剑侠客"  then
               chs[1]=0xABCAB132
               chs[2]=0xABCAB131
               chs[3]="剑侠客素材.wdf"
elseif ch =="游龙剑_剑侠客" or ch =="北斗七星剑_剑侠客" or ch =="碧玉剑_剑侠客"   then
               chs[1]=0xABCAB141
               chs[2]=0xABCAB140
               chs[3]="剑侠客素材.wdf"
elseif ch =="鱼肠_剑侠客"  then
               chs[1]=0xABCAB142
               chs[2]=0xABCAB149
               chs[3]="剑侠客素材.wdf"
elseif ch =="倚天_剑侠客"  then
               chs[1]=0xABCAB157
               chs[2]=0xABCAB156
               chs[3]="剑侠客素材.wdf"
elseif ch =="湛卢_剑侠客"  then
               chs[1]=0xABCAB158
               chs[2]=0xABCAB165
               chs[3]="剑侠客素材.wdf"
elseif ch =="魏武青虹_剑侠客"  then
               chs[1]=0xABCAB173
               chs[2]=0xABCAB172
               chs[3]="剑侠客素材.wdf"
elseif ch =="灵犀神剑_剑侠客"  then
               chs[1]=0xABCAB174
               chs[2]=0xABCAB181
               chs[3]="剑侠客素材.wdf"
elseif ch =="四法青云_剑侠客"  then
               chs[1]=0xABCAB182
               chs[2]=0xABCAB189
               chs[3]="剑侠客素材.wdf"
elseif ch =="霜冷九州_剑侠客"  then
               chs[1]=0xABCAB197
               chs[2]=0xABCAB196
               chs[3]="剑侠客素材.wdf"
elseif ch =="擒龙_剑侠客"  then
               chs[1]=0xABCAB198
               chs[2]=0xABCAB205
                chs[3]="剑侠客素材.wdf"
	elseif ch == "竹节双剑_飞燕女" then
		chs[1] = 2478979274
		chs[2] = 683536595
		chs[3] = "common/shape.wdf"
	elseif ch == "无极丝_玄彩娥" then
		chs[1] = 1086469645
		chs[2] = 2643257844
		chs[3] = "common/shape.wdf"
	elseif ch == "羽灵神_法杖" then
		chs[1] = 2581796502
		chs[2] = 3940257408
		chs[3] = "shape.wda"
	elseif ch == "狼牙锤_虎头怪" then
		chs[1] = 900073506
		chs[2] = 556692511
		chs[3] = "common/shape.wdf"
	elseif ch == "腾云杖_巫蛮儿" then
		chs[1] = 3237314719
		chs[2] = 1747492117
		chs[3] = "shape.wda"
	elseif ch == "逍遥生" then
		chs[1] = 1492865095
		chs[2] = 304945535
		chs[3] = "common/shape.wdf"
	elseif ch == "逍遥生_剑" then
		chs[1] = 1492865095
		chs[2] = 304945535
		chs[3] = "common/shape.wdf"
	elseif ch == "逍遥生_扇" then
		chs[1] = 0x22ced97b
		chs[2] = 304945535
		chs[3] = "common/shape.wdf"
	elseif ch == "青铜短剑_逍遥生" then
		chs[1] = 614590386
		chs[2] = 2214774214
		chs[3] = "common/shape.wdf"
	elseif ch == "飞燕女" then
		chs[1] = 2708080383
		chs[2] = 1337608376
		chs[3] = "common/shape.wdf"
	elseif ch == "七彩罗刹_玄彩娥" then
		chs[1] = 2992307123
		chs[2] = 3171287220
		chs[3] = "common/shape.wdf"
	elseif ch == "神火扇_龙太子" then
		chs[1] = 3998986408
		chs[2] = 207256533
		chs[3] = "common/shape.wdf"
	elseif ch == "青铜斧_虎头怪" then
		chs[1] = 1495520707
		chs[2] = 1952969514
		chs[3] = "common/shape.wdf"
	elseif ch == "青龙牙_骨精灵" then
		chs[1] = 819272546
		chs[2] = 4143052600
		chs[3] = "common/shape.wdf"
	elseif ch == "如意宝珠_杀破狼" then
		chs[1] = 3027466503
		chs[2] = 3046998488
		chs[3] = "shape.wda"
	elseif ch == "翡翠珠_巫蛮儿" then
		chs[1] = 1191800816
		chs[2] = 1331598936
		chs[3] = "shape.wda"
	elseif ch == "点金棒_骨精灵" then
		chs[1] = 2615197180
		chs[2] = 3429205695
		chs[3] = "common/shape.wdf"
	elseif ch == "鸣鸿_巨魔王" then
		chs[1] = 2272535883
		chs[2] = 4183963940
		chs[3] = "common/shape.wdf"
	elseif ch == "牛皮鞭_英女侠" then
		chs[1] = 2721039077
		chs[2] = 4092691055
		chs[3] = "shape.wdf"
	elseif ch == "钢结鞭_狐美人" then
		chs[1] = 1358766658
		chs[2] = 219014606
		chs[3] = "common/shape.wdf"
	elseif ch == "折扇_逍遥生" then
		chs[1] = 0x5a34b119
		chs[2] = 4052148846
		chs[3] = "common/shape.wdf"
	elseif ch == "裂天_虎头怪" then
		chs[1] = 161677133
		chs[2] = 2342305231
		chs[3] = "common/shape.wdf"
	elseif ch == "青刚刺_狐美人" then
		chs[1] = 943875548
		chs[2] = 2075432907
		chs[3] = "common/shape.wdf"
	
	elseif ch == "腾云杖_羽灵神" then
		chs[1] = 1584570480
		chs[2] = 1046023851
		chs[3] = "shape.wda"
	elseif ch == "龙太子" then
		chs[1] = 2944637360
		chs[2] = 4098637790
		chs[3] = "common/shape.wdf"
	elseif ch == "弑皇_龙太子" then
		chs[1] = 2305995091
		chs[2] = 1956552460
		chs[3] = "common/shape.wdf"
	elseif ch == "双弦钺_巨魔王" then
		chs[1] = 4111880178
		chs[2] = 2679811341
		chs[3] = "common/shape.wdf"
	
	elseif ch == "狼牙锤_神天兵" then
		chs[1] = 952314130
		chs[2] = 1577638509
		chs[3] = "common/shape.wdf"
	elseif ch == "红缨枪_神天兵" then
		chs[1] = 3564813918
		chs[2] = 2236546380
		chs[3] = "common/shape.wdf"
	elseif ch == "青锋剑_逍遥生" then
		chs[1] = 540655754
		chs[2] = 526326278
		chs[3] = "common/shape.wdf"
	elseif ch == "如意宝珠_巫蛮儿" then
		chs[1] = 2417421936
		chs[2] = 2197534441
		chs[3] = "shape.wda"
	elseif ch == "翡翠珠_杀破狼" then
		chs[1] = 1314894172
		chs[2] = 433513441
		chs[3] = "shape.wda"
	elseif ch == "狐美人" then
		chs[1] = 3753105193
		chs[2] = 3988533543
		chs[3] = "common/shape.wdf"
	elseif ch == "满天星_骨精灵" then
		chs[1] = 412146092
		chs[2] = 59782698
		chs[3] = "common/shape.wdf"
	elseif ch == "骨精灵" then
		chs[1] = 812821174
		chs[2] = 493656179
		chs[3] = "common/shape.wdf"
	elseif ch == "琉璃珠_巫蛮儿" then
		chs[1] = 4171731900
		chs[2] = 143410001
		chs[3] = "shape.wda"
	elseif ch == "硬木弓_杀破狼" then
		chs[1] = 2500153518
		chs[2] = 34690017
		chs[3] = "shape.wda"
	elseif ch == "宝雕长弓_杀破狼" then
		chs[1] = 3168212514
		chs[2] = 1524411866
		chs[3] = "shape.wda"
	elseif ch == "玄铁矛_龙太子" then
		chs[1] = 2397764102
		chs[2] = 2300479837
		chs[3] = "common/shape.wdf"
	elseif ch == "巨魔王" then
		chs[1] = 2213567130
		chs[2] = 1051618199
		chs[3] = "common/shape.wdf"
	elseif ch == "青藤柳叶鞭_狐美人" then
		chs[1] = 2017171936
		chs[2] = 1015863531
		chs[3] = "common/shape.wdf"
	elseif ch == "宝雕长弓_羽灵神" then
		chs[1] = 487656505
		chs[2] = 162322797
		chs[3] = "shape.wda"
	elseif ch == "连珠神弓_羽灵神" then
		chs[1] = 3702678012
		chs[2] = 2163189324
		chs[3] = "shape.wda"
	elseif ch == "硬木弓_羽灵神" then
		chs[1] = 3985633058
		chs[2] = 2192045984
		chs[3] = "shape.wda"
	elseif ch == "震天锤_神天兵" then
		chs[1] = 3106536422
		chs[2] = 4262815425
		chs[3] = "common/shape.wdf"
	elseif ch == "墨铁拐_巫蛮儿" then
		chs[1] = 2710601924
		chs[2] = 495554266
		chs[3] = "shape.wda"
	elseif ch == "曲柳杖_巫蛮儿" then
		chs[1] = 438684246
		chs[2] = 2418364461
		chs[3] = "shape.wda"
	elseif ch == "狼牙刀_巨魔王" then
		chs[1] = 1185865684
		chs[2] = 2820957694
		chs[3] = "common/shape.wdf"
	elseif ch == "赤明_杀破狼_宝珠" then
		chs[1] = 3482219011
		chs[2] = 3906907508
		chs[3] = "shape.wda"
	elseif ch == "细木棒_骨精灵" then
		chs[1] = 1202797055
		chs[2] = 4178020883
		chs[3] = "common/shape.wdf"
	elseif ch == "柳叶刀_巨魔王" then
		chs[1] = 4115620300
		chs[2] = 3330022961
		chs[3] = "common/shape.wdf"
	elseif ch == "蛇形月_舞天姬" then
		chs[1] = 1644759402
		chs[2] = 1759014159
		chs[3] = "common/shape.wdf"
	elseif ch == "蛇形月_飞燕女" then
		chs[1] = 3586173418
		chs[2] = 732948875
		chs[3] = "common/shape.wdf"
	elseif ch == "金刺轮_舞天姬" then
		chs[1] = 2807451206
		chs[2] = 138314297
		chs[3] = "common/shape.wdf"
	elseif ch == "墨铁拐_羽灵神" then
		chs[1] = 2848235637
		chs[2] = 2266600687
		chs[3] = "shape.wda"
	elseif ch == "黄铜圈_舞天姬" then
		chs[1] = 194575710
		chs[2] = 2421095781
		chs[3] = "common/shape.wdf"
	elseif ch == "杀破狼_宝珠" then
		chs[1] = 2930414626
		chs[2] = 4291811931
		chs[3] = "shape.wda"
	elseif ch == "玄彩娥" then
		chs[1] = 1362263605
		chs[2] = 3715462681
		chs[3] = "common/shape.wdf"
	elseif ch == "黄铜圈_飞燕女" then
		chs[1] = 737601414
		chs[2] = 1669143734
		chs[3] = "common/shape.wdf"
	elseif ch == "双短剑_英女侠" then
		chs[1] = 2246741733
		chs[2] = 2201236800
		chs[3] = "shape.wdf"
	elseif ch == "青藤柳叶鞭_英女侠" then
		chs[1] = 3009625218
		chs[2] = 2830037944
		chs[3] = "shape.wdf"
	elseif ch == "钢结鞭_英女侠" then
		chs[1] = 1003144235
		chs[2] = 1524918418
		chs[3] = "shape.wdf"
	elseif ch == "羽灵神_弓弩" then
		chs[1] = 2581796502
		chs[2] = 1858805344
		chs[3] = "shape.wda"
	elseif ch == "羽灵神_弓弩1" then
		chs[1] = 0262638661
		chs[2] = 3940257408
		chs[3] = "shape.wda"
	elseif ch == "震天锤_虎头怪" then
		chs[1] = 676548466
		chs[2] = 1816923096
		chs[3] = "common/shape.wdf"
	
	elseif ch == "金刺轮_飞燕女" then
		chs[1] = 860305472
		chs[2] = 4154736570
		chs[3] = "common/shape.wdf"
	
	elseif ch == "青龙牙_狐美人" then
		chs[1] = 3750219087
		chs[2] = 346973613
		chs[3] = "common/shape.wdf"
	elseif ch == "赤焰双剑_英女侠" then
		chs[1] = 1427570181
		chs[2] = 3478724046
		chs[3] = "shape.wdf"
	elseif ch == "满天星_玄彩娥" then
		chs[1] = 1121013667
		chs[2] = 291147333
		chs[3] = "common/shape.wdf"
	elseif ch == "点金棒_玄彩娥" then
		chs[1] = 1581306371
		chs[2] = 1230293004
		chs[3] = "common/shape.wdf"
	elseif ch == "金背大砍刀_巨魔王" then
		chs[1] = 2395375353
		chs[2] = 3599969440
		chs[3] = "common/shape.wdf"
	elseif ch == "巫蛮儿_宝珠" then
		chs[1] = 202554088
		chs[2] = 255156094
		chs[3] = "shape.wda"
	elseif ch == "杀破狼" then
		chs[1] = 652210495
		chs[2] = 1032044905
		chs[3] = "shape.wda"
	elseif ch == "神火扇_逍遥生" then
		chs[1] = 0x32eadd
		chs[2] = 2463492889
		chs[3] = "common/shape.wdf"
	elseif ch == "铁面扇_龙太子" then
		chs[1] = 0x9f33cb04
		chs[2] = 0x322cf1fd
		chs[3] = "common/shape.wdf"
	elseif ch == "英女侠" then
		chs[1] = 2898894124
		chs[2] = 3708489082
		chs[3] = "shape.wdf"
	elseif ch == "折扇_龙太子" then
		chs[1] = 506375536
		chs[2] = 4142026495
		chs[3] = "common/shape.wdf"
	elseif ch == "青刚刺_骨精灵" then
		chs[1] = 4186507615
		chs[2] = 2094848573
		chs[3] = "common/shape.wdf"
	elseif ch == "松木锤_神天兵" then
		chs[1] = 385167718
		chs[2] = 887944587
		chs[3] = "common/shape.wdf"
	elseif ch == "巫蛮儿_法杖" then
		chs[1] = 202554088
		chs[2] = 4185651500
		chs[3] = "shape.wda"
	elseif ch == "铁爪_骨精灵" then
		chs[1] = 980144775
		chs[2] = 630615359
		chs[3] = "common/shape.wdf"
	elseif ch == "铁爪_狐美人" then
		chs[1] = 3977087148
		chs[2] = 1562072464
		chs[3] = "common/shape.wdf"
	elseif ch == "七彩罗刹_舞天姬" then
		chs[1] = 903786802
		chs[2] = 2633357816
		chs[3] = "common/shape.wdf"
	elseif ch == "无极丝_舞天姬" then
		chs[1] = 4219745722
		chs[2] = 3471825039
		chs[3] = "common/shape.wdf"
	elseif ch == "五色缎带_玄彩娥" then
		chs[1] = 4201646940
		chs[2] = 2449560215
		chs[3] = "common/shape.wdf"
	elseif ch == "五色缎带_舞天姬" then
		chs[1] = 3852826693
		chs[2] = 1284868321
		chs[3] = "common/shape.wdf"
	elseif ch == "羽灵神" then
		chs[1] = 2581796502
		chs[2] = 1858805344
		chs[3] = "shape.wda"
	elseif ch == "琉璃珠_杀破狼" then
		chs[1] = 2754911857
		chs[2] = 2888668416
		chs[3] = "shape.wda"
	elseif ch == "竹节双剑_英女侠" then
		chs[1] = 1476049499
		chs[2] = 2441717360
		chs[3] = "shape.wdf"
	elseif ch == "双短剑_飞燕女" then
		chs[1] = 932337963
		chs[2] = 1862513649
		chs[3] = "common/shape.wdf"
	elseif ch == "连珠神弓_杀破狼" then
		chs[1] = 824051161
		chs[2] = 3255758268
		chs[3] = "shape.wda"
	
	elseif ch == "乌金三叉戟_龙太子" then
		chs[1] = 1709314112
		chs[2] = 50056701
		chs[3] = "common/shape.wdf"
	
	elseif ch == "双弦钺_虎头怪" then
		chs[1] = 1464696308
		chs[2] = 1468494251
		chs[3] = "common/shape.wdf"
	elseif ch == "玄铁矛_神天兵" then
		chs[1] = 491583081
		chs[2] = 2008609870
		chs[3] = "common/shape.wdf"
	elseif ch == "乌金三叉戟_神天兵" then
		chs[1] = 733304931
		chs[2] = 235606285
		chs[3] = "common/shape.wdf"
	elseif ch == "乌金鬼头镰_巨魔王" then
		chs[1] = 1147867834
		chs[2] = 3049186137
		chs[3] = "common/shape.wdf"
	elseif ch == "红缨枪_龙太子" then
		chs[1] = 2274614746
		chs[2] = 1825813896
		chs[3] = "common/shape.wdf"
	elseif ch == "浮犀_飞燕女" then
		chs[1] = 3366765078
		chs[2] = 3831481111
		chs[3] = "common/shape.wdf"
	elseif ch == "牛皮鞭_狐美人" then
		chs[1] = 476936950
		chs[2] = 387504165
		chs[3] = "common/shape.wdf"
	elseif ch == "青铜斧_巨魔王" then
		chs[1] = 550609107
		chs[2] = 1015351627
		chs[3] = "common/shape.wdf"
	elseif ch == "细木棒_玄彩娥" then
		chs[1] = 534278293
		chs[2] = 4175187443
		chs[3] = "common/shape.wdf"
	elseif ch == "松木锤_虎头怪" then
		chs[1] = 1728983487
		chs[2] = 2655200756
		chs[3] = "common/shape.wdf"
	elseif ch == "曲柳杖_羽灵神" then
		chs[1] = 1868152845
		chs[2] = 460325915
		chs[3] = "shape.wda"
	elseif ch == "神天兵" then
		chs[1] = 2115558165
		chs[2] = 1433167185
		chs[3] = "common/shape.wdf"
	elseif ch == "舞天姬" then
		chs[1] = 1050893021
		chs[2] = 3778545729
		chs[3] = "common/shape.wdf"
	elseif ch == "舞天姬_飘带" then
		chs[1] = 1050893021
		chs[2] = 3778545729
		chs[3] = "common/shape.wdf"
	elseif ch == "舞天姬_环圈" then
		chs[1] = 0x326c8c14
		chs[2] = 0x122cc513
		chs[3] = "common/shape.wdf"
	elseif ch == "铁面扇_逍遥生" then
		chs[1] = 0xd33792db
		chs[2] = 2358358928
		chs[3] = "common/shape.wdf"
	elseif ch == "赤焰双剑_飞燕女" then
		chs[1] = 4061318075
		chs[2] = 2660522564
		chs[3] = "common/shape.wdf"
	elseif ch == "游龙剑_逍遥生" then
		chs[1] = 1313817198
		chs[2] = 3892924667
		chs[3] = "common/shape.wdf"
	elseif ch == "巫蛮儿" then
		chs[1] = 1602126433
		chs[2] = 4185651500
		chs[3] = "shape.wda"
	elseif ch == "骷髅怪" then
		chs[1] = 2014136988
		chs[2] = 365789642
		chs[3] = "shape.wdf"
	elseif ch == "乌金鬼头镰_虎头怪" then
		chs[1] = 3940375773
		chs[2] = 3876300955
		chs[3] = "common/shape.wdf"
	elseif ch == "狐狸精" then
		chs[1] = 4061102935
		chs[2] = 275265957
		chs[3] = "shape.wdf"
	elseif ch == "杀破狼_宝珠" then
		chs[1] = 2930414626
		chs[2] = 4291811931
		chs[3] = "shape.wda"
	elseif ch == "杀破狼_弓弩" then
		chs[1] = 0652210495
		chs[2] = 1032044905
		chs[3] = "shape.wda"
	elseif ch == "杀破狼_弓弩1" then
		chs[1] = 0652210495
		chs[2] = 4291811931
		chs[3] = "shape.wda"
	elseif ch == "虎头怪" then
		chs[1] = 571142035
		chs[2] = 803245291
		chs[3] = "common/shape.wdf"

		-- v1.3新增
	elseif ch == "暗夜_龙太子" then
		chs[1] = 0906768777
		chs[2] = 0402972999
		chs[3] = "common/shape.wdf"
	elseif ch == "暗夜_神天兵" then
		chs[1] = 0xfbf07390
		chs[2] = 0x981089c2
		chs[3] = "common/shape.wdf"
	elseif ch == "梨花_龙太子" then
		chs[1] = 3562006868
		chs[2] = 0563824081
		chs[3] = "common/shape.wdf"
	elseif ch == "梨花_神天兵" then
		chs[1] = 3155530506
		chs[2] = 4149381636
		chs[3] = "common/shape.wdf"
	elseif ch == "霹雳_龙太子" then
		chs[1] = 0663241555
		chs[2] = 0882577208
		chs[3] = "common/shape.wdf"
	elseif ch == "霹雳_神天兵" then
		chs[1] = 3690872798
		chs[2] = 3942970730
		chs[3] = "common/shape.wdf"
	elseif ch == "刑天之逆_龙太子" then
		chs[1] = 0x31CA69F0
		chs[2] = 0x898AF13F
		chs[3] = "common/shape.wdf"
	elseif ch == "五虎断魂_龙太子" then
		chs[1] = 0x929158FC
		chs[2] = 0xc2e1216a
		chs[3] = "common/shape.wdf"
	elseif ch == "飞龙在天_龙太子" then
		chs[1] = 0x15E284F9
		chs[2] = 0x0A73B2E0
		chs[3] = "common/shape.wdf"
	elseif ch == "天龙破城_龙太子" then
		chs[1] = 1524391868
		chs[2] = 3805099760
		chs[3] = "common/shape.wdf"
	elseif ch == "刑天之逆_神天兵" then
		chs[1] = 0xDBFE3FDE
		chs[2] = 0xEB04F56A
		chs[3] = "common/shape.wdf"
	elseif ch == "五虎断魂_神天兵" then
		chs[1] = 0xEF75190E
		chs[2] = 0x7A0C3835
		chs[3] = "common/shape.wdf"
	elseif ch == "飞龙在天_神天兵" then
		chs[1] = 0x37F26C44
		chs[2] = 0xD751042A
		chs[3] = "common/shape.wdf"
	elseif ch == "天龙破城_神天兵" then
		chs[1] = 3154146622
		chs[2] = 2015118453
		chs[3] = "common/shape.wdf"
	elseif ch == "弑皇_神天兵" then
		chs[1] = 1837680668
		chs[2] = 0689112756
		chs[3] = "common/shape.wdf"
	elseif ch == "破魄_虎头怪" then
		chs[1] = 0x53F914DE
		chs[2] = 0x8102D783
		chs[3] = "common/shape.wdf"
	elseif ch == "破魄_巨魔王" then
		chs[1] = 0x02CECBCB
		chs[2] = 0xB8554947
		chs[3] = "common/shape.wdf"
	elseif ch == "肃魂_虎头怪" then
		chs[1] = 0xE8866C8F
		chs[2] = 0x16B86A5E
		chs[3] = "common/shape.wdf"
	elseif ch == "肃魂_巨魔王" then
		chs[1] = 0x726F7762
		chs[2] = 0x199CF19E
		chs[3] = "common/shape.wdf"
	elseif ch == "无敌_虎头怪" then
		chs[1] = 0xD88565BC
		chs[2] = 0x375756CE
		chs[3] = "common/shape.wdf"
	elseif ch == "无敌_巨魔王" then
		chs[1] = 0x6AE68E94
		chs[2] = 0x29FE3B3E
		chs[3] = "common/shape.wdf"
	elseif ch == "五丁开山_巨魔王" then
		chs[1] = 0xDDE32A30
		chs[2] = 0x7D02D5DB
		chs[3] = "common/shape.wdf"
	elseif ch == "元神禁锢_巨魔王" then
		chs[1] = 0x6693BB73
		chs[2] = 0x4E32D0BC
		chs[3] = "common/shape.wdf"
	elseif ch == "护法灭魔_巨魔王" then
		chs[1] = 0x75E45C94
		chs[2] = 0xDA6126C5
		chs[3] = "common/shape.wdf"
	elseif ch == "碧血干戚_巨魔王" then
		chs[1] = 1651186704
		chs[2] = 1048057784
		chs[3] = "common/shape.wdf"
	elseif ch == "裂天_巨魔王" then
		chs[1] = 3160261512
		chs[2] = 0098835428
		chs[3] = "common/shape.wdf"
	elseif ch == "五丁开山_虎头怪" then
		chs[1] = 0x2261BF73
		chs[2] = 0xB02E0452
		chs[3] = "common/shape.wdf"
	elseif ch == "元神禁锢_虎头怪" then
		chs[1] = 0xFC8BAA37
		chs[2] = 0xC133DEC4
		chs[3] = "common/shape.wdf"
	elseif ch == "护法灭魔_虎头怪" then
		chs[1] = 0x0F200DE2
		chs[2] = 0xEE971A2F
		chs[3] = "common/shape.wdf"
	elseif ch == "碧血干戚_虎头怪" then
		chs[1] = 2740822575
		chs[2] = 1846382457
		chs[3] = "common/shape.wdf"
	elseif ch == "裂天_虎头怪" then
		chs[1] = 0161677133
		chs[2] = 2342305231
		chs[3] = "common/shape.wdf"
	
	elseif ch == "鱼肠_逍遥生" then
		chs[1] = 0x39BAEA10
		chs[2] = 0xE9D644EA
		chs[3] = "common/shape.wdf"
	
	elseif ch == "倚天_逍遥生" then
		chs[1] = 0745286869
		chs[2] = 1361011629
		chs[3] = "common/shape.wdf"
	
	elseif ch == "湛卢_逍遥生" then
		chs[1] = 0x439811D3
		chs[2] = 0x6DE2CCCB
		chs[3] = "common/shape.wdf"
	elseif ch == "画龙点睛_逍遥生" then
		chs[1] = 0x2ef87fd7
		chs[2] = 0xBDC4259D
		chs[3] = "common/shape.wdf"
	elseif ch == "秋水人家_逍遥生" then
		chs[1] = 0x9d8ff3c2
		chs[2] = 0xEEFDA661
		chs[3] = "common/shape.wdf"
	elseif ch == "逍遥江湖_逍遥生" then
		chs[1] = 0xd940f97e
		chs[2] = 0x0FF23BFF
		chs[3] = "common/shape.wdf"
	elseif ch == "浩气长舒_逍遥生" then
		chs[1] = 0x9297dd11
		chs[2] = 0378375394
		chs[3] = "common/shape.wdf"
	elseif ch == "星瀚_逍遥生" then
		chs[1] = 0xe481f72b
		chs[2] = 3682713078
		chs[3] = "common/shape.wdf"
	
	elseif ch == "魏武青虹_逍遥生" then
		chs[1] = 0x2562AA24
		chs[2] = 0x2C0190DC
		chs[3] = "common/shape.wdf"
	elseif ch == "灵犀神剑_逍遥生" then
		chs[1] = 0xB532E559
		chs[2] = 0x55AA2A03
		chs[3] = "common/shape.wdf"
	elseif ch == "四法青云_逍遥生" then
		chs[1] = 0x345FD6AC
		chs[2] = 0x5763E3AE
		chs[3] = "common/shape.wdf"
	elseif ch == "霜冷九州_逍遥生" then
		chs[1] = 3023520771
		chs[2] = 3722552317
		chs[3] = "common/shape.wdf"
	elseif ch == "擒龙_逍遥生" then
		chs[1] = 1376642035
		chs[2] = 1247967770
		chs[3] = "common/shape.wdf"
	elseif ch == "太极_逍遥生" then
		chs[1] = 0xc5d0ffa5
		chs[2] = 3793189291
		chs[3] = "common/shape.wdf"
	elseif ch == "太极_龙太子" then
		chs[1] = 0x58D20E79
		chs[2] = 0xA963CEE9
		chs[3] = "common/shape.wdf"
	elseif ch == "玉龙_逍遥生" then
		chs[1] = 0x836bd211 --
		chs[2] = 4197667404
		chs[3] = "common/shape.wdf"
	elseif ch == "玉龙_龙太子" then
		chs[1] = 0x44BEAA26
		chs[2] = 0xE819C83D
		chs[3] = "common/shape.wdf"
	elseif ch == "秋风_逍遥生" then
		chs[1] = 0xc9d1e4d9
		chs[2] = 4268258437
		chs[3] = "common/shape.wdf"
	elseif ch == "秋风_龙太子" then
		chs[1] = 0x387B481F
		chs[2] = 0xFB69C03A
		chs[3] = "common/shape.wdf"
	elseif ch == "画龙点睛_龙太子" then
		chs[1] = 0x741AAD01
		chs[2] = 0x7691CE27
		chs[3] = "common/shape.wdf"
	elseif ch == "秋水人家_龙太子" then
		chs[1] = 0xB68FBD09
		chs[2] = 0x9A1E802B
		chs[3] = "common/shape.wdf"
	elseif ch == "逍遥江湖_龙太子" then
		chs[1] = 0xD1FABFBB
		chs[2] = 0x46AB4BEC
		chs[3] = "common/shape.wdf"
	elseif ch == "浩气长舒_龙太子" then
		chs[1] = 0xD5E7FC6E
		chs[2] = 0x804E4F85
		chs[3] = "common/shape.wdf"
	elseif ch == "星瀚_龙太子" then
		chs[1] = 0xBD8FF16C
		chs[2] = 0xC7E0CEC1
		chs[3] = "common/shape.wdf"
	elseif ch == "冷月_巨魔王" then
		chs[1] = 1674010879
		chs[2] = 1438363487
		chs[3] = "common/shape.wdf"
	
	elseif ch == "屠龙_巨魔王" then
		chs[1] = 2271660461
		chs[2] = 0895095420
		chs[3] = "common/shape.wdf"
	
	elseif ch == "血刃_巨魔王" then
		chs[1] = 3645677695
		chs[2] = 1888150636
		chs[3] = "common/shape.wdf"
	elseif ch == "偃月青龙_巨魔王" then
		chs[1] = 0xF6A68E4C
		chs[2] = 0xB20BA1E9
		chs[3] = "common/shape.wdf"
	elseif ch == "斩妖泣血_巨魔王" then
		chs[1] = 0x15B2D6D4
		chs[2] = 0x14997A50
		chs[3] = "common/shape.wdf"
	elseif ch == "晓风残月_巨魔王" then
		chs[1] = 0x4B2232FE
		chs[2] = 0x2D70D93E
		chs[3] = "common/shape.wdf"
	elseif ch == "业火三灾_巨魔王" then
		chs[1] = 4160821910
		chs[2] = 2586259872
		chs[3] = "common/shape.wdf"
	elseif ch == "鸣鸿_巨魔王" then
		chs[1] = 2272535883
		chs[2] = 4183963940
		chs[3] = "common/shape.wdf"
	elseif ch == "沧海_骨精灵" then
		chs[1] = 3768392022
		chs[2] = 3372471073
		chs[3] = "common/shape.wdf"
	elseif ch == "沧海_玄彩娥" then
		chs[1] = 0xC1ACB479
		chs[2] = 0x6A9147F7
		chs[3] = "common/shape.wdf"
	elseif ch == "红莲_骨精灵" then
		chs[1] = 2232215638
		chs[2] = 1432534548
		chs[3] = "common/shape.wdf"
	elseif ch == "红莲_玄彩娥" then
		chs[1] = 0x0ADFB109
		chs[2] = 0xCA7E32B9
		chs[3] = "common/shape.wdf"
	elseif ch == "盘龙_骨精灵" then
		chs[1] = 3403515550
		chs[2] = 00912832719
		chs[3] = "common/shape.wdf"
	elseif ch == "盘龙_玄彩娥" then
		chs[1] = 0x69036521
		chs[2] = 0x02E73DE2
		chs[3] = "common/shape.wdf"
	elseif ch == "降魔玉杵_骨精灵" then
		chs[1] = 0x51F29AF8
		chs[2] = 0x77E6448E
		chs[3] = "common/shape.wdf"
	elseif ch == "墨玉骷髅_骨精灵" then
		chs[1] = 0x41184BFA
		chs[2] = 0x1C9639D1
		chs[3] = "common/shape.wdf"
	elseif ch == "青藤玉树_骨精灵" then
		chs[1] = 0x162DD3BA
		chs[2] = 0xC603E808
		chs[3] = "common/shape.wdf"
	elseif ch == "丝萝乔木_骨精灵" then
		chs[1] = 1422256901
		chs[2] = 3988348379
		chs[3] = "common/shape.wdf"
	elseif ch == "醍醐_骨精灵" then
		chs[1] = 0609424635
		chs[2] = 4017665874
		chs[3] = "common/shape.wdf"
	elseif ch == "降魔玉杵_玄彩娥" then
		chs[1] = 0xB3AB79E6
		chs[2] = 0x87E2D3A6
		chs[3] = "common/shape.wdf"
	elseif ch == "墨玉骷髅_玄彩娥" then
		chs[1] = 0x89AFF2A0
		chs[2] = 0x791841F4
		chs[3] = "common/shape.wdf"
	elseif ch == "青藤玉树_玄彩娥" then
		chs[1] = 0x98440F9D
		chs[2] = 0xA6807253
		chs[3] = "common/shape.wdf"
	elseif ch == "丝萝乔木_玄彩娥" then
		chs[1] = 2492839980
		chs[2] = 0908131256
		chs[3] = "common/shape.wdf"
	elseif ch == "醍醐_玄彩娥" then
		chs[1] = 2560304889
		chs[2] = 3032370082
		chs[3] = "common/shape.wdf"
	elseif ch == "八卦_神天兵" then
		chs[1] = 0885266650
		chs[2] = 1350386258
		chs[3] = "common/shape.wdf"
	elseif ch == "八卦_虎头怪" then
		chs[1] = 0xA438A403
		chs[2] = 0xAC1BAB97
		chs[3] = "common/shape.wdf"
	elseif ch == "鬼牙_神天兵" then
		chs[1] = 0050371172
		chs[2] = 1900721739
		chs[3] = "common/shape.wdf"
	elseif ch == "鬼牙_虎头怪" then
		chs[1] = 0x56DA382F
		chs[2] = 0x959DF477
		chs[3] = "common/shape.wdf"
	elseif ch == "雷神_神天兵" then
		chs[1] = 1937688127
		chs[2] = 3648341818
		chs[3] = "common/shape.wdf"
	elseif ch == "雷神_虎头怪" then
		chs[1] = 0x8CF27534
		chs[2] = 0xDA17EC9A
		chs[3] = "common/shape.wdf"
	elseif ch == "混元金锤_虎头怪" then
		chs[1] = 0x8E7866EB
		chs[2] = 0x9101F598
		chs[3] = "common/shape.wdf"
	elseif ch == "九瓣莲花_虎头怪" then
		chs[1] = 0xA7B9EF31
		chs[2] = 0xF5C7E01A
		chs[3] = "common/shape.wdf"
	elseif ch == "鬼王蚀日_虎头怪" then
		chs[1] = 0xA14E222D
		chs[2] = 0x757CC5CE
		chs[3] = "common/shape.wdf"
	elseif ch == "狂澜碎岳_虎头怪" then
		chs[1] = 0981496208
		chs[2] = 1685513235
		chs[3] = "common/shape.wdf"
	elseif ch == "碎寂_虎头怪" then
		chs[1] = 0512165103
		chs[2] = 2912368983
		chs[3] = "common/shape.wdf"
	elseif ch == "混元金锤_神天兵" then
		chs[1] = 4173823692
		chs[2] = 0903872944
		chs[3] = "common/shape.wdf"
	elseif ch == "九瓣莲花_神天兵" then
		chs[1] = 1960543447
		chs[2] = 1550557054
		chs[3] = "common/shape.wdf"
	elseif ch == "鬼王蚀日_神天兵" then
		chs[1] = 1056981959
		chs[2] = 0461194116
		chs[3] = "common/shape.wdf"
	elseif ch == "狂澜碎岳_神天兵" then
		chs[1] = 4056574244
		chs[2] = 2900798348
		chs[3] = "common/shape.wdf"
	elseif ch == "碎寂_神天兵" then
		chs[1] = 0577319844
		chs[2] = 2305127073
		chs[3] = "common/shape.wdf"
	elseif ch == "撕天_狐美人" then
		chs[1] = 2959598354
		chs[2] = 3959909274
		chs[3] = "common/shape.wdf"
	elseif ch == "撕天_骨精灵" then
		chs[1] = 0x3DF34F1E
		chs[2] = 0xE5D43556
		chs[3] = "common/shape.wdf"
	elseif ch == "毒牙_狐美人" then
		chs[1] = 3492190917
		chs[2] = 0057548694
		chs[3] = "common/shape.wdf"
	elseif ch == "毒牙_骨精灵" then
		chs[1] = 0xD6EF0627
		chs[2] = 0x831F74AE
		chs[3] = "common/shape.wdf"
	elseif ch == "胭脂_狐美人" then
		chs[1] = 3087805369
		chs[2] = 0210949852
		chs[3] = "common/shape.wdf"
	elseif ch == "胭脂_骨精灵" then
		chs[1] = 0x7D916F78
		chs[2] = 0xF65B1CC4
		chs[3] = "common/shape.wdf"
	elseif ch == "九阴勾魂_骨精灵" then
		chs[1] = 0x63413CA4
		chs[2] = 0x9C82F08B
		chs[3] = "common/shape.wdf"
	elseif ch == "雪蚕之刺_骨精灵" then
		chs[1] = 0xF1E4D97A
		chs[2] = 0x5D773943
		chs[3] = "common/shape.wdf"
	elseif ch == "贵霜之牙_骨精灵" then
		chs[1] = 0xAE948CBB
		chs[2] = 0x7E47B81B
		chs[3] = "common/shape.wdf"
	elseif ch == "忘川三途_骨精灵" then
		chs[1] = 2856473183
		chs[2] = 2645115155
		chs[3] = "common/shape.wdf"
	elseif ch == "离钩_骨精灵" then
		chs[1] = 0xa484df3d
		chs[2] = 2314275840
		chs[3] = "common/shape.wdf"
	elseif ch == "九阴勾魂_狐美人" then
		chs[1] = 0xC2DC1244
		chs[2] = 0xB0ED001E
		chs[3] = "common/shape.wdf"
	elseif ch == "雪蚕之刺_狐美人" then
		chs[1] = 0xC4B56A00
		chs[2] = 0x0381802B
		chs[3] = "common/shape.wdf"
	elseif ch == "贵霜之牙_狐美人" then
		chs[1] = 0x762F7556
		chs[2] = 0xCDD20A7E
		chs[3] = "common/shape.wdf"
	elseif ch == "忘川三途_狐美人" then
		chs[1] = 1211891114
		chs[2] = 0425062404
		chs[3] = "common/shape.wdf"
	elseif ch == "离钩_狐美人" then
		chs[1] = 1495713199
		chs[2] = 1510775202
		chs[3] = "common/shape.wdf"
	elseif ch == "彩虹_舞天姬" then
		chs[1] = 0573669624
		chs[2] = 0x55516619
		chs[3] = "common/shape.wdf"
	elseif ch == "彩虹_玄彩娥" then
		chs[1] = 0x223180F8
		chs[2] = 0x583E1B17
		chs[3] = "common/shape.wdf"
	elseif ch == "流云_舞天姬" then
		chs[1] = 1071235145
		chs[2] = 0xef3a3a78
		chs[3] = "common/shape.wdf"
	elseif ch == "流云_玄彩娥" then
		chs[1] = 0x3FD9C049
		chs[2] = 0x8EC49F3A
		chs[3] = "common/shape.wdf"
	elseif ch == "碧波_舞天姬" then
		chs[1] = 2358752644
		chs[2] = 0xf56c2c31
		chs[3] = "common/shape.wdf"
	elseif ch == "碧波_玄彩娥" then
		chs[1] = 0x8C97B584
		chs[2] = 0xB61DA735
		chs[3] = "common/shape.wdf"
	elseif ch == "秋水落霞_舞天姬" then
		chs[1] = 0xBC559AEB
		chs[2] = 0xBC89D4EB
		chs[3] = "common/shape.wdf"
	elseif ch == "晃金仙绳_舞天姬" then
		chs[1] = 0x14918F2D
		chs[2] = 0x7AEB22FC
		chs[3] = "common/shape.wdf"
	elseif ch == "此最相思_舞天姬" then
		chs[1] = 0xB04EF3E7
		chs[2] = 0xE47097A9
		chs[3] = "common/shape.wdf"
	elseif ch == "揽月摘星_舞天姬" then
		chs[1] = 2425294287
		chs[2] = 0718029991
		chs[3] = "common/shape.wdf"
	elseif ch == "九霄_舞天姬" then
		chs[1] = 1944035871
		chs[2] = 0335082726
		chs[3] = "common/shape.wdf"
	elseif ch == "别情离恨_舞天姬" then
		chs[1] = 0xF420B6F9
		chs[2] = 0x0958E12B
		chs[3] = "common/shape.wdf"
	elseif ch == "金玉双环_舞天姬" then
		chs[1] = 0x93CDA250
		chs[2] = 0xA50B0DB0
		chs[3] = "common/shape.wdf"
	elseif ch == "九天金线_舞天姬" then
		chs[1] = 0xF5E7C6EF
		chs[2] = 0x0218E725
		chs[3] = "common/shape.wdf"
	elseif ch == "无关风月_舞天姬" then
		chs[1] = 1007231129
		chs[2] = 1829725423
		chs[3] = "common/shape.wdf"
	elseif ch == "朝夕_舞天姬" then
		chs[1] = 2753598378
		chs[2] = 0871520866
		chs[3] = "common/shape.wdf"
	elseif ch == "秋水落霞_玄彩娥" then
		chs[1] = 0x8BF9992F
		chs[2] = 0x17D413B7
		chs[3] = "common/shape.wdf"
	elseif ch == "晃金仙绳_玄彩娥" then
		chs[1] = 0xEBA114CC
		chs[2] = 0x8FDCA745
		chs[3] = "common/shape.wdf"
	elseif ch == "此最相思_玄彩娥" then
		chs[1] = 0xBEF9E038
		chs[2] = 0xFCF69018
		chs[3] = "common/shape.wdf"
	elseif ch == "揽月摘星_玄彩娥" then
		chs[1] = 4239911535
		chs[2] = 1327298920
		chs[3] = "common/shape.wdf"
	elseif ch == "九霄_玄彩娥" then
		chs[1] = 1385035033
		chs[2] = 2513919345
		chs[3] = "common/shape.wdf"
	elseif ch == "龙筋_英女侠" then
		chs[1] = 0120114237
		chs[2] = 4185441630
		chs[3] = "shape.wdf"
	elseif ch == "龙筋_狐美人" then
		chs[1] = 0xD76152B7
		chs[2] = 0xB241D7A6
		chs[3] = "common/shape.wdf"
	elseif ch == "百花_英女侠" then
		chs[1] = 3000747610
		chs[2] = 0571279871
		chs[3] = "shape.wdf"
	elseif ch == "百花_狐美人" then
		chs[1] = 0x888C7C46
		chs[2] = 0xE7CBB64B
		chs[3] = "common/shape.wdf"
	elseif ch == "吹雪_英女侠" then
		chs[1] = 1309495973
		chs[2] = 0159974487
		chs[3] = "shape.wdf"
	elseif ch == "吹雪_狐美人" then
		chs[1] = 0xBC2F95EF
		chs[2] = 0x16AC35C8
		chs[3] = "common/shape.wdf"
	elseif ch == "游龙惊鸿_狐美人" then
		chs[1] = 0xB11264BE
		chs[2] = 0x7C2A8EF7
		chs[3] = "common/shape.wdf"
	elseif ch == "仙人指路_狐美人" then
		chs[1] = 0x87BE19F7
		chs[2] = 0x10C7E94F
		chs[3] = "common/shape.wdf"
	elseif ch == "血之刺藤_狐美人" then
		chs[1] = 0x430429EE
		chs[2] = 0xAB7969FB
		chs[3] = "common/shape.wdf"
	elseif ch == "牧云清歌_狐美人" then
		chs[1] = 0846824610
		chs[2] = 3304484241
		chs[3] = "common/shape.wdf"
	elseif ch == "霜陨_狐美人" then
		chs[1] = 0xe7d16091
		chs[2] = 0x4384e238
		chs[3] = "common/shape.wdf"
	elseif ch == "如意_舞天姬" then
		chs[1] = 2798387657
		chs[2] = 0709983425
		chs[3] = "common/shape.wdf"
	elseif ch == "如意_飞燕女" then
		chs[1] = 0x108FFF69
		chs[2] = 0xEEB4814C
		chs[3] = "common/shape.wdf"
	elseif ch == "乾坤_舞天姬" then
		chs[1] = 4117773016
		chs[2] = 0888040957
		chs[3] = "common/shape.wdf"
	elseif ch == "乾坤_飞燕女" then
		chs[1] = 0x516AC342
		chs[2] = 0x6011B8EA
		chs[3] = "common/shape.wdf"
	elseif ch == "月光双环_舞天姬" then
		chs[1] = 2969095231
		chs[2] = 3586695559
		chs[3] = "common/shape.wdf"
	elseif ch == "月光双环_飞燕女" then
		chs[1] = 0xD2011BDE
		chs[2] = 0x118B2316
		chs[3] = "common/shape.wdf"
	elseif ch == "阴阳_飞燕女" then
		chs[1] = 0006565675
		chs[2] = 0527831083
		chs[3] = "common/shape.wdf"
	elseif ch == "阴阳_英女侠" then
		chs[1] = 0xB8D3407A
		chs[2] = 0xa776d93a
		chs[3] = "shape.wdf"
	elseif ch == "月光双剑_飞燕女" then
		chs[1] = 1968668223
		chs[2] = 1806180317
		chs[3] = "common/shape.wdf"
	elseif ch == "月光双剑_英女侠" then
		chs[1] = 0x0E469C32
		chs[2] = 0x4b68d6fe
		chs[3] = "shape.wdf"
	elseif ch == "灵蛇_飞燕女" then
		chs[1] = 0585049597
		chs[2] = 0883345409
		chs[3] = "common/shape.wdf"
	elseif ch == "灵蛇_英女侠" then
		chs[1] = 0x36D0EAA0
		chs[2] = 0xc4ed7657
		chs[3] = "shape.wdf"
	elseif ch == "游龙惊鸿_英女侠" then
		chs[1] = 0x3E7DDDB1
		chs[2] = 0x339E1DD5
		chs[3] = "shape.wd3"
	elseif ch == "仙人指路_英女侠" then
		chs[1] = 0x36FA7E8F
		chs[2] = 0x33825F90
		chs[3] = "shape.wd3"
	elseif ch == "血之刺藤_英女侠" then
		chs[1] = 0xCEF9D441
		chs[2] = 0xCB134023
		chs[3] = "shape.wd3"
	elseif ch == "牧云清歌_英女侠" then
		chs[1] = 2729481727
		chs[2] = 1717626599
		chs[3] = "shape.wd8"
	elseif ch == "霜陨_英女侠" then
		chs[1] = 1215671834
		chs[2] = 1056698647
		chs[3] = "shape.wd9"
	elseif ch == "金龙双剪_飞燕女" then
		chs[1] = 0x88E2548C
		chs[2] = 0xC70FF23A
		chs[3] = "common/shape.wdf"
	elseif ch == "连理双树_飞燕女" then
		chs[1] = 0xBFBE4DC9
		chs[2] = 0x4894EB42
		chs[3] = "common/shape.wdf"
	elseif ch == "祖龙对剑_飞燕女" then
		chs[1] = 0x088A1188
		chs[2] = 0x0D3ED468
		chs[3] = "common/shape.wdf"
	elseif ch == "紫电青霜_飞燕女" then
		chs[1] = 0x4efa7c73
		chs[2] = 3343319550
		chs[3] = "common/shape.wdf"
	elseif ch == "浮犀_飞燕女" then
		chs[1] = 3366765078
		chs[2] = 3831481111
		chs[3] = "common/shape.wdf"
	elseif ch == "别情离恨_飞燕女" then
		chs[1] = 0x72013AF5
		chs[2] = 0xF2FB1AFA
		chs[3] = "common/shape.wdf"
	elseif ch == "金玉双环_飞燕女" then
		chs[1] = 0xA1661BC0
		chs[2] = 0xB6C5947A
		chs[3] = "common/shape.wdf"
	elseif ch == "九天金线_飞燕女" then
		chs[1] = 0x454E8758
		chs[2] = 0x2D8326FB
		chs[3] = "common/shape.wdf"
	elseif ch == "无关风月_飞燕女" then
		chs[1] = 0888561149
		chs[2] = 3212121801
		chs[3] = "common/shape.wdf"
	elseif ch == "朝夕_飞燕女" then
		chs[1] = 0961373825
		chs[2] = 1399381898
		chs[3] = "common/shape.wdf"
	elseif ch == "金龙双剪_英女侠" then
		chs[1] = 0xB2D36625
		chs[2] = 0x373FA8FC
		chs[3] = "shape.wd3"
	elseif ch == "连理双树_英女侠" then
		chs[1] = 0x2F82163D
		chs[2] = 0xA051D73F
		chs[3] = "shape.wd3"
	elseif ch == "祖龙对剑_英女侠" then
		chs[1] = 0x466B6959
		chs[2] = 0xEE3BCF6B
		chs[3] = "shape.wd3"
	elseif ch == "紫电青霜_英女侠" then
		chs[1] = 4174514804
		chs[2] = 0254271220
		chs[3] = "shape.wd8"
	elseif ch == "浮犀_英女侠" then
		chs[1] = 1454482476
		chs[2] = 3425270325
		chs[3] = "shape.wd9"
	elseif ch == "离火_巫蛮儿" then
		chs[1] = 3491744635
		chs[2] = 3429826897
		chs[3] = "shape.wda"
	elseif ch == "离火_杀破狼" then
		chs[1] = 2641155879
		chs[2] = 1590716186
		chs[3] = "shape.wda"
	elseif ch == "飞星_巫蛮儿" then
		chs[1] = 3062034163
		chs[2] = 3170325397
		chs[3] = "shape.wda"
	elseif ch == "飞星_杀破狼" then
		chs[1] = 2717746866
		chs[2] = 1504946577
		chs[3] = "shape.wda"
	elseif ch == "月华_巫蛮儿" then
		chs[1] = 4115068184
		chs[2] = 2364973462
		chs[3] = "shape.wda"
	elseif ch == "月华_杀破狼" then
		chs[1] = 2389596849
		chs[2] = 2983597511
		chs[3] = "shape.wda"
	elseif ch == "回风舞雪_杀破狼" then
		chs[1] = 3286763223
		chs[2] = 1088084197
		chs[3] = "shape.wda"
	elseif ch == "紫金葫芦_杀破狼" then
		chs[1] = 3085783481
		chs[2] = 2243295981
		chs[3] = "shape.wda"
	elseif ch == "裂云啸日_杀破狼" then
		chs[1] = 3958823224
		chs[2] = 1544529746
		chs[3] = "shape.wda"
	elseif ch == "云雷万里_杀破狼" then
		chs[1] = 2031537277
		chs[2] = 1403541362
		chs[3] = "shape.wda"
	elseif ch == "赤明_杀破狼" then
		chs[1] = 3883902194
		chs[2] = 0xD74EF908
		chs[3] = "shape.wda"
	elseif ch == "回风舞雪_巫蛮儿" then
		chs[1] = 3587358129
		chs[2] = 3378197526
		chs[3] = "shape.wda"
	elseif ch == "紫金葫芦_巫蛮儿" then
		chs[1] = 0668840870
		chs[2] = 3082640737
		chs[3] = "shape.wda"
	elseif ch == "裂云啸日_巫蛮儿" then
		chs[1] = 0033586962
		chs[2] = 3500204883
		chs[3] = "shape.wda"
	elseif ch == "云雷万里_巫蛮儿" then
		chs[1] = 0086034382
		chs[2] = 2492569356
		chs[3] = "shape.wda"
	elseif ch == "赤明_巫蛮儿" then
		chs[1] = 3482219011
		chs[2] = 0125440945
		chs[3] = "shape.wda"
	elseif ch == "非攻_杀破狼" then
		chs[1] = 2360647601
		chs[2] = 3580642624
		chs[3] = "shape.wda"
	elseif ch == "非攻_羽灵神" then
		chs[1] = 4118502147
		chs[2] = 1301985929
		chs[3] = "shape.wda"
	elseif ch == "幽篁_杀破狼" then
		chs[1] = 1961778763
		chs[2] = 2093379552
		chs[3] = "shape.wda"
	elseif ch == "幽篁_羽灵神" then
		chs[1] = 0044473302
		chs[2] = 0943743279
		chs[3] = "shape.wda"
	elseif ch == "百鬼_杀破狼" then
		chs[1] = 3918682738
		chs[2] = 3616556566
		chs[3] = "shape.wda"
	elseif ch == "百鬼_羽灵神" then
		chs[1] = 4227459057
		chs[2] = 0226502213
		chs[3] = "shape.wda"
	elseif ch == "冥火薄天_羽灵神" then
		chs[1] = 1329583138
		chs[2] = 2921186180
		chs[3] = "shape.wda"
	elseif ch == "龙鸣寒水_羽灵神" then
		chs[1] = 2146481723
		chs[2] = 1237674101
		chs[3] = "shape.wda"
	elseif ch == "太极流光_羽灵神" then
		chs[1] = 0635066655
		chs[2] = 0454346244
		chs[3] = "shape.wda"
	elseif ch == "九霄风雷_羽灵神" then
		chs[1] = 1118851042
		chs[2] = 3857072095
		chs[3] = "shape.wda"
	elseif ch == "若木_羽灵神" then
		chs[1] = 2140866752
		chs[2] = 0300870526
		chs[3] = "shape.wda"
	elseif ch == "冥火薄天_杀破狼" then
		chs[1] = 4237566348
		chs[2] = 3313167169
		chs[3] = "shape.wda"
	elseif ch == "龙鸣寒水_杀破狼" then
		chs[1] = 1522717413
		chs[2] = 0xECB3ED94
		chs[3] = "shape.wda"
	elseif ch == "太极流光_杀破狼" then
		chs[1] = 3966436183
		chs[2] = 3741875286
		chs[3] = "shape.wda"
	elseif ch == "九霄风雷_杀破狼" then
		chs[1] = 0929770205
		chs[2] = 3222657771
		chs[3] = "shape.wda"
	elseif ch == "若木_杀破狼" then
		chs[1] = 1083623074
		chs[2] = 3047863049
		chs[3] = "shape.wda"
	elseif ch == "业焰_羽灵神" then
		chs[1] = 0834237487
		chs[2] = 3629386269
		chs[3] = "shape.wda"
	elseif ch == "业焰_巫蛮儿" then
		chs[1] = 0830839494
		chs[2] = 1738625165
		chs[3] = "shape.wda"
	elseif ch == "玉辉_羽灵神" then
		chs[1] = 0713952553
		chs[2] = 3757988895
		chs[3] = "shape.wda"
	elseif ch == "玉辉_巫蛮儿" then
		chs[1] = 0378020939
		chs[2] = 3913240810
		chs[3] = "shape.wda"
	elseif ch == "鹿鸣_羽灵神" then
		chs[1] = 1396998121
		chs[2] = 2061375933
		chs[3] = "shape.wda"
	elseif ch == "鹿鸣_巫蛮儿" then
		chs[1] = 1036718398
		chs[2] = 1545197282
		chs[3] = "shape.wda"
	elseif ch == "庄周梦蝶_羽灵神" then
		chs[1] = 4147727634
		chs[2] = 3250095538
		chs[3] = "shape.wda"
	elseif ch == "凤翼流珠_羽灵神" then
		chs[1] = 3818690168
		chs[2] = 3332193101
		chs[3] = "shape.wda"
	elseif ch == "雪蟒霜寒_羽灵神" then
		chs[1] = 1208982538
		chs[2] = 3271417203
		chs[3] = "shape.wda"
	elseif ch == "碧海潮生_羽灵神" then
		chs[1] = 3786902490
		chs[2] = 0069282931
		chs[3] = "shape.wda"
	elseif ch == "弦月_羽灵神" then
		chs[1] = 4218574639
		chs[2] = 3403641761
		chs[3] = "shape.wda"
	elseif ch == "庄周梦蝶_巫蛮儿" then
		chs[1] = 0383346255
		chs[2] = 0788977205
		chs[3] = "shape.wda"
	elseif ch == "凤翼流珠_巫蛮儿" then
		chs[1] = 2738200746
		chs[2] = 3013213807
		chs[3] = "shape.wda"
	elseif ch == "雪蟒霜寒_巫蛮儿" then
		chs[1] = 2446794254
		chs[2] = 2344781059
		chs[3] = "shape.wda"
	elseif ch == "碧海潮生_巫蛮儿" then
		chs[1] = 3147201779
		chs[2] = 3842138961
		chs[3] = "shape.wda"
	elseif ch == "弦月_巫蛮儿" then
		chs[1] = 2558772509
		chs[2] = 0994443450
		chs[3] = "shape.wda"

		-- 完善
	elseif ch == "桃夭夭" then
		chs[1] = 0x2f099d59
		chs[2] = 0x1b5f4786
		chs[3] = "common/shape.wdf"
	elseif ch == "桃夭夭_灯笼" then
		chs[1] = 0x2f099d59
		chs[2] = 0x1b5f4786
		chs[3] = "common/shape.wdf"
	elseif ch == "桃夭夭_飘带" then
		chs[1] = 0xf514e58f
		chs[2] = 0x24e813dd
		chs[3] = "common/shape.wdf"
	elseif ch == "素纸灯_桃夭夭" then
		chs[1] = 0xfca44d34
		chs[2] = 0x6b6a3e9b
		chs[3] = "common/shape.wdf"
	elseif ch == "如意宫灯_桃夭夭" then
		chs[1] = 0xace0ad55
		chs[2] = 0x7d52b7b2
		chs[3] = "common/shape.wdf"
	elseif ch == "玉兔盏_桃夭夭" then
		chs[1] = 0x711c00c
		chs[2] = 0xae8716c
		chs[3] = "common/shape.wdf"
	elseif ch == "蟠龙_桃夭夭" then
		chs[1] = 0xf6feaca1
		chs[2] = 0xd6a7506c
		chs[3] = "common/shape.wdf"
	elseif ch == "云鹤_桃夭夭" then
		chs[1] = 0x8ec884a6
		chs[2] = 0x1ace0dea
		chs[3] = "common/shape.wdf"
	elseif ch == "风荷_桃夭夭" then
		chs[1] = 0x2924735e
		chs[2] = 0x12ac5a00
		chs[3] = "common/shape.wdf"
	elseif ch == "金风玉露_桃夭夭" then
		chs[1] = 0xe7bd767a
		chs[2] = 0x7101fac1
		chs[3] = "common/shape.wdf"
	elseif ch == "凰火燎原_桃夭夭" then
		chs[1] = 0x16729bb3
		chs[2] = 0x65a74f45
		chs[3] = "common/shape.wdf"
	elseif ch == "月露清愁_桃夭夭" then
		chs[1] = 0x223c1b62
		chs[2] = 0xcbf4ce31
		chs[3] = "common/shape.wdf"
	elseif ch == "夭桃秾李_桃夭夭" then
		chs[1] = 0x1a53c4e7
		chs[2] = 0x27c1e665
		chs[3] = "common/shape.wdf"
	elseif ch == "荒尘_桃夭夭" then
		chs[1] = 0x3848e76
		chs[2] = 0x8b49d1c6
		chs[3] = "common/shape.wdf"
	elseif ch == "五色缎带_桃夭夭" then
		chs[1] = 0x6afc59f7
		chs[2] = 0x32736853
		chs[3] = "common/shape.wdf"
	elseif ch == "无极丝_桃夭夭" then
		chs[1] = 0xacfd4797
		chs[2] = 0xee59d055
		chs[3] = "common/shape.wdf"
	elseif ch == "七彩罗刹_桃夭夭" then
		chs[1] = 0xec2ce1b
		chs[2] = 0x109ac390
		chs[3] = "common/shape.wdf"
	elseif ch == "彩虹_桃夭夭" then
		chs[1] = 0x5fcce5d5
		chs[2] = 0xd0d7b4c6
		chs[3] = "common/shape.wdf"
	elseif ch == "流云_桃夭夭" then
		chs[1] = 0x51a9f58b
		chs[2] = 0x4f0d82c7
		chs[3] = "common/shape.wdf"
	elseif ch == "碧波_桃夭夭" then
		chs[1] = 0x800185fa
		chs[2] = 0xc0a2f354
		chs[3] = "common/shape.wdf"
	elseif ch == "秋水落霞_桃夭夭" then
		chs[1] = 0xce670726
		chs[2] = 0xd3dac606
		chs[3] = "common/shape.wdf"
	elseif ch == "晃金仙绳_桃夭夭" then
		chs[1] = 0xf4c0c1f6
		chs[2] = 0xa7546f17
		chs[3] = "common/shape.wdf"
	elseif ch == "此最相思_桃夭夭" then
		chs[1] = 0x8700d110
		chs[2] = 0xbb8f8820
		chs[3] = "common/shape.wdf"
	elseif ch == "揽月摘星_桃夭夭" then
		chs[1] = 0x79fe3e9d
		chs[2] = 0xfba71a70
		chs[3] = "common/shape.wdf"
	elseif ch == "九霄_桃夭夭" then
		chs[1] = 0xd196466d
		chs[2] = 0x48d96197
		chs[3] = "common/shape.wdf"
	elseif ch == "偃无师" then
		chs[1] = 0x89f0f085
		chs[2] = 0x2fd449d8
		chs[3] = "common/shape.wdf"
	elseif ch == "偃无师_巨剑" then
		chs[1] = 0x89f0f085
		chs[2] = 0x2fd449d8
		chs[3] = "common/shape.wdf"
	elseif ch == "偃无师_剑" then
		chs[1] = 0x89f0f085
		chs[2] = 0x12fab5cf
		chs[3] = "common/shape.wdf"
	elseif ch == "钝铁重剑_偃无师" then
		chs[1] = 0x59996f41
		chs[2] = 0x28b6eb2f
		chs[3] = "common/shape.wdf"
	elseif ch == "壁玉长铗_偃无师" then
		chs[1] = 0x26416de1
		chs[2] = 0x7e269ae
		chs[3] = "common/shape.wdf"
	elseif ch == "惊涛雪_偃无师" then
		chs[1] = 0xe9b2e7c5
		chs[2] = 0xf1db01b3
		chs[3] = "common/shape.wdf"
	elseif ch == "鸦九_偃无师" then
		chs[1] = 0x929263f1
		chs[2] = 0xa1346952
		chs[3] = "common/shape.wdf"
	elseif ch == "昆吾_偃无师" then
		chs[1] = 0x2c9ade2
		chs[2] = 0x182ae6bd
		chs[3] = "common/shape.wdf"
	elseif ch == "弦歌_偃无师" then
		chs[1] = 0x2f3eb992
		chs[2] = 0x4b302241
		chs[3] = "common/shape.wdf"
	elseif ch == "墨骨枯麟_偃无师" then
		chs[1] = 0xc0446928
		chs[2] = 0x1364a86d
		chs[3] = "common/shape.wdf"
	elseif ch == "腾蛇郁刃_偃无师" then
		chs[1] = 0x88b7a489
		chs[2] = 0x812da7b7
		chs[3] = "common/shape.wdf"
	elseif ch == "秋水澄流_偃无师" then
		chs[1] = 0x776f5f7d
		chs[2] = 0x29d584ca
		chs[3] = "common/shape.wdf"
	elseif ch == "百辟镇魂_偃无师" then
		chs[1] = 0x8a56e79b
		chs[2] = 0xeffea077
		chs[3] = "common/shape.wdf"
	elseif ch == "长息_偃无师" then
		chs[1] = 0x7d5fe85c
		chs[2] = 0xb5aec18c
		chs[3] = "common/shape.wdf"
	elseif ch == "青铜短剑_偃无师" then
		chs[1] = 0xa3a53ee1
		chs[2] = 0x5fcb90c5
		chs[3] = "common/shape.wdf"
	elseif ch == "青锋剑_偃无师" then
		chs[1] = 0x184828c5
		chs[2] = 0x85f1e16f
		chs[3] = "common/shape.wdf"
	elseif ch == "游龙剑_偃无师" then
		chs[1] = 0x421aa16f
		chs[2] = 0x6552d73
		chs[3] = "common/shape.wdf"
	elseif ch == "鱼肠_偃无师" then
		chs[1] = 0x6fbab8b7
		chs[2] = 0xc4278104
		chs[3] = "common/shape.wdf"
	elseif ch == "倚天_偃无师" then
		chs[1] = 0xffbac97
		chs[2] = 0x283e8c79
		chs[3] = "common/shape.wdf"
	elseif ch == "湛卢_偃无师" then
		chs[1] = 0x536861b9
		chs[2] = 0x7e265c51
		chs[3] = "common/shape.wdf"
	elseif ch == "魏武青虹_偃无师" then
		chs[1] = 0xfdd3ecbb
		chs[2] = 0x2e4c5ba9
		chs[3] = "common/shape.wdf"
	elseif ch == "灵犀神剑_偃无师" then
		chs[1] = 0xfdd5c98e
		chs[2] = 0x30e9fb89
		chs[3] = "common/shape.wdf"
	elseif ch == "四法青云_偃无师" then
		chs[1] = 0x8ac69053
		chs[2] = 0xef01b789
		chs[3] = "common/shape.wdf"
	elseif ch == "霜冷九州_偃无师" then
		chs[1] = 0x48224b34
		chs[2] = 0x6b9319a9
		chs[3] = "common/shape.wdf"
	elseif ch == "擒龙_偃无师" then
		chs[1] = 0x66d72341
		chs[2] = 0x9d706607
		chs[3] = "common/shape.wdf"
	elseif ch == "鬼潇潇" then
		chs[1] = 0xb917a58d
		chs[2] = 0x4ed95a04
		chs[3] = "common/shape.wdf"
	elseif ch == "鬼潇潇_伞" then
		chs[1] = 0xb917a58d
		chs[2] = 0x4ed95a04
		chs[3] = "common/shape.wdf"
	elseif ch == "鬼潇潇_爪刺" then
		chs[1] = 0xf5aad68f
		chs[2] = 0xd509567a
		chs[3] = "common/shape.wdf"
	elseif ch == "红罗伞_鬼潇潇" then
		chs[1] = 0x76426098
		chs[2] = 0x561bc662
		chs[3] = "common/shape.wdf"
	elseif ch == "琳琅盖_鬼潇潇" then
		chs[1] = 0x8d8277fb
		chs[2] = 0x75b80826
		chs[3] = "common/shape.wdf"
	elseif ch == "金刚伞_鬼潇潇" then
		chs[1] = 0x8b2f6408
		chs[2] = 0x9bcaecbc
		chs[3] = "common/shape.wdf"
	elseif ch == "鬼骨_鬼潇潇" then
		chs[1] = 0x87cc13bd
		chs[2] = 0x26274c0
		chs[3] = "common/shape.wdf"
	elseif ch == "云梦_鬼潇潇" then
		chs[1] = 0x1186392b
		chs[2] = 0xd5985d18
		chs[3] = "common/shape.wdf"
	elseif ch == "枕霞_鬼潇潇" then
		chs[1] = 0x12b17018
		chs[2] = 0x279052c9
		chs[3] = "common/shape.wdf"
	elseif ch == "碧火琉璃_鬼潇潇" then
		chs[1] = 0xd016b928
		chs[2] = 0x3c4cb4fe
		chs[3] = "common/shape.wdf"
	elseif ch == "雪羽穿云_鬼潇潇" then
		chs[1] = 0x15667d89
		chs[2] = 0x868b19fb
		chs[3] = "common/shape.wdf"
	elseif ch == "月影星痕_鬼潇潇" then
		chs[1] = 0x59f606ce
		chs[2] = 0x9bfb157c
		chs[3] = "common/shape.wdf"
	elseif ch == "浮生归梦_鬼潇潇" then
		chs[1] = 0x4129400e
		chs[2] = 0x4015fc31
		chs[3] = "common/shape.wdf"
	elseif ch == "晴雪_鬼潇潇" then
		chs[1] = 0xcffe51e1
		chs[2] = 0x888851b6
		chs[3] = "common/shape.wdf"
	elseif ch == "铁爪_鬼潇潇" then
		chs[1] = 0x2f5a4d48
		chs[2] = 0xcb494ef8
		chs[3] = "common/shape.wdf"
	elseif ch == "青龙牙_鬼潇潇" then
		chs[1] = 0xc4598e51
		chs[2] = 0x9091bfcb
		chs[3] = "common/shape.wdf"
	elseif ch == "青刚刺_鬼潇潇" then
		chs[1] = 0x64ea234b
		chs[2] = 0x59be69a2
		chs[3] = "common/shape.wdf"
	elseif ch == "撕天_鬼潇潇" then
		chs[1] = 0xddd2427e
		chs[2] = 0x9f8667cd
		chs[3] = "common/shape.wdf"
	elseif ch == "毒牙_鬼潇潇" then
		chs[1] = 0xefa1b021
		chs[2] = 0x32ea26bb
		chs[3] = "common/shape.wdf"
	elseif ch == "胭脂_鬼潇潇" then
		chs[1] = 0x71917206
		chs[2] = 0xe178f1f8
		chs[3] = "common/shape.wdf"
	elseif ch == "九阴勾魂_鬼潇潇" then
		chs[1] = 0xddb52de7
		chs[2] = 0xd3ba6091
		chs[3] = "common/shape.wdf"
	elseif ch == "雪蚕之刺_鬼潇潇" then
		chs[1] = 0x95535295
		chs[2] = 0x6294455a
		chs[3] = "common/shape.wdf"
	elseif ch == "贵霜之牙_鬼潇潇" then
		chs[1] = 0x67455b85
		chs[2] = 0x8bc6755f
		chs[3] = "common/shape.wdf"
	elseif ch == "忘川三途_鬼潇潇" then
		chs[1] = 0xa227eae0
		chs[2] = 0x517613b8
		chs[3] = "common/shape.wdf"
	elseif ch == "离钩_鬼潇潇" then
		chs[1] = 0x27bfa1cb
		chs[2] = 0x540c068e
		chs[3] = "common/shape.wdf"

		-- 新神兽
		-- 任务特效
	elseif ch == "僵尸倒地" then
		chs[1] = 0x5723F6F9
		chs[2] = 0x5723F6F9
		chs[3] = "shape.wdf"
	elseif ch == "赌徒倒地" then
		chs[1] = 0x93371DC2
		chs[2] = 0x93371DC2
		chs[3] = "shape.wdf"
	elseif ch == "逍遥生坐下" then
		chs[1] = 2165332228
		chs[2] = 2165332228
		chs[3] = "common/shape.wdf"
	elseif ch == "英女侠坐下" then
		chs[1] = 0x8AE7E3A4
		chs[2] = 0x8AE7E3A4
		chs[3] = "shape.wdf"
	elseif ch == "玄彩娥坐下" then
		chs[1] = 0xF6820612
		chs[2] = 0xF6820612
		chs[3] = "common/shape.wdf"
	elseif ch == "舞天姬坐下" then
		chs[1] = 3933281088
		chs[2] = 3933281088
		chs[3] = "common/shape.wdf"
	elseif ch == "神天兵坐下" then
		chs[1] = 0xA4D3F138
		chs[2] = 0xA4D3F138
		chs[3] = "common/shape.wdf"
	elseif ch == "龙太子坐下" then
		chs[1] = 0x1D76393F
		chs[2] = 0x1D76393F
		chs[3] = "common/shape.wdf"
	elseif ch == "巨魔王坐下" then
		chs[1] = 0x8349ECD1
		chs[2] = 0x8349ECD1
		chs[3] = "common/shape.wdf"
	elseif ch == "剑侠客坐下" then
		chs[1] = 0xCA7EED95
		chs[2] = 0xCA7EED95
		chs[3] = "shape.wdf"
	elseif ch == "虎头怪坐下" then
		chs[1] = 0x0431506B
		chs[2] = 0x0431506B
		chs[3] = "common/shape.wdf"
	elseif ch == "狐美人坐下" then
		chs[1] = 0x9C1633C8
		chs[2] = 0x9C1633C8
		chs[3] = "common/shape.wdf"
	elseif ch == "骨精灵坐下" then
		chs[1] = 0x72AFA4E9
		chs[2] = 0x72AFA4E9
		chs[3] = "common/shape.wdf"
	elseif ch == "飞燕女坐下" then
		chs[1] = 0x45988F73
		chs[2] = 0x45988F73
		chs[3] = "common/shape.wdf"
	elseif ch == "巫蛮儿坐下" then
		chs[1] = 0803847012
		chs[2] = 0803847012
		chs[3] = "shape.wda"
	elseif ch == "杀破狼坐下" then
		chs[1] = 448666846
		chs[2] = 448666846
		chs[3] = "shape.wda"
	elseif ch == "羽灵神坐下" then
		chs[1] = 0775868075
		chs[2] = 0775868075
		chs[3] = "shape.wda"
	elseif ch == "偃无师坐下" then
		chs[1] = 0x4eb0e2d8
		chs[2] = 0x4eb0e2d8
		chs[3] = "common/shape.wdf"
	elseif ch == "桃夭夭坐下" then
		chs[1] = 0x5be51474
		chs[2] = 0x5be51474
		chs[3] = "common/shape.wdf"
	elseif ch == "鬼潇潇坐下" then
		chs[1] = 0xf5aad68f
		chs[2] = 0xf5aad68f
		chs[3] = "common/shape.wdf"
		-- 翅膀
		--########################################################?自己修改?##########################################
	elseif ch == "太古" then
		chs[1] = 431905545
		chs[2] = 431905545
		chs[3] = "common/cb.wdf"
	elseif ch == "太古1" then
		chs[1] = 505469611
		chs[2] = 505469611
		chs[3] = "common/cb.wdf"
	elseif ch == "太古2" then
		chs[1] = 748607040
		chs[2] = 748607040
		chs[3] = "common/cb.wdf"
	elseif ch == "太古3" then
		chs[1] = 1058946066
		chs[2] = 1058946066
		chs[3] = "common/cb.wdf"
	elseif ch == "太古4" then
		chs[1] = 1245185735
		chs[2] = 1245185735
		chs[3] = "common/cb.wdf"
	elseif ch == "太古5" then
		chs[1] = 1647528545
		chs[2] = 1647528545
		chs[3] = "common/cb.wdf"
	elseif ch == "太古6" then
		chs[1] = 1987416200
		chs[2] = 1987416200
		chs[3] = "common/cb.wdf"
	elseif ch == "太古7" then
		chs[1] = 2695020068
		chs[2] = 2695020068
		chs[3] = "common/cb.wdf"
	elseif ch == "太古8" then
		chs[1] = 3624277419
		chs[2] = 3624277419
		chs[3] = "common/cb.wdf"
	elseif ch == "太古9" then
		chs[1] = 3908190757
		chs[2] = 3908190757
		chs[3] = "common/cb.wdf"
	elseif ch == "太古10" then
		chs[1] = 3914126318
		chs[2] = 3914126318
		chs[3] = "common/cb.wdf"
	elseif ch == "太古11" then
		chs[1] = 3952525894
		chs[2] = 3952525894
		chs[3] = "common/cb.wdf"
	elseif ch == "太古12" then
		chs[1] = 3627119723
		chs[2] = 3627119723
		chs[3] = "common/cb.wdf"
	elseif ch == "太古13" then
		chs[1] = 3250792870
		chs[2] = 3250792870
		chs[3] = "common/cb.wdf"
	elseif ch == "太古14" then
		chs[1] = 748607040
		chs[2] = 748607040
		chs[3] = "common/cb.wdf"
	elseif ch == "太古15" then
		chs[1] = 2763887390
		chs[2] = 2763887390
		chs[3] = "common/cb.wdf"
	elseif ch == "太古16" then
		chs[1] = 3365926588
		chs[2] = 3365926588
		chs[3] = "common/cb.wdf"
	elseif ch == "太古17" then
		chs[1] = 3393134740
		chs[2] = 3393134740
		chs[3] = "common/cb.wdf"
	elseif ch == "太古18" then
		chs[1] = 3606504069
		chs[2] = 3606504069
		chs[3] = "common/cb.wdf"
	elseif ch == "太古19" then
		chs[1] = 3392146366
		chs[2] = 3392146366
		chs[3] = "common/cb.wdf"
	
		--########################################################?自己修改?##########################################
	
		-- 新Npc
		--道具类
	elseif ch == "祈愿宝箱" then
		chs[1] = 0x1e29a66f
		chs[2] = 0x1e29a66f
		chs[3] = "common/shape.wdf"
	elseif ch == "中秋梦幻" then
		chs[1] = 0xe2736848
		chs[2] = 0xe2736848
		chs[3] = "common/shape.wdf"
	elseif ch == "路障红正" then
		chs[1] = 0x859d3610
		chs[2] = 0x859d3610
		chs[3] = "common/shape.wdf"
	elseif ch == "路障红反" then
		chs[1] = 0x714cb3d2
		chs[2] = 0x714cb3d2
		chs[3] = "common/shape.wdf"
	elseif ch == "路障蓝正" then
		chs[1] = 0xa539b7cd
		chs[2] = 0xa539b7cd
		chs[3] = "common/shape.wdf"
	elseif ch == "路障蓝反" then
		chs[1] = 0x1b28fe8
		chs[2] = 0x1b28fe8
		chs[3] = "common/shape.wdf"
	elseif ch == "路障红正小" then
		chs[1] = 0x40ae5ddd
		chs[2] = 0x40ae5ddd
		chs[3] = "common/shape.wdf"
	elseif ch == "路障红反小" then
		chs[1] = 0x34cf73ab
		chs[2] = 0x34cf73ab
		chs[3] = "common/shape.wdf"
	elseif ch == "路障蓝正小" then
		chs[1] = 0x769c31fa
		chs[2] = 0x769c31fa
		chs[3] = "common/shape.wdf"
	elseif ch == "路障蓝反小" then
		chs[1] = 0x4fba55bf
		chs[2] = 0x4fba55bf
		chs[3] = "common/shape.wdf"
	elseif ch == "尸骨" then
		chs[1] = 0x92f29862
		chs[2] = 0x92f29862
		chs[3] = "common/shape.wdf"
	elseif ch == "酒坛" then
		chs[1] = 0x7baf0ee9
		chs[2] = 0x7baf0ee9
		chs[3] = "common/shape.wdf"
	elseif ch == "布书" then
		chs[1] = 0xab46d4c1
		chs[2] = 0xab46d4c1
		chs[3] = "common/shape.wdf"
	elseif ch == "祭台火盆黑" then
		chs[1] = 0x1823c626
		chs[2] = 0x1823c626
		chs[3] = "common/shape.wdf"
	elseif ch == "祭台火盆红" then
		chs[1] = 0x84dbc2e1
		chs[2] = 0x84dbc2e1
		chs[3] = "common/shape.wdf"
	elseif ch == "祭台火盆蓝" then
		chs[1] = 0x70e9a5ad
		chs[2] = 0x70e9a5ad
		chs[3] = "common/shape.wdf"
	elseif ch == "龙柱" then
		chs[1] = 0x6f6aa35c
		chs[2] = 0x6f6aa35c
		chs[3] = "common/shape.wdf"
	elseif ch == "菩萨" then
		chs[1] = 0xeb22f96e
		chs[2] = 0xeb22f96e
		chs[3] = "common/shape.wdf"
	elseif ch == "菩萨1" then
		chs[1] = 0x5bcf3551
		chs[2] = 0x5bcf3551
		chs[3] = "common/shape.wdf"
	elseif ch == "菩萨2" then
		chs[1] = 0x8777954e
		chs[2] = 0x8777954e
		chs[3] = "common/shape.wdf"
	elseif ch == "僧人" then
		chs[1] = 0x905fd8c9
		chs[2] = 0x905fd8c9
		chs[3] = "common/shape.wdf"
	elseif ch == "僧人1" then
		chs[1] = 0x962a7ca6
		chs[2] = 0x962a7ca6
		chs[3] = "common/shape.wdf"
	elseif ch == "僧人2" then
		chs[1] = 0xd53eb58e
		chs[2] = 0xd53eb58e
		chs[3] = "common/shape.wdf"
	elseif ch == "士兵" then
		chs[1] = 0xc9ed9138
		chs[2] = 0xc9ed9138
		chs[3] = "common/shape.wdf"
	elseif ch == "士兵1" then
		chs[1] = 0xd11a664
		chs[2] = 0xd11a664
		chs[3] = "common/shape.wdf"
	elseif ch == "烽火台" then
		chs[1] = 0x6b772c36
		chs[2] = 0x6b772c36
		chs[3] = "common/shape.wdf"
	elseif ch == "角楼" then
		chs[1] = 0x7b5195bb
		chs[2] = 0x7b5195bb
		chs[3] = "common/shape.wdf"
	elseif ch == "竹简" then
		chs[1] = 0x7b4e8f
		chs[2] = 0x7b4e8f
		chs[3] = "shape.wdc"
	elseif ch == "礼包褐" then
		chs[1] = 0x7746fa4b
		chs[2] = 0x7746fa4b
		chs[3] = "shape.wdc"
	elseif ch == "礼包紫" then
		chs[1] = 0xb2c207b4
		chs[2] = 0xb2c207b4
		chs[3] = "shape.wdc"
	elseif ch == "礼包蓝" then
		chs[1] = 0xed59647e
		chs[2] = 0xed59647e
		chs[3] = "shape.wdc"
	elseif ch == "符咒" then
		chs[1] = 0xe000bcf4
		chs[2] = 0xe000bcf4
		chs[3] = "shape.wdc"
	elseif ch == "符咒1" then
		chs[1] = 0xe000bcf4
		chs[2] = 0xe000bcf4
		chs[3] = "shape.wdc"
	elseif ch == "符咒2" then
		chs[1] = 0x77f93926
		chs[2] = 0x77f93926
		chs[3] = "shape.wdc"
	elseif ch == "符咒3" then
		chs[1] = 0xe693c77f
		chs[2] = 0xe693c77f
		chs[3] = "shape.wdc"
	elseif ch == "符咒4" then
		chs[1] = 0x8f507a06
		chs[2] = 0x8f507a06
		chs[3] = "shape.wdc"
	elseif ch == "符咒5" then
		chs[1] = 0xc9aa7151
		chs[2] = 0xc9aa7151
		chs[3] = "shape.wdc"
	elseif ch == "符咒6" then
		chs[1] = 0x11e8b141
		chs[2] = 0x11e8b141
		chs[3] = "shape.wdc"
	elseif ch == "符咒7" then
		chs[1] = 0x4b3c7866
		chs[2] = 0x4b3c7866
		chs[3] = "shape.wdc"
	elseif ch == "雪宝箱" then
		chs[1] = 0x45541e0a
		chs[2] = 0x45541e0a
		chs[3] = "shape.wdc"
	elseif ch == "破旧宝箱" then
		chs[1] = 0xc4c5611f
		chs[2] = 0xc4c5611f
		chs[3] = "shape.wdc"
	elseif ch == "赤金宝箱" then
		chs[1] = 0xc0d4d240
		chs[2] = 0xc0d4d240
		chs[3] = "shape.wd4"
	elseif ch == "战车机关" then
		chs[1] = 0x45541e0a
		chs[2] = 0x45541e0a
		chs[3] = "shape.wdc"
	elseif ch == "未知BOOS无恶1" then
		chs[1] = 0xF207F1A0
		chs[2] = 0xF207F1A0
		chs[3] = "shape.wdc"
	elseif ch == "未知BOOS无恶2" then
		chs[1] = 0xBF358FFE
		chs[2] = 0xBF358FFE
		chs[3] = "shape.wdc"
	elseif ch == "未知BOOS无恶3" then
		chs[1] = 0x22413486
		chs[2] = 0x22413486
		chs[3] = "shape.wdc"
	elseif ch == "未知BOOS无恶4" then
		chs[1] = 0x2FE25A8B
		chs[2] = 0x2FE25A8B
		chs[3] = "shape.wdc"
	elseif ch == "未知BOOS无恶5" then
		chs[1] = 0x679F3915
		chs[2] = 0x679F3915
		chs[3] = "shape.wdc"
	elseif ch == "未知BOOS无恶6" then
		chs[1] = 0x6C1BFD1F
		chs[2] = 0x6C1BFD1F
		chs[3] = "shape.wdc"
	elseif ch == "未知BOOS无恶7" then
		chs[1] = 0x6F8C61B8
		chs[2] = 0x6F8C61B8
		chs[3] = "shape.wdc"
	elseif ch == "竹筏" then
		chs[1] = 2325825167
		chs[2] = 2325825167
		chs[3] = "shape.wda"
	elseif ch == "蚩尤小" then
		chs[1] = 1796855426
		chs[2] = 2677184683
		chs[3] = "shape.wdc"
	-- elseif ch == "谛听" then
	-- 	chs[1] = 0x8000009
	-- 	chs[2] = 0x8000010
	-- 	chs[3] = "zdy4.rpk"
	-- elseif ch == "进阶谛听" then
	-- 	chs[1] = 0x8000019
	-- 	chs[2] = 0x8000020
	-- 	chs[3] = "zdy4.rpk"
	elseif ch == "赤炎兽" then
		chs[1] = 2486594272
		chs[2] = 304465120
		chs[3] = "zdy2.rpk"
	elseif ch == "九尾狐" then
		chs[1] = 1886636512
		chs[2] = 1710481696
		chs[3] = "zdy2.rpk"
	elseif ch == "进阶赤炎兽" then
		chs[1] = 2486594272
		chs[2] = 304465120
		chs[3] = "zdy2.rpk"
	elseif ch == "进阶九尾狐" then
		chs[1] = 1886636512
		chs[2] = 1710481696
		chs[3] = "zdy2.rpk"
	elseif ch == "蓐收" then
		chs[1] = 1761893344
		chs[2] = 1246851296
		chs[3] = "zdy2.rpk"
	elseif ch == "女娲" then
		chs[1] = 3123920864
		chs[2] = 2110343904
		chs[3] = "zdy2.rpk"
	elseif ch == "百鬼" then
		chs[1] = 645064160
		chs[2] = 2400324832
		chs[3] = "zdy2.rpk"
	elseif ch == "飞鱼" then
		chs[1] = 2279908064
		chs[2] = 2494275552
		chs[3] = "zdy2.rpk"
	elseif ch == "帝江" then
		chs[1] = 3854950624
		chs[2] = 2199068896
		chs[3] = "zdy2.rpk"
	elseif ch == "强良" then
		chs[1] = 4215751648
		chs[2] = 3906485472
		chs[3] = "zdy2.rpk"
	elseif ch == "烛龙" then
		chs[1] = 0x12d86ee0
		chs[2] = 0x12d86ee0
		chs[3] = "zdy2.rpk"
	elseif ch == "饕餮" then
		chs[1] = 0xd000390
		chs[2] = 0xd000393
		chs[3] = "zdy2.rpk"
	elseif ch == "镇妖塔" then
		chs[1] = 0x2588ce0
		chs[2] = 0x2588ce0
		chs[3] = "zdy2.rpk"
	-- elseif ch == "超级鲲鹏" or ch == "进阶超级鲲鹏" then
	-- 	chs[3] = "zdy5.rpk"
	-- 	chs[1] = 0x11000008
	-- 	chs[2] = 0x11000007
		--########################################################?自己修改?##########################################
	elseif ch == "铜矿_普通" then
		chs[1] = 0x10000207
		chs[2] = 0x10000207
	elseif ch == "银矿_普通" then
		chs[1] = 0x10000208
		chs[2] = 0x10000208
	elseif ch == "金矿_普通" then
		chs[1] = 0x10000209
		chs[2] = 0x10000209
	elseif ch == "翡翠矿_普通" then
		chs[1] = 0x10000210
		chs[2] = 0x10000210
	elseif ch == "紫金矿_普通" then
		chs[1] = 0x10000211
		chs[2] = 0x10000211
	end
	local jps0 = 取所有模型(ch2)
	if jps0 ~= nil and jps0.站立 ~= nil then
		chs[1] = jps0.站立
		chs[2] = jps0.行走
		if jps0.站立 == 0 or jps0.行走 == 0 then
			jps0 = 取所有模型("火星人")
			if jps0.站立 == 0 then
				chs[1] = jps0.站立
			end
			if jps0.行走 == 0 then
				chs[2] = jps0.行走
			end
		end
	end
	return chs
end

function 取战斗模型(pg, wq, 锦衣, 武器类型)
	if pg == nil then
		pg = "天将"
	end
	local pgs = {}
	local pg2 = pg
	local s = ""
	if 锦衣 ~= nil then
		pg = 锦衣 .. "_" .. pg
		-- if pg2 =="影精灵" then
		-- 	pg ="影精灵"
		-- end
		-- if 新锦衣[pg] then
		-- 	pgs[8]=新锦衣[pg]["跑去"]
		-- 	pgs[4]=新锦衣[pg]["防御"]
		-- 	pgs[1]=新锦衣[pg]["攻击"]
		-- 	pgs[2]=新锦衣[pg]["攻击1"]
		-- 	pgs[9]=新锦衣[pg]["挨打"]
		-- 	pgs[3]=新锦衣[pg]["静立"]
		-- 	pgs[7]=新锦衣[pg]["施法"]
		-- 	pgs[6]=新锦衣[pg]["静立"]
		-- 	pgs[10]="白色斗战.wdf"
		-- 	return pgs
		-- end
	else
		if wq ~= nil then
			s = "_" .. wq
		end
		pg = pg .. s
	end
	if ZhandouModel[pg] then
        local 数量 = 1
        for k,v in pairs(ZhandouModel[pg]) do
            数量 = 数量 + 1
        end
	    for i=1,数量 do
	    	if ZhandouModel[pg]["pgs_"..i] then
	    	    pgs[i]=ZhandouModel[pg]["pgs_"..i]
	    	end
	    end
		return pgs
	end
	if pg == "竹节双剑_飞燕女" then
		pgs[1] = 1107292387
		pgs[2] = 1107292387
		pgs[3] = 0x1a7f20d6
		pgs[4] = 3431990852
		pgs[6] = 2150756975
		pgs[7] = 2948306353
		pgs[8] = 3415383948
		pgs[9] = 2723304031
		pgs[10] = "common/shape.wdf"
	elseif pg == "黄铜圈_飞燕女" then
		pgs[1] = 4146113787
		pgs[2] = 4146113787
		pgs[3] = 3328869375
		pgs[4] = 2935267523
		pgs[6] = 2104438938
		pgs[7] = 3418401452
		pgs[8] = 867616434
		pgs[9] = 2580407403
		pgs[10] = "common/shape.wdf"
	elseif pg == "蛇形月_飞燕女" then
		pgs[1] = 1584140220
		pgs[2] = 1584140220
		pgs[3] = 1692063004
		pgs[4] = 1463150317
		pgs[6] = 4215251914
		pgs[7] = 3715550978
		pgs[8] = 174531720
		pgs[9] = 913070441
		pgs[10] = "common/shape.wdf"
	elseif pg == "双短剑_飞燕女" then
		pgs[1] = 18896713
		pgs[2] = 18896713
		pgs[3] = 0x919bf5dc
		pgs[4] = 3950458782
		pgs[6] = 0xB1488E22
		pgs[7] = 3421854459
		pgs[8] = 967461082
		pgs[9] = 372406582
		pgs[10] = "common/shape.wdf"
	elseif pg == "金刺轮_飞燕女" then
		pgs[1] = 3720262398
		pgs[2] = 3720262398
		pgs[3] = 1115289817
		pgs[4] = 2525078858
		pgs[6] = 827935432
		pgs[7] = 1403033620
		pgs[8] = 2466319363
		pgs[9] = 113367602
		pgs[10] = "common/shape.wdf"
	elseif pg == "赤焰双剑_飞燕女" then
		pgs[1] = 1548996612
		pgs[2] = 1548996612
		pgs[3] = 0xacc10e65
		pgs[4] = 3742981382
		pgs[6] = 2519910999
		pgs[7] = 313011222
		pgs[8] = 3245654395
		pgs[9] = 2878513884
		pgs[10] = "common/shape.wdf"
	elseif pg == "祖龙对剑_飞燕女" then
		pgs[1] = 985733706
		pgs[2] = 985733706
		pgs[3] = 0x3dc61885
		pgs[4] = 1544369507
		pgs[6] = 3553066663
		pgs[7] = 4238979964
		pgs[8] = 2190872843
		pgs[9] = 2053572839
		pgs[10] = "common/shape.wdf"
	elseif pg == "紫电青霜_飞燕女" then
		pgs[1] = 1709377296
		pgs[2] = 1709377296
		pgs[3] = 0x46384768
		pgs[4] = 2079837773
		pgs[6] = 2835812814
		pgs[7] = 1289475462
		pgs[8] = 1892940716
		pgs[9] = 1899538113
		pgs[10] = "common/shape.wdf"
	elseif pg == "浮犀_飞燕女" then
		pgs[1] = 1474639442
		pgs[2] = 1474639442
		pgs[3] = 0xd731d412
		pgs[4] = 2084990754
		pgs[6] = 2071526304
		pgs[7] = 1695237386
		pgs[8] = 2750824335
		pgs[9] = 0969736831
		pgs[10] = "common/shape.wdf"
	elseif pg == "金玉双环_飞燕女" then
		pgs[1] = 358856899
		pgs[2] = 358856899
		pgs[3] = 1504523359
		pgs[4] = 1837818019
		pgs[6] = 2360002112
		pgs[7] = 1630259287
		pgs[8] = 1285329813
		pgs[9] = 1980919951
		pgs[10] = "common/shape.wdf"
	elseif pg == "别情离恨_飞燕女" then
		pgs[1] = 2294614510
		pgs[2] = 2294614510
		pgs[3] = 1412079494
		pgs[4] = 1646305352
		pgs[6] = 2256502232
		pgs[7] = 104447335
		pgs[8] = 471741487
		pgs[9] = 1039274121
		pgs[10] = "common/shape.wdf"
	elseif pg == "连理双树_飞燕女" then
		pgs[1] = 2798452597
		pgs[2] = 2798452597
		pgs[3] = 0x60445950
		pgs[4] = 111849301
		pgs[6] = 3818492150
		pgs[7] = 359904366
		pgs[8] = 981796200
		pgs[9] = 1623427017
		pgs[10] = "common/shape.wdf"
	elseif pg == "月光双剑_飞燕女" then
		pgs[1] = 2513982445
		pgs[2] = 2513982445
		pgs[3] = 0xcc6e99e4
		pgs[4] = 2962390676
		pgs[6] = 586287519
		pgs[7] = 851655841
		pgs[8] = 1872246816
		pgs[9] = 3097886899
		pgs[10] = "common/shape.wdf"
	elseif pg == "乾坤_飞燕女" then
		pgs[1] = 3034288425
		pgs[2] = 3034288425
		pgs[3] = 2723272677
		pgs[4] = 1960402927
		pgs[6] = 3867771865
		pgs[7] = 1780449233
		pgs[8] = 967310259
		pgs[9] = 2120714102
		pgs[10] = "common/shape.wdf"
	elseif pg == "金龙双剪_飞燕女" then
		pgs[1] = 1411197712
		pgs[2] = 1411197712
		pgs[3] = 0x5ab67b17
		pgs[4] = 2149768266
		pgs[6] = 3896276189
		pgs[7] = 1274536324
		pgs[8] = 3865893351
		pgs[9] = 4293096481
		pgs[10] = "common/shape.wdf"
	elseif pg == "九天金线_飞燕女" then
		pgs[1] = 256145777
		pgs[2] = 256145777
		pgs[3] = 805152074
		pgs[4] = 612236907
		pgs[6] = 1205883736
		pgs[7] = 4056107702
		pgs[8] = 1146798449
		pgs[9] = 876728636
		pgs[10] = "common/shape.wdf"
	elseif pg == "无关风月_飞燕女" then
		pgs[1] = 2051866479
		pgs[2] = 2051866479
		pgs[3] = 1785158753
		pgs[4] = 1982666386
		pgs[6] = 3204942337
		pgs[7] = 1654668611
		pgs[8] = 0930614766
		pgs[9] = 3051530981
		pgs[10] = "common/shape.wdf"
	elseif pg == "朝夕_飞燕女" then
		pgs[1] = 4138802289
		pgs[2] = 4138802289
		pgs[3] = 0258017396
		pgs[4] = 0480690756
		pgs[6] = 2701132789
		pgs[7] = 3192094510
		pgs[8] = 3576848265
		pgs[9] = 1213207317
		pgs[10] = "common/shape.wdf"
	elseif pg == "月光双环_飞燕女" then
		pgs[1] = 4194305873
		pgs[2] = 4194305873
		pgs[3] = 2807816879
		pgs[4] = 73773078
		pgs[6] = 1041791674
		pgs[7] = 1651978044
		pgs[8] = 2848081881
		pgs[9] = 3069409432
		pgs[10] = "common/shape.wdf"
	elseif pg == "灵蛇_飞燕女" then
		pgs[1] = 2306957117
		pgs[2] = 2306957117
		pgs[3] = 0x36e7dda5
		pgs[4] = 2656017222
		pgs[6] = 3801799119
		pgs[7] = 2677792087
		pgs[8] = 1072683373
		pgs[9] = 2798173689
		pgs[10] = "common/shape.wdf"
	elseif pg == "如意_飞燕女" then
		pgs[1] = 361357102
		pgs[2] = 361357102
		pgs[3] = 1779832361
		pgs[4] = 1983738335
		pgs[6] = 1018400713
		pgs[7] = 3356485876
		pgs[8] = 1369851554
		pgs[9] = 4083603000
		pgs[10] = "common/shape.wdf"
	elseif pg == "阴阳_飞燕女" then
		pgs[1] = 308284096
		pgs[2] = 308284096
		pgs[3] = 0x5514fe8
		pgs[4] = 624581176
		pgs[6] = 2662103332
		pgs[7] = 338180652
		pgs[8] = 2211026380
		pgs[9] = 162524465
		pgs[10] = "common/shape.wdf"
	elseif pg == "折扇_逍遥生" then
		pgs[1] = 2964614373
		pgs[2] = 2964614373
		pgs[3] = 0xfa5c9e94
		pgs[4] = 293936349
		pgs[6] = 1375158316
		pgs[7] = 3094890393
		pgs[8] = 1511168433
		pgs[9] = 391725534
		pgs[10] = "common/shape.wdf"
	elseif pg == "青铜短剑_逍遥生" then
		pgs[1] = 1198108472
		pgs[2] = 1198108472
		pgs[3] = 1361263285
		pgs[4] = 2271925935
		pgs[6] = 2946567894
		pgs[7] = 3149178979
		pgs[8] = 3990213912
		pgs[9] = 3929526014
		pgs[10] = "common/shape.wdf"
	elseif pg == "青锋剑_逍遥生" then
		pgs[1] = 2028105319
		pgs[2] = 2028105319
		pgs[3] = 3791928171
		pgs[4] = 2088494889
		pgs[6] = 91578554
		pgs[7] = 518706841
		pgs[8] = 3909235980
		pgs[9] = 0x9f40beb5
		pgs[10] = "common/shape.wdf"
	elseif pg == "铁面扇_逍遥生" then
		pgs[1] = 265930064
		pgs[2] = 265930064
		pgs[3] = 0x1e1c8c68
		pgs[4] = 851934430
		pgs[6] = 3398365059
		pgs[7] = 1327574185
		pgs[8] = 3720853183
		pgs[9] = 2140890725
		pgs[10] = "common/shape.wdf"
	elseif pg == "神火扇_逍遥生" then
		pgs[1] = 809466984
		pgs[2] = 809466984
		pgs[3] = 0xc4a8be71
		pgs[4] = 1484450534
		pgs[6] = 1946292417
		pgs[7] = 2773394627
		pgs[8] = 3033319609
		pgs[9] = 815459690
		pgs[10] = "common/shape.wdf"
	elseif pg == "游龙剑_逍遥生" then
		pgs[1] = 2298557178
		pgs[2] = 2298557178
		pgs[3] = 923259950
		pgs[4] = 145374235
		pgs[6] = 4267993677
		pgs[7] = 3641474775
		pgs[8] = 345371692
		pgs[9] = 551366747
		pgs[10] = "common/shape.wdf"
	elseif pg == "玉龙_逍遥生" then
		pgs[1] = 291599680
		pgs[2] = 291599680
		pgs[3] = 0x47b23554
		pgs[4] = 1026330223
		pgs[6] = 3159923026
		pgs[7] = 2920506479
		pgs[8] = 2112187507
		pgs[9] = 3163375922
		pgs[10] = "common/shape.wdf"
	elseif pg == "魏武青虹_逍遥生" then
		pgs[1] = 2954647770
		pgs[2] = 2954647770
		pgs[3] = 1287899115
		pgs[4] = 0x6a4deb74
		pgs[6] = 2567725998
		pgs[7] = 2862658372
		pgs[8] = 4023660358
		pgs[9] = 1267402087
		pgs[10] = "common/shape.wdf"
	elseif pg == "逍遥江湖_逍遥生" then
		pgs[1] = 3459742955
		pgs[2] = 3459742955
		pgs[3] = 0x6eeb6938
		pgs[4] = 4224277364
		pgs[6] = 1818516162
		pgs[7] = 3783711264
		pgs[8] = 3566337709
		pgs[9] = 2650676483
		pgs[10] = "common/shape.wdf"
	elseif pg == "浩气长舒_逍遥生" then
		pgs[1] = 1787687382
		pgs[2] = 1787687382
		pgs[3] = 0xbdf71787
		pgs[4] = 2007103844
		pgs[6] = 1976544695
		pgs[7] = 1456930860
		pgs[8] = 2385855153
		pgs[9] = 3599367465
		pgs[10] = "common/shape.wdf"
	elseif pg == "星瀚_逍遥生" then
		pgs[1] = 2809028406
		pgs[2] = 2809028406
		pgs[3] = 0xc28e132b
		pgs[4] = 0635822686
		pgs[6] = 4199298440
		pgs[7] = 4100767959
		pgs[8] = 3470836750
		pgs[9] = 0649411872
		pgs[10] = "common/shape.wdf"
	elseif pg == "灵犀神剑_逍遥生" then
		pgs[1] = 4048939390
		pgs[2] = 4048939390
		pgs[3] = 2956972471
		pgs[4] = 0xb7aa2441
		pgs[6] = 1499210091
		pgs[7] = 3108724735
		pgs[8] = 3464352844
		pgs[9] = 1984805790
		pgs[10] = "common/shape.wdf"
	elseif pg == "鱼肠_逍遥生" then
		pgs[1] = 111752242
		pgs[2] = 111752242
		pgs[3] = 2779964916
		pgs[4] = 3099677412
		pgs[6] = 1315883113
		pgs[7] = 4096670906
		pgs[8] = 3380575361
		pgs[9] = 3347297766
		pgs[10] = "common/shape.wdf"
	elseif pg == "霜冷九州_逍遥生" then
		pgs[1] = 3500923187
		pgs[2] = 3500923187
		pgs[3] = 3419416515
		pgs[4] = 4121135422
		pgs[6] = 1766329695
		pgs[7] = 1208240575
		pgs[8] = 2948332373
		pgs[9] = 0569489195
		pgs[10] = "common/shape.wdf"
	elseif pg == "擒龙_逍遥生" then
		pgs[1] = 2313480743
		pgs[2] = 2313480743
		pgs[3] = 1394178168
		pgs[4] = 3931344485
		pgs[6] = 4049254285
		pgs[7] = 1046891202
		pgs[8] = 2147278343
		pgs[9] = 4088283715
		pgs[10] = "common/shape.wdf"
	elseif pg == "倚天_逍遥生" then
		pgs[1] = 944530413
		pgs[2] = 944530413
		pgs[3] = 4288693369
		pgs[4] = 0xfba36656
		pgs[6] = 893536575
		pgs[7] = 3580840293
		pgs[8] = 1513199932
		pgs[9] = 1959183902
		pgs[10] = "common/shape.wdf"
	elseif pg == "湛卢_逍遥生" then
		pgs[1] = 4122820611
		pgs[2] = 4122820611
		pgs[3] = 39942374
		pgs[4] = 0x252feb34
		pgs[6] = 3879135399
		pgs[7] = 1799718291
		pgs[8] = 2656683712
		pgs[9] = 356672046
		pgs[10] = "common/shape.wdf"
	elseif pg == "秋风_逍遥生" then
		pgs[1] = 2946234719
		pgs[2] = 2946234719
		pgs[3] = 0xe73a34e
		pgs[4] = 913597263
		pgs[6] = 1906683947
		pgs[7] = 3000647151
		pgs[8] = 3901133072
		pgs[9] = 1776219114
		pgs[10] = "common/shape.wdf"
	elseif pg == "四法青云_逍遥生" then
		pgs[1] = 3016226515
		pgs[2] = 3016226515
		pgs[3] = 52451636
		pgs[4] = 1691019474
		pgs[6] = 2058662475
		pgs[7] = 1670645347
		pgs[8] = 372928672
		pgs[9] = 3475794618
		pgs[10] = "common/shape.wdf"
	elseif pg == "太极_逍遥生" then
		pgs[1] = 649896254
		pgs[2] = 649896254
		pgs[3] = 0x65daa4af
		pgs[4] = 2206939775
		pgs[6] = 4084370231
		pgs[7] = 730224004
		pgs[8] = 2110134716
		pgs[9] = 297375576
		pgs[10] = "common/shape.wdf"
	elseif pg == "画龙点睛_逍遥生" then
		pgs[1] = 1820963257
		pgs[2] = 1820963257
		pgs[3] = 0xe3fd6ace
		pgs[4] = 847585063
		pgs[6] = 2168341927
		pgs[7] = 2999351206
		pgs[8] = 2759214368
		pgs[9] = 3485764253
		pgs[10] = "common/shape.wdf"
	elseif pg == "秋水人家_逍遥生" then
		pgs[1] = 3722556358
		pgs[2] = 3722556358
		pgs[3] = 0x4b84b4bc
		pgs[4] = 817486875
		pgs[6] = 2119665882
		pgs[7] = 79540806
		pgs[8] = 1912450629
		pgs[9] = 3131282288
		pgs[10] = "common/shape.wdf"
	elseif pg == "擒龙_逍遥生" then
		pgs[1] = 2313480743
		pgs[2] = 2313480743
		pgs[3] = 1394178168
		pgs[4] = 3931344485
		pgs[6] = 4049254285
		pgs[7] = 1046891202
		pgs[8] = 2147278343
		pgs[9] = 4088283715
		pgs[10] = "common/shape.wdf"
	elseif pg == "青铜斧_虎头怪" then
		pgs[1] = 2625820889
		pgs[2] = 2625820889
		pgs[3] = 0x2208a659
		pgs[4] = 1319228411
		pgs[6] = 860172680
		pgs[7] = 36420174
		pgs[8] = 3821452431
		pgs[9] = 303003892
		pgs[10] = "common/shape.wdf"
	elseif pg == "双弦钺_虎头怪" then
		pgs[1] = 3106550770
		pgs[2] = 3106550770
		pgs[3] = 0x1ddbb1c6
		pgs[4] = 813505863
		pgs[6] = 4256430594
		pgs[7] = 1073168906
		pgs[8] = 3722911626
		pgs[9] = 1532549372
		pgs[10] = "common/shape.wdf"
	elseif pg == "八卦_虎头怪" then
		pgs[1] = 0xF4E93C19
		pgs[2] = 0xF4E93C19
		pgs[3] = 0xDAA88DDF
		pgs[4] = 0xDCA25DA6
		pgs[6] = 0x9EB4376A
		pgs[7] = 0x257EEB28
		pgs[8] = 0x6AD54C39
		pgs[9] = 0xBF887095
		pgs[10] = "common/shape.wdf"
	elseif pg == "狼牙锤_虎头怪" then
		pgs[1] = 2073386691
		pgs[2] = 2073386691
		pgs[3] = 336486465
		pgs[4] = 381771912
		pgs[6] = 4106128916
		pgs[7] = 1791439790
		pgs[8] = 568824381
		pgs[9] = 1676981226
		pgs[10] = "common/shape.wdf"
	elseif pg == "乌金鬼头镰_虎头怪" then
		pgs[1] = 3466710001
		pgs[2] = 3466710001
		pgs[3] = 0x6f6e119a
		pgs[4] = 3433763427
		pgs[6] = 752010966
		pgs[7] = 2871143747
		pgs[8] = 1261420343
		pgs[9] = 2046811187
		pgs[10] = "common/shape.wdf"
	elseif pg == "震天锤_虎头怪" then
		pgs[1] = 910543157
		pgs[2] = 910543157
		pgs[3] = 396098490
		pgs[4] = 51606250
		pgs[6] = 647794191
		pgs[7] = 1034863730
		pgs[8] = 34149923
		pgs[9] = 2195214010
		pgs[10] = "common/shape.wdf"
	elseif pg == "松木锤_虎头怪" then
		pgs[1] = 3954765830
		pgs[2] = 3954765830
		pgs[3] = 1463806219
		pgs[4] = 4224177154
		pgs[6] = 78625091
		pgs[7] = 2652829739
		pgs[8] = 2214494438
		pgs[9] = 1060924399
		pgs[10] = "common/shape.wdf"
	elseif pg == "肃魂_虎头怪" then
		pgs[1] = 3347502793
		pgs[2] = 3347502793
		pgs[3] = 0x4cbc0cc5
		pgs[4] = 118700546
		pgs[6] = 2438511946
		pgs[7] = 654574910
		pgs[8] = 2443863215
		pgs[9] = 3044188142
		pgs[10] = "common/shape.wdf"
	elseif pg == "无敌_虎头怪" then
		pgs[1] = 3570280462
		pgs[2] = 3570280462
		pgs[3] = 0xe74758dc
		pgs[4] = 4066794943
		pgs[6] = 2962716394
		pgs[7] = 2728193647
		pgs[8] = 1018712733
		pgs[9] = 3542032877
		pgs[10] = "common/shape.wdf"
	elseif pg == "雷神_虎头怪" then
		pgs[1] = 3666407377
		pgs[2] = 3666407377
		pgs[3] = 465270733
		pgs[4] = 2173835439
		pgs[6] = 1254874348
		pgs[7] = 2506000487
		pgs[8] = 3727411622
		pgs[9] = 2103867801
		pgs[10] = "common/shape.wdf"
	elseif pg == "九瓣莲花_虎头怪" then
		pgs[1] = 4211862022
		pgs[2] = 4211862022
		pgs[3] = 3700497436
		pgs[4] = 2579634951
		pgs[6] = 3976648204
		pgs[7] = 2765994764
		pgs[8] = 3401808842
		pgs[9] = 4094340569
		pgs[10] = "common/shape.wdf"
	elseif pg == "元神禁锢_虎头怪" then
		pgs[1] = 345884366
		pgs[2] = 345884366
		pgs[3] = 0x77acf46a
		pgs[4] = 3684415104
		pgs[6] = 3779343772
		pgs[7] = 1164144313
		pgs[8] = 2870850177
		pgs[9] = 1485270944
		pgs[10] = "common/shape.wdf"
	elseif pg == "护法灭魔_虎头怪" then
		pgs[1] = 2333757160
		pgs[2] = 2333757160
		pgs[3] = 0x436e551f
		pgs[4] = 1240918279
		pgs[6] = 4006191476
		pgs[7] = 291325187
		pgs[8] = 1586774719
		pgs[9] = 2726510090
		pgs[10] = "common/shape.wdf"
	elseif pg == "碧血干戚_虎头怪" then
		pgs[1] = 2522616044
		pgs[2] = 2522616044
		pgs[3] = 0x9953b8a3
		pgs[4] = 4132910073
		pgs[6] = 2916654539
		pgs[7] = 1375729749
		pgs[8] = 3235367936
		pgs[9] = 2444186613
		pgs[10] = "common/shape.wdf"
	elseif pg == "裂天_虎头怪" then
		pgs[1] = 3605525759
		pgs[2] = 3605525759
		pgs[3] = 0x32f0dc6c
		pgs[4] = 1428790516
		pgs[6] = 1927582914
		pgs[7] = 0157199347
		pgs[8] = 2018235479
		pgs[9] = 0184731195
		pgs[10] = "common/shape.wdf"
	elseif pg == "鬼牙_虎头怪" then
		pgs[1] = 3191385649
		pgs[2] = 3191385649
		pgs[3] = 964246481
		pgs[4] = 439390498
		pgs[6] = 2557976454
		pgs[7] = 899308703
		pgs[8] = 1809962467
		pgs[9] = 1310176885
		pgs[10] = "common/shape.wdf"
	elseif pg == "鬼王蚀日_虎头怪" then
		pgs[1] = 2268846765
		pgs[2] = 2268846765
		pgs[3] = 257733900
		pgs[4] = 733650393
		pgs[6] = 2155760337
		pgs[7] = 3690009014
		pgs[8] = 3223595996
		pgs[9] = 553446556
		pgs[10] = "common/shape.wdf"
	elseif pg == "狂澜碎岳_虎头怪" then
		pgs[1] = 0843924172
		pgs[2] = 0843924172
		pgs[3] = 3497818294
		pgs[4] = 0119723529
		pgs[6] = 2748969191
		pgs[7] = 1323769114
		pgs[8] = 1279428078
		pgs[9] = 1811551067
		pgs[10] = "common/shape.wdf"
	elseif pg == "碎寂_虎头怪" then
		pgs[1] = 3620927202
		pgs[2] = 3620927202
		pgs[3] = 1460939045
		pgs[4] = 3684775387
		pgs[6] = 3894472815
		pgs[7] = 0534677085
		pgs[8] = 1857702941
		pgs[9] = 3336710114
		pgs[10] = "common/shape.wdf"
	elseif pg == "混元金锤_虎头怪" then
		pgs[1] = 3310158404
		pgs[2] = 3310158404
		pgs[3] = 3916719461
		pgs[4] = 2256126103
		pgs[6] = 1047119087
		pgs[7] = 649007137
		pgs[8] = 3287631002
		pgs[9] = 3272074169
		pgs[10] = "common/shape.wdf"
	elseif pg == "五丁开山_虎头怪" then
		pgs[1] = 2062014821
		pgs[2] = 2062014821
		pgs[3] = 0xc9417a1a
		pgs[4] = 3661893622
		pgs[6] = 1889040253
		pgs[7] = 1541320741
		pgs[8] = 1738256578
		pgs[9] = 722835269
		pgs[10] = "common/shape.wdf"
	elseif pg == "破魄_虎头怪" then
		pgs[1] = 66503730
		pgs[2] = 66503730
		pgs[3] = 0xec47773c
		pgs[4] = 147936745
		pgs[6] = 915959107
		pgs[7] = 2946347461
		pgs[8] = 1892595080
		pgs[9] = 1320517389
		pgs[10] = "common/shape.wdf"
	elseif pg == "狼牙刀_巨魔王" then
		pgs[1] = 1348040770
		pgs[2] = 1348040770
		pgs[3] = 352421824
		pgs[4] = 1800113692
		pgs[6] = 1284246655
		pgs[7] = 4283867446
		pgs[8] = 1391628501
		pgs[9] = 2232000579
		pgs[10] = "common/shape.wdf"
	elseif pg == "金背大砍刀_巨魔王" then
		pgs[1] = 2076710374
		pgs[2] = 2076710374
		pgs[3] = 1462666995
		pgs[4] = 1595258466
		pgs[6] = 3808390705
		pgs[7] = 3112271650
		pgs[8] = 1162958128
		pgs[9] = 3317931600
		pgs[10] = "common/shape.wdf"
	elseif pg == "双弦钺_巨魔王" then
		pgs[1] = 1793132112
		pgs[2] = 1793132112
		pgs[3] = 0x690d9a1
		pgs[4] = 3898773470
		pgs[6] = 2550126650
		pgs[7] = 0xb02e8a71
		pgs[8] = 0x405a73c1 --544328121
		pgs[9] = 2797209389
		pgs[10] = "common/shape.wdf"
	elseif pg == "柳叶刀_巨魔王" then
		pgs[1] = 3522958092
		pgs[2] = 3522958092
		pgs[3] = 2519475388
		pgs[4] = 3788202981
		pgs[6] = 333884425
		pgs[7] = 3427345453
		pgs[8] = 0x6cbbe06c
		pgs[9] = 4266255286
		pgs[10] = "common/shape.wdf"
	elseif pg == "乌金鬼头镰_巨魔王" then
		pgs[1] = 208276143
		pgs[2] = 208276143
		pgs[3] = 0x5342d0dd
		pgs[4] = 1471811059
		pgs[6] = 1976211634
		pgs[7] = 153091850
		pgs[8] = 3647700056
		pgs[9] = 4019257677
		pgs[10] = "common/shape.wdf"
	elseif pg == "青铜斧_巨魔王" then
		pgs[1] = 182516681
		pgs[2] = 182516681
		pgs[3] = 0xebc7d5d6
		pgs[4] = 3396040890
		pgs[6] = 3108223122
		pgs[7] = 1776525498
		pgs[8] = 3618533458
		pgs[9] = 2670573290
		pgs[10] = "common/shape.wdf"
	elseif pg == "晓风残月_巨魔王" then
		pgs[1] = 684541206
		pgs[2] = 684541206
		pgs[3] = 575760044
		pgs[4] = 2922449802
		pgs[6] = 578321277
		pgs[7] = 1145919811
		pgs[8] = 1959824975
		pgs[9] = 2531067724
		pgs[10] = "common/shape.wdf"
	elseif pg == "元神禁锢_巨魔王" then
		pgs[1] = 1611966521
		pgs[2] = 1611966521
		pgs[3] = 0xcde7b933
		pgs[4] = 3825599050
		pgs[6] = 2980430167
		pgs[7] = 2239466708
		pgs[8] = 1421663600
		pgs[9] = 2749153529
		pgs[10] = "common/shape.wdf"
	elseif pg == "护法灭魔_巨魔王" then
		pgs[1] = 1083493637
		pgs[2] = 1083493637
		pgs[3] = 0x91b7053d
		pgs[4] = 2551291495
		pgs[6] = 4082536262
		pgs[7] = 2847560160
		pgs[8] = 1955001763
		pgs[9] = 4262995164
		pgs[10] = "common/shape.wdf"
	elseif pg == "碧血干戚_巨魔王" then
		pgs[1] = 0325617872
		pgs[2] = 0325617872
		pgs[3] = 0x9c68e3fe
		pgs[4] = 1634024596
		pgs[6] = 2566297187
		pgs[7] = 1516430527
		pgs[8] = 1859893291
		pgs[9] = 1309789755
		pgs[10] = "common/shape.wdf"
	elseif pg == "裂天_巨魔王" then
		pgs[1] = 3770058550
		pgs[2] = 3770058550
		pgs[3] = 0x1401a457
		pgs[4] = 4223217027
		pgs[6] = 3564628022
		pgs[7] = 2046633309
		pgs[8] = 2119151502
		pgs[9] = 1758406529
		pgs[10] = "common/shape.wdf"
	elseif pg == "血刃_巨魔王" then
		pgs[1] = 1939335498
		pgs[2] = 1939335498
		pgs[3] = 877636726
		pgs[4] = 916167152
		pgs[6] = 867523001
		pgs[7] = 3564043256
		pgs[8] = 776791724
		pgs[9] = 1515674466
		pgs[10] = "common/shape.wdf"
	elseif pg == "屠龙_巨魔王" then
		pgs[1] = 1484416784
		pgs[2] = 1484416784
		pgs[3] = 1775621951
		pgs[4] = 1549828750
		pgs[6] = 3154364234
		pgs[7] = 993921470
		pgs[8] = 2220195117
		pgs[9] = 2747950696
		pgs[10] = "common/shape.wdf"
	elseif pg == "斩妖泣血_巨魔王" then
		pgs[1] = 1896056556
		pgs[2] = 1896056556
		pgs[3] = 399651097
		pgs[4] = 335656095
		pgs[6] = 4247090300
		pgs[7] = 3557597697
		pgs[8] = 131374191
		pgs[9] = 3408927878
		pgs[10] = "common/shape.wdf"
	elseif pg == "业火三灾_巨魔王" then
		pgs[1] = 4258129878
		pgs[2] = 4258129878
		pgs[3] = 3927074237
		pgs[4] = 0727738647
		pgs[6] = 0460666887
		pgs[7] = 3086041675
		pgs[8] = 0213811481
		pgs[9] = 2227980701
		pgs[10] = "common/shape.wdf"
	elseif pg == "鸣鸿_巨魔王" then
		pgs[1] = 2725911621
		pgs[2] = 2725911621
		pgs[3] = 1064946168
		pgs[4] = 0641529870
		pgs[6] = 1154664012
		pgs[7] = 2387777949
		pgs[8] = 0310225545
		pgs[9] = 2338581088
		pgs[10] = "common/shape.wdf"
	elseif pg == "肃魂_巨魔王" then
		pgs[1] = 3727576188
		pgs[2] = 3727576188
		pgs[3] = 0xca673c26
		pgs[4] = 4127273897
		pgs[6] = 1400005662
		pgs[7] = 3888898365
		pgs[8] = 2920150876
		pgs[9] = 696981765
		pgs[10] = "common/shape.wdf"
	elseif pg == "破魄_巨魔王" then
		pgs[1] = 319488423
		pgs[2] = 319488423
		pgs[3] = 0x64d25284
		pgs[4] = 3984718092
		pgs[6] = 3043299876
		pgs[7] = 2152441077
		pgs[8] = 4105273607
		pgs[9] = 1812185996
		pgs[10] = "common/shape.wdf"
	elseif pg == "五丁开山_巨魔王" then
		pgs[1] = 2764988110
		pgs[2] = 2764988110
		pgs[3] = 0xb49adb36
		pgs[4] = 1647167110
		pgs[6] = 3579833021
		pgs[7] = 1948978116
		pgs[8] = 1824676110
		pgs[9] = 1166051005
		pgs[10] = "common/shape.wdf"
	elseif pg == "无敌_巨魔王" then
		pgs[1] = 1778946713
		pgs[2] = 1778946713
		pgs[3] = 0x9fb8ebfe
		pgs[4] = 1841084145
		pgs[6] = 2152432898
		pgs[7] = 2969721676
		pgs[8] = 1229188957
		pgs[9] = 788779469
		pgs[10] = "common/shape.wdf"
	elseif pg == "偃月青龙_巨魔王" then
		pgs[1] = 4010127360
		pgs[2] = 4010127360
		pgs[3] = 1888302904
		pgs[4] = 1208038344
		pgs[6] = 1840793383
		pgs[7] = 1348825008
		pgs[8] = 868863512
		pgs[9] = 514498611
		pgs[10] = "common/shape.wdf"
	elseif pg == "冷月_巨魔王" then
		pgs[1] = 432866760
		pgs[2] = 432866760
		pgs[3] = 1400294209
		pgs[4] = 2104157931
		pgs[6] = 1649287571
		pgs[7] = 3373155289
		pgs[8] = 3573839422
		pgs[9] = 914206326
		pgs[10] = "common/shape.wdf"
	elseif pg == "铁爪_骨精灵" then
		pgs[1] = 3158218287
		pgs[2] = 3158218287
		pgs[3] = 4058918673
		pgs[4] = 619798639
		pgs[6] = 4166133046
		pgs[7] = 2469680581
		pgs[8] = 1948730791
		pgs[9] = 2320459601
		pgs[10] = "common/shape.wdf"
	elseif pg == "点金棒_骨精灵" then
		pgs[1] = 3310814476
		pgs[2] = 3310814476
		pgs[3] = 3103212281
		pgs[4] = 3301564224
		pgs[6] = 1122132964
		pgs[7] = 3107411095
		pgs[8] = 155295757
		pgs[9] = 1580683403
		pgs[10] = "common/shape.wdf"
	elseif pg == "细木棒_骨精灵" then
		pgs[1] = 572946160
		pgs[2] = 572946160
		pgs[3] = 869013113
		pgs[4] = 430229213
		pgs[6] = 0x8fe3bea0
		pgs[7] = 87009475
		pgs[8] = 3532585728
		pgs[9] = 1194431645
		pgs[10] = "common/shape.wdf"
	elseif pg == "青龙牙_骨精灵" then
		pgs[1] = 3799914888
		pgs[2] = 3799914888
		pgs[3] = 1849406648
		pgs[4] = 623293418
		pgs[6] = 4122645564
		pgs[7] = 674755217
		pgs[8] = 1075420620
		pgs[9] = 3643822727
		pgs[10] = "common/shape.wdf"
	elseif pg == "青刚刺_骨精灵" then
		pgs[1] = 3075032207
		pgs[2] = 3075032207
		pgs[3] = 4256318239
		pgs[4] = 0xcd5c1687
		pgs[6] = 1414239405
		pgs[7] = 1414239405
		pgs[8] = 2053717070
		pgs[9] = 2785457115
		pgs[10] = "common/shape.wdf"
	elseif pg == "满天星_骨精灵" then
		pgs[1] = 3437083756
		pgs[2] = 3437083756
		pgs[3] = 2306843235
		pgs[4] = 1714484126
		pgs[6] = 373133398
		pgs[7] = 3805394703
		pgs[8] = 1606121584
		pgs[9] = 1531375263
		pgs[10] = "common/shape.wdf"
	elseif pg == "雪蚕之刺_骨精灵" then
		pgs[1] = 463147476
		pgs[2] = 463147476
		pgs[3] = 156477563
		pgs[4] = 2554614685
		pgs[6] = 1016195647
		pgs[7] = 1685978750
		pgs[8] = 882510520
		pgs[9] = 3100053953
		pgs[10] = "common/shape.wdf"
	elseif pg == "撕天_骨精灵" then
		pgs[1] = 1763722445
		pgs[2] = 1763722445
		pgs[3] = 933726342
		pgs[4] = 974601076
		pgs[6] = 311571350
		pgs[7] = 482224323
		pgs[8] = 1316921786
		pgs[9] = 3581381656
		pgs[10] = "common/shape.wdf"
	elseif pg == "红莲_骨精灵" then
		pgs[1] = 3424827150
		pgs[2] = 3424827150
		pgs[3] = 934671466
		pgs[4] = 1076423299
		pgs[6] = 3574472708
		pgs[7] = 2280284843
		pgs[8] = 506056336
		pgs[9] = 2313738142
		pgs[10] = "common/shape.wdf"
	elseif pg == "墨玉骷髅_骨精灵" then
		pgs[1] = 577830528
		pgs[2] = 577830528
		pgs[3] = 3266821735
		pgs[4] = 1068099312
		pgs[6] = 4070992100
		pgs[7] = 977905309
		pgs[8] = 2508349179
		pgs[9] = 100402035
		pgs[10] = "common/shape.wdf"
	elseif pg == "丝萝乔木_骨精灵" then
		pgs[1] = 0901353063
		pgs[2] = 0901353063
		pgs[3] = 2063487357
		pgs[4] = 0147143279
		pgs[6] = 2653363272
		pgs[7] = 1155369624
		pgs[8] = 1510947809
		pgs[9] = 3973054279
		pgs[10] = "common/shape.wdf"
	elseif pg == "醍醐_骨精灵" then
		pgs[1] = 1250633387
		pgs[2] = 1250633387
		pgs[3] = 2381723311
		pgs[4] = 1282610978
		pgs[6] = 0138367003
		pgs[7] = 1160534304
		pgs[8] = 3907592293
		pgs[9] = 0808638054
		pgs[10] = "common/shape.wdf"
	elseif pg == "九阴勾魂_骨精灵" then
		pgs[1] = 1703807983
		pgs[2] = 1703807983
		pgs[3] = 1108591457
		pgs[4] = 2771732364
		pgs[6] = 489022779
		pgs[7] = 3267946192
		pgs[8] = 3766522110
		pgs[9] = 2175760076
		pgs[10] = "common/shape.wdf"
	elseif pg == "青藤玉树_骨精灵" then
		pgs[1] = 3707129187
		pgs[2] = 3707129187
		pgs[3] = 260368700
		pgs[4] = 1260458106
		pgs[6] = 2796632770
		pgs[7] = 1119703569
		pgs[8] = 229416981
		pgs[9] = 2366517522
		pgs[10] = "common/shape.wdf"
	elseif pg == "贵霜之牙_骨精灵" then
		pgs[1] = 13151833
		pgs[2] = 13151833
		pgs[3] = 3119070731
		pgs[4] = 2925176370
		pgs[6] = 799282094
		pgs[7] = 602955150
		pgs[8] = 2619296391
		pgs[9] = 1165096955
		pgs[10] = "common/shape.wdf"
	elseif pg == "忘川三途_骨精灵" then
		pgs[1] = 1057196119
		pgs[2] = 1057196119
		pgs[3] = 3284493434
		pgs[4] = 3066925446
		pgs[6] = 0859112470
		pgs[7] = 2663913050
		pgs[8] = 1551227703
		pgs[9] = 2945401960
		pgs[10] = "common/shape.wdf"
	elseif pg == "离钩_骨精灵" then
		pgs[1] = 4162960663
		pgs[2] = 4162960663
		pgs[3] = 0433475784
		pgs[4] = 2169364374
		pgs[6] = 0158171847
		pgs[7] = 2484616195
		pgs[8] = 1699445520
		pgs[9] = 2751461351
		pgs[10] = "common/shape.wdf"
	elseif pg == "盘龙_骨精灵" then
		pgs[1] = 399188318
		pgs[2] = 399188318
		pgs[3] = 3336570526
		pgs[4] = 2823302607
		pgs[6] = 4143522053
		pgs[7] = 4066814475
		pgs[8] = 2053873433
		pgs[9] = 4254444118
		pgs[10] = "common/shape.wdf"
	elseif pg == "胭脂_骨精灵" then
		pgs[1] = 4115672778
		pgs[2] = 4115672778
		pgs[3] = 2352019632
		pgs[4] = 1274576130
		pgs[6] = 970419487
		pgs[7] = 2008951769
		pgs[8] = 275870055
		pgs[9] = 2737514270
		pgs[10] = "common/shape.wdf"
	elseif pg == "沧海_骨精灵" then
		pgs[1] = 3063376651
		pgs[2] = 3063376651
		pgs[3] = 2245942073
		pgs[4] = 3879413923
		pgs[6] = 3414421168
		pgs[7] = 4221563191
		pgs[8] = 3538250889
		pgs[9] = 3779942817
		pgs[10] = "common/shape.wdf"
	elseif pg == "降魔玉杵_骨精灵" then
		pgs[1] = 3334934404
		pgs[2] = 3334934404
		pgs[3] = 3854049791
		pgs[4] = 1672795955
		pgs[6] = 2227811489
		pgs[7] = 2499485952
		pgs[8] = 265141570
		pgs[9] = 1457344498
		pgs[10] = "common/shape.wdf"
	elseif pg == "毒牙_骨精灵" then
		pgs[1] = 991315240
		pgs[2] = 991315240
		pgs[3] = 1625283763
		pgs[4] = 2524067340
		pgs[6] = 1149167732
		pgs[7] = 1113746352
		pgs[8] = 590367663
		pgs[9] = 288632015
		pgs[10] = "common/shape.wdf"
	elseif pg == "钢结鞭_狐美人" then
		pgs[1] = 2383050056
		pgs[2] = 2383050056
		pgs[3] = 3281460149
		pgs[4] = 3516998304
		pgs[6] = 246739877
		pgs[7] = 3039794984
		pgs[8] = 875610474
		pgs[9] = 3210281280
		pgs[10] = "common/shape.wdf"
	elseif pg == "青藤柳叶鞭_狐美人" then
		pgs[1] = 1451526591
		pgs[2] = 1451526591
		pgs[3] = 672510267
		pgs[4] = 2873780575
		pgs[6] = 2492119629
		pgs[7] = 599092463
		pgs[8] = 3419036208
		pgs[9] = 2641306317
		pgs[10] = "common/shape.wdf"
	elseif pg == "青刚刺_狐美人" then
		pgs[1] = 181873383
		pgs[2] = 181873383
		pgs[3] = 0xf1c3eb05
		pgs[4] = 429992710
		pgs[6] = 1822050644
		pgs[7] = 366643004
		pgs[8] = 2389652378
		pgs[9] = 2180063945
		pgs[10] = "common/shape.wdf"
	elseif pg == "牛皮鞭_狐美人" then
		pgs[1] = 803587567
		pgs[2] = 803587567
		pgs[3] = 2928593272
		pgs[4] = 0x1d194be4
		pgs[6] = 3201126946
		pgs[7] = 3347553641
		pgs[8] = 435101418
		pgs[9] = 0x1169732b
		pgs[10] = "common/shape.wdf"
	elseif pg == "青龙牙_狐美人" then
		pgs[1] = 3328063850
		pgs[2] = 3328063850
		pgs[3] = 0x2e7bec5d
		pgs[4] = 1207144244
		pgs[6] = 620017539
		pgs[7] = 1100137434
		pgs[8] = 957732521
		pgs[9] = 702824336
		pgs[10] = "common/shape.wdf"
	elseif pg == "铁爪_狐美人" then
		pgs[1] = 1341071015
		pgs[2] = 1341071015
		pgs[3] = 0x8554ba42
		pgs[4] = 2453642175
		pgs[6] = 1760107365
		pgs[7] = 4127315635
		pgs[8] = 2476805398
		pgs[9] = 2928915082
		pgs[10] = "common/shape.wdf"
	elseif pg == "胭脂_狐美人" then
		pgs[1] = 435255964
		pgs[2] = 435255964
		pgs[3] = 0x3017b6e1
		pgs[4] = 3864765510
		pgs[6] = 505158205
		pgs[7] = 1747354624
		pgs[8] = 1199574166
		pgs[9] = 954931940
		pgs[10] = "common/shape.wdf"
	elseif pg == "贵霜之牙_狐美人" then
		pgs[1] = 2026448705
		pgs[2] = 2026448705
		pgs[3] = 0xf63172d0
		pgs[4] = 3203975285
		pgs[6] = 1564840489
		pgs[7] = 474679658
		pgs[8] = 4058539230
		pgs[9] = 926627376
		pgs[10] = "common/shape.wdf"
	elseif pg == "忘川三途_狐美人" then
		pgs[1] = 0236232349
		pgs[2] = 0236232349
		pgs[3] = 0xc4da3341
		pgs[4] = 1037429893
		pgs[6] = 2989801805
		pgs[7] = 1339124563
		pgs[8] = 3926929253
		pgs[9] = 3874185526
		pgs[10] = "common/shape.wdf"
	elseif pg == "离钩_狐美人" then
		pgs[1] = 0564401744
		pgs[2] = 0564401744
		pgs[3] = 0xd40ee4a7
		pgs[4] = 2021299893
		pgs[6] = 3148444658
		pgs[7] = 3954561085
		pgs[8] = 4230441971
		pgs[9] = 1335188315
		pgs[10] = "common/shape.wdf"
	elseif pg == "百花_狐美人" then
		pgs[1] = 1502748093
		pgs[2] = 1502748093
		pgs[3] = 2250675787
		pgs[4] = 2755073465
		pgs[6] = 1990532858
		pgs[7] = 1787167953
		pgs[8] = 3161043606
		pgs[9] = 546759080
		pgs[10] = "common/shape.wdf"
	elseif pg == "仙人指路_狐美人" then
		pgs[1] = 1169841436
		pgs[2] = 1169841436
		pgs[3] = 851455711
		pgs[4] = 1792787137
		pgs[6] = 1034828303
		pgs[7] = 4038631411
		pgs[8] = 1358665134
		pgs[9] = 657246130
		pgs[10] = "common/shape.wdf"
	elseif pg == "九阴勾魂_狐美人" then
		pgs[1] = 34055457
		pgs[2] = 34055457
		pgs[3] = 0x9eb6b04
		pgs[4] = 2594225835
		pgs[6] = 1606837702
		pgs[7] = 4229873282
		pgs[8] = 14066732
		pgs[9] = 3187095867
		pgs[10] = "common/shape.wdf"
	elseif pg == "雪蚕之刺_狐美人" then
		pgs[1] = 3375230005
		pgs[2] = 3375230005
		pgs[3] = 0x535e76d0
		pgs[4] = 4186182464
		pgs[6] = 4168563223
		pgs[7] = 3779159654
		pgs[8] = 1556439270
		pgs[9] = 3143637419
		pgs[10] = "common/shape.wdf"
	elseif pg == "毒牙_狐美人" then
		pgs[1] = 2678046311
		pgs[2] = 2678046311
		pgs[3] = 0x6338b65
		pgs[4] = 1046153681
		pgs[6] = 3025877259
		pgs[7] = 4196456021
		pgs[8] = 2797725717
		pgs[9] = 648763427
		pgs[10] = "common/shape.wdf"
	elseif pg == "游龙惊鸿_狐美人" then
		pgs[1] = 1677496371
		pgs[2] = 1677496371
		pgs[3] = 1419416100
		pgs[4] = 1427572959
		pgs[6] = 3911390728
		pgs[7] = 4269124018
		pgs[8] = 1118732647
		pgs[9] = 1632285264
		pgs[10] = "common/shape.wdf"
	elseif pg == "血之刺藤_狐美人" then
		pgs[1] = 4050126740
		pgs[2] = 4050126740
		pgs[3] = 3429497989
		pgs[4] = 2489520435
		pgs[6] = 2605547995
		pgs[7] = 888707380
		pgs[8] = 1942318093
		pgs[9] = 3544559629
		pgs[10] = "common/shape.wdf"
	elseif pg == "牧云清歌_狐美人" then
		pgs[1] = 1719727329
		pgs[2] = 1719727329
		pgs[3] = 0210056156
		pgs[4] = 4235354976
		pgs[6] = 3324406676
		pgs[7] = 4002747821
		pgs[8] = 2497747470
		pgs[9] = 0747942707
		pgs[10] = "common/shape.wdf"
	elseif pg == "霜陨_狐美人" then
		pgs[1] = 1258580513
		pgs[2] = 1258580513
		pgs[3] = 1285805382
		pgs[4] = 3557049784
		pgs[6] = 0373506230
		pgs[7] = 1376923560
		pgs[8] = 4168352366
		pgs[9] = 1324744500
		pgs[10] = "common/shape.wdf"
	elseif pg == "龙筋_狐美人" then
		pgs[1] = 3760276395
		pgs[2] = 3760276395
		pgs[3] = 53105381
		pgs[4] = 3304310422
		pgs[6] = 1123548549
		pgs[7] = 478714521
		pgs[8] = 3148732170
		pgs[9] = 61804478
		pgs[10] = "common/shape.wdf"
	elseif pg == "吹雪_狐美人" then
		pgs[1] = 2782365575
		pgs[2] = 2782365575
		pgs[3] = 2863024953
		pgs[4] = 2075646427
		pgs[6] = 1793299889
		pgs[7] = 3492647849
		pgs[8] = 4255111126
		pgs[9] = 3079814036
		pgs[10] = "common/shape.wdf"
	elseif pg == "撕天_狐美人" then
		pgs[1] = 3142217049
		pgs[2] = 3142217049
		pgs[3] = 0xf32ce8b9
		pgs[4] = 3204327512
		pgs[6] = 2232734491
		pgs[7] = 2803578940
		pgs[8] = 1204989569
		pgs[9] = 3697845403
		pgs[10] = "common/shape.wdf"
	elseif pg == "玄铁矛_神天兵" then
		pgs[1] = 457024889
		pgs[2] = 457024889
		pgs[3] = 0x3261f
		pgs[4] = 970913679
		pgs[6] = 3111818852
		pgs[7] = 1880364342
		pgs[8] = 883798385
		pgs[9] = 2466450533
		pgs[10] = "common/shape.wdf"
	elseif pg == "八卦_神天兵" then
		pgs[1] = 0x94265799
		pgs[2] = 0x14046CB9
		pgs[3] = 0x35A8F0B2
		pgs[4] = 0xF721C3A5
		pgs[5] = 0xCAEC2F8A
		pgs[6] = 0x82407177
		pgs[7] = 0x14046CB9
		pgs[8] = 0x793550FC
		pgs[9] = 0x66D1B6C4
		pgs[10] = "common/shape.wdf"
	elseif pg == "乌金三叉戟_神天兵" then
		pgs[1] = 408164304
		pgs[2] = 408164304
		pgs[3] = 0xdd1ca29d
		pgs[4] = 2362411253
		pgs[6] = 2944638184
		pgs[7] = 611952719
		pgs[8] = 907746138
		pgs[9] = 1478073855
		pgs[10] = "common/shape.wdf"
	elseif pg == "狼牙锤_神天兵" then
		pgs[1] = 103920893
		pgs[2] = 103920893
		pgs[3] = 3337098745
		pgs[4] = 1754275390
		pgs[6] = 1598161855
		pgs[7] = 4165662626
		pgs[8] = 3269185703
		pgs[9] = 685627288
		pgs[10] = "common/shape.wdf"
	elseif pg == "松木锤_神天兵" then
		pgs[1] = 4014115127
		pgs[2] = 4014115127
		pgs[3] = 433361276
		pgs[4] = 2686623681
		pgs[6] = 316202605
		pgs[7] = 776522968
		pgs[8] = 400987167
		pgs[9] = 3257370843
		pgs[10] = "common/shape.wdf"
	elseif pg == "红缨枪_神天兵" then
		pgs[1] = 3072500196
		pgs[2] = 3072500196
		pgs[3] = 0x8c0a81b3
		pgs[4] = 522874091
		pgs[6] = 72270422
		pgs[7] = 2966336322
		pgs[8] = 117062963
		pgs[9] = 3637390492
		pgs[10] = "common/shape.wdf"
	elseif pg == "震天锤_神天兵" then
		pgs[1] = 3035485426
		pgs[2] = 3035485426
		pgs[3] = 1437571424
		pgs[4] = 3129123356
		pgs[6] = 3250445538
		pgs[7] = 4112972849
		pgs[8] = 4145837202
		pgs[9] = 0x27885331
		pgs[10] = "common/shape.wdf"
	elseif pg == "飞龙在天_神天兵" then
		pgs[1] = 2032927311
		pgs[2] = 2032927311
		pgs[3] = 0x80bdb343
		pgs[4] = 3978455792
		pgs[6] = 1874013939
		pgs[7] = 3740325538
		pgs[8] = 2181635146
		pgs[9] = 599728780
		pgs[10] = "common/shape.wdf"
	elseif pg == "天龙破城_神天兵" then
		pgs[1] = 0171966452
		pgs[2] = 0171966452
		pgs[3] = 0x39cefa42
		pgs[4] = 2107979991
		pgs[6] = 1581914867
		pgs[7] = 2942548432
		pgs[8] = 1411813089
		pgs[9] = 1849607449
		pgs[10] = "common/shape.wdf"
	elseif pg == "弑皇_神天兵" then
		pgs[1] = 1997962163
		pgs[2] = 1997962163
		pgs[3] = 0xb9b8f39e
		pgs[4] = 1627526221
		pgs[6] = 0244362789
		pgs[7] = 0451837867
		pgs[8] = 3255465889
		pgs[9] = 1104681624
		pgs[10] = "common/shape.wdf"
	elseif pg == "鬼王蚀日_神天兵" then
		pgs[1] = 963362133
		pgs[2] = 963362133
		pgs[3] = 152105194
		pgs[4] = 3867741716
		pgs[6] = 1752393650
		pgs[7] = 278748353
		pgs[8] = 1749943111
		pgs[9] = 0xB1EC4BAE
		pgs[10] = "common/shape.wdf"
	elseif pg == "狂澜碎岳_神天兵" then
		pgs[1] = 2235903565
		pgs[2] = 2235903565
		pgs[3] = 2603636370
		pgs[4] = 0xfc8556ff
		pgs[6] = 2176071785
		pgs[7] = 4182805395
		pgs[8] = 0485622618
		pgs[9] = 0725700904
		pgs[10] = "common/shape.wdf"
	elseif pg == "碎寂_神天兵" then
		pgs[1] = 3625830153
		pgs[2] = 3625830153
		pgs[3] = 3568054291
		pgs[4] = 2897242392
		pgs[6] = 2339108953
		pgs[7] = 0520986973
		pgs[8] = 3030332360
		pgs[9] = 1269074276
		pgs[10] = "common/shape.wdf"
	elseif pg == "暗夜_神天兵" then
		pgs[1] = 1082922820
		pgs[2] = 1082922820
		pgs[3] = 0x935502d2
		pgs[4] = 3895199857
		pgs[6] = 1619820242
		pgs[7] = 3383885620
		pgs[8] = 336694600
		pgs[9] = 932923894
		pgs[10] = "common/shape.wdf"
	elseif pg == "梨花_神天兵" then
		pgs[1] = 1046350880
		pgs[2] = 1046350880
		pgs[3] = 0x5788173c
		pgs[4] = 2634626428
		pgs[6] = 3303390888
		pgs[7] = 1240292677
		pgs[8] = 3708021512
		pgs[9] = 1872876301
		pgs[10] = "common/shape.wdf"
	elseif pg == "五虎断魂_神天兵" then
		pgs[1] = 2816878895
		pgs[2] = 2816878895
		pgs[3] = 0x695191d6
		pgs[4] = 298941115
		pgs[6] = 555909501
		pgs[7] = 683330927
		pgs[8] = 2195670772
		pgs[9] = 223295368
		pgs[10] = "common/shape.wdf"
	elseif pg == "鬼牙_神天兵" then
		pgs[1] = 2430761776
		pgs[2] = 2430761776
		pgs[3] = 3359352706
		pgs[4] = 2621027170
		pgs[6] = 1110189315
		pgs[7] = 2486917341
		pgs[8] = 2741674073
		pgs[9] = 2681319409
		pgs[10] = "common/shape.wdf"
	elseif pg == "霹雳_神天兵" then
		pgs[1] = 1051053489
		pgs[2] = 1051053489
		pgs[3] = 0x4229e403
		pgs[4] = 2085918398
		pgs[6] = 3349289903
		pgs[7] = 3508045990
		pgs[8] = 143015740
		pgs[9] = 2889808459
		pgs[10] = "common/shape.wdf"
	elseif pg == "雷神_神天兵" then
		pgs[1] = 148474283
		pgs[2] = 148474283
		pgs[3] = 2398394513
		pgs[4] = 2945190989
		pgs[6] = 3920362664
		pgs[7] = 3086874992
		pgs[8] = 2993116090
		pgs[9] = 2515289535
		pgs[10] = "common/shape.wdf"
	elseif pg == "混元金锤_神天兵" then
		pgs[1] = 1923208867
		pgs[2] = 1923208867
		pgs[3] = 3952062894
		pgs[4] = 1295504995
		pgs[6] = 577114027
		pgs[7] = 1445398766
		pgs[8] = 3171781597
		pgs[9] = 1835217455
		pgs[10] = "common/shape.wdf"
	elseif pg == "刑天之逆_神天兵" then
		pgs[1] = 4050435392
		pgs[2] = 4050435392
		pgs[3] = 0x26056ca0
		pgs[4] = 1688528240
		pgs[6] = 2425493529
		pgs[7] = 1710005881
		pgs[8] = 507405361
		pgs[9] = 167694840
		pgs[10] = "common/shape.wdf"
	elseif pg == "九瓣莲花_神天兵" then
		pgs[1] = 697482824
		pgs[2] = 697482824
		pgs[3] = 1082828846
		pgs[4] = 1141897393
		pgs[6] = 3748355701
		pgs[7] = 616355012
		pgs[8] = 2187902545
		pgs[9] = 927580732
		pgs[10] = "common/shape.wdf"
	elseif pg == "折扇_龙太子" then
		pgs[1] = 1892693347
		pgs[2] = 1892693347
		pgs[3] = 0x779cd74
		pgs[4] = 1204995981
		pgs[6] = 1362359639
		pgs[7] = 2228831626
		pgs[8] = 4142026495
		pgs[9] = 80506382
		pgs[10] = "common/shape.wdf"
	elseif pg == "铁面扇_龙太子" then
		pgs[1] = 0xe1c39fa4
		pgs[2] = 0xe1c39fa4
		pgs[3] = 0xba525a8f
		pgs[4] = 0xf1b65eef
		pgs[6] = 0x425bd517
		pgs[7] = 0x7b8b943
		pgs[8] = 0x322cf1fd
		pgs[9] = 0xcdd1b9f5
		pgs[10] = "common/shape.wdf"
	elseif pg == "神火扇_龙太子" then
		pgs[1] = 1818358093
		pgs[2] = 1818358093
		pgs[3] = 0x257fdf2a
		pgs[4] = 1584219148
		pgs[6] = 3409145103
		pgs[7] = 666236837
		pgs[8] = 207256533
		pgs[9] = 1171511807
		pgs[10] = "common/shape.wdf"
	elseif pg == "玄铁矛_龙太子" then
		pgs[1] = 650631390
		pgs[2] = 650631390
		pgs[3] = 1332270280
		pgs[4] = 1220141886
		pgs[6] = 407764697
		pgs[7] = 477458607
		pgs[8] = 2300479837
		pgs[9] = 663869830
		pgs[10] = "common/shape.wdf"
	elseif pg == "红缨枪_龙太子" then
		pgs[1] = 4208641994
		pgs[2] = 4208641994
		pgs[3] = 3367459571
		pgs[4] = 4155725796
		pgs[6] = 170841557
		pgs[7] = 2694226760
		pgs[8] = 1825813896
		pgs[9] = 1217969354
		pgs[10] = "common/shape.wdf"
	elseif pg == "乌金三叉戟_龙太子" then
		pgs[1] = 2664793060
		pgs[2] = 2664793060
		pgs[3] = 1779222969
		pgs[4] = 1212846725
		pgs[6] = 3544733296
		pgs[7] = 2097787361
		pgs[8] = 50056701
		pgs[9] = 2573475492
		pgs[10] = "common/shape.wdf"
	elseif pg == "暗夜_龙太子" then
		pgs[1] = 741288949
		pgs[2] = 741288949
		pgs[3] = 1972123841
		pgs[4] = 2182082171
		pgs[6] = 4066915831
		pgs[7] = 1492298468
		pgs[8] = 0402972999
		pgs[9] = 1751076384
		pgs[10] = "common/shape.wdf"
	elseif pg == "秋水人家_龙太子" then
		pgs[1] = 3391613661
		pgs[2] = 3391613661
		pgs[3] = 0x55dec235
		pgs[4] = 2120876772
		pgs[6] = 2647082872
		pgs[7] = 1201013296
		pgs[8] = 0x9A1E802B
		pgs[9] = 817870297
		pgs[10] = "common/shape.wdf"
	elseif pg == "刑天之逆_龙太子" then
		pgs[1] = 1200609263
		pgs[2] = 1200609263
		pgs[3] = 2005252098
		pgs[4] = 3509150743
		pgs[6] = 3445110785
		pgs[7] = 951231487
		pgs[8] = 0x898AF13F
		pgs[9] = 4062233204
		pgs[10] = "common/shape.wdf"
	elseif pg == "霹雳_龙太子" then
		pgs[1] = 278992607
		pgs[2] = 278992607
		pgs[3] = 1512127783
		pgs[4] = 3642679990
		pgs[6] = 1313071015
		pgs[7] = 3971560979
		pgs[8] = 0882577208
		pgs[9] = 4060439247
		pgs[10] = "common/shape.wdf"
	elseif pg == "画龙点睛_龙太子" then
		pgs[1] = 479654062
		pgs[2] = 479654062
		pgs[3] = 0xb9c4539
		pgs[4] = 2828288868
		pgs[6] = 2229841293
		pgs[7] = 235465927
		pgs[8] = 0x7691CE27
		pgs[9] = 1018236421
		pgs[10] = "common/shape.wdf"
	elseif pg == "五虎断魂_龙太子" then
		pgs[1] = 1272648373
		pgs[2] = 1272648373
		pgs[3] = 1067074679
		pgs[4] = 1592032597
		pgs[6] = 2132267301
		pgs[7] = 4089962192
		pgs[8] = 0xc2e1216a
		pgs[9] = 2635610460
		pgs[10] = "common/shape.wdf"
	elseif pg == "逍遥江湖_龙太子" then
		pgs[1] = 346935725
		pgs[2] = 346935725
		pgs[3] = 0x8c0689d3
		pgs[4] = 4293635787
		pgs[6] = 4152040342
		pgs[7] = 3271976691
		pgs[8] = 0x46AB4BEC
		pgs[9] = 2687029336
		pgs[10] = "common/shape.wdf"
	elseif pg == "玉龙_龙太子" then
		pgs[1] = 2333774279
		pgs[2] = 2333774279
		pgs[3] = 0x85307da5
		pgs[4] = 444659320
		pgs[6] = 629954791
		pgs[7] = 263378940
		pgs[8] = 0xE819C83D
		pgs[9] = 862461187
		pgs[10] = "common/shape.wdf"
	elseif pg == "浩气长舒_龙太子" then
		pgs[1] = 0x2CA2202A
		pgs[2] = 0x2CA2202A
		pgs[3] = 0x8d249d24
		pgs[4] = 0x322040E
		pgs[6] = 0xEBBBD6A
		pgs[7] = 0xAF198759
		pgs[8] = 0x804E4F85
		pgs[9] = 0x8D6EBCD
		pgs[10] = "common/shape.wdf"
	elseif pg == "星瀚_龙太子" then
		pgs[1] = 0xF67E30AD
		pgs[2] = 0xF67E30AD
		pgs[3] = 0xe41424f5
		pgs[4] = 0xA7FAAB06
		pgs[6] = 0x67BC1005
		pgs[7] = 0x9FE029BF
		pgs[8] = 0xC7E0CEC1
		pgs[9] = 0xBF00ABF2
		pgs[10] = "common/shape.wdf"
	elseif pg == "梨花_龙太子" then
		pgs[1] = 3747222349
		pgs[2] = 3747222349
		pgs[3] = 3189155092
		pgs[4] = 3062365732
		pgs[6] = 1598243358
		pgs[7] = 2389430522
		pgs[8] = 0563824081
		pgs[9] = 1648372626
		pgs[10] = "common/shape.wdf"
	elseif pg == "飞龙在天_龙太子" then
		pgs[1] = 0x49187E40
		pgs[2] = 0x49187E40
		pgs[3] = 0xA87E49E8
		pgs[4] = 0x41E835B5
		pgs[6] = 0x28FCF221
		pgs[7] = 0x367AC070
		pgs[8] = 0x0A73B2E0
		pgs[9] = 0x4E9D13AE
		pgs[10] = "common/shape.wdf"
	elseif pg == "天龙破城_龙太子" then
		pgs[1] = 0666227171
		pgs[2] = 0666227171
		pgs[3] = 3545294647
		pgs[4] = 1075279479
		pgs[6] = 4013753607
		pgs[7] = 1440842173
		pgs[8] = 3805099760
		pgs[9] = 1609569152
		pgs[10] = "common/shape.wdf"
	elseif pg == "弑皇_龙太子" then
		pgs[1] = 0x2F84D4CA
		pgs[2] = 0x2F84D4CA
		pgs[3] = 0x9792B519
		pgs[4] = 0xB80DD092
		pgs[6] = 0xEF721760
		pgs[7] = 0x6B780672
		pgs[8] = 1956552460
		pgs[9] = 0x28B45289
		pgs[10] = "common/shape.wdf"
	elseif pg == "秋风_龙太子" then
		pgs[1] = 775882284
		pgs[2] = 775882284
		pgs[3] = 0xb02f871d
		pgs[4] = 4103046621
		pgs[6] = 4079294468
		pgs[7] = 1774952424
		pgs[8] = 0xFB69C03A
		pgs[9] = 342475400
		pgs[10] = "common/shape.wdf"
	elseif pg == "太极_龙太子" then
		pgs[1] = 3905888692
		pgs[2] = 3905888692
		pgs[3] = 0xd7af7f94
		pgs[4] = 518907138
		pgs[6] = 121079973
		pgs[7] = 662010105
		pgs[8] = 0xA963CEE9
		pgs[9] = 269312850
		pgs[10] = "common/shape.wdf"
	elseif pg == "无极丝_玄彩娥" then
		pgs[1] = 720570501
		pgs[2] = 720570501
		pgs[3] = 0x65040b9d
		pgs[4] = 2487726993
		pgs[6] = 3513269889
		pgs[7] = 629550622
		pgs[8] = 327433169
		pgs[9] = 0x19026de7
		pgs[10] = "common/shape.wdf"
	elseif pg == "七彩罗刹_玄彩娥" then
		pgs[1] = 2097271664
		pgs[2] = 2097271664
		pgs[3] = 0xbccf18c6
		pgs[4] = 34704861
		pgs[6] = 2226391655
		pgs[7] = 4023029297
		pgs[8] = 2658422875
		pgs[9] = 1050015636
		pgs[10] = "common/shape.wdf"
	elseif pg == "满天星_玄彩娥" then
		pgs[1] = 3100078257
		pgs[2] = 3100078257
		pgs[3] = 677178981
		pgs[4] = 4188799764
		pgs[6] = 2373806356
		pgs[7] = 123928187
		pgs[8] = 2280722867
		pgs[9] = 591449018
		pgs[10] = "common/shape.wdf"
	elseif pg == "五色缎带_玄彩娥" then
		pgs[1] = 986673291
		pgs[2] = 986673291
		pgs[3] = 0xd6bcec1b
		pgs[4] = 1814531001
		pgs[6] = 2478192000
		pgs[7] = 3703252301
		pgs[8] = 3541518516
		pgs[9] = 3812334075
		pgs[10] = "common/shape.wdf"
	elseif pg == "点金棒_玄彩娥" then
		pgs[1] = 321961419
		pgs[2] = 321961419
		pgs[3] = 1825339978
		pgs[4] = 2854164977
		pgs[6] = 1309940385
		pgs[7] = 3400892076
		pgs[8] = 3042819558
		pgs[9] = 499124570
		pgs[10] = "common/shape.wdf"
	elseif pg == "细木棒_玄彩娥" then
		pgs[1] = 2705175188
		pgs[2] = 2705175188
		pgs[3] = 4202680960
		pgs[4] = 3228448399
		pgs[6] = 436522649
		pgs[7] = 2039230457
		pgs[8] = 1506278188
		pgs[9] = 375356336
		pgs[10] = "common/shape.wdf"
	elseif pg == "红莲_玄彩娥" then
		pgs[1] = 3643377339
		pgs[2] = 3643377339
		pgs[3] = 476128501
		pgs[4] = 3322875805
		pgs[6] = 1450950143
		pgs[7] = 1405056236
		pgs[8] = 477554400
		pgs[9] = 1296371001
		pgs[10] = "common/shape.wdf"
	elseif pg == "盘龙_玄彩娥" then
		pgs[1] = 3068635068
		pgs[2] = 3068635068
		pgs[3] = 959077202
		pgs[4] = 3616804633
		pgs[6] = 2106636810
		pgs[7] = 555283478
		pgs[8] = 2056912982
		pgs[9] = 2481130669
		pgs[10] = "common/shape.wdf"
	elseif pg == "沧海_玄彩娥" then
		pgs[1] = 3065680078
		pgs[2] = 3065680078
		pgs[3] = 504261236
		pgs[4] = 60075072
		pgs[6] = 3170504444
		pgs[7] = 3448269542
		pgs[8] = 1357669355
		pgs[9] = 3608953515
		pgs[10] = "common/shape.wdf"
	elseif pg == "碧波_玄彩娥" then
		pgs[1] = 970441283
		pgs[2] = 970441283
		pgs[3] = 0xd370f823
		pgs[4] = 1436245505
		pgs[6] = 3228799230
		pgs[7] = 3957482085
		pgs[8] = 1916346891
		pgs[9] = 1521611307
		pgs[10] = "common/shape.wdf"
	elseif pg == "此最相思_玄彩娥" then
		pgs[1] = 193367860
		pgs[2] = 193367860
		pgs[3] = 0xb7d84088
		pgs[4] = 2340791616
		pgs[6] = 493173921
		pgs[7] = 1169690561
		pgs[8] = 2674679688
		pgs[9] = 668529798
		pgs[10] = "common/shape.wdf"
	elseif pg == "揽月摘星_玄彩娥" then
		pgs[1] = 3957461210
		pgs[2] = 3957461210
		pgs[3] = 0x2a5b6a13
		pgs[4] = 1507018653
		pgs[6] = 2821704604
		pgs[7] = 3505463631
		pgs[8] = 2825593192
		pgs[9] = 1456089502
		pgs[10] = "common/shape.wdf"
	elseif pg == "九霄_玄彩娥" then
		pgs[1] = 1925606125
		pgs[2] = 1925606125
		pgs[3] = 0xb4a8dcd0
		pgs[4] = 3074777996
		pgs[6] = 3263307981
		pgs[7] = 1083356098
		pgs[8] = 2475418304
		pgs[9] = 2130671600
		pgs[10] = "common/shape.wdf"
	elseif pg == "降魔玉杵_玄彩娥" then
		pgs[1] = 4099217390
		pgs[2] = 4099217390
		pgs[3] = 3206381160
		pgs[4] = 2229271781
		pgs[6] = 2242027872
		pgs[7] = 775886307
		pgs[8] = 3480235058
		pgs[9] = 3182933271
		pgs[10] = "common/shape.wdf"
	elseif pg == "流云_玄彩娥" then
		pgs[1] = 2363368052
		pgs[2] = 2363368052
		pgs[3] = 0x98fd03b4
		pgs[4] = 1588271293
		pgs[6] = 688944433
		pgs[7] = 4012911086
		pgs[8] = 4199981403
		pgs[9] = 459658607
		pgs[10] = "common/shape.wdf"
	elseif pg == "彩虹_玄彩娥" then
		pgs[1] = 4010760941
		pgs[2] = 4010760941
		pgs[3] = 0x456f97ad
		pgs[4] = 444072186
		pgs[6] = 1602142769
		pgs[7] = 3326013825
		pgs[8] = 1763662402
		pgs[9] = 2222466647
		pgs[10] = "common/shape.wdf"
	elseif pg == "墨玉骷髅_玄彩娥" then
		pgs[1] = 1829371224
		pgs[2] = 1829371224
		pgs[3] = 2002019356
		pgs[4] = 2320316366
		pgs[6] = 2555196614
		pgs[7] = 335647506
		pgs[8] = 2671690470
		pgs[9] = 85118950
		pgs[10] = "common/shape.wdf"
	elseif pg == "丝萝乔木_玄彩娥" then
		pgs[1] = 1121230155
		pgs[2] = 1121230155
		pgs[3] = 0322946589
		pgs[4] = 4206785453
		pgs[6] = 2777298091
		pgs[7] = 2186653861
		pgs[8] = 1884580054
		pgs[9] = 0740212343
		pgs[10] = "common/shape.wdf"
	elseif pg == "醍醐_玄彩娥" then
		pgs[1] = 3632446855
		pgs[2] = 3632446855
		pgs[3] = 2786004275
		pgs[4] = 4043816298
		pgs[6] = 0583826926
		pgs[7] = 2781044081
		pgs[8] = 0752278480
		pgs[9] = 0053905909
		pgs[10] = "common/shape.wdf"
	elseif pg == "晃金仙绳_玄彩娥" then
		pgs[1] = 2648596978
		pgs[2] = 2648596978
		pgs[3] = 0xbd9d313d
		pgs[4] = 2708781818
		pgs[6] = 1007388957
		pgs[7] = 629130124
		pgs[8] = 99182575
		pgs[9] = 359094555
		pgs[10] = "common/shape.wdf"
	elseif pg == "青藤玉树_玄彩娥" then
		pgs[1] = 2503627450
		pgs[2] = 2503627450
		pgs[3] = 3110285636
		pgs[4] = 1992978765
		pgs[6] = 3809375891
		pgs[7] = 2547741955
		pgs[8] = 4282993605
		pgs[9] = 462404473
		pgs[10] = "common/shape.wdf"
	elseif pg == "秋水落霞_玄彩娥" then
		pgs[1] = 2834670277
		pgs[2] = 2834670277
		pgs[3] = 0x73e31106
		pgs[4] = 1773897847
		pgs[6] = 2096851051
		pgs[7] = 2528379760
		pgs[8] = 4035277094
		pgs[9] = 2619283310
		pgs[10] = "common/shape.wdf"
	elseif pg == "黄铜圈_舞天姬" then
		pgs[1] = 1246340040
		pgs[2] = 1246340040
		pgs[3] = 1695349470
		pgs[4] = 2991787754
		pgs[6] = 1524014588
		pgs[7] = 4075994022
		pgs[8] = 504842185
		pgs[9] = 1374023375
		pgs[10] = "common/shape.wdf"
	elseif pg == "无极丝_舞天姬" then
		pgs[1] = 614245463
		pgs[2] = 614245463
		pgs[3] = 0x12c0084e
		pgs[4] = 694856255
		pgs[6] = 2175791405
		pgs[7] = 448343009
		pgs[8] = 2148337924
		pgs[9] = 2923284079
		pgs[10] = "common/shape.wdf"
	elseif pg == "金刺轮_舞天姬" then
		pgs[1] = 3926831021
		pgs[2] = 3926831021
		pgs[3] = 1774309751
		pgs[4] = 2501160049
		pgs[6] = 2255887722
		pgs[7] = 173996820
		pgs[8] = 4154265461
		pgs[9] = 3161036338
		pgs[10] = "common/shape.wdf"
	elseif pg == "五色缎带_舞天姬" then
		pgs[1] = 13536912
		pgs[2] = 13536912
		pgs[3] = 0x6b5c6c40
		pgs[4] = 4096686404
		pgs[6] = 2509295261
		pgs[7] = 3306367653
		pgs[8] = 4257026415
		pgs[9] = 213886082
		pgs[10] = "common/shape.wdf"
	elseif pg == "蛇形月_舞天姬" then
		pgs[1] = 3668441645
		pgs[2] = 3668441645
		pgs[3] = 1423059990
		pgs[4] = 9780356
		pgs[6] = 2142449311
		pgs[7] = 0x98a9b5e
		pgs[8] = 4149929342
		pgs[9] = 712091462
		pgs[10] = "common/shape.wdf"
	elseif pg == "七彩罗刹_舞天姬" then
		pgs[1] = 1449553165
		pgs[2] = 1449553165
		pgs[3] = 0x17ec87e
		pgs[4] = 4157162296
		pgs[6] = 1859257571
		pgs[7] = 2698141768
		pgs[8] = 2971905394
		pgs[9] = 2020209393
		pgs[10] = "common/shape.wdf"
	elseif pg == "此最相思_舞天姬" then
		pgs[1] = 1976958564
		pgs[2] = 1976958564
		pgs[3] = 0xcff08da4
		pgs[4] = 3902626006
		pgs[6] = 1239150663
		pgs[7] = 1817978990
		pgs[8] = 3578667390
		pgs[9] = 2374794875
		pgs[10] = "common/shape.wdf"
	elseif pg == "揽月摘星_舞天姬" then
		pgs[1] = 3095847005
		pgs[2] = 3095847005
		pgs[3] = 0xcf089af3
		pgs[4] = 2694329428
		pgs[6] = 4179340991
		pgs[7] = 2099180209
		pgs[8] = 0795965688
		pgs[9] = 1691850913
		pgs[10] = "common/shape.wdf"
	elseif pg == "九霄_舞天姬" then
		pgs[1] = 1709199725
		pgs[2] = 1709199725
		pgs[3] = 0xb12efc5a
		pgs[4] = 0940501812
		pgs[6] = 1332030559
		pgs[7] = 3784736116
		pgs[8] = 1618775589
		pgs[9] = 0895130345
		pgs[10] = "common/shape.wdf"
	elseif pg == "彩虹_舞天姬" then
		pgs[1] = 3921702263
		pgs[2] = 3921702263
		pgs[3] = 0xa18d027d
		pgs[4] = 261592524
		pgs[6] = 3826935762
		pgs[7] = 1461988918
		pgs[8] = 658865406
		pgs[9] = 2510075859
		pgs[10] = "common/shape.wdf"
	elseif pg == "金玉双环_舞天姬" then
		pgs[1] = 3279495962
		pgs[2] = 3279495962
		pgs[3] = 1189482605
		pgs[4] = 2148299765
		pgs[6] = 3630009301
		pgs[7] = 3263066954
		pgs[8] = 3371000519
		pgs[9] = 2240511279
		pgs[10] = "common/shape.wdf"
	elseif pg == "月光双环_舞天姬" then
		pgs[1] = 3165243568
		pgs[2] = 3165243568
		pgs[3] = 16282348
		pgs[4] = 2288648467
		pgs[6] = 3693039080
		pgs[7] = 2693457978
		pgs[8] = 3984861090
		pgs[9] = 1429132352
		pgs[10] = "common/shape.wdf"
	elseif pg == "碧波_舞天姬" then
		pgs[1] = 1034789143
		pgs[2] = 1034789143
		pgs[3] = 0x116df6c7
		pgs[4] = 2355929470
		pgs[6] = 2655943207
		pgs[7] = 2855246102
		pgs[8] = 241555200
		pgs[9] = 1141838919
		pgs[10] = "common/shape.wdf"
	elseif pg == "流云_舞天姬" then
		pgs[1] = 4195857049
		pgs[2] = 4195857049
		pgs[3] = 0x6903fd70
		pgs[4] = 972420940
		pgs[6] = 198547491
		pgs[7] = 2802292186
		pgs[8] = 3885561582
		pgs[9] = 1837939421
		pgs[10] = "common/shape.wdf"
	elseif pg == "如意_舞天姬" then
		pgs[1] = 3267454880
		pgs[2] = 3267454880
		pgs[3] = 1911031086
		pgs[4] = 2351280146
		pgs[6] = 850292701
		pgs[7] = 500162329
		pgs[8] = 1166644566
		pgs[9] = 197968673
		pgs[10] = "common/shape.wdf"
	elseif pg == "晃金仙绳_舞天姬" then
		pgs[1] = 480998208
		pgs[2] = 480998208
		pgs[3] = 0x42063dca
		pgs[4] = 1983509384
		pgs[6] = 2029228117
		pgs[7] = 1363856210
		pgs[8] = 66546999
		pgs[9] = 4226984468
		pgs[10] = "common/shape.wdf"
	elseif pg == "别情离恨_舞天姬" then
		pgs[1] = 799504916
		pgs[2] = 799504916
		pgs[3] = 842553389
		pgs[4] = 1982103646
		pgs[6] = 2210222918
		pgs[7] = 1858157676
		pgs[8] = 1117799210
		pgs[9] = 3296383020
		pgs[10] = "common/shape.wdf"
	elseif pg == "九天金线_舞天姬" then
		pgs[1] = 1669961605
		pgs[2] = 1669961605
		pgs[3] = 280626373
		pgs[4] = 2737030257
		pgs[6] = 1711064047
		pgs[7] = 2155201472
		pgs[8] = 2934052938
		pgs[9] = 2722500657
		pgs[10] = "common/shape.wdf"
	elseif pg == "无关风月_舞天姬" then
		pgs[1] = 3653729862
		pgs[2] = 3653729862
		pgs[3] = 2118476708
		pgs[4] = 1290614140
		pgs[6] = 2011121195
		pgs[7] = 3035499198
		pgs[8] = 3842984317
		pgs[9] = 1519396140
		pgs[10] = "common/shape.wdf"
	elseif pg == "朝夕_舞天姬" then
		pgs[1] = 2395353653
		pgs[2] = 2395353653
		pgs[3] = 0708502548
		pgs[4] = 3224442340
		pgs[6] = 3649114993
		pgs[7] = 2271525100
		pgs[8] = 3918368321
		pgs[9] = 3452351752
		pgs[10] = "common/shape.wdf"
	elseif pg == "秋水落霞_舞天姬" then
		pgs[1] = 1202111998
		pgs[2] = 1202111998
		pgs[3] = 0x5b54beea
		pgs[4] = 3049902097
		pgs[6] = 690602552
		pgs[7] = 1342960347
		pgs[8] = 3838882501
		pgs[9] = 1483726919
		pgs[10] = "common/shape.wdf"
	elseif pg == "乾坤_舞天姬" then
		pgs[1] = 266685423
		pgs[2] = 266685423
		pgs[3] = 2851409574
		pgs[4] = 3890863565
		pgs[6] = 1515127869
		pgs[7] = 256273093
		pgs[8] = 2425863420
		pgs[9] = 615875314
		pgs[10] = "common/shape.wdf"
	elseif pg == "骨精灵" then
		pgs[1] = 3043670818
		pgs[2] = 3043670818
		pgs[3] = 3644222844
		pgs[4] = 2656336023
		pgs[6] = 4229617854
		pgs[7] = 3601844930
		pgs[8] = 2956176231
		pgs[9] = 4259873334
		pgs[10] = "common/shape.wdf"
	elseif pg == "骨精灵_魔棒" then
		pgs[1] = 2452516043
		pgs[2] = 2452516043
		pgs[3] = 1899323518
		pgs[4] = 3477875588
		pgs[6] = 1063711236
		pgs[7] = 3657445131
		pgs[8] = 2024668974
		pgs[9] = 3508788176
		pgs[10] = "common/shape.wdf"
	elseif pg == "骨精灵_爪刺" then
		pgs[1] = 3043670818
		pgs[2] = 3043670818
		pgs[3] = 3644222844
		pgs[4] = 2656336023
		pgs[6] = 4229617854
		pgs[7] = 3601844930
		pgs[8] = 2956176231
		pgs[9] = 4259873334
		pgs[10] = "common/shape.wdf"
	elseif pg == "狐美人" then
		pgs[1] = 143164260
		pgs[2] = 143164260
		pgs[3] = 247333098
		pgs[4] = 3467601219
		pgs[6] = 1873404188
		pgs[7] = 1585787695
		pgs[8] = 947996020
		pgs[9] = 3212527142
		pgs[10] = "common/shape.wdf"
	elseif pg == "狐美人_鞭" then
		pgs[1] = 1138804365
		pgs[2] = 1138804365
		pgs[3] = 247333098
		pgs[4] = 303785981
		pgs[6] = 1734212905
		pgs[7] = 3749438
		pgs[8] = 4126393258
		pgs[9] = 3502426669
		pgs[10] = "common/shape.wdf"
	elseif pg == "狐美人_爪刺" then
		pgs[1] = 143164260
		pgs[2] = 143164260
		pgs[3] = 247333098
		pgs[4] = 3467601219
		pgs[6] = 1873404188
		pgs[7] = 1585787695
		pgs[8] = 947996020
		pgs[9] = 3212527142
		pgs[10] = "common/shape.wdf"
	elseif pg == "飞燕女" then
		pgs[1] = 1018070922
		pgs[2] = 1018070922
		pgs[3] = 2068177574
		pgs[4] = 4111908170
		pgs[6] = 1489146739
		pgs[7] = 607870271
		pgs[8] = 1607593791
		pgs[9] = 3911067979
		pgs[10] = "common/shape.wdf"
	elseif pg == "飞燕女_环圈" then
		pgs[1] = 1018070922
		pgs[2] = 1018070922
		pgs[3] = 2068177574
		pgs[4] = 4111908170
		pgs[6] = 1489146739
		pgs[7] = 607870271
		pgs[8] = 1607593791
		pgs[9] = 3911067979
		pgs[10] = "common/shape.wdf"
	elseif pg == "飞燕女_双短剑" then
		pgs[1] = 2103710679
		pgs[2] = 2103710679
		pgs[3] = 2068177574
		pgs[4] = 29450010
		pgs[6] = 3234089534
		pgs[7] = 2076610755
		pgs[8] = 2826457680
		pgs[9] = 2418368925
		pgs[10] = "common/shape.wdf"
	elseif pg == "逍遥生" then
		pgs[1] = 776342191
		pgs[2] = 776342191
		pgs[3] = 1782439566
		pgs[4] = 4097908221
		pgs[6] = 947396698
		pgs[7] = 3952279767
		pgs[8] = 1198567883
		pgs[9] = 1011046408
		pgs[10] = "common/shape.wdf"
	elseif pg == "逍遥生_剑" then
		pgs[1] = 2801151609
		pgs[2] = 2801151609
		pgs[3] = 1782439566
		pgs[4] = 3738039458
		pgs[6] = 1629704855
		pgs[7] = 1539613628
		pgs[8] = 1512265752
		pgs[9] = 116130982
		pgs[10] = "common/shape.wdf"
	elseif pg == "逍遥生_扇" then
		pgs[1] = 776342191
		pgs[2] = 776342191
		pgs[3] = 1782439566
		pgs[4] = 4097908221
		pgs[6] = 947396698
		pgs[7] = 3952279767
		pgs[8] = 1198567883
		pgs[9] = 1011046408
		pgs[10] = "common/shape.wdf"
	elseif pg == "神天兵" then
		pgs[1] = 1465303491
		pgs[2] = 1465303491
		pgs[3] = 1649555822
		pgs[4] = 2910864082
		pgs[6] = 3107944047
		pgs[7] = 2714401860
		pgs[8] = 2489545420
		pgs[9] = 2796680623
		pgs[10] = "common/shape.wdf"
	elseif pg == "神天兵_锤" then
		pgs[1] = 1465303491
		pgs[2] = 1465303491
		pgs[3] = 1649555822
		pgs[4] = 2910864082
		pgs[6] = 3107944047
		pgs[7] = 2714401860
		pgs[8] = 2489545420
		pgs[9] = 2796680623
		pgs[10] = "common/shape.wdf"
	elseif pg == "神天兵_枪矛" then
		pgs[1] = 3139413485
		pgs[2] = 3139413485
		pgs[3] = 1649555822
		pgs[4] = 1857394109
		pgs[6] = 1539170847
		pgs[7] = 1525915374
		pgs[8] = 2489545420
		pgs[9] = 2207457325
		pgs[10] = "common/shape.wdf"
	elseif pg == "龙太子" then
		pgs[1] = 995698620
		pgs[2] = 995698620
		pgs[3] = 2482790664
		pgs[4] = 708419920
		pgs[6] = 397538195
		pgs[7] = 1042710685
		pgs[8] = 4098637790
		pgs[9] = 1173564955
		pgs[10] = "common/shape.wdf"
	elseif pg == "龙太子_扇" then
		pgs[1] = 241140809
		pgs[2] = 241140809
		pgs[3] = 2482790664
		pgs[4] = 3101694266
		pgs[6] = 2034116134
		pgs[7] = 2603954881
		pgs[8] = 4098637790
		pgs[9] = 3966136859
		pgs[10] = "common/shape.wdf"
	elseif pg == "龙太子_枪矛" then
		pgs[1] = 995698620
		pgs[2] = 995698620
		pgs[3] = 2482790664
		pgs[4] = 708419920
		pgs[6] = 397538195
		pgs[7] = 1042710685
		pgs[8] = 4098637790
		pgs[9] = 1173564955
		pgs[10] = "common/shape.wdf"
	elseif pg == "虎头怪" then
		pgs[1] = 3188334211
		pgs[2] = 3188334211
		pgs[3] = 1740983547
		pgs[4] = 3951179215
		pgs[6] = 1705376638
		pgs[7] = 659922551
		pgs[8] = 3836622392
		pgs[9] = 4274012337
		pgs[10] = "common/shape.wdf"
	elseif pg == "虎头怪_斧钺" then
		pgs[1] = 2471916192
		pgs[2] = 2471916192
		pgs[3] = 1740983547
		pgs[4] = 1851258377
		pgs[6] = 1927395527
		pgs[7] = 1883982028
		pgs[8] = 2089007572
		pgs[9] = 92383142
		pgs[10] = "common/shape.wdf"
	elseif pg == "虎头怪_锤" then
		pgs[1] = 3188334211
		pgs[2] = 3188334211
		pgs[3] = 1740983547
		pgs[4] = 3951179215
		pgs[6] = 1705376638
		pgs[7] = 659922551
		pgs[8] = 3836622392
		pgs[9] = 4274012337
		pgs[10] = "common/shape.wdf"
	elseif pg == "舞天姬" then
		pgs[1] = 2774401093
		pgs[2] = 2774401093
		pgs[3] = 3043244041
		pgs[4] = 86275401
		pgs[6] = 3443216643
		pgs[7] = 1786109105
		pgs[8] = 1241775590
		pgs[9] = 4118221086
		pgs[10] = "common/shape.wdf"
	elseif pg == "舞天姬_飘带" then
		pgs[1] = 2774401093
		pgs[2] = 2774401093
		pgs[3] = 3043244041
		pgs[4] = 86275401
		pgs[6] = 3443216643
		pgs[7] = 1786109105
		pgs[8] = 1241775590
		pgs[9] = 4118221086
		pgs[10] = "common/shape.wdf"
	elseif pg == "舞天姬_环圈" then
		pgs[1] = 4193428466
		pgs[2] = 4193428466
		pgs[3] = 3043244041
		pgs[4] = 2814262767
		pgs[6] = 4189229797
		pgs[7] = 3277294463
		pgs[8] = 3942685609
		pgs[9] = 610824997
		pgs[10] = "common/shape.wdf"
	elseif pg == "巨魔王" then
		pgs[1] = 508905397
		pgs[2] = 508905397
		pgs[3] = 2951893280
		pgs[4] = 1635724392
		pgs[6] = 2639845870
		pgs[7] = 2750701818
		pgs[8] = 2273495960
		pgs[9] = 4081980249
		pgs[10] = "common/shape.wdf"
	elseif pg == "巨魔王_斧钺" then
		pgs[1] = 508905397
		pgs[2] = 508905397
		pgs[3] = 2951893280
		pgs[4] = 1635724392
		pgs[6] = 2639845870
		pgs[7] = 2750701818
		pgs[8] = 2273495960
		pgs[9] = 4081980249
		pgs[10] = "common/shape.wdf"
	elseif pg == "巨魔王_刀" then
		pgs[1] = 1518169819
		pgs[2] = 1518169819
		pgs[3] = 2951893280
		pgs[4] = 533876880
		pgs[6] = 747524185
		pgs[7] = 594523269
		pgs[8] = 3417945932
		pgs[9] = 2896805672
		pgs[10] = "common/shape.wdf"
	elseif pg == "玄彩娥" then
		pgs[1] = 3947923690
		pgs[2] = 3947923690
		pgs[3] = 1501032219
		pgs[4] = 728904944
		pgs[6] = 2291528828
		pgs[7] = 2162415082
		pgs[8] = 2234123373
		pgs[9] = 2657283590
		pgs[10] = "common/shape.wdf"
	elseif pg == "玄彩娥_魔棒" then
		pgs[1] = 3947923690
		pgs[2] = 3947923690
		pgs[3] = 1501032219
		pgs[4] = 3870010961
		pgs[6] = 184048410
		pgs[7] = 2162415082
		pgs[8] = 2234123373
		pgs[9] = 2657283590
		pgs[10] = "common/shape.wdf"
	elseif pg == "玄彩娥_飘带" then
		pgs[1] = 4201959108
		pgs[2] = 4201959108
		pgs[3] = 1501032219
		pgs[4] = 728904944
		pgs[6] = 2291528828
		pgs[7] = 1617545683
		pgs[8] = 339045070
		pgs[9] = 2545689750
		pgs[10] = "common/shape.wdf"
	elseif pg == "桃夭夭" then
		pgs[1] = 0x1a03df30
		pgs[2] = 0x1a03df30
		pgs[3] = 0x7f187687
		pgs[4] = 0x6b4481c
		pgs[6] = 0x3991e969
		pgs[7] = 0x9b8bc36b
		pgs[8] = 0xcc7c66c
		pgs[9] = 0xdd822e38
		pgs[10] = "common/shape.wdf"
	elseif pg == "桃夭夭_灯笼" then
		pgs[1] = 0x1a03df30
		pgs[2] = 0x1a03df30
		pgs[3] = 0x7f187687
		pgs[4] = 0x6b4481c
		pgs[6] = 0x3991e969
		pgs[7] = 0x9b8bc36b
		pgs[8] = 0xcc7c66c
		pgs[9] = 0xdd822e38
		pgs[10] = "common/shape.wdf"
	elseif pg == "桃夭夭_飘带" then
		pgs[1] = 0x3c82f54d
		pgs[2] = 0x3c82f54d
		pgs[3] = 0xb318ecf8
		pgs[4] = 0x82e34b44
		pgs[6] = 0xfb6e2b62
		pgs[7] = 0xa2e3009d
		pgs[8] = 0x71166311
		pgs[9] = 0x67073877
		pgs[10] = "common/shape.wdf"
	elseif pg == "素纸灯_桃夭夭" then
		pgs[1] = 0x22ad0116
		pgs[2] = 0x22ad0116
		pgs[3] = 0x4417b129
		pgs[4] = 0xb87618dc
		pgs[6] = 0xcac98ec9
		pgs[7] = 0x134b6a11
		pgs[8] = 0xf37445d5
		pgs[9] = 0x6df9943b
		pgs[10] = "common/shape.wdf"
	elseif pg == "如意宫灯_桃夭夭" then
		pgs[1] = 0x88721101
		pgs[2] = 0x88721101
		pgs[3] = 0x1020d86
		pgs[4] = 0x308e178f
		pgs[6] = 0xa5d2156f
		pgs[7] = 0x3a445c1a
		pgs[8] = 0xd832a9bd
		pgs[9] = 0xceb48c43
		pgs[10] = "common/shape.wdf"
	elseif pg == "玉兔盏_桃夭夭" then
		pgs[1] = 0xd268fbd9
		pgs[2] = 0xd268fbd9
		pgs[3] = 0xbadf1f94
		pgs[4] = 0xd3018212
		pgs[6] = 0xb53e4e80
		pgs[7] = 0x2ba599e2
		pgs[8] = 0x20302676
		pgs[9] = 0xb2827463
		pgs[10] = "common/shape.wdf"
	elseif pg == "蟠龙_桃夭夭" then
		pgs[1] = 0x19edc0fa
		pgs[2] = 0x19edc0fa
		pgs[3] = 0x9322fd7b
		pgs[4] = 0xa0e0350a
		pgs[6] = 0xdd3cb89e
		pgs[7] = 0x9864e2c8
		pgs[8] = 0xfad057ca
		pgs[9] = 0xf6c344b6
		pgs[10] = "common/shape.wdf"
	elseif pg == "云鹤_桃夭夭" then
		pgs[1] = 0xb070eee1
		pgs[2] = 0xb070eee1
		pgs[3] = 0x2c85ff8d
		pgs[4] = 0x38e04897
		pgs[6] = 0x6d8f66ba
		pgs[7] = 0x9425a996
		pgs[8] = 0xba9c52ae
		pgs[9] = 0xe75caef5
		pgs[10] = "common/shape.wdf"
	elseif pg == "风荷_桃夭夭" then
		pgs[1] = 0xf6d896b6
		pgs[2] = 0xf6d896b6
		pgs[3] = 0x6c50de51
		pgs[4] = 0x5ac26b24
		pgs[6] = 0xc9883742
		pgs[7] = 0x6eb959f2
		pgs[8] = 0xfccc31f
		pgs[9] = 0xe82f8299
		pgs[10] = "common/shape.wdf"
	elseif pg == "金风玉露_桃夭夭" then
		pgs[1] = 0x77a50bdc
		pgs[2] = 0x77a50bdc
		pgs[3] = 0xdd2cad1d
		pgs[4] = 0x199302fe
		pgs[6] = 0x75483548
		pgs[7] = 0x8ee4a54b
		pgs[8] = 0xcc9574e2
		pgs[9] = 0x2459ce56
		pgs[10] = "common/shape.wdf"
	elseif pg == "凰火燎原_桃夭夭" then
		pgs[1] = 0xa87a5d2b
		pgs[2] = 0xa87a5d2b
		pgs[3] = 0x52c94be6
		pgs[4] = 0xca6f214e
		pgs[6] = 0x1129a4ab
		pgs[7] = 0xfe30f591
		pgs[8] = 0xd2b85397
		pgs[9] = 0xf5c5fd57
		pgs[10] = "common/shape.wdf"
	elseif pg == "月露清愁_桃夭夭" then
		pgs[1] = 0x886127e1
		pgs[2] = 0x886127e1
		pgs[3] = 0xa0824967
		pgs[4] = 0xa68b7212
		pgs[6] = 0xde519a20
		pgs[7] = 0x7c971917
		pgs[8] = 0x2fc262c4
		pgs[9] = 0xfb3ab3e6
		pgs[10] = "common/shape.wdf"
	elseif pg == "夭桃秾李_桃夭夭" then
		pgs[1] = 0x2debd3d7
		pgs[2] = 0x2debd3d7
		pgs[3] = 0xcc3c4690
		pgs[4] = 0x584d6344
		pgs[6] = 0x9d644607
		pgs[7] = 0xaa34ad15
		pgs[8] = 0xa3b3f40e
		pgs[9] = 0x39e1e2a6
		pgs[10] = "common/shape.wdf"
	elseif pg == "荒尘_桃夭夭" then
		pgs[1] = 0x537aec81
		pgs[2] = 0x537aec81
		pgs[3] = 0x3b023441
		pgs[4] = 0x7bb26165
		pgs[6] = 0xb3460fef
		pgs[7] = 0xba3628be
		pgs[8] = 0xfedd5513
		pgs[9] = 0x9538c0e7
		pgs[10] = "common/shape.wdf"
	elseif pg == "五色缎带_桃夭夭" then
		pgs[1] = 0xa53fecf4
		pgs[2] = 0xa53fecf4
		pgs[3] = 0xa1e7d445
		pgs[4] = 0xf3d9b16b
		pgs[6] = 0xb6495c7d
		pgs[7] = 0xfec751b2
		pgs[8] = 0x7c764187
		pgs[9] = 0x2151b286
		pgs[10] = "common/shape.wdf"
	elseif pg == "无极丝_桃夭夭" then
		pgs[1] = 0x2dc47758
		pgs[2] = 0x2dc47758
		pgs[3] = 0xb3a754ce
		pgs[4] = 0x7d829f97
		pgs[6] = 0x9cc635f2
		pgs[7] = 0x60d66d11
		pgs[8] = 0xa19d67df
		pgs[9] = 0x8b8352b7
		pgs[10] = "common/shape.wdf"
	elseif pg == "七彩罗刹_桃夭夭" then
		pgs[1] = 0x4eb293c1
		pgs[2] = 0x4eb293c1
		pgs[3] = 0xa930b7be
		pgs[4] = 0xee1e86d1
		pgs[6] = 0x12ea4c25
		pgs[7] = 0x9f13c3d0
		pgs[8] = 0x4bf0188
		pgs[9] = 0xf9d6c3b0
		pgs[10] = "common/shape.wdf"
	elseif pg == "彩虹_桃夭夭" then
		pgs[1] = 0xa4e7e620
		pgs[2] = 0xa4e7e620
		pgs[3] = 0x7116581a
		pgs[4] = 0xbe9b3d09
		pgs[6] = 0x2ad9ea91
		pgs[7] = 0x723c25dd
		pgs[8] = 0xb7e14a4f
		pgs[9] = 0x620fe6b1
		pgs[10] = "common/shape.wdf"
	elseif pg == "流云_桃夭夭" then
		pgs[1] = 0x6f2e866f
		pgs[2] = 0x6f2e866f
		pgs[3] = 0xcd434139
		pgs[4] = 0x9d63ef9d
		pgs[6] = 0x1fe48f84
		pgs[7] = 0xc923ce1
		pgs[8] = 0xf0ea98e1
		pgs[9] = 0x469aca2a
		pgs[10] = "common/shape.wdf"
	elseif pg == "碧波_桃夭夭" then
		pgs[1] = 0xce2b41ec
		pgs[2] = 0xce2b41ec
		pgs[3] = 0x1de079ad
		pgs[4] = 0x43d5e3bf
		pgs[6] = 0x37017692
		pgs[7] = 0x61bb1655
		pgs[8] = 0x28d8b610
		pgs[9] = 0x10ddce44
		pgs[10] = "common/shape.wdf"
	elseif pg == "秋水落霞_桃夭夭" then
		pgs[1] = 0x169138c8
		pgs[2] = 0x169138c8
		pgs[3] = 0x87fbd841
		pgs[4] = 0x6329fe9e
		pgs[6] = 0xd292e908
		pgs[7] = 0x169e2035
		pgs[8] = 0xf8167e8d
		pgs[9] = 0x7ec4569e
		pgs[10] = "common/shape.wdf"
	elseif pg == "晃金仙绳_桃夭夭" then
		pgs[1] = 0xc298b821
		pgs[2] = 0xc298b821
		pgs[3] = 0xfb027bb6
		pgs[4] = 0x3881f0f3
		pgs[6] = 0x7c243bcf
		pgs[7] = 0x1001ee49
		pgs[8] = 0x891407e9
		pgs[9] = 0x11353491
		pgs[10] = "common/shape.wdf"
	elseif pg == "此最相思_桃夭夭" then
		pgs[1] = 0xedec5cbc
		pgs[2] = 0xedec5cbc
		pgs[3] = 0xa0de2fef
		pgs[4] = 0x4a7673fe
		pgs[6] = 0x348d04ba
		pgs[7] = 0xb08135f3
		pgs[8] = 0x9ddee2cd
		pgs[9] = 0x208786e5
		pgs[10] = "common/shape.wdf"
	elseif pg == "揽月摘星_桃夭夭" then
		pgs[1] = 0x7709c75
		pgs[2] = 0x7709c75
		pgs[3] = 0x8e3ba76
		pgs[4] = 0x88c1356a
		pgs[6] = 0xb0bbe8c7
		pgs[7] = 0xcc0caec1
		pgs[8] = 0x79521faa
		pgs[9] = 0x474085ed
		pgs[10] = "common/shape.wdf"
	elseif pg == "九霄_桃夭夭" then
		pgs[1] = 0x7f1a6777
		pgs[2] = 0x7f1a6777
		pgs[3] = 0xebbd89fa
		pgs[4] = 0x8310f14c
		pgs[6] = 0x3cecb898
		pgs[7] = 0x31b08320
		pgs[8] = 0xa30a11d2
		pgs[9] = 0x7045a7d2
		pgs[10] = "common/shape.wdf"
	elseif pg == "偃无师" then
		pgs[1] = 0xafa4cfec
		pgs[2] = 0xafa4cfec
		pgs[3] = 0x85509c8
		pgs[4] = 0xc90f21c
		pgs[6] = 0x521d4408
		pgs[7] = 0x22a9ca3c
		pgs[8] = 0x4e662122
		pgs[9] = 0xbf4b1d4a
		pgs[10] = "common/shape.wdf"
	elseif pg == "偃无师_巨剑" then
		pgs[1] = 0xafa4cfec
		pgs[2] = 0xafa4cfec
		pgs[3] = 0x85509c8
		pgs[4] = 0xc90f21c
		pgs[6] = 0x521d4408
		pgs[7] = 0x22a9ca3c
		pgs[8] = 0x4e662122
		pgs[9] = 0xbf4b1d4a
		pgs[10] = "common/shape.wdf"
	elseif pg == "偃无师_剑" then
		pgs[1] = 0xad061995
		pgs[2] = 0xad061995
		pgs[3] = 0x82d23cd2
		pgs[4] = 0xdc74d786
		pgs[6] = 0x6f2aee3e
		pgs[7] = 0x4a07d4e6
		pgs[8] = 0x3dd83ab2
		pgs[9] = 0xcb726c52
		pgs[10] = "common/shape.wdf"
	elseif pg == "钝铁重剑_偃无师" then
		pgs[1] = 0x9b705dfc
		pgs[2] = 0x9b705dfc
		pgs[3] = 0xe4fb8084
		pgs[4] = 0x27b5e405
		pgs[6] = 0x4f8b5293
		pgs[7] = 0x7af690ab
		pgs[8] = 0xdae58736
		pgs[9] = 0x820b063
		pgs[10] = "common/shape.wdf"
	elseif pg == "壁玉长铗_偃无师" then
		pgs[1] = 0x3091b3bb
		pgs[2] = 0x3091b3bb
		pgs[3] = 0x4863d36b
		pgs[4] = 0xca927285
		pgs[6] = 0xd78128a6
		pgs[7] = 0xd563a7f3
		pgs[8] = 0xb4defa9d
		pgs[9] = 0x4ba39302
		pgs[10] = "common/shape.wdf"
	elseif pg == "惊涛雪_偃无师" then
		pgs[1] = 0x193de511
		pgs[2] = 0x193de511
		pgs[3] = 0xf2ac8d4c
		pgs[4] = 0x1b5540b9
		pgs[6] = 0x25f948aa
		pgs[7] = 0x57121661
		pgs[8] = 0x24ab4742
		pgs[9] = 0x6a768302
		pgs[10] = "common/shape.wdf"
	elseif pg == "鸦九_偃无师" then
		pgs[1] = 0xa23c58fd
		pgs[2] = 0xa23c58fd
		pgs[3] = 0x4eab1898
		pgs[4] = 0x70910530
		pgs[6] = 0x6cdf9821
		pgs[7] = 0xee7edf15
		pgs[8] = 0x6fcb07e7
		pgs[9] = 0xf38c0901
		pgs[10] = "common/shape.wdf"
	elseif pg == "昆吾_偃无师" then
		pgs[1] = 0x673c07b1
		pgs[2] = 0x673c07b1
		pgs[3] = 0x2d94eb0e
		pgs[4] = 0xaed16a4e
		pgs[6] = 0x52aed75a
		pgs[7] = 0x7df86859
		pgs[8] = 0x64313732
		pgs[9] = 0x2fc105f4
		pgs[10] = "common/shape.wdf"
	elseif pg == "弦歌_偃无师" then
		pgs[1] = 0xaad90a0b
		pgs[2] = 0xaad90a0b
		pgs[3] = 0x8ded764d
		pgs[4] = 0xfae608
		pgs[6] = 0xad7f34f6
		pgs[7] = 0xbd506694
		pgs[8] = 0x1dc96138
		pgs[9] = 0xc7b7a920
		pgs[10] = "common/shape.wdf"
	elseif pg == "墨骨枯麟_偃无师" then
		pgs[1] = 0x978efcfa
		pgs[2] = 0x978efcfa
		pgs[3] = 0xd313d551
		pgs[4] = 0xa1bb932
		pgs[6] = 0xd7c4635b
		pgs[7] = 0x38762fac
		pgs[8] = 0x886a209c
		pgs[9] = 0xcda81fbe
		pgs[10] = "common/shape.wdf"
	elseif pg == "腾蛇郁刃_偃无师" then
		pgs[1] = 0x41c3161c
		pgs[2] = 0x41c3161c
		pgs[3] = 0x23bf6d3e
		pgs[4] = 0x2e604d5c
		pgs[6] = 0x7ef4f80c
		pgs[7] = 0x6be248b6
		pgs[8] = 0x64ce0c0e
		pgs[9] = 0x64c5f528
		pgs[10] = "common/shape.wdf"
	elseif pg == "秋水澄流_偃无师" then
		pgs[1] = 0xdfa2c2e
		pgs[2] = 0xdfa2c2e
		pgs[3] = 0xeb19c33c
		pgs[4] = 0x51fd5287
		pgs[6] = 0x20e87072
		pgs[7] = 0xcc7777dd
		pgs[8] = 0xd497f6d1
		pgs[9] = 0xc6b32cf4
		pgs[10] = "common/shape.wdf"
	elseif pg == "百辟镇魂_偃无师" then
		pgs[1] = 0xfbfad6c9
		pgs[2] = 0xfbfad6c9
		pgs[3] = 0x67d5aa8
		pgs[4] = 0x31b99d8d
		pgs[6] = 0x834bed74
		pgs[7] = 0xcd37ef04
		pgs[8] = 0x55b2278a
		pgs[9] = 0x53ab516
		pgs[10] = "common/shape.wdf"
	elseif pg == "长息_偃无师" then
		pgs[1] = 0x50430ce5
		pgs[2] = 0x50430ce5
		pgs[3] = 0xbf6da3f0
		pgs[4] = 0xbd247eda
		pgs[6] = 0x4a0d3123
		pgs[7] = 0x1ad155f4
		pgs[8] = 0x8d342ba9
		pgs[9] = 0x344f1cd7
		pgs[10] = "common/shape.wdf"
	elseif pg == "青铜短剑_偃无师" then
		pgs[1] = 0xf8dd37cb
		pgs[2] = 0xf8dd37cb
		pgs[3] = 0xa2a6256e
		pgs[4] = 0x998f0f9a
		pgs[6] = 0x46db51e2
		pgs[7] = 0x54507e29
		pgs[8] = 0xf264f47a
		pgs[9] = 0xdfaf8493
		pgs[10] = "common/shape.wdf"
	elseif pg == "青锋剑_偃无师" then
		pgs[1] = 0xaee8bd71
		pgs[2] = 0xaee8bd71
		pgs[3] = 0x63e57f9d
		pgs[4] = 0xd7c8f9e8
		pgs[6] = 0xb02a17de
		pgs[7] = 0x257f48fb
		pgs[8] = 0xa803878f
		pgs[9] = 0x7bd1465c
		pgs[10] = "common/shape.wdf"
	elseif pg == "游龙剑_偃无师" then
		pgs[1] = 0x8275e104
		pgs[2] = 0x8275e104
		pgs[3] = 0x2261634
		pgs[4] = 0xfa873366
		pgs[6] = 0x3357f4ce
		pgs[7] = 0xa4f1c098
		pgs[8] = 0x76797182
		pgs[9] = 0x99b2418
		pgs[10] = "common/shape.wdf"
	elseif pg == "鱼肠_偃无师" then
		pgs[1] = 0x1f507e66
		pgs[2] = 0x1f507e66
		pgs[3] = 0x7ab885f
		pgs[4] = 0x796299c5
		pgs[6] = 0x97f5e71
		pgs[7] = 0xce9cadf3
		pgs[8] = 0x19d6bb89
		pgs[9] = 0xe167d72d
		pgs[10] = "common/shape.wdf"
	elseif pg == "倚天_偃无师" then
		pgs[1] = 0x9a54cf2e
		pgs[2] = 0x9a54cf2e
		pgs[3] = 0xe33e1d20
		pgs[4] = 0x3632d870
		pgs[6] = 0x7f8db9c8
		pgs[7] = 0xfebbbc14
		pgs[8] = 0x18cb12ea
		pgs[9] = 0xba3e2ad9
		pgs[10] = "common/shape.wdf"
	elseif pg == "湛卢_偃无师" then
		pgs[1] = 0xd9a821cc
		pgs[2] = 0xd9a821cc
		pgs[3] = 0x7ab82ea7
		pgs[4] = 0x52ade316
		pgs[6] = 0xb1df0e1b
		pgs[7] = 0x17daffd2
		pgs[8] = 0xd501afbb
		pgs[9] = 0x5d681d5c
		pgs[10] = "common/shape.wdf"
	elseif pg == "魏武青虹_偃无师" then
		pgs[1] = 0xf870cff7
		pgs[2] = 0xf870cff7
		pgs[3] = 0x10ad6201
		pgs[4] = 0x2120194f
		pgs[6] = 0xfb30dc17
		pgs[7] = 0xe25c0098
		pgs[8] = 0xe994cbc7
		pgs[9] = 0x76de282f
		pgs[10] = "common/shape.wdf"
	elseif pg == "灵犀神剑_偃无师" then
		pgs[1] = 0x53ff28df
		pgs[2] = 0x53ff28df
		pgs[3] = 0x55e1ac27
		pgs[4] = 0x9ca9aa0d
		pgs[6] = 0xed47ed45
		pgs[7] = 0xf3cdbf99
		pgs[8] = 0x95ae8983
		pgs[9] = 0x398d9ddc
		pgs[10] = "common/shape.wdf"
	elseif pg == "四法青云_偃无师" then
		pgs[1] = 0x7f89fcb3
		pgs[2] = 0x7f89fcb3
		pgs[3] = 0x919e5c
		pgs[4] = 0xae8c251a
		pgs[6] = 0xdf6b7526
		pgs[7] = 0x2d55f615
		pgs[8] = 0x4906093
		pgs[9] = 0x8fc40f24
		pgs[10] = "common/shape.wdf"
	elseif pg == "霜冷九州_偃无师" then
		pgs[1] = 0xf7d26ea8
		pgs[2] = 0xf7d26ea8
		pgs[3] = 0x1824e3a5
		pgs[4] = 0xf062ca2
		pgs[6] = 0xd2656d03
		pgs[7] = 0x2e368961
		pgs[8] = 0x853cfdd9
		pgs[9] = 0x129c0ce6
		pgs[10] = "common/shape.wdf"
	elseif pg == "擒龙_偃无师" then
		pgs[1] = 0xf540ee21
		pgs[2] = 0xf540ee21
		pgs[3] = 0x25309ec1
		pgs[4] = 0x23069ca
		pgs[6] = 0x5c2c0872
		pgs[7] = 0x769ce33e
		pgs[8] = 0x2c7a88d9
		pgs[9] = 0xefb68790
		pgs[10] = "common/shape.wdf"
	elseif pg == "鬼潇潇" then
		pgs[1] = 0x1ba0d020
		pgs[2] = 0x1ba0d020
		pgs[3] = 0x16603d24
		pgs[4] = 0xf5cb2334
		pgs[6] = 0x5777c1b1
		pgs[7] = 0xc6d60a6
		pgs[8] = 0x391f4c8d
		pgs[9] = 0x13e75e87
		pgs[10] = "common/shape.wdf"
	elseif pg == "鬼潇潇_伞" then
		pgs[1] = 0x1ba0d020
		pgs[2] = 0x1ba0d020
		pgs[3] = 0x16603d24
		pgs[4] = 0xf5cb2334
		pgs[6] = 0x5777c1b1
		pgs[7] = 0x2512d0b8
		pgs[8] = 0x391f4c8d
		pgs[9] = 0x13e75e87
		pgs[10] = "common/shape.wdf"
	elseif pg == "鬼潇潇_爪刺" then
		pgs[1] = 0x9308957c
		pgs[2] = 0x9308957c
		pgs[3] = 0x69e9b3fd
		pgs[4] = 0x5423348e
		pgs[6] = 0xb93971ac
		pgs[7] = 0xc6d60a6
		pgs[8] = 0xffcf7efa
		pgs[9] = 0x78f0f6cb
		pgs[10] = "common/shape.wdf"
	elseif pg == "红罗伞_鬼潇潇" then
		pgs[1] = 0x13dcb6f5
		pgs[2] = 0x13dcb6f5
		pgs[3] = 0x4da43b21
		pgs[4] = 0x9ac28de5
		pgs[6] = 0x72a11b43
		pgs[7] = 0x27c2632f
		pgs[8] = 0x860771ff
		pgs[9] = 0x7a37608
		pgs[10] = "common/shape.wdf"
	elseif pg == "琳琅盖_鬼潇潇" then
		pgs[1] = 0xef5199e4
		pgs[2] = 0xef5199e4
		pgs[3] = 0x4935ede3
		pgs[4] = 0x8d4bfa3d
		pgs[6] = 0x606bf0c5
		pgs[7] = 0x69ad515c
		pgs[8] = 0x54dd0aa9
		pgs[9] = 0x995417f0
		pgs[10] = "common/shape.wdf"
	elseif pg == "金刚伞_鬼潇潇" then
		pgs[1] = 0x88ff6368
		pgs[2] = 0x88ff6368
		pgs[3] = 0xa8a7dd8f
		pgs[4] = 0xa213a5d7
		pgs[6] = 0x5b29f582
		pgs[7] = 0x8920f9c7
		pgs[8] = 0xe7c7ed96
		pgs[9] = 0x733db9b
		pgs[10] = "common/shape.wdf"
	elseif pg == "鬼骨_鬼潇潇" then
		pgs[1] = 0xc13dfbf9
		pgs[2] = 0xc13dfbf9
		pgs[3] = 0xc5eb3d87
		pgs[4] = 0x6a274bc3
		pgs[6] = 0xc5fb9878
		pgs[7] = 0x43e46273
		pgs[8] = 0xc6ee2079
		pgs[9] = 0x483034e
		pgs[10] = "common/shape.wdf"
	elseif pg == "云梦_鬼潇潇" then
		pgs[1] = 0x79bb36ba
		pgs[2] = 0x79bb36ba
		pgs[3] = 0x7cc2e7af
		pgs[4] = 0x97f1f96d
		pgs[6] = 0x736fdbc6
		pgs[7] = 0xba8614a0
		pgs[8] = 0xfedc081b
		pgs[9] = 0x52bf4fe1
		pgs[10] = "common/shape.wdf"
	elseif pg == "枕霞_鬼潇潇" then
		pgs[1] = 0xd1d08451
		pgs[2] = 0xd1d08451
		pgs[3] = 0x431d2334
		pgs[4] = 0x49c00677
		pgs[6] = 0x6a18ea72
		pgs[7] = 0x5520f7a3
		pgs[8] = 0xa4631e15
		pgs[9] = 0xbc7e59ae
		pgs[10] = "common/shape.wdf"
	elseif pg == "月影星痕_鬼潇潇" then
		pgs[1] = 0xbd7484eb
		pgs[2] = 0xbd7484eb
		pgs[3] = 0xb254801a
		pgs[4] = 0xcedfce6e
		pgs[6] = 0x1ed16b0
		pgs[7] = 0xd7e7626
		pgs[8] = 0x708875c0
		pgs[9] = 0xfa7b67f1
		pgs[10] = "common/shape.wdf"
	elseif pg == "雪羽穿云_鬼潇潇" then
		pgs[1] = 0x603eb4e4
		pgs[2] = 0x603eb4e4
		pgs[3] = 0x783a196a
		pgs[4] = 0xbb22fe45
		pgs[6] = 0x5460d705
		pgs[7] = 0x51337a6c
		pgs[8] = 0x3b7ce297
		pgs[9] = 0xc73db590
		pgs[10] = "common/shape.wdf"
	elseif pg == "碧火琉璃_鬼潇潇" then
		pgs[1] = 0x6023305a
		pgs[2] = 0x6023305a
		pgs[3] = 0xedd53776
		pgs[4] = 0xc21e2453
		pgs[6] = 0xcc2e3462
		pgs[7] = 0x10a8c4bc
		pgs[8] = 0x8df0c2f9
		pgs[9] = 0x5471b14e
		pgs[10] = "common/shape.wdf"
	elseif pg == "浮生归梦_鬼潇潇" then
		pgs[1] = 0xc3c2168b
		pgs[2] = 0xc3c2168b
		pgs[3] = 0x50380adf
		pgs[4] = 0x3a7a787c
		pgs[6] = 0xa3ad8994
		pgs[7] = 0xdd685d4e
		pgs[8] = 0xd111529a
		pgs[9] = 0x2328866c
		pgs[10] = "common/shape.wdf"
	elseif pg == "晴雪_鬼潇潇" then
		pgs[1] = 0x86240202
		pgs[2] = 0x86240202
		pgs[3] = 0xd45760c
		pgs[4] = 0x9181349b
		pgs[6] = 0xa8c2fc83
		pgs[7] = 0x2e52cde4
		pgs[8] = 0x43022433
		pgs[9] = 0x15799adc
		pgs[10] = "common/shape.wdf"
	elseif pg == "铁爪_鬼潇潇" then
		pgs[1] = 0xd8c84714
		pgs[2] = 0xd8c84714
		pgs[3] = 0xc42aa234
		pgs[4] = 0x2bbb7044
		pgs[6] = 0xfa704666
		pgs[7] = 0x4dc318c9
		pgs[8] = 0xd104e67f
		pgs[9] = 0x4496ca86
		pgs[10] = "common/shape.wdf"
	elseif pg == "青龙牙_鬼潇潇" then
		pgs[1] = 0x8c811220
		pgs[2] = 0x8c811220
		pgs[3] = 0x6422b0d5
		pgs[4] = 0xc87d6432
		pgs[6] = 0xbbb66679
		pgs[7] = 0xc1d12715
		pgs[8] = 0x71e45393
		pgs[9] = 0x98f6a979
		pgs[10] = "common/shape.wdf"
	elseif pg == "青刚刺_鬼潇潇" then
		pgs[1] = 0x4ab65936
		pgs[2] = 0x4ab65936
		pgs[3] = 0xffb3516c
		pgs[4] = 0xefd58471
		pgs[6] = 0x8cd79c98
		pgs[7] = 0xd3e18bfb
		pgs[8] = 0x708b7c5
		pgs[9] = 0x9c6aed3b
		pgs[10] = "common/shape.wdf"
	elseif pg == "撕天_鬼潇潇" then
		pgs[1] = 0x450c888a
		pgs[2] = 0x450c888a
		pgs[3] = 0x60b8f5b2
		pgs[4] = 0x3fb86dec
		pgs[6] = 0xa5ebba28
		pgs[7] = 0x78ed127d
		pgs[8] = 0x23a26760
		pgs[9] = 0x36ce4aca
		pgs[10] = "common/shape.wdf"
	elseif pg == "毒牙_鬼潇潇" then
		pgs[1] = 0x51b463a
		pgs[2] = 0x51b463a
		pgs[3] = 0x73792347
		pgs[4] = 0x8292637d
		pgs[6] = 0x470ba647
		pgs[7] = 0xc9af27aa
		pgs[8] = 0xa1709867
		pgs[9] = 0xecf48fe4
		pgs[10] = "common/shape.wdf"
	elseif pg == "胭脂_鬼潇潇" then
		pgs[1] = 0x2e1083fe
		pgs[2] = 0x2e1083fe
		pgs[3] = 0x9ece2c4
		pgs[4] = 0xef3e8d26
		pgs[6] = 0x5d578929
		pgs[7] = 0x1501be96
		pgs[8] = 0x17dee18f
		pgs[9] = 0x6d1c58d9
		pgs[10] = "common/shape.wdf"
	elseif pg == "九阴勾魂_鬼潇潇" then
		pgs[1] = 0x42399936
		pgs[2] = 0x42399936
		pgs[3] = 0xb8fc756f
		pgs[4] = 0x3b85fa19
		pgs[6] = 0x419d4670
		pgs[7] = 0x89eaa81
		pgs[8] = 0x17473047
		pgs[9] = 0xed25a4a3
		pgs[10] = "common/shape.wdf"
	elseif pg == "雪蚕之刺_鬼潇潇" then
		pgs[1] = 0xa93e1fd5
		pgs[2] = 0xa93e1fd5
		pgs[3] = 0xe12d30cf
		pgs[4] = 0x8f87c512
		pgs[6] = 0x5f3920e8
		pgs[7] = 0xdf5499b8
		pgs[8] = 0x51699cee
		pgs[9] = 0x318949e3
		pgs[10] = "common/shape.wdf"
	elseif pg == "贵霜之牙_鬼潇潇" then
		pgs[1] = 0xd8270ca8
		pgs[2] = 0xd8270ca8
		pgs[3] = 0xe7d2f1d3
		pgs[4] = 0x9b7f1c84
		pgs[6] = 0x40a723ef
		pgs[7] = 0xf9361347
		pgs[8] = 0xbc2b048e
		pgs[9] = 0x29c67740
		pgs[10] = "common/shape.wdf"
	elseif pg == "忘川三途_鬼潇潇" then
		pgs[1] = 0xc688ef38
		pgs[2] = 0xc688ef38
		pgs[3] = 0x49f7c06e
		pgs[4] = 0x1e8cce73
		pgs[6] = 0xbac52da2
		pgs[7] = 0x23d984c
		pgs[8] = 0x2ee39875
		pgs[9] = 0xa4749be3
		pgs[10] = "common/shape.wdf"
	elseif pg == "离钩_鬼潇潇" then
		pgs[1] = 0xe15bc68d
		pgs[2] = 0xe15bc68d
		pgs[3] = 0xcd0dec76
		pgs[4] = 0x1147d15
		pgs[6] = 0xb0abea3d
		pgs[7] = 0x60613bc6
		pgs[8] = 0x2e602dcb
		pgs[9] = 0xff43b2d1
		pgs[10] = "common/shape.wdf"
	
	elseif pg == "英女侠" then
		pgs[1] = 1131552735
		pgs[2] = 1131552735
		pgs[3] = 550776032
		pgs[4] = 1762226248
		pgs[6] = 283881972
		pgs[7] = 1333230872
		pgs[8] = 2022264436
		pgs[9] = 1784128647
		pgs[10] = "shape.wdf"
	elseif pg == "英女侠_鞭" then
		pgs[1] = 1083652265
		pgs[2] = 1083652265
		pgs[3] = 550776032
		pgs[4] = 1830207536
		pgs[6] = 487493048
		pgs[7] = 4015503046
		pgs[8] = 3420727052
		pgs[9] = 2264625814
		pgs[10] = "shape.wdf"
	elseif pg == "英女侠_双短剑" then
		pgs[1] = 1131552735
		pgs[2] = 1131552735
		pgs[3] = 550776032
		pgs[4] = 1762226248
		pgs[6] = 283881972
		pgs[7] = 1333230872
		pgs[8] = 2022264436
		pgs[9] = 1784128647
		pgs[10] = "shape.wdf"
	elseif pg == "双短剑_英女侠" then
		pgs[1] = 2749813573
		pgs[2] = 2749813573
		pgs[3] = 3182553286
		pgs[4] = 2212413736
		pgs[6] = 0x8f937d83
		pgs[7] = 4220417948
		pgs[8] = 3709846822
		pgs[9] = 4251803233
		pgs[10] = "shape.wdf"
	elseif pg == "竹节双剑_英女侠" then
		pgs[1] = 785035487
		pgs[2] = 785035487
		pgs[3] = 388404819
		pgs[4] = 3063317704
		pgs[6] = 781929242
		pgs[7] = 992739922
		pgs[8] = 2099829177
		pgs[9] = 2839104966
		pgs[10] = "shape.wdf"
	elseif pg == "赤焰双剑_英女侠" then
		pgs[1] = 4168647024
		pgs[2] = 4168647024
		pgs[3] = 3572817351
		pgs[4] = 712581498
		pgs[6] = 2658138658
		pgs[7] = 2764921579
		pgs[8] = 2741994479
		pgs[9] = 4235932064
		pgs[10] = "shape.wdf"
	elseif pg == "牛皮鞭_英女侠" then
		pgs[1] = 3931398716
		pgs[2] = 3931398716
		pgs[3] = 1978009081
		pgs[4] = 3180100501
		pgs[6] = 2391704735
		pgs[7] = 2419933303
		pgs[8] = 2521677817
		pgs[9] = 2956424440
		pgs[10] = "shape.wdf"
	elseif pg == "青藤柳叶鞭_英女侠" then
		pgs[1] = 2804585084
		pgs[2] = 2804585084
		pgs[3] = 60106873
		pgs[4] = 1142701864
		pgs[6] = 3663657779
		pgs[7] = 1499832483
		pgs[8] = 3691312807
		pgs[9] = 3691312807
		pgs[10] = "shape.wdf"
	elseif pg == "钢结鞭_英女侠" then
		pgs[1] = 271263789
		pgs[2] = 271263789
		pgs[3] = 1861510591
		pgs[4] = 1546457330
		pgs[6] = 2479743000
		pgs[7] = 95594363
		pgs[8] = 2418442398
		pgs[9] = 1501213311
		pgs[10] = "shape.wdf"
	elseif pg == "灵蛇_英女侠" then
		pgs[1] = 3036397933
		pgs[2] = 3036397933
		pgs[3] = 109615900
		pgs[4] = 2747926100
		pgs[6] = 2286194550
		pgs[7] = 2559098069
		pgs[8] = 227111990
		pgs[9] = 2520581903
		pgs[10] = "shape.wdf"
	elseif pg == "游龙惊鸿_英女侠" then
		pgs[1] = 1724242915
		pgs[2] = 1724242915
		pgs[3] = 84894305
		pgs[4] = 1910956791
		pgs[6] = 4279024946
		pgs[7] = 4245988549
		pgs[8] = 204351801
		pgs[9] = 3689683150
		pgs[10] = "shape.wd3"
	elseif pg == "百花_英女侠旧" then
		pgs[1] = 120
		pgs[2] = 120
		pgs[3] = 128
		pgs[4] = 119
		pgs[6] = 130
		pgs[7] = 121
		pgs[8] = 129
		pgs[9] = 117
		pgs[10] = "shape.wdf"
	elseif pg == "月光双剑_英女侠" then
		pgs[1] = 2739970529
		pgs[2] = 2739970529
		pgs[3] = 1305035055
		pgs[4] = 908717950
		pgs[6] = 1760682539
		pgs[7] = 433987877
		pgs[8] = 2692136956
		pgs[9] = 3445935850
		pgs[10] = "shape.wdf"
	elseif pg == "祖龙对剑_英女侠" then
		pgs[1] = 371522347
		pgs[2] = 371522347
		pgs[3] = 1072281713
		pgs[4] = 3068921098
		pgs[6] = 3389582086
		pgs[7] = 388288592
		pgs[8] = 640740376
		pgs[9] = 3752665492
		pgs[10] = "shape.wd3"
	elseif pg == "紫电青霜_英女侠" then
		pgs[1] = 2940261156
		pgs[2] = 2940261156
		pgs[3] = 0x666e547d
		pgs[4] = 1476632389
		pgs[6] = 2376803038
		pgs[7] = 3092849276
		pgs[8] = 1335963374
		pgs[9] = 3005914168
		pgs[10] = "shape.wd8"
	elseif pg == "浮犀_英女侠" then
		pgs[1] = 1239588375
		pgs[2] = 1239588375
		pgs[3] = 0756053968
		pgs[4] = 0821109265
		pgs[6] = 1472865246
		pgs[7] = 2192274301
		pgs[8] = 1990043008
		pgs[9] = 3996927795
		pgs[10] = "shape.wd9"
	elseif pg == "阴阳_英女侠" then
		pgs[1] = 3489122494
		pgs[2] = 3489122494
		pgs[3] = 880749981
		pgs[4] = 4142038041
		pgs[6] = 2678300879
		pgs[7] = 3591452298
		pgs[8] = 351801901
		pgs[9] = 2182164503
		pgs[10] = "shape.wdf"
	elseif pg == "连理双树_英女侠" then
		pgs[1] = 1056087193
		pgs[2] = 1056087193
		pgs[3] = 158990972
		pgs[4] = 2230185189
		pgs[6] = 3682647142
		pgs[7] = 3580865845
		pgs[8] = 686282707
		pgs[9] = 3554518006
		pgs[10] = "shape.wd3"
	elseif pg == "龙筋_英女侠旧" then
		pgs[1] = 151
		pgs[2] = 151
		pgs[3] = 153
		pgs[4] = 150
		pgs[6] = 257
		pgs[7] = 152
		pgs[8] = 256
		pgs[9] = 148
		pgs[10] = "shape.wdf"
	elseif pg == "月光双剑_英女侠旧" then
		pgs[1] = 293
		pgs[2] = 293
		pgs[3] = 295
		pgs[4] = 292
		pgs[6] = 297
		pgs[7] = 294
		pgs[8] = 296
		pgs[9] = 290
		pgs[10] = "shape.wdf"
	elseif pg == "阴阳_英女侠旧" then
		pgs[1] = 293
		pgs[2] = 293
		pgs[3] = 295
		pgs[4] = 292
		pgs[6] = 297
		pgs[7] = 294
		pgs[8] = 296
		pgs[9] = 290
		pgs[10] = "shape.wdf"
	elseif pg == "吹雪_英女侠" then
		pgs[1] = 1984457860
		pgs[2] = 1984457860
		pgs[3] = 2659822722
		pgs[4] = 4091160803
		pgs[6] = 2259108135
		pgs[7] = 1616653577
		pgs[8] = 0x1a1a871e
		pgs[9] = 1671498156
		pgs[10] = "shape.wdf"
	elseif pg == "百花_英女侠" then
		pgs[1] = 1180240329
		pgs[2] = 1180240329
		pgs[3] = 2921076198
		pgs[4] = 2432608663
		pgs[6] = 1464871645
		pgs[7] = 2411376211
		pgs[8] = 0x4f96b7d3
		pgs[9] = 1686679961
		pgs[10] = "shape.wdf"
	elseif pg == "血之刺藤_英女侠" then
		pgs[1] = 543888368
		pgs[2] = 543888368
		pgs[3] = 3535124792
		pgs[4] = 1279996625
		pgs[6] = 676243872
		pgs[7] = 355830171
		pgs[8] = 3183836178
		pgs[9] = 373595036
		pgs[10] = "shape.wd3"
	elseif pg == "牧云清歌_英女侠" then
		pgs[1] = 4166360919
		pgs[2] = 4166360919
		pgs[3] = 2255696063
		pgs[4] = 3268785498
		pgs[6] = 0534627512
		pgs[7] = 1644779301
		pgs[8] = 0411350546
		pgs[9] = 3269704350
		pgs[10] = "shape.wd8"
	elseif pg == "霜陨_英女侠" then
		pgs[1] = 3617687903
		pgs[2] = 3617687903
		pgs[3] = 3055706917
		pgs[4] = 0667306037
		pgs[6] = 4248825161
		pgs[7] = 0234849785
		pgs[8] = 0336164631
		pgs[9] = 2174583476
		pgs[10] = "shape.wd9"
	elseif pg == "游龙惊鸿_英女侠旧" then
		pgs[1] = 17
		pgs[2] = 17
		pgs[3] = 19
		pgs[4] = 16
		pgs[6] = 368
		pgs[7] = 18
		pgs[8] = 361
		pgs[9] = 8
		pgs[10] = "shape.wdf"
	elseif pg == "金龙双剪_英女侠" then
		pgs[1] = 2024899093
		pgs[2] = 2024899093
		pgs[3] = 3727381444
		pgs[4] = 2340031682
		pgs[6] = 1687704448
		pgs[7] = 573860286
		pgs[8] = 1396936106
		pgs[9] = 2113820492
		pgs[10] = "shape.wd3"
	elseif pg == "仙人指路_英女侠" then
		pgs[1] = 1536229276
		pgs[2] = 1536229276
		pgs[3] = 3074198838
		pgs[4] = 781619913
		pgs[6] = 2533848487
		pgs[7] = 4069179535
		pgs[8] = 1975224690
		pgs[9] = 1681443649
		pgs[10] = "shape.wd3"
	elseif pg == "龙筋_英女侠" then
		pgs[1] = 983659718
		pgs[2] = 983659718
		pgs[3] = 4209944243
		pgs[4] = 1910275062
		pgs[6] = 2426563525
		pgs[7] = 3749832411
		pgs[8] = 0xa4346f9e
		pgs[9] = 1847888299
		pgs[10] = "shape.wdf"
	elseif pg == "灵蛇_英女侠旧" then
		pgs[1] = 262
		pgs[2] = 262
		pgs[3] = 264
		pgs[4] = 261
		pgs[6] = 272
		pgs[7] = 263
		pgs[8] = 265
		pgs[9] = 407
		pgs[10] = "shape.wdf"
	elseif pg == "吹雪_英女侠旧" then
		pgs[1] = 120
		pgs[2] = 120
		pgs[3] = 128
		pgs[4] = 119
		pgs[6] = 130
		pgs[7] = 121
		pgs[8] = 129
		pgs[9] = 117
		pgs[10] = "shape.wdf"
	
	elseif pg == "连珠神弓_羽灵神" then
		pgs[1] = 2326794251
		pgs[2] = 2326794251
		pgs[3] = 2712600528
		pgs[4] = 3987564547
		pgs[6] = 427605991
		pgs[7] = 3545789610
		pgs[8] = 49846298
		pgs[9] = 4190609956
		pgs[10] = "shape.wda"
	elseif pg == "腾云杖_羽灵神" then
		pgs[1] = 446004749
		pgs[2] = 446004749
		pgs[3] = 866998113
		pgs[4] = 30654504
		pgs[6] = 3664608621
		pgs[7] = 631837046
		pgs[8] = 3821365630
		pgs[9] = 172627858
		pgs[10] = "shape.wda"
	elseif pg == "墨铁拐_羽灵神" then
		pgs[1] = 581491157
		pgs[2] = 581491157
		pgs[3] = 95568889
		pgs[4] = 4136518094
		pgs[6] = 1603576455
		pgs[7] = 2492027915
		pgs[8] = 616237873
		pgs[9] = 2456783957
		pgs[10] = "shape.wda"
	elseif pg == "宝雕长弓_羽灵神" then
		pgs[1] = 4253393401
		pgs[2] = 4253393401
		pgs[3] = 1615127028
		pgs[4] = 3401409995
		pgs[6] = 2163483216
		pgs[7] = 2874238993
		pgs[8] = 290712464
		pgs[9] = 412551822
		pgs[10] = "shape.wda"
	elseif pg == "硬木弓_羽灵神" then
		pgs[1] = 150635600
		pgs[2] = 150635600
		pgs[3] = 1149486021
		pgs[4] = 1352870002
		pgs[6] = 3031812840
		pgs[7] = 2982615098
		pgs[8] = 3723589923
		pgs[9] = 1534728987
		pgs[10] = "shape.wda"
	elseif pg == "曲柳杖_羽灵神" then
		pgs[1] = 177392781
		pgs[2] = 177392781
		pgs[3] = 126506799
		pgs[4] = 2086224634
		pgs[6] = 2070674478
		pgs[7] = 2841942625
		pgs[8] = 1310664391
		pgs[9] = 945248214
		pgs[10] = "shape.wda"
	elseif pg == "冥火薄天_羽灵神" then
		pgs[1] = 2410653859
		pgs[2] = 2410653859
		pgs[3] = 412668278
		pgs[4] = 411982136
		pgs[6] = 2414080025
		pgs[7] = 3270399877
		pgs[8] = 1113080394
		pgs[9] = 2526125934
		pgs[10] = "shape.wda"
	elseif pg == "非攻_羽灵神" then
		pgs[1] = 2832976024
		pgs[2] = 2832976024
		pgs[3] = 1185088706
		pgs[4] = 4004334076
		pgs[6] = 3652084138
		pgs[7] = 384985378
		pgs[8] = 2233740441
		pgs[9] = 1204493716
		pgs[10] = "shape.wda"
	elseif pg == "庄周梦蝶_羽灵神" then
		pgs[1] = 101429091
		pgs[2] = 101429091
		pgs[3] = 1184168411
		pgs[4] = 3432364546
		pgs[6] = 3657330082
		pgs[7] = 548056296
		pgs[8] = 3683860076
		pgs[9] = 1443396752
		pgs[10] = "shape.wda"
	elseif pg == "鹿鸣_羽灵神" then
		pgs[1] = 430621291
		pgs[2] = 430621291
		pgs[3] = 3690027526
		pgs[4] = 2690907506
		pgs[6] = 2067206624
		pgs[7] = 3983937939
		pgs[8] = 2646614429
		pgs[9] = 664180130
		pgs[10] = "shape.wda"
	elseif pg == "碧海潮生_羽灵神" then
		pgs[1] = 2874500726
		pgs[2] = 2874500726
		pgs[3] = 2974311966
		pgs[4] = 3236853267
		pgs[6] = 2141705747
		pgs[7] = 3946028962
		pgs[8] = 4233351592
		pgs[9] = 2739863852
		pgs[10] = "shape.wda"
	elseif pg == "弦月_羽灵神" then
		pgs[1] = 4100861245
		pgs[2] = 4100861245
		pgs[3] = 2434737195
		pgs[4] = 2220097459
		pgs[6] = 0862692538
		pgs[7] = 2870088340
		pgs[8] = 1671028156
		pgs[9] = 2129606162
		pgs[10] = "shape.wda"
	elseif pg == "玉辉_羽灵神" then
		pgs[1] = 1799011000
		pgs[2] = 1799011000
		pgs[3] = 3831187618
		pgs[4] = 2997063111
		pgs[6] = 3312955607
		pgs[7] = 3013082841
		pgs[8] = 1939053710
		pgs[9] = 1116805220
		pgs[10] = "shape.wda"
	elseif pg == "业焰_羽灵神" then
		pgs[1] = 1471856529
		pgs[2] = 1471856529
		pgs[3] = 1895438642
		pgs[4] = 1769877803
		pgs[6] = 4245874516
		pgs[7] = 572738149
		pgs[8] = 1774544621
		pgs[9] = 565335915
		pgs[10] = "shape.wda"
	elseif pg == "龙鸣寒水_羽灵神" then
		pgs[1] = 2288999152
		pgs[2] = 2288999152
		pgs[3] = 3191815629
		pgs[4] = 975203915
		pgs[6] = 3559987378
		pgs[7] = 0xDE5063CD
		pgs[8] = 55816849
		pgs[9] = 1433469896
		pgs[10] = "shape.wda"
	elseif pg == "太极流光_羽灵神" then
		pgs[1] = 2848033504
		pgs[2] = 2848033504
		pgs[3] = 2656382753
		pgs[4] = 2977776427
		pgs[6] = 1141425103
		pgs[7] = 3968350241
		pgs[8] = 2316321007
		pgs[9] = 104034525
		pgs[10] = "shape.wda"
	elseif pg == "九霄风雷_羽灵神" then
		pgs[1] = 0158730771
		pgs[2] = 0158730771
		pgs[3] = 0132145415
		pgs[4] = 0764898549
		pgs[6] = 3046428836
		pgs[7] = 0756094913
		pgs[8] = 1838448889
		pgs[9] = 0827920690
		pgs[10] = "shape.wda"
	elseif pg == "若木_羽灵神" then
		pgs[1] = 4068136814
		pgs[2] = 4068136814
		pgs[3] = 0418458259
		pgs[4] = 3490606442
		pgs[6] = 3417142708
		pgs[7] = 3650939868
		pgs[8] = 3613858643
		pgs[9] = 3612898812
		pgs[10] = "shape.wda"
	elseif pg == "幽篁_羽灵神" then
		pgs[1] = 1385345996
		pgs[2] = 1385345996
		pgs[3] = 767991055
		pgs[4] = 2413280637
		pgs[6] = 3907295353
		pgs[7] = 4034909222
		pgs[8] = 590632369
		pgs[9] = 1102812055
		pgs[10] = "shape.wda"
	elseif pg == "百鬼_羽灵神" then
		pgs[1] = 433769011
		pgs[2] = 433769011
		pgs[3] = 1388983839
		pgs[4] = 2412124226
		pgs[6] = 3519132595
		pgs[7] = 2744030084
		pgs[8] = 3242785816
		pgs[9] = 4010155361
		pgs[10] = "shape.wda"
	elseif pg == "凤翼流珠_羽灵神" then
		pgs[1] = 3353149334
		pgs[2] = 3353149334
		pgs[3] = 1074224727
		pgs[4] = 160508292
		pgs[6] = 3400914167
		pgs[7] = 3537311768
		pgs[8] = 1351147384
		pgs[9] = 279371088
		pgs[10] = "shape.wda"
	elseif pg == "腾云杖_巫蛮儿" then
		pgs[1] = 3456418962
		pgs[2] = 3456418962
		pgs[3] = 1443524884
		pgs[4] = 2407737199
		pgs[6] = 4073450724
		pgs[7] = 4073450724
		pgs[8] = 2828185705
		pgs[9] = 2088694658
		pgs[10] = "shape.wda"
	elseif pg == "翡翠珠_巫蛮儿" then
		pgs[1] = 3539296504
		pgs[2] = 3539296504
		pgs[3] = 2255315467
		pgs[4] = 1802143462
		pgs[6] = 1510770330
		pgs[7] = 1930701898
		pgs[8] = 3505690179
		pgs[9] = 1435774063
		pgs[10] = "shape.wda"
	elseif pg == "琉璃珠_巫蛮儿" then
		pgs[1] = 1403236209
		pgs[2] = 1403236209
		pgs[3] = 1329700091
		pgs[4] = 1691312599
		pgs[6] = 786593580
		pgs[7] = 164320860
		pgs[8] = 2463504053
		pgs[9] = 2573416526
		pgs[10] = "shape.wda"
	elseif pg == "如意宝珠_巫蛮儿" then
		pgs[1] = 3047110383
		pgs[2] = 3047110383
		pgs[3] = 2280873549
		pgs[4] = 2717151389
		pgs[6] = 3043609869
		pgs[7] = 3638266331
		pgs[8] = 2356120530
		pgs[9] = 62625934
		pgs[10] = "shape.wda"
	elseif pg == "墨铁拐_巫蛮儿" then
		pgs[1] = 333733022
		pgs[2] = 333733022
		pgs[3] = 923276916
		pgs[4] = 1683281266
		pgs[6] = 3200804307
		pgs[7] = 2976979233
		pgs[8] = 160002331
		pgs[9] = 1565301941
		pgs[10] = "shape.wda"
	elseif pg == "曲柳杖_巫蛮儿" then
		pgs[1] = 3570910020
		pgs[2] = 3570910020
		pgs[3] = 923276916
		pgs[4] = 1683281266
		pgs[6] = 3312479705
		pgs[7] = 429861263
		pgs[8] = 3316485994
		pgs[9] = 1090261872
		pgs[10] = "shape.wda"
	elseif pg == "裂云啸日_巫蛮儿" then
		pgs[1] = 1953175087
		pgs[2] = 1953175087
		pgs[3] = 3696783624
		pgs[4] = 2606125215
		pgs[6] = 1758916755
		pgs[7] = 3089221190
		pgs[8] = 147933165
		pgs[9] = 3171772535
		pgs[10] = "shape.wda"
	elseif pg == "云雷万里_巫蛮儿" then
		pgs[1] = 3496291125
		pgs[2] = 3496291125
		pgs[3] = 1465968075
		pgs[4] = 1397554648
		pgs[6] = 2459508456
		pgs[7] = 2516514287
		pgs[8] = 3589170230
		pgs[9] = 3317700918
		pgs[10] = "shape.wda"
	elseif pg == "赤明_巫蛮儿" then
		pgs[1] = 0200658060
		pgs[2] = 0200658060
		pgs[3] = 3759594662
		pgs[4] = 3318654178
		pgs[6] = 4035253624
		pgs[7] = 2693415826
		pgs[8] = 2972224698
		pgs[9] = 3906907508
		pgs[10] = "shape.wda"
	elseif pg == "紫金葫芦_巫蛮儿" then
		pgs[1] = 2831632905
		pgs[2] = 2831632905
		pgs[3] = 3521304774
		pgs[4] = 3768453514
		pgs[6] = 2981305233
		pgs[7] = 2400756176
		pgs[8] = 1889441810
		pgs[9] = 2164075551
		pgs[10] = "shape.wda"
	elseif pg == "离火_巫蛮儿" then
		pgs[1] = 593251101
		pgs[2] = 593251101
		pgs[3] = 1674828781
		pgs[4] = 83754672
		pgs[6] = 3337153292
		pgs[7] = 341330281
		pgs[8] = 662302587
		pgs[9] = 1380161976
		pgs[10] = "shape.wda"
	elseif pg == "雪蟒霜寒_巫蛮儿" then
		pgs[1] = 739148944
		pgs[2] = 739148944
		pgs[3] = 1573479582
		pgs[4] = 1491739579
		pgs[6] = 851932811
		pgs[7] = 3605348497
		pgs[8] = 1658854000
		pgs[9] = 759781703
		pgs[10] = "shape.wda"
	elseif pg == "碧海潮生_巫蛮儿" then
		pgs[1] = 3910342400
		pgs[2] = 3910342400
		pgs[3] = 0733894543
		pgs[4] = 1050839754
		pgs[6] = 3505371915
		pgs[7] = 1647388270
		pgs[8] = 1832777753
		pgs[9] = 0844025414
		pgs[10] = "shape.wda"
	elseif pg == "弦月_巫蛮儿" then
		pgs[1] = 3736877850
		pgs[2] = 3736877850
		pgs[3] = 3588393432
		pgs[4] = 2220097459
		pgs[6] = 0280199730
		pgs[7] = 3405371659
		pgs[8] = 2586240981
		pgs[9] = 0420838884
		pgs[10] = "shape.wda"
	elseif pg == "飞星_巫蛮儿" then
		pgs[1] = 902532881
		pgs[2] = 902532881
		pgs[3] = 1311875894
		pgs[4] = 1263683269
		pgs[6] = 4006180572
		pgs[7] = 941967075
		pgs[8] = 1752683572
		pgs[9] = 173425117
		pgs[10] = "shape.wda"
	elseif pg == "回风舞雪_巫蛮儿" then
		pgs[1] = 1226070803
		pgs[2] = 1226070803
		pgs[3] = 3590109632
		pgs[4] = 3593543610
		pgs[6] = 3882426852
		pgs[7] = 136839080
		pgs[8] = 1265716525
		pgs[9] = 126040992
		pgs[10] = "shape.wda"
	elseif pg == "庄周梦蝶_巫蛮儿" then
		pgs[1] = 2699629829
		pgs[2] = 2699629829
		pgs[3] = 19941067
		pgs[4] = 2214888719
		pgs[6] = 2405414221
		pgs[7] = 3124365588
		pgs[8] = 181704645
		pgs[9] = 1598617101
		pgs[10] = "shape.wda"
	elseif pg == "玉辉_巫蛮儿" then
		pgs[1] = 2197847487
		pgs[2] = 2197847487
		pgs[3] = 647814036
		pgs[4] = 643336377
		pgs[6] = 3288644239
		pgs[7] = 869836664
		pgs[8] = 2936127898
		pgs[9] = 2134751551
		pgs[10] = "shape.wda"
	elseif pg == "业焰_巫蛮儿" then
		pgs[1] = 358788281
		pgs[2] = 358788281
		pgs[3] = 3187541069
		pgs[4] = 1276652632
		pgs[6] = 746435059
		pgs[7] = 1492176534
		pgs[8] = 4078550197
		pgs[9] = 2864410571
		pgs[10] = "shape.wda"
	elseif pg == "凤翼流珠_巫蛮儿" then
		pgs[1] = 2005711219
		pgs[2] = 2005711219
		pgs[3] = 1777115444
		pgs[4] = 738268467
		pgs[6] = 3554514707
		pgs[7] = 2166949971
		pgs[8] = 2242679788
		pgs[9] = 3110874208
		pgs[10] = "shape.wda"
	elseif pg == "鹿鸣_巫蛮儿" then
		pgs[1] = 2923599993
		pgs[2] = 2923599993
		pgs[3] = 862900418
		pgs[4] = 2806977290
		pgs[6] = 2678464587
		pgs[7] = 893469617
		pgs[8] = 3689245011
		pgs[9] = 780797617
		pgs[10] = "shape.wda"
	elseif pg == "月华_巫蛮儿" then
		pgs[1] = 1792811676
		pgs[2] = 1792811676
		pgs[3] = 4148391824
		pgs[4] = 3636515320
		pgs[6] = 3355609993
		pgs[7] = 4240539050
		pgs[8] = 3498546662
		pgs[9] = 2176161640
		pgs[10] = "shape.wda"
	elseif pg == "如意宝珠_杀破狼" then
		pgs[1] = 2994264484
		pgs[2] = 2994264484
		pgs[3] = 1404894523
		pgs[4] = 530980268
		pgs[6] = 3593075951
		pgs[7] = 4288686185
		pgs[8] = 834957611
		pgs[9] = 935164006
		pgs[10] = "shape.wda"
	elseif pg == "翡翠珠_杀破狼" then
		pgs[1] = 1888438119
		pgs[2] = 1888438119
		pgs[3] = 832082873
		pgs[4] = 2462082254
		pgs[6] = 3335305851
		pgs[7] = 3225276990
		pgs[8] = 3777022322
		pgs[9] = 2618824675
		pgs[10] = "shape.wda"
	elseif pg == "连珠神弓_杀破狼" then
		pgs[1] = 3896611853
		pgs[2] = 3896611853
		pgs[3] = 2036432029
		pgs[4] = 2102929671
		pgs[6] = 3589969117
		pgs[7] = 3876338026
		pgs[8] = 1811002066
		pgs[9] = 1930889295
		pgs[10] = "shape.wda"
	elseif pg == "琉璃珠_杀破狼" then
		pgs[1] = 1347542308
		pgs[2] = 1347542308
		pgs[3] = 1084648267
		pgs[4] = 2598475041
		pgs[6] = 220293482
		pgs[7] = 309382841
		pgs[8] = 3237534358
		pgs[9] = 4248308764
		pgs[10] = "shape.wda"
	elseif pg == "宝雕长弓_杀破狼" then
		pgs[1] = 3187707461
		pgs[2] = 3187707461
		pgs[3] = 3770288341
		pgs[4] = 2752043077
		pgs[6] = 2434290964
		pgs[7] = 3329145004
		pgs[8] = 1745722591
		pgs[9] = 9444076
		pgs[10] = "shape.wda"
	elseif pg == "硬木弓_杀破狼" then
		pgs[1] = 3001778802
		pgs[2] = 3001778802
		pgs[3] = 2629114281
		pgs[4] = 370350902
		pgs[6] = 3945843828
		pgs[7] = 297727953
		pgs[8] = 1273865503
		pgs[9] = 1767508772
		pgs[10] = "shape.wda"
	elseif pg == "裂云啸日_杀破狼" then
		pgs[1] = 1323042371
		pgs[2] = 1323042371
		pgs[3] = 2471306192
		pgs[4] = 2206427343
		pgs[6] = 3359417010
		pgs[7] = 3912741797
		pgs[8] = 753797811
		pgs[9] = 656525376
		pgs[10] = "shape.wda"
	elseif pg == "云雷万里_杀破狼" then
		pgs[1] = 0929693147
		pgs[2] = 0929693147
		pgs[3] = 2339783982
		pgs[4] = 2673184399
		pgs[6] = 1053032888
		pgs[7] = 1343023772
		pgs[8] = 1593490105
		pgs[9] = 0305349853
		pgs[10] = "shape.wda"
	elseif pg == "赤明_杀破狼" then
		pgs[1] = 0454754499
		pgs[2] = 0454754499
		pgs[3] = 4014535055
		pgs[4] = 1847890126
		pgs[6] = 0039518222
		pgs[7] = 2065247607
		pgs[8] = 1441775582
		pgs[9] = 0138471714
		pgs[10] = "shape.wda"
	elseif pg == "雪蟒霜寒_羽灵神" then
		pgs[1] = 2930005782
		pgs[2] = 2930005782
		pgs[3] = 1411447909
		pgs[4] = 1157464245
		pgs[6] = 1798260255
		pgs[7] = 3245955639
		pgs[8] = 1135006044
		pgs[9] = 272976564
		pgs[10] = "shape.wda"
	elseif pg == "太极流光_杀破狼" then
		pgs[1] = 2074525537
		pgs[2] = 2074525537
		pgs[3] = 449187270
		pgs[4] = 2759360079
		pgs[6] = 3413608092
		pgs[7] = 1682905191
		pgs[8] = 4051367450
		pgs[9] = 3252077695
		pgs[10] = "shape.wda"
	elseif pg == "九霄风雷_杀破狼" then
		pgs[1] = 3704392067
		pgs[2] = 3704392067
		pgs[3] = 3632605747
		pgs[4] = 2197826216
		pgs[6] = 2845081681
		pgs[7] = 2020968771
		pgs[8] = 3450511222
		pgs[9] = 1885695436
		pgs[10] = "shape.wda"
	elseif pg == "若木_杀破狼" then
		pgs[1] = 2783866786
		pgs[2] = 2783866786
		pgs[3] = 1862994822
		pgs[4] = 1445406110
		pgs[6] = 1501063042
		pgs[7] = 1500235485
		pgs[8] = 3264257605
		pgs[9] = 3963075748
		pgs[10] = "shape.wda"
	elseif pg == "飞星_杀破狼" then
		pgs[1] = 1920229574
		pgs[2] = 1920229574
		pgs[3] = 3670774470
		pgs[4] = 1565695987
		pgs[6] = 612719827
		pgs[7] = 304215519
		pgs[8] = 15688186
		pgs[9] = 3390941259
		pgs[10] = "shape.wda"
	elseif pg == "冥火薄天_杀破狼" then
		pgs[1] = 871369705
		pgs[2] = 871369705
		pgs[3] = 1399674031
		pgs[4] = 1805010867
		pgs[6] = 1620002437
		pgs[7] = 1839576620
		pgs[8] = 621841422
		pgs[9] = 3126248794
		pgs[10] = "shape.wda"
	elseif pg == "幽篁_杀破狼" then
		pgs[1] = 1663842501
		pgs[2] = 1663842501
		pgs[3] = 2110884946
		pgs[4] = 4241477506
		pgs[6] = 4245424904
		pgs[7] = 1184291529
		pgs[8] = 3595306000
		pgs[9] = 3541370331
		pgs[10] = "shape.wda"
	elseif pg == "百鬼_杀破狼" then
		pgs[1] = 2607438844
		pgs[2] = 2607438844
		pgs[3] = 894755654
		pgs[4] = 1601466888
		pgs[6] = 520922337
		pgs[7] = 3106122659
		pgs[8] = 610584642
		pgs[9] = 1809776963
		pgs[10] = "shape.wda"
	elseif pg == "非攻_杀破狼" then
		pgs[1] = 1885839562
		pgs[2] = 1885839562
		pgs[3] = 3957124377
		pgs[4] = 3204102825
		pgs[6] = 2379415806
		pgs[7] = 1950788981
		pgs[8] = 1127738414
		pgs[9] = 2661471858
		pgs[10] = "shape.wda"
	elseif pg == "紫金葫芦_杀破狼" then
		pgs[1] = 994535269
		pgs[2] = 994535269
		pgs[3] = 4014927528
		pgs[4] = 3310480847
		pgs[6] = 2831639351
		pgs[7] = 122206673
		pgs[8] = 1940957103
		pgs[9] = 2257546251
		pgs[10] = "shape.wda"
	elseif pg == "回风舞雪_杀破狼" then
		pgs[1] = 723925966
		pgs[2] = 723925966
		pgs[3] = 1798299344
		pgs[4] = 1212380108
		pgs[6] = 1637540313
		pgs[7] = 2653292719
		pgs[8] = 257191592
		pgs[9] = 2659671813
		pgs[10] = "shape.wda"
	elseif pg == "离火_杀破狼" then
		pgs[1] = 1736891488
		pgs[2] = 1736891488
		pgs[3] = 1516097158
		pgs[4] = 1419099406
		pgs[6] = 619566973
		pgs[7] = 332324123
		pgs[8] = 942082261
		pgs[9] = 4082318050
		pgs[10] = "shape.wda"
	elseif pg == "月华_杀破狼" then
		pgs[1] = 3883698348
		pgs[2] = 3883698348
		pgs[3] = 1535796704
		pgs[4] = 81237364
		pgs[6] = 786918783
		pgs[7] = 1149367266
		pgs[8] = 2874084219
		pgs[9] = 2578429791
		pgs[10] = "shape.wda"
	elseif pg == "龙鸣寒水_杀破狼" then
		pgs[1] = 2135796424
		pgs[2] = 2135796424
		pgs[3] = 4117872420
		pgs[4] = 4105996895
		pgs[6] = 2127507146
		pgs[7] = 4261464327
		pgs[8] = 1514939238
		pgs[9] = 748425136
		pgs[10] = "shape.wda"
	elseif pg == "杀破狼" then
		pgs[1] = 2232599242
		pgs[2] = 2232599242
		pgs[3] = 3215162495
		pgs[4] = 3629275056
		pgs[6] = 4241012400
		pgs[7] = 3547444917
		pgs[8] = 1721194312
		pgs[9] = 3836921096
		pgs[10] = "shape.wda"
	elseif pg == "杀破狼_宝珠" then
		pgs[1] = 3067304876
		pgs[2] = 3067304876
		pgs[3] = 3215162495
		pgs[4] = 1186759867
		pgs[6] = 1266038770
		pgs[7] = 2576943278
		pgs[8] = 1721194312
		pgs[9] = 3836921096
		pgs[10] = "shape.wda"
	elseif pg == "杀破狼_弓弩" then
		pgs[1] = 2232599242
		pgs[2] = 2232599242
		pgs[3] = 3215162495
		pgs[4] = 3629275056
		pgs[6] = 4241012400
		pgs[7] = 3547444917
		pgs[8] = 1721194312
		pgs[9] = 3836921096
		pgs[10] = "shape.wda"
	elseif pg == "杀破狼_弓弩1" then
		pgs[1] = 3555676410
		pgs[2] = 3555676410
		pgs[3] = 3215162495
		pgs[4] = 3629275056
		pgs[6] = 0167917977
		pgs[7] = 2697172445
		pgs[8] = 1721194312
		pgs[9] = 3836921096
		pgs[10] = "shape.wda"
	elseif pg == "巫蛮儿" then
		pgs[1] = 2404345852
		pgs[2] = 2404345852
		pgs[3] = 857427883
		pgs[4] = 3299007490
		pgs[6] = 3847342356
		pgs[7] = 2219256477
		pgs[8] = 3377965731
		pgs[9] = 1458812347
		pgs[10] = "shape.wda"
	elseif pg == "巫蛮儿_宝珠" then
		pgs[1] = 724036542
		pgs[2] = 724036542
		pgs[3] = 857427883
		pgs[4] = 1487210709
		pgs[6] = 2600092653
		pgs[7] = 4235120544
		pgs[8] = 3377965731
		pgs[9] = 170880794
		pgs[10] = "shape.wda"
	elseif pg == "巫蛮儿_法杖" then
		pgs[1] = 2404345852
		pgs[2] = 2404345852
		pgs[3] = 857427883
		pgs[4] = 3299007490
		pgs[6] = 3847342356
		pgs[7] = 2219256477
		pgs[8] = 3377965731
		pgs[9] = 1458812347
		pgs[10] = "shape.wda"
	elseif pg == "羽灵神" then
		pgs[1] = 1894911422
		pgs[2] = 1894911422
		pgs[3] = 570130129
		pgs[4] = 1552868103
		pgs[6] = 1384231887
		pgs[7] = 3035774294
		pgs[8] = 1198313117
		pgs[9] = 1516641634
		pgs[10] = "shape.wda"
	elseif pg == "羽灵神_法杖" then
		pgs[1] = 529648379
		pgs[2] = 529648379
		pgs[3] = 570130129
		pgs[4] = 1552868103
		pgs[6] = 2280958058
		pgs[7] = 4138194582
		pgs[8] = 1198313117
		pgs[9] = 1516641634
		pgs[10] = "shape.wda"
	elseif pg == "羽灵神_弓弩" then
		pgs[1] = 1894911422
		pgs[2] = 1894911422
		pgs[3] = 570130129
		pgs[4] = 1552868103
		pgs[6] = 1384231887
		pgs[7] = 3035774294
		pgs[8] = 1198313117
		pgs[9] = 1516641634
		pgs[10] = "shape.wda"
	elseif pg == "羽灵神_弓弩1" then
		pgs[1] = 0042392635
		pgs[2] = 0042392635
		pgs[3] = 0570130129
		pgs[4] = 1552868103
		pgs[6] = 1139367548
		pgs[7] = 0xB4F23D56
		pgs[8] = 1750053013
		pgs[9] = 1516641634
		pgs[10] = "shape.wda"

		--------------------------------------手动注释为了测试
	
	elseif pg == "赤炎兽" or pg == "进阶赤炎兽" then
		pgs[1] = 156532448
		pgs[2] = 156532448
		pgs[3] = 2486594272
		pgs[4] = 777916624
		pgs[6] = 2486594272
		pgs[7] = 956931642
		pgs[8] = 304465120
		pgs[9] = 214832060
		pgs[10] = "zdy2.rpk"
	elseif pg == "九尾狐" or pg == "进阶九尾狐" then
		pgs[1] = 1131301040
		pgs[2] = 1131301040
		pgs[3] = 1886636512
		pgs[4] = 4029545184
		pgs[6] = 1886636512
		pgs[7] = 4142866400
		pgs[8] = 1710481696
		pgs[9] = 2556300849
		pgs[10] = "zdy2.rpk"
	
	elseif pg == "帮派妖兽" then
		pgs[1] = 0xC1816D39
		pgs[2] = 0xC1816D39
		pgs[3] = 0xD225AEF5
		pgs[4] = 0x0CC07284
		pgs[6] = 0xD252E998
		pgs[7] = 0x048CC7DD
		pgs[8] = 0x6c396ad2
		pgs[9] = 0x2E8C40EC
		pgs[10] = "shape.wdf"
	elseif pg == "战斗坐骑1" then
		pgs[1] = 45188947
		pgs[2] = 45188947
		pgs[3] = 437683438
		pgs[4] = 2051522148
		pgs[6] = 3832766912 --
		pgs[7] = 37818122
		pgs[8] = 81627590
		pgs[9] = 2718427437
		pgs[10] = "shape.wdc"
	elseif pg == "战斗坐骑2" then
		pgs[1] = 3077903783
		pgs[2] = 3077903783
		pgs[3] = 1632113367
		pgs[4] = 3496875568
		pgs[6] = 786303190 --
		pgs[7] = 2507433576
		pgs[8] = 1752376507
		pgs[9] = 1997094673
		pgs[10] = "shape.wdc"
	-- elseif pg == "谛听" then
	-- 	pgs[1] = 134217729 --攻击
	-- 	pgs[2] = 134217729
	-- 	pgs[3] = 134217730
	-- 	pgs[4] = 134217731
	-- 	pgs[6] = 134217732 --
	-- 	pgs[7] = 134217732
	-- 	pgs[8] = 134217733
	-- 	pgs[9] = 134217731
	-- 	pgs[10] = "zdy4.rpk"
	-- elseif pg == "进阶谛听" then
	-- 	pgs[1] = 134217750
	-- 	pgs[2] = 134217750
	-- 	pgs[3] = 134217746
	-- 	pgs[4] = 134217747
	-- 	pgs[6] = 134217748 --
	-- 	pgs[7] = 134217745
	-- 	pgs[8] = 134217749
	-- 	pgs[9] = 134217747
	-- 	pgs[10] = "zdy4.rpk"
	elseif pg == "蓐收" then
		pgs[1] = 625622240
		pgs[2] = 625622240
		pgs[3] = 1761893344
		pgs[4] = 2889917408
		pgs[6] = 1761893344
		pgs[7] = 350261728
		pgs[8] = 1246851296
		pgs[9] = 2770176992
		pgs[10] = "zdy2.rpk"
	elseif pg == "女娲" then
		pgs[1] = 3583069920
		pgs[2] = 3583069920
		pgs[3] = 86406368
		pgs[4] = 2110343904
		pgs[6] = 3123920864
		pgs[7] = 86406368
		pgs[8] = 2110343904
		pgs[9] = 1746555872
		pgs[10] = "zdy2.rpk"
	elseif pg == "百鬼" then
		pgs[1] = 4228702944
		pgs[2] = 4228702944
		pgs[3] = 645064160
		pgs[4] = 1244814304
		pgs[6] = 645064160
		pgs[7] = 1314045408
		pgs[8] = 2400324832
		pgs[9] = 2753928672
		pgs[10] = "zdy2.rpk"
	elseif pg == "飞鱼" then
		pgs[1] = 2317392864
		pgs[2] = 2317392864
		pgs[3] = 2279908064
		pgs[4] = 1124596960
		pgs[6] = 2279908064
		pgs[7] = 1808798176
		pgs[8] = 2494275552
		pgs[9] = 1124596960
		pgs[10] = "zdy2.rpk"
	elseif pg == "帝江" then
		pgs[1] = 466084832
		pgs[2] = 466084832
		pgs[3] = 3854950624
		pgs[4] = 2508374496
		pgs[6] = 3854950624
		pgs[7] = 3214841312
		pgs[8] = 2199068896
		pgs[9] = 2140888800
		pgs[10] = "zdy2.rpk"
	elseif pg == "强良" then
		pgs[1] = 151806944
		pgs[2] = 151806944
		pgs[3] = 3000903392
		pgs[4] = 378390240
		pgs[6] = 3000903392
		pgs[7] = 2329538272
		pgs[8] = 3906485472
		pgs[9] = 3906485472
		pgs[10] = "zdy2.rpk"
	elseif pg == "烛龙" then
		pgs[1] = 0x665826e0
		pgs[2] = 0x665826e0
		pgs[3] = 0x524c11e0
		pgs[4] = 0x8c9848e0
		pgs[6] = 0x6d0ade0
		pgs[7] = 0x4f38e5e0
		pgs[8] = 0x6d0ade0
		pgs[9] = 0x8c9848e0
		pgs[10] = "zdy2.rpk"
	elseif pg == "饕餮" then
		pgs[1] = 0xd000387
		pgs[2] = 0xd000387
		pgs[3] = 0xd000389
		pgs[4] = 0xd000388
		pgs[6] = 0xd000390
		pgs[7] = 0xd000392
		pgs[8] = 0xd000393
		pgs[9] = 0xd000391
		pgs[10] = "zdy2.rpk"
	-- elseif pg == "超级鲲鹏" or pg == "进阶超级鲲鹏" then
	-- 	pgs[1] = 0x11000011
	-- 	pgs[2] = 0x11000010
	-- 	pgs[3] = 0x11000013
	-- 	pgs[4] = 0x11000006
	-- 	pgs[6] = 0x11000008
	-- 	pgs[7] = 0x11000012
	-- 	pgs[8] = 0x11000007
	-- 	pgs[9] = 0x11000009
	-- 	pgs[10] = "zdy5.rpk"

		--########################################################?自己修改?##########################################
end
	-- 1是攻击 2是第二种形态攻击 3是死亡 4是防御 6是待战 7是施法 8是跑去 9是挨打 10是资源包
	if pgs[10] == nil then
		local jps0 = 取所有模型(pg2)
		if jps0 ~= nil and jps0.待战 ~= nil then
			pgs[1] = jps0.攻击
			pgs[2] = jps0.攻击B
			pgs[3] = jps0.倒地
			pgs[4] = jps0.防御
			pgs[6] = jps0.待战
			pgs[7] = jps0.施法
			pgs[8] = jps0.跑去
			pgs[9] = jps0.挨打
		end
	end
	-- 1是攻击 2是第二种形态攻击 3是死亡 4是防御 6是待战 7是施法 8是跑去 9是挨打 10是资源包
	return pgs
end

function 取站立坐骑(名称)
	if 名称 == "山河画卷" then
		return { 0x0FF3F9E2, 0x2D6915E1, "goods.wdf" }
	elseif 名称 == "凌霄飞剑" then --
		return { 0x4931C9EC, 0xEEB83B53, "goods.wdf" }
	elseif 名称 == "瑞彩祥云" then --
		return { 0x089A78C7, 0x43FB6660, "goods.wdf" }
	elseif 名称 == "风火飞轮" then --
		return { 0x3815C169, 0x3158C169, "goods.wdf" }
	elseif 名称 == "落英纷飞" then --
		return { 0x32BE003F, 0x32BE003F, "goods.wdf" }
	elseif 名称 == "凤舞灵蝶" then --
		return { 0xF809B4D1, 0x6D33C1DB, "goods.wdf" }
	elseif 名称 == "七彩祥云" then --
		return { 0xD4CED8F7, 0x4391944D, "goods.wdf" }
	elseif 名称 == "齐天小轿" then --
		return { 0xD81F56A7, 0x6ED61C4C, "goods.wdf" }
	elseif 名称 == "流云玉佩" then --
		return { 0xF92EAB94, 0x40DBF469, "goods.wdf" }
	end
end

function 坐骑库(id, zq, sp)
	if zq == nil then
		return
	end
	if sp ~= nil then
		if sp ~= "空" then
			sp = sp.名称
		end
	else
		sp = "空"
	end
	if id =="影精灵" then
		id ="骨精灵"
	end
	-- 站立，行走
	local zqs = {
		宝贝葫芦 = { 0x63C1AA04, 0x939B6AA2, 1, "shape.wd5" },
		神气小龟 = { 0xE88353, 0x702610D3, 2, "shape.wd5" },
		汗血宝马 = { 0x7B49FA9A, 0x3F76F5B2, 3, "shape.wd5" },
		欢喜羊羊 = { 0x8D4DBAAE, 0x2636063C, 4, "shape.wd5" },
		魔力斗兽 = { 0x4B0E16F1, 0x28F7499E, 3, "shape.wd5" },
		披甲战狼 = { 0x3B0CC9, 0xF6B76F79, 4, "shape.wd5" },
		闲云野鹤 = { 0x49CAB729, 0x1544FBAD, 3, "shape.wd5" },
		云魅仙鹿 = { 0x621ECF47, 0x98D7DB2, 4, "shape.wd5" },
		-- 战火穷奇 = { 0x9EA86797, 0x7B745DE4, 2, "shape.wdf" },
		暗影战豹 = { 0x2283C8E4, 0x256B2E02, 2, "1shape.wdf" },
		--战火穷奇 = { 0x0A5927A8, 0x0BDDE762, 2, "shape.wdf" },
		雷霆战豹 = { 0x33668F97, 0xDD66EE9C, 2, "shape.wdf" },
		七彩神驴 = { 0x03633E07, 0x01040DCE, 2, "shape.wdf" },
		七彩小驴 = { 0x03633E07, 0x01040DCE, 2, "shape.wdf" },
		九尾神狐 = { 0xAC08BBC1, 0x2F2B02F5, 2, "shape.wdf" },
		九尾冰狐 = { 0xAC08BBC1, 0x2F2B02F5, 2, "shape.wdf" },
		粉红小驴 = { 0xC7655C83, 0xAD4889BD, 2, "shape.wdf" },
		神行小驴 = { 0x9CEA9EAE, 0xDA83EF16, 2, "shape.wdf" },
		怒雷狂狮 = { 0xEC31AF3B, 0x55E4FB5C, 2, "shape.wdf" },
		妙缘暖犀 = { 0x52282FC2, 0x843816AD, 2, "1shape.wdf" },
		玉脂福羊 = {946576361,1280347072,2,"shape.wdb"},
		玄冰灵虎 = {587079486,2812695545,2,"shape.wd8"},
		紫霞云麒 = {2180734458,1711224353,2,"shape.wd7"},
		御风灵貂 = { 0x5BCF5B7B, 0x0A6E3345, 2, "1shape.wdf" },
		鹤雪锦犀 = { 0x2C490405, 0x61F5973D, 2, "1shape.wdf" },
		沉星寒犀 = { 0x43E7BE1F, 0x77C1746C, 2, "1shape.wdf" },
		黄牛 = { 0x3A8FCA30, 0xEBDD5700, 2, "zuoqi.wdf" },
		青霄天麟 = { 0x3D66E3DF, 0x367B3DF0, 2, "zuoqi.wdf" },
		莽林猛犸 = { 0xD3DFAA00, 0x183ADF00, 4, "zuoqi.wdf" },
		--玄冰灵虎 = { 0xDA3F18D0, 0x7E948F3F, 2, "zuoqi.wdf" },
		玄火神驹 = { 0xFADF7000, 0x8CD3DF00, 4, "zuoqi.wdf" },
		魔骨战熊 = { 0x437FA86A, 0x18663DF0, 2, "zuoqi.wdf" },
		天使猪猪 = { 0xFBCFD808, 0x3A4A8FC0, 2, "zuoqi.wdf" },
		月影天马 = { 0xD894F800, 0x87FCF6F0, 4, "zuoqi.wdf" },
		沙漠驼铃 = { 0x57F3EF00, 0x3D2F3D2F, 2, "zuoqi.wdf" },
		琉璃宝象 = { 0x7E82F33A, 0x578FD857, 2, "zuoqi.wdf" },
		粉色猪猪 = { 0x38DADF3D, 0xE7134866, 2, "zuoqi.wdf" },
		傻猫 = { 0x13DFE348, 0x8CDA8C00, 4, "zuoqi.wdf" },
		草泥马 = { 0xB93D5700, 0x1827DF00, 2, "zuoqi.wdf" },
		白金战火穷奇 = {0x023E3D97,0x0536E9A02,2, "zuoqi.wdf" },
		吾皇 = { 0xB93D5700, 0x1827DF00, 2, "zuoqi.wdf" },
		-- 大象 = {0xc01d7558,0x343087b3,1,"shape.wd4"},蝎子坐骑 = {0x94FD9126,0xFCB0282F,2,"shape.wdc"},
		-- 紫霞云麒 = {2180734458,1711224353,2,"shape.wd7"},玄冰灵虎 = {587079486,2812695545,2,"shape.wd8"},
		-- 七彩小驴 = {1026769966,3894750331,2,"shape.wd8"},玄火神驹 = {1426370750,3906810689,2,"shape.wd8"},
		-- 大黑虎坐骑 = {0x33668F97,0xDD66EE9C,2,"shape.wdc"},黄金象坐骑 = {0xD8E8D600,0x4771DEA3,2,"shape.wdc"},
	}
	local sps = {
		展翅高飞 = { 0x2DC16EF4, 0x47A59E6C, "shape.wd5" },
		旗开得胜 = { 0x4FB7A645, 0xC89B8D7B, "shape.wd5" },
		霸王雄风 = { 0x8AC5514E, 0xD30116BE, "shape.wd5" },
		独眼观天 = { 0xCB41BF07, 0x6D415352, "shape.wd5" },
		威武不屈 = { 0xE385373B, 0x71FE0155, "shape.wd5" },
		深藏不露 = { 0x2529E5A5, 0x51C03CD4, "shape.wd5" },
		异域浓情 = { 0xE8B35E96, 0x3949C769, "shape.wd5" },
		流星天马 = { 0x72489CFD, 0x4D136355, "shape.wd5" },
		威猛将军 = { 0x5BDBA7CB, 0x5CDC5A5E, "shape.wd5" },
		知情达理 = { 0xCCBF24B8, 0xFE4B37F2, "shape.wd5" },
		气宇轩昂 = { 0xEC4C09DF, 0x57B096DF, "shape.wd5" },
		如花似玉 = { 0xA6966FD2, 0xCA8864D1, "shape.wd5" },
		傲视天下 = { 0xBB906984, 0x2549904, "shape.wd5" },
		铁血豪情 = { 0x742FBF19, 0x103FFB93, "shape.wd5" },
		唯我独尊 = { 0x7F6FFC35, 0x716B5DC1, "shape.wd5" },
		叱咤风云 = { 0xAB007164, 0x2E177381, "shape.wd5" },
		异域风情 = { 0xAB007164, 0x2E177381, "shape.wd5" },
		假面勇者 = { 0xE7CB8205, 0xE615404, "shape.wd5" },
		披星戴月 = { 0xE0CB07C8, 0xD9D958E6, "shape.wd5" },
		霓裳魅影 = { 0x8ED6D8CC, 0xC5D8F53D, "shape.wd5" },
		烈焰燃情 = { 0x8C575D26, 0x7B15590A, "shape.wd5" },
		天雨流芳 = { 0x503F394B, 0x23BF657B, "shape.wd5" },
		灵光再现 = { 0xC4D118C5, 0xCBC6930A, "shape.wd5" },
		倾国倾城 = { 0x1F01B8BE, 0xBDA4DDAB, "shape.wd5" },
		空 = {}
	}
	local scs
	if id == "飞燕女" then
		scs = { { 0x4492502E, 0xF6D6D5E6, "common/shape.wdf" }, { 0xDCB946EC, 0xDCC84D4E, "common/shape.wdf" }, { 0xDF01F29D, 0xA77B55E4, "common/shape.wdf" }, { 0x6E0AD379, 0x87C7A650, "common/shape.wdf" } }
	elseif id == "英女侠" then
		scs = { { 0xD43912A9, 0xD2D4CAD3, "shape.wd5" }, { 0x70291C50, 0x30CABF19, "shape.wd5" }, { 0x726C392E, 0x68FB1969, "shape.wd5" }, { 0x2474769B, 0xACD868DE, "shape.wd5" } }
	elseif id == "巫蛮儿" then
		scs = { { 0xF2BC9369, 0xB11F6642, "shape.wda" }, { 0x9B73C75F, 0xDA0A8B06, "shape.wda" }, { 0x2F5EAD3F, 0x499F9D37, "shape.wda" }, { 0xCCC0985C, 0xC8F56BA3, "shape.wda" } }
	elseif id == "偃无师" then
		scs = { { 0x281c3fee, 0xee3624a8, "common/shape.wdf" }, { 0x281c3fee, 0xee3624a8, "common/shape.wdf" }, { 0x281c3fee, 0xee3624a8, "common/shape.wdf" }, { 0x281c3fee, 0xee3624a8, "common/shape.wdf" } }
	elseif id == "逍遥生" then
		scs = { { 0xA35491C9, 0x49D7C76E, "common/shape.wdf" }, { 0xB770EAD4, 0x9A1479D8, "common/shape.wdf" }, { 0x76D629EA, 0xFB50C58F, "common/shape.wdf" }, { 0x3D392EF4, 0xA5E02A65, "common/shape.wdf" } }
	elseif id == "剑侠客" then
		scs = { { 0xABCAB214, 0xABCAB215, "shape.wd5" }, { 0x32DA9583, 0xEC9AC961, "shape.wd5" }, { 0x766731D, 0x8C50358A, "shape.wd5" }, { 0xA95A126D, 0x513DDE6C, "shape.wd5" } }
	elseif id == "狐美人" then
		scs = { { 0xE3123BDA, 0x956305B5, "common/shape.wdf" }, { 0xFB798485, 0xD1997415, "common/shape.wdf" }, { 0x64C21A63, 0xD5D2FA14, "common/shape.wdf" }, { 0xBCD86DDA, 0xF0062006, "common/shape.wdf" } }
	elseif id == "骨精灵" then
		scs = { { 0xBEEF3795, 0x3C6BF98F, "common/shape.wdf" }, { 0xBEEF3795, 0x3C6BF98F, "common/shape.wdf" }, { 0xBEEF3795, 0x3C6BF98F, "common/shape.wdf" }, { 0xBEEF3795, 0x3C6BF98F, "common/shape.wdf" } }
		--scs = {{0xBEEF3795,0x3C6BF98F,"common/shape.wdf"},{0xE2C1CDE4,0xBAD0F711,"common/shape.wdf"},{0x75B09FA1,0x5E5736EE,"common/shape.wdf"},{0x83DD50D3,0xB84C7C38,"common/shape.wdf"}}
		--scs = {{0xBEEF3795,0x3C6BF98F,"shape.wd5"},{0xE2C1CDE4,0xBAD0F711,"shape.wd5"},{0x75B09FA1,0x5E5736EE,"shape.wd5"},{0x83DD50D3,0xB84C7C38,"shape.wd5"}}
	elseif id == "鬼潇潇" then
		scs = { { 0x94c5bfb, 0xfe2d2b18, "common/shape.wdf" }, { 0x94c5bfb, 0xfe2d2b18, "common/shape.wdf" }, { 0x94c5bfb, 0xfe2d2b18, "common/shape.wdf" }, { 0x94c5bfb, 0xfe2d2b18, "common/shape.wdf" } }
	elseif id == "杀破狼" then
		scs = { { 0xE137A55D, 0xDB553291, "shape.wda" }, { 0x8BEA762D, 0x14EE7109, "shape.wda" }, { 0x46A79E5, 0x3CD5444, "shape.wda" }, { 0xF974CEB, 0x54A8F096, "shape.wda" } }
	elseif id == "巨魔王" then
		scs = { { 0x21ED721D, 0x5A05E1C0, "common/shape.wdf" }, { 0x9DFEB143, 0x77C20678, "common/shape.wdf" }, { 0x1AF61311, 0x6E370D46, "common/shape.wdf" }, { 0xCC1426ED, 0x39FE09DB, "common/shape.wdf" } }
	elseif id == "虎头怪" then
		scs = { { 0x99AD84CD, 0x9FA6D533, "common/shape.wdf" }, { 0xF56603D1, 0x83DBBA94, "common/shape.wdf" }, { 0x37FFB9DF, 0x64426F93, "common/shape.wdf" }, { 0x95BC0425, 0xC6053278, "common/shape.wdf" } }
	elseif id == "舞天姬" then
		scs = { { 0x54DB4F4D, 0xCB722714, "common/shape.wdf" }, { 0xD92FC3DE, 0x809F42FE, "common/shape.wdf" }, { 0x212848A1, 0xAAD7CB93, "common/shape.wdf" }, { 0xB44DF735, 0xECA5DB49, "common/shape.wdf" } }
	elseif id == "玄彩娥" then
		scs = { { 0x861EE4D9, 0x9F2F9C11, "common/shape.wdf" }, { 0x3316877C, 0x31F77503, "common/shape.wdf" }, { 0x779A3DF, 0x622664DC, "common/shape.wdf" }, { 0xA6FD7850, 0xB9FD9DBD, "common/shape.wdf" } }
	elseif id == "桃夭夭" then
		scs = { { 0x5aa5e164, 0x2c255cee, "common/shape.wdf" }, { 0x5aa5e164, 0x2c255cee, "common/shape.wdf" }, { 0x5aa5e164, 0x2c255cee, "common/shape.wdf" }, { 0x5aa5e164, 0x2c255cee, "common/shape.wdf" } }
	elseif id == "羽灵神" then
		scs = { { 0x7D31F43E, 0x76E4E3D6, "shape.wda" }, { 0x7B86A5F4, 0xE496A2D7, "shape.wda" }, { 0x8072202A, 0x6528F013, "shape.wda" }, { 0x4BBD02E6, 0x694A236B, "shape.wda" } }
	elseif id == "神天兵" then
		scs = { { 0x77104303, 0xBC38000F, "common/shape.wdf" }, { 0xF4EF98B5, 0x7C731501, "common/shape.wdf" }, { 0x7F6D09AB, 0x13AD1C23, "common/shape.wdf" }, { 0x60A47C21, 0x63930A54, "common/shape.wdf" } }
	elseif id == "龙太子" then
		-- scs = {{0x4F27A59F,0x801F438D,"common/shape.wdf"},{0x643F7DDE,0x801F438D,"common/shape.wdf"},{0x4F27A59F,0x801F438D,"common/shape.wdf"},{0x4F27A59F,0x801F438D,"common/shape.wdf"}}
		scs = { { 0x4F27A59F, 0x801F438D, "common/shape.wdf" }, { 0x46F4FDF6, 0xC9EF2751, "common/shape.wdf" }, { 0x5B0EDDAD, 0xB227D39F, "common/shape.wdf" }, { 0x643F7DDE, 0xCC8E0921, "common/shape.wdf" } }
		--scs = {{0x4F27A59F,0x801F438D,"shape.wd5"},{0x46F4FDF6,0xC9EF2751,"shape.wd5"},{0x5B0EDDAD,0xB227D39F,"shape.wd5"},{0x643F7DDE,0xCC8E0921,"shape.wd5"}}
	end
	if zqs[zq] == nil then
		return
	end
	local bh = zqs[zq][3]
	return {
		坐骑资源 = zqs[zq][4],
		坐骑站立 = zqs[zq][1],
		坐骑行走 = zqs[zq][2],
		人物资源 = scs[bh][3],
		人物站立 = scs[bh][1],
		人物行走 = scs[bh][2],
		坐骑饰品站立 = sps[sp][1],
		坐骑饰品行走 = sps[sp][2],
		坐骑饰品资源 = sps[sp][3]
	}
end

function 取施法特效(tx)
	local n = {}
	if tx == "扶摇九霄（法）" then
		n[1] = 0xABABC036
	elseif tx == "比翼飞（粉）" then
		n[1] = 0xABABC001
	elseif tx == "比翼飞（蓝）" then
		n[1] = 0xABABC002
	elseif tx == "万物生长（白）" then
		n[1] = 0xABABC003
	elseif tx == "万物生长（黑）" then
		n[1] = 0xABABC004
	elseif tx == "万物生长（绿）" then
		n[1] = 0xABABC005
	elseif tx == "虎威一震（白）" then
		n[1] = 0xABABC014
	elseif tx == "虎威一震（金）" then
		n[1] = 0xABABC015
	elseif tx == "虎威一震（黑）" then
		n[1] = 0xABABC016
	elseif tx == "虎啸生风（黑）" then
		n[1] = 0xABABC017
	elseif tx == "虎啸生风（金）" then
		n[1] = 0xABABC018
	elseif tx == "耀炎麒麟（白）" then
		n[1] = 0xABABC021
	elseif tx == "耀炎麒麟（黑）" then
		n[1] = 0xABABC022
	elseif tx == "耀炎麒麟（金）" then
		n[1] = 0xABABC025
	elseif tx == "星火燎原" then
		n[1] = 0xABABC026
	elseif tx == "野蛮冲撞（金）" then
		n[1] = 0xABABC028
	elseif tx == "野蛮冲撞（白）" then
		n[1] = 0xABABC029
	elseif tx == "野蛮冲撞（黑）" then
		n[1] = 0xABABC030
	elseif tx == "牛气冲天" then
		n[1] = 0xABABC035
	elseif tx == "巫山曲（原）" then
        n[1] = 0xABABC038
	end
	return n
end
function 取攻击特效(sf)
    local sft = {}
    if sf == "扶摇九霄（攻）" then
        sft[1] = 0xABABC036
        sft[2] = "施法特效.wdf"
    elseif sf == "野蛮冲撞（金）" then
        sft[1] = 0xABABC028
        sft[2] = "施法特效.wdf"
    elseif sf == "野蛮冲撞（白）" then
        sft[1] = 0xABABC029
        sft[2] = "施法特效.wdf"
    elseif sf == "野蛮冲撞（黑）" then
        sft[1] = 0xABABC030
        sft[2] = "施法特效.wdf"
    elseif sf == "牛气冲天" then
        sft[1] = 0xABABC035
        sft[2] = "施法特效.wdf"
    elseif sf == "虎威一震（白）" then
        sft[1] = 0xABABC014
        sft[2] = "施法特效.wdf"
    elseif sf == "虎威一震（金）" then
        sft[1] = 0xABABC015
        sft[2] = "施法特效.wdf"
    elseif sf == "虎威一震（黑）" then
        sft[1] = 0xABABC016
        sft[2] = "施法特效.wdf"
    elseif sf == "耀炎麒麟（白）" then
        sft[1] = 0xABABC021
        sft[2] = "施法特效.wdf"
    elseif sf == "耀炎麒麟（黑）" then
        sft[1] = 0xABABC022
        sft[2] = "施法特效.wdf"
    elseif sf == "耀炎麒麟（金）" then
        sft[1] = 0xABABC025
        sft[2] = "施法特效.wdf"
    elseif sf == "星火燎原" then
        sft[1] = 0xABABC026
        sft[2] = "施法特效.wdf"
    elseif sf == "天火焚城" then
        sft[1] = 0xABABC027
        sft[2] = "施法特效.wdf"
    end
    return sft
end

function 取足迹(zj)
	local zjs = {}
	if zj == "浮游水母" then--
	zjs[1] = 0x5841D4FC
	zjs[2] = "common/addon.wdf"
	elseif zj == "闪光足迹" then --
	zjs[1] = 0x38079F9D
	zjs[2] = "common/addon.wdf"
	elseif zj == "青草足迹" then --
	zjs[1] = 0x173C29B5
	zjs[2] = "common/addon.wdf"
	elseif zj == "糖果足迹" then --
	zjs[1] = 0x2FF794F8
	zjs[2] = "common/addon.wdf"
	elseif zj == "爱心足迹" then --
	zjs[1] = 0x7D75476A
	zjs[2] = "common/addon.wdf"
	elseif zj == "玉剑足迹" then --
	zjs[1] = 0xBA3A3239
	zjs[2] = "common/addon.wdf"
	elseif zj == "晶翅足迹" then --
	zjs[1] = 0xE6B33F90
	zjs[2] = "common/addon.wdf"
	elseif zj == "蝴蝶足迹" then --
	zjs[1] = 0xA872E424
	zjs[2] = "common/addon.wdf"
	elseif zj == "爱的泡泡" then --
	zjs[1] = 0xE4E5EEAF
	zjs[2] = "common/addon.wdf"
	elseif zj == "爱的风暴" then--
	zjs[1] = 0x4CEE16D1
	zjs[2] = "common/addon.wdf"
	elseif zj == "璀璨烟花" then --
	zjs[1] = 0x2EA044B9
	zjs[2] = "common/addon.wdf"
	elseif zj == "心享气球" then--
	zjs[1] = 0x37BE87E8
	zjs[2] = "common/addon.wdf"

	-----------------------新增
	elseif zj == "南瓜足迹" then--
	zjs[1] = 0xF46601C7
	zjs[2] = "新足迹.wdf"
	elseif zj == "炎火足迹" then--
	zjs[1] = 0x7D931979
	zjs[2] = "新足迹.wdf"
	elseif zj == "时空之门" then--
	zjs[1] = 0x2C1C2C80
	zjs[2] = "新足迹.wdf"
	elseif zj == "火漩涡足迹" then--
	zjs[1] = 0x2FD54C43
	zjs[2] = "新足迹.wdf"
	elseif zj == "跃动喷泉" then--
	zjs[1] = 0x4274906D
	zjs[2] = "新足迹.wdf"
	elseif zj == "锦鲤游" then--
	zjs[1] = 0x42462D25
	zjs[2] = "新足迹.wdf"
	elseif zj == "落羽" then--
	zjs[1] = 0x4D6FB2B3
	zjs[2] = "新足迹.wdf"
	elseif zj == "星光" then--
	zjs[1] = 0x58D8C27C
	zjs[2] = "新足迹.wdf"
	elseif zj == "星星足迹" then--
	zjs[1] = 0x5E45FA62
	zjs[2] = "新足迹.wdf"
	elseif zj == "明月升" then--
	zjs[1] = 0x68D9ADE9
	zjs[2] = "新足迹.wdf"
	elseif zj == "飞雪足迹" then--
	zjs[1] = 0x744486FA
	zjs[2] = "新足迹.wdf"
	elseif zj == "元宝足迹" then--
	zjs[1] = 0x8E5FA0FF
	zjs[2] = "新足迹.wdf"
	elseif zj == "皮球足迹" then--
	zjs[1] = 0x9C146BBA
	zjs[2] = "新足迹.wdf"
	elseif zj == "龙卷风足迹" then--
	zjs[1] = 0xAAC2A156
	zjs[2] = "新足迹.wdf"
	elseif zj == "未知足迹" then--
	zjs[1] = 0xAF6631EB
	zjs[2] = "新足迹.wdf"
	elseif zj == "璀璨花火" then--
	zjs[1] = 0xAF942904
	zjs[2] = "新足迹.wdf"
	elseif zj == "星如雨" then--
	zjs[1] = 0xB77ED878
	zjs[2] = "新足迹.wdf"
	elseif zj == "雷电足迹" then--
	zjs[1] = 0xC3060301
	zjs[2] = "新足迹.wdf"
	elseif zj == "寒冰足迹" then--
	zjs[1] = 0xD588789A
	zjs[2] = "新足迹.wdf"
	elseif zj == "踩浪花" then--
	zjs[1] = 0xDDFBC01E
	zjs[2] = "新足迹.wdf"
	elseif zj == "采蘑菇" then--
	zjs[1] = 0xF2848531
	zjs[2] = "新足迹.wdf"
	elseif zj == "枫叶足迹" then--
	zjs[1] = 0xF879A813
	zjs[2] = "新足迹.wdf"
	elseif zj == "旋星足迹" then--
	zjs[1] = 0xFCA197EB
	zjs[2] = "新足迹.wdf"
	
	end
	return zjs
end

function 取光环(tx)
	local n = {}
	if tx == "烈焰澜翻" then
		n[1] = 0x52A385FE
		n[2] = 0x60FB8930
		n[3] = 0x1CDB4C3F
		
	elseif tx == "寒霜冰凌" then
	   	n[1]= 0xaaaaaa01
	   	n[2]= 0xaaaaaa01                           
	   	n[3]= 0xaaaaaa01
	    
	elseif tx == "金枝春绽" then
	   	n[1]=0xaaaaaaa2
	   	n[2]=0xaaaaaaa2
	   	n[3]=0xaaaaaaa2
	    
	elseif tx == "九霄云图" then
	   	n[1]=0xaaaaaaa3         ---新加光环 -特效
	   	n[2]=0xaaaaaaa3
	   	n[3]=0xaaaaaaa3
	    
	elseif tx == "浪淘沙月白" then
	   	n[1]=0xaaaaaaa4            ---新加光环 -特效
	   	n[2]=0xaaaaaaa4
	   	n[3]=0xaaaaaaa4
	    
	elseif tx == "凌霄天宫月白" then
	   	n[1]=0xaaaaaaa5          ---新加光环 -特效
	   	n[2]=0xaaaaaaa5
	   	n[3]=0xaaaaaaa5
	    
	
	elseif tx == "流云蝶影" then
	   	n[1]=0xaaaaaaa6         ---新加光环 -特效
	   	n[2]=0xaaaaaaa6
	   	n[3]=0xaaaaaaa6
	    

	elseif tx == "琪草瑶花" then
	   	n[1]=0xaaaaaaa7          ---新加光环 -特效
	   	n[2]=0xaaaaaaa7
	   	n[3]=0xaaaaaaa7
	    
	elseif tx == "琪花瑶草" then
	   	n[1]=0xaaaaaaa8          ---新加光环 -特效
	   	n[2]=0xaaaaaaa8
	   	n[3]=0xaaaaaaa8
	    
	
	elseif tx == "浪淘沙墨黑" then
	   	n[1]=0xaaaaaaa9          ---新加光环 -特效
	   	n[2]=0xaaaaaaa9
	   	n[3]=0xaaaaaaa9
	    
	elseif tx == "财源滚滚" then
	   	n[1]=0xaaaaaa10          ---新加光环 -特效
	   	n[2]=0xaaaaaa10
	   	n[3]=0xaaaaaa10
	    
	elseif tx == "凌霄天宫墨黑" then
	   	n[1]=0xaaaaaa11          ---新加光环 -特效
	   	n[2]=0xaaaaaa11
	   	n[3]=0xaaaaaa11
	    
	elseif tx == "凌霄天宫" then
	   	n[1]=0xaaaaaa12          ---新加光环 -特效
	   	n[2]=0xaaaaaa12
	   	n[3]=0xaaaaaa12
	    
	elseif tx == "午夜魔蝠" then
	   	n[1]=0xaaaaaa13          ---新加光环 -特效
	   	n[2]=0xaaaaaa13
	   	n[3]=0xaaaaaa13
	    
	elseif tx == "星驰剑阵染" then
	   	n[1]=0xaaaaaa14          ---新加光环 -特效
	   	n[2]=0xaaaaaa14
	   	n[3]=0xaaaaaa14
	    
	elseif tx == "星驰剑阵" then
	   	n[1]=0xaaaaaa15          ---新加光环 -特效
	   	n[2]=0xaaaaaa15
	   	n[3]=0xaaaaaa15
	    
	elseif tx == "月半潮" then
	   	n[1]=0xaaaaaa16          ---新加光环 -特效
	   	n[2]=0xaaaaaa16
	   	n[3]=0xaaaaaa16
	    
	elseif tx == "月半潮墨黑" then
	   	n[1]=0xaaaaaa17          ---新加光环 -特效
	   	n[2]=0xaaaaaa17
	   	n[3]=0xaaaaaa17
	    
	elseif tx == "月半潮月白" then
	   	n[1]=0xaaaaaa18          ---新加光环 -特效
	   	n[2]=0xaaaaaa18
	   	n[3]=0xaaaaaa18
	    
	elseif tx == "云龙梦" then
	   	n[1]=0xaaaaaa19          ---新加光环 -特效
	   	n[2]=0xaaaaaa19
	   	n[3]=0xaaaaaa19
	    
    elseif tx == "云龙梦墨黑" then
		n[1]=0xaaaaaa20          ---新加光环 -特效
		n[2]=0xaaaaaa20
		n[3]=0xaaaaaa20
	    
	elseif tx == "云龙梦月白" then
	   	n[1]=0xaaaaaa21          ---新加光环 -特效
	   	n[2]=0xaaaaaa21
	   	n[3]=0xaaaaaa21
	    
	elseif tx == "浪淘纱月白" then
		n[1] = 0xF0CBB55B
		n[2] = 0xF0CBB55B
		n[3] = 0xF0CBB55B
	elseif tx == "水墨游龙" then
		n[1] = 0x0DF5F610
		n[2] = 0x8109B081
		n[3] = 0xFFCF398C
		
	elseif tx == "星光熠熠" then
		n[1] = 0xCA82DD54
		n[2] = 0xFCC5CE3A
		n[3] = 0xCA82DD54
		
	elseif tx == "双鲤寄情" then
		n[1] = 0xC056D8DD
		n[2] = 0x865FF084
		n[3] = 0x654EAD9E
		
	elseif tx == "凌波微步" then
		n[1] = 0x6F1A7860
		n[2] = 0x6F1A7860
		n[3] = 0xE1D6A08F
		
	elseif tx == "月影婆娑" then
		n[1] = 0xD0000018
		n[2] = 0xD0000018
		n[3] = 0xD0000018
		
	
	elseif tx == "雪花飘落" then
		n[1] = 0x12907C0F
		n[2] = 0xDE953084
		n[3] = 0xDE953084
		
	elseif tx == "花的海洋" then
		n[1] = 0xCA3B3A8F
		n[2] = 0xBACF8614
		n[3] = 0xCA3B3A8F
		
	elseif tx == "爱的光影" then
		n[1] = 0xF0CBB55B
		n[2] = 0xF0CBB55B
		n[3] = 0xF0CBB55B
		
	elseif tx == "祥云瑞气" then
		n[1] = 0xD5E2F0A8
		n[2] = 0x84BE68C9
		n[3] = 0x50907DFA
		
	elseif tx == "珠落玉盘" then
		n[1] = 0xAAC2A157
		n[2] = 0xAAC2A157
		n[3] = 0xAAC2A157
		
	elseif tx == "红叶随风" then
		n[1] = 0xD0000017
		n[2] = 0xD0000017
		n[3] = 0xD0000017
		
	elseif tx == "蛙蛙落泪" then
		n[1] = 0xfafff001
		n[2] = 0xfafff001
		n[3] = 0xfafff001
	elseif tx == "龙游鱼跃" then
		n[1] = 0xfafff002
		n[2] = 0xfafff002
		n[3] = 0xfafff002
	elseif tx == "星虹蝶影" then
		n[1] = 0xfafff003
		n[2] = 0xfafff003
		n[3] = 0xfafff003
	end
	return n
end
function 引擎.取翅膀(tx)
	local n={}
 	if tx == "炎黄神翼" then
 		n[1] = 0x00A17557
		n[2] = "xinjn.wdf"
 	elseif tx =="金凤神翼" then
		n[1]=0x00A18567
	   	n[2]="xinjn.wdf"
	elseif tx == "水墨江南" then
		n[1]=0x00A18566
	   	n[2]="xinjn.wdf"
	elseif tx == "天元枭雄" then
		n[1]=0x00A18564
	   	n[2]="xinjn.wdf"
	elseif tx == "焚天炎翼" then
		n[1]=0x00A18563
	   	n[2]="xinjn.wdf"
	elseif tx == "撼地魔翼" then
		n[1]=0x00A18562
	   	n[2]="xinjn.wdf"
	elseif tx == "天阙神翼" then
		n[1]=0x00A18561
	   	n[2]="xinjn.wdf"
	elseif tx == "裂空战翼" then
		n[1]=0x00A18560
	   	n[2]="xinjn.wdf"
	elseif tx == "弑神绝翼" then
		n[1]=0x00A18559
	   	n[2]="xinjn.wdf"
	elseif tx == "傲天玄翼" then
		n[1]=0x00A18558
	   	n[2]="xinjn.wdf"
	elseif tx == "降魔天翼" then
		n[1]=0x00A18568
	   	n[2]="xinjn.wdf"
	elseif tx == "九霄云翼" then
		n[1]=0x00A18569
	   	n[2]="xinjn.wdf"
	elseif tx == "紫府灵翼" then
		n[1]=0x00A18570
	   	n[2]="xinjn.wdf"
	elseif tx == "灵霄羽翼" then
		n[1]=0x00A18555
	   	n[2]="xinjn.wdf"
	elseif tx == "毁天暗翼" then
		n[1]=0x00A17556
	   	n[2]="xinjn.wdf"
   	 elseif tx == "碎星炎翼" then
		n[1]=0x00A17558
	   	n[2]="xinjn.wdf"
	elseif tx == "云巅鹤翼" then
		n[1]=0x00A18557
	   	n[2]="xinjn.wdf"
	end
 	return n
end
ZhandouModel={}

ZhandouModel["剑侠客"]={
                       pgs_1=0xABCAB004,--攻击
                       pgs_2=0xABCAB004,--攻击2
                       pgs_3=0xABCAB006,--死亡
                       pgs_4=0xABCAB003,--防御
                       pgs_6=0xABCAB002,--待战
                       pgs_7=0xABCAB005,--施法
                       pgs_8=0xABCAB009,--跑去
                       pgs_9=0xABCAB001,--挨打
                       pgs_10="剑侠客素材.wdf"}
ZhandouModel["剑侠客_刀"]={
                       pgs_1=0xABCAB004,--攻击
                       pgs_2=0xABCAB004,--攻击2
                       pgs_3=0xABCAB006,--死亡
                       pgs_4=0xABCAB003,--防御
                       pgs_6=0xABCAB002,--待战
                       pgs_7=0xABCAB005,--施法
                       pgs_8=0xABCAB009,--跑去
                       pgs_9=0xABCAB001,--挨打
                       pgs_10="剑侠客素材.wdf"}
ZhandouModel["柳叶刀_剑侠客"]={
                       pgs_1=0xABCAB013,--攻击
                       pgs_2=0xABCAB013,--攻击2
                       pgs_3=0xABCAB015,--死亡
                       pgs_4=0xABCAB012,--防御
                       pgs_6=0xABCAB011,--待战
                       pgs_7=0xABCAB014,--施法
                       pgs_8=0xABCAB016,--跑去
                       pgs_9=0xABCAB010,--挨打
                       pgs_10="剑侠客素材.wdf"}
ZhandouModel["金背大砍刀_剑侠客"]={
                       pgs_1=0xABCAB022,--攻击
                       pgs_2=0xABCAB022,--攻击2
                       pgs_3=0xABCAB024,--死亡
                       pgs_4=0xABCAB021,--防御
                       pgs_6=0xABCAB020,--待战
                       pgs_7=0xABCAB023,--施法
                       pgs_8=0xABCAB025,--跑去
                       pgs_9=0xABCAB019,--挨打
                       pgs_10="剑侠客素材.wdf"}
ZhandouModel["狼牙刀_剑侠客"]={
                       pgs_1=0xABCAB031,--攻击
                       pgs_2=0xABCAB031,--攻击2
                       pgs_3=0xABCAB033,--死亡
                       pgs_4=0xABCAB030,--防御
                       pgs_6=0xABCAB029,--待战
                       pgs_7=0xABCAB032,--施法
                       pgs_8=0xABCAB034,--跑去
                       pgs_9=0xABCAB028,--挨打
                       pgs_10="剑侠客素材.wdf"}
ZhandouModel["冷月_剑侠客"]={
                       pgs_1=0xABCAB040,--攻击
                       pgs_2=0xABCAB040,--攻击2
                       pgs_3=0xABCAB042,--死亡
                       pgs_4=0xABCAB039,--防御
                       pgs_6=0xABCAB038,--待战
                       pgs_7=0xABCAB041,--施法
                       pgs_8=0xABCAB043,--跑去
                       pgs_9=0xABCAB037,--挨打
                       pgs_10="剑侠客素材.wdf"}
ZhandouModel["屠龙_剑侠客"]={
                       pgs_1=0xABCAB049,--攻击
                       pgs_2=0xABCAB049,--攻击2
                       pgs_3=0xABCAB051,--死亡
                       pgs_4=0xABCAB048,--防御
                       pgs_6=0xABCAB047,--待战
                       pgs_7=0xABCAB050,--施法
                       pgs_8=0xABCAB052,--跑去
                       pgs_9=0xABCAB046,--挨打
                       pgs_10="剑侠客素材.wdf"}
ZhandouModel["血刃_剑侠客"]={
                       pgs_1=0xABCAB058,--攻击
                       pgs_2=0xABCAB058,--攻击2
                       pgs_3=0xABCAB060,--死亡
                       pgs_4=0xABCAB057,--防御
                       pgs_6=0xABCAB056,--待战
                       pgs_7=0xABCAB059,--施法
                       pgs_8=0xABCAB061,--跑去
                       pgs_9=0xABCAB055,--挨打
                       pgs_10="剑侠客素材.wdf"}
ZhandouModel["偃月青龙_剑侠客"]={
                       pgs_1=0xABCAB067,--攻击
                       pgs_2=0xABCAB067,--攻击2
                       pgs_3=0xABCAB069,--死亡
                       pgs_4=0xABCAB066,--防御
                       pgs_6=0xABCAB065,--待战
                       pgs_7=0xABCAB068,--施法
                       pgs_8=0xABCAB070,--跑去
                       pgs_9=0xABCAB064,--挨打
                       pgs_10="剑侠客素材.wdf"}
ZhandouModel["晓风残月_剑侠客"]={
                       pgs_1=0xABCAB076,--攻击
                       pgs_2=0xABCAB076,--攻击2
                       pgs_3=0xABCAB078,--死亡
                       pgs_4=0xABCAB075,--防御
                       pgs_6=0xABCAB074,--待战
                       pgs_7=0xABCAB077,--施法
                       pgs_8=0xABCAB079,--跑去
                       pgs_9=0xABCAB073,--挨打
                       pgs_10="剑侠客素材.wdf"}
ZhandouModel["斩妖泣血_剑侠客"]={
                       pgs_1=0xABCAB085,--攻击
                       pgs_2=0xABCAB085,--攻击2
                       pgs_3=0xABCAB087,--死亡
                       pgs_4=0xABCAB084,--防御
                       pgs_6=0xABCAB083,--待战
                       pgs_7=0xABCAB086,--施法
                       pgs_8=0xABCAB088,--跑去
                       pgs_9=0xABCAB082,--挨打
                       pgs_10="剑侠客素材.wdf"}
ZhandouModel["业火三灾_剑侠客"]={
                       pgs_1=0xABCAB094,--攻击
                       pgs_2=0xABCAB094,--攻击2
                       pgs_3=0xABCAB096,--死亡
                       pgs_4=0xABCAB093,--防御
                       pgs_6=0xABCAB092,--待战
                       pgs_7=0xABCAB095,--施法
                       pgs_8=0xABCAB097,--跑去
                       pgs_9=0xABCAB091,--挨打
                       pgs_10="剑侠客素材.wdf"}
ZhandouModel["鸣鸿_剑侠客"]={
                       pgs_1=0xABCAB103,--攻击
                       pgs_2=0xABCAB103,--攻击2
                       pgs_3=0xABCAB105,--死亡
                       pgs_4=0xABCAB102,--防御
                       pgs_6=0xABCAB101,--待战
                       pgs_7=0xABCAB104,--施法
                       pgs_8=0xABCAB106,--跑去
                       pgs_9=0xABCAB100,--挨打
                       pgs_10="剑侠客素材.wdf"}

--=================================================================================================



ZhandouModel["剑侠客_剑"]={
                       pgs_1=0xABCAB112,--攻击
                       pgs_2=0xABCAB112,--攻击2
                       pgs_3=0xABCAB006,--死亡
                       pgs_4=0xABCAB111,--防御
                       pgs_6=0xABCAB110,--待战
                       pgs_7=0xABCAB113,--施法
                       pgs_8=0xABCAB115,--跑去
                       pgs_9=0xABCAB109,--挨打
                       pgs_10="剑侠客素材.wdf"}
ZhandouModel["青铜短剑_剑侠客"]={
                       pgs_1=0xABCAB120,--攻击
                       pgs_2=0xABCAB120,--攻击2
                       pgs_3=0xABCAB122,--死亡
                       pgs_4=0xABCAB119,--防御
                       pgs_6=0xABCAB118,--待战
                       pgs_7=0xABCAB121,--施法
                       pgs_8=0xABCAB123,--跑去
                       pgs_9=0xABCAB117,--挨打
                       pgs_10="剑侠客素材.wdf"}

ZhandouModel["青锋剑_剑侠客"]={
                       pgs_1=0xABCAB128,--攻击
                       pgs_2=0xABCAB128,--攻击2
                       pgs_3=0xABCAB130,--死亡
                       pgs_4=0xABCAB127,--防御
                       pgs_6=0xABCAB126,--待战
                       pgs_7=0xABCAB129,--施法
                       pgs_8=0xABCAB131,--跑去
                       pgs_9=0xABCAB125,--挨打
                       pgs_10="剑侠客素材.wdf"}
ZhandouModel["游龙剑_剑侠客"]={
                       pgs_1=0xABCAB137,--攻击
                       pgs_2=0xABCAB137,--攻击2
                       pgs_3=0xABCAB139,--死亡
                       pgs_4=0xABCAB136,--防御
                       pgs_6=0xABCAB135,--待战
                       pgs_7=0xABCAB138,--施法
                       pgs_8=0xABCAB140,--跑去
                       pgs_9=0xABCAB134,--挨打
                       pgs_10="剑侠客素材.wdf"}
ZhandouModel["鱼肠_剑侠客"]={
                       pgs_1=0xABCAB146,--攻击
                       pgs_2=0xABCAB146,--攻击2
                       pgs_3=0xABCAB148,--死亡
                       pgs_4=0xABCAB145,--防御
                       pgs_6=0xABCAB144,--待战
                       pgs_7=0xABCAB147,--施法
                       pgs_8=0xABCAB149,--跑去
                       pgs_9=0xABCAB143,--挨打
                       pgs_10="剑侠客素材.wdf"}
ZhandouModel["倚天_剑侠客"]={
                       pgs_1=0xABCAB153,--攻击
                       pgs_2=0xABCAB153,--攻击2
                       pgs_3=0xABCAB155,--死亡
                       pgs_4=0xABCAB152,--防御
                       pgs_6=0xABCAB151,--待战
                       pgs_7=0xABCAB154,--施法
                       pgs_8=0xABCAB156,--跑去
                       pgs_9=0xABCAB150,--挨打
                       pgs_10="剑侠客素材.wdf"}
ZhandouModel["湛卢_剑侠客"]={
                       pgs_1=0xABCAB162,--攻击
                       pgs_2=0xABCAB162,--攻击2
                       pgs_3=0xABCAB164,--死亡
                       pgs_4=0xABCAB161,--防御
                       pgs_6=0xABCAB160,--待战
                       pgs_7=0xABCAB163,--施法
                       pgs_8=0xABCAB165,--跑去
                       pgs_9=0xABCAB159,--挨打
                       pgs_10="剑侠客素材.wdf"}
ZhandouModel["魏武青虹_剑侠客"]={
                       pgs_1=0xABCAB169,--攻击
                       pgs_2=0xABCAB169,--攻击2
                       pgs_3=0xABCAB171,--死亡
                       pgs_4=0xABCAB168,--防御
                       pgs_6=0xABCAB167,--待战
                       pgs_7=0xABCAB170,--施法
                       pgs_8=0xABCAB172,--跑去
                       pgs_9=0xABCAB166,--挨打
                       pgs_10="剑侠客素材.wdf"}
ZhandouModel["灵犀神剑_剑侠客"]={
                       pgs_1=0xABCAB178,--攻击
                       pgs_2=0xABCAB178,--攻击2
                       pgs_3=0xABCAB180,--死亡
                       pgs_4=0xABCAB177,--防御
                       pgs_6=0xABCAB176,--待战
                       pgs_7=0xABCAB179,--施法
                       pgs_8=0xABCAB172,--跑去
                       pgs_9=0xABCAB175,--挨打
                       pgs_10="剑侠客素材.wdf"}
ZhandouModel["四法青云_剑侠客"]={
                       pgs_1=0xABCAB186,--攻击
                       pgs_2=0xABCAB186,--攻击2
                       pgs_3=0xABCAB188,--死亡
                       pgs_4=0xABCAB185,--防御
                       pgs_6=0xABCAB184,--待战
                       pgs_7=0xABCAB187,--施法
                       pgs_8=0xABCAB189,--跑去
                       pgs_9=0xABCAB183,--挨打
                       pgs_10="剑侠客素材.wdf"}
ZhandouModel["霜冷九州_剑侠客"]={
                       pgs_1=0xABCAB193,--攻击
                       pgs_2=0xABCAB193,--攻击2
                       pgs_3=0xABCAB195,--死亡
                       pgs_4=0xABCAB192,--防御
                       pgs_6=0xABCAB191,--待战
                       pgs_7=0xABCAB194,--施法
                       pgs_8=0xABCAB196,--跑去
                       pgs_9=0xABCAB190,--挨打
                       pgs_10="剑侠客素材.wdf"}
ZhandouModel["擒龙_剑侠客"]={
                       pgs_1=0xABCAB202,--攻击
                       pgs_2=0xABCAB202,--攻击2
                       pgs_3=0xABCAB206,--死亡
                       pgs_4=0xABCAB201,--防御
                       pgs_6=0xABCAB200,--待战
                       pgs_7=0xABCAB203,--施法
                       pgs_8=0xABCAB205,--跑去
                       pgs_9=0xABCAB199,--挨打
                       pgs_10="剑侠客素材.wdf"}
ZhandouModel["影精灵_爪刺"]={
                        pgs_6=0xA1000148
                        ,pgs_4=0xA1000157
                        ,pgs_9=0xA1000159
                        ,pgs_7=0xA1000151
                        ,pgs_3=0xA1000152
                        ,pgs_8=0xA1000153
                        ,pgs_2=0xA1000150--攻击2
                        ,pgs_1=0xA1000150--攻击1
                        ,pgs_99=0xA1000150--攻击3
                        ,pgs_10="影精灵.wdf"
                        }
ZhandouModel["铁爪_影精灵"]={
        pgs_1 = 0xA1000430--攻击
       ,pgs_2 = 0xA1000430--攻击二
       ,pgs_3 = 0xA1000432--死亡
       ,pgs_4 = 0xA1000437--防御
       ,pgs_6 = 0xA1000428--待机
       ,pgs_7 = 0xA1000431--施法
       ,pgs_8 = 0xA1000433--移动
       ,pgs_9 = 0xA1000429--挨打
       ,pgs_10 = "影精灵.wdf"
       ,pgs_99 = 0xA1000430--连击3
       }
ZhandouModel["青刚刺_影精灵"]={
        pgs_1 = 0xA1000460--攻击
       ,pgs_2 = 0xA1000460--攻击二
       ,pgs_3 = 0xA1000462--死亡
       ,pgs_4 = 0xA1000467--防御
       ,pgs_6 = 0xA1000458--待机
       ,pgs_7 = 0xA1000461--施法
       ,pgs_8 = 0xA1000463--移动
       ,pgs_9 = 0xA1000459--挨打
       ,pgs_10 = "影精灵.wdf"
       ,pgs_99 = 0xA1000460--连击3
       }
ZhandouModel["青龙牙_影精灵"]={
        pgs_1 = 0xA1000480--攻击
       ,pgs_2 = 0xA1000480--攻击二
       ,pgs_3 = 0xA1000482--死亡
       ,pgs_4 = 0xA1000487--防御
       ,pgs_6 = 0xA1000478--待机
       ,pgs_7 = 0xA1000481--施法
       ,pgs_8 = 0xA1000483--移动
       ,pgs_9 = 0xA1000479--挨打
       ,pgs_10 = "影精灵.wdf"
       ,pgs_99 = 0xA1000480--连击3
       }
ZhandouModel["雪蚕之刺_影精灵"]={
        pgs_1 = 0xA1000450--攻击
       ,pgs_2 = 0xA1000450--攻击二
       ,pgs_3 = 0xA1000452--死亡
       ,pgs_4 = 0xA1000457--防御
       ,pgs_6 = 0xA1000448--待机
       ,pgs_7 = 0xA1000451--施法
       ,pgs_8 = 0xA1000453--移动
       ,pgs_9 = 0xA1000449--挨打
       ,pgs_10 = "影精灵.wdf"
       ,pgs_99 = 0xA1000450--连击3
       }
ZhandouModel["九阴勾魂_影精灵"]={
        pgs_1 = 0xA1000065--攻击
       ,pgs_2 = 0xA1000065--攻击二
       ,pgs_3 = 0xA1000067--死亡
       ,pgs_4 = 0xA1000072--防御
       ,pgs_6 = 0xA1000063--待机
       ,pgs_7 = 0xA1000066--施法
       ,pgs_8 = 0xA1000068--移动
       ,pgs_9 = 0xA1000064--挨打
       ,pgs_10 = "影精灵.wdf"
       ,pgs_99 = 0xA1000065--连击3
       }
ZhandouModel["撕天_影精灵"]={
        pgs_1 = 0xA1000206--攻击
       ,pgs_2 = 0xA1000206--攻击二
       ,pgs_3 = 0xA1000208--死亡
       ,pgs_4 = 0xA1000213--防御
       ,pgs_6 = 0xA1000204--待机
       ,pgs_7 = 0xA1000207--施法
       ,pgs_8 = 0xA1000209--移动
       ,pgs_9 = 0xA1000205--挨打
       ,pgs_10 = "影精灵.wdf"
       ,pgs_99 = 0xA1000206--连击3
       }
ZhandouModel["毒牙_影精灵"]={
        pgs_1 = 0xA1000216--攻击
       ,pgs_2 = 0xA1000216--攻击二
       ,pgs_3 = 0xA1000218--死亡
       ,pgs_4 = 0xA1000223--防御
       ,pgs_6 = 0xA1000214--待机
       ,pgs_7 = 0xA1000217--施法
       ,pgs_8 = 0xA1000219--移动
       ,pgs_9 = 0xA1000215--挨打
       ,pgs_10 = "影精灵.wdf"
       ,pgs_99 = 0xA1000216--连击3
       }
ZhandouModel["胭脂_影精灵"]={
        pgs_1 = 0xA1000400--攻击
       ,pgs_2 = 0xA1000400--攻击二
       ,pgs_3 = 0xA1000402--死亡
       ,pgs_4 = 0xA1000407--防御
       ,pgs_6 = 0xA1000398--待机
       ,pgs_7 = 0xA1000401--施法
       ,pgs_8 = 0xA1000403--移动
       ,pgs_9 = 0xA1000399--挨打
       ,pgs_10 = "影精灵.wdf"
       ,pgs_99 = 0xA1000400--连击3
       }
ZhandouModel["贵霜之牙_影精灵"]={
        pgs_1 = 0xA1000410--攻击
       ,pgs_2 = 0xA1000410--攻击二
       ,pgs_3 = 0xA1000412--死亡
       ,pgs_4 = 0xA1000417--防御
       ,pgs_6 = 0xA1000408--待机
       ,pgs_7 = 0xA1000411--施法
       ,pgs_8 = 0xA1000413--移动
       ,pgs_9 = 0xA1000409--挨打
       ,pgs_10 = "影精灵.wdf"
       ,pgs_99 = 0xA1000410--连击3
       }
ZhandouModel["离钩_影精灵"]={
        pgs_1 = 0xA1000318--攻击
       ,pgs_2 = 0xA1000318--攻击二
       ,pgs_3 = 0xA1000320--死亡
       ,pgs_4 = 0xA1000325--防御
       ,pgs_6 = 0xA1000316--待机
       ,pgs_7 = 0xA1000319--施法
       ,pgs_8 = 0xA1000321--移动
       ,pgs_9 = 0xA1000317--挨打
       ,pgs_10 = "影精灵.wdf"
       ,pgs_99 = 0xA1000318--连击3
       }
ZhandouModel["忘川三途_影精灵"]={
        pgs_1 = 0xA1000170--攻击
       ,pgs_2 = 0xA1000170--攻击二
       ,pgs_3 = 0xA1000172--死亡
       ,pgs_4 = 0xA1000177--防御
       ,pgs_6 = 0xA1000168--待机
       ,pgs_7 = 0xA1000171--施法
       ,pgs_8 = 0xA1000173--移动
       ,pgs_9 = 0xA1000169--挨打
       ,pgs_10 = "影精灵.wdf"
       ,pgs_99 = 0xA1000170--连击3
       }
ZhandouModel["影精灵_魔棒"]={
                        pgs_6=0xA1000158
                        ,pgs_4=0xA1000167
                        ,pgs_9=0xA1000159
                        ,pgs_7=0xA1000161
                        ,pgs_3=0xA1000162
                        ,pgs_8=0xA1000163
                        ,pgs_2=0xA1000160--攻击2
                        ,pgs_1=0xA1000160--攻击1
                        ,pgs_99=0xA1000146--攻击3
                        ,pgs_10="影精灵.wdf"
                        }
ZhandouModel["细木棒_影精灵"]={
       pgs_1 = 0xA1000364--攻击
       ,pgs_2 = 0xA1000364--攻击二
       ,pgs_3 = 0xA1000366--死亡
       ,pgs_4 = 0xA1000361--防御
       ,pgs_6 = 0xA1000362--待机
       ,pgs_7 = 0xA1000365--施法
       ,pgs_8 = 0xA1000367--移动
       ,pgs_9 = 0xA1000363--挨打
       ,pgs_10 = "影精灵.wdf"
       ,pgs_99 = 0xA1000364--连击3
       }
ZhandouModel["沧海_影精灵"]={
       pgs_1 = 0xA1000226--攻击
       ,pgs_2 = 0xA1000226--攻击二
       ,pgs_3 = 0xA1000228--死亡
       ,pgs_4 = 0xA1000233--防御
       ,pgs_6 = 0xA1000224--待机
       ,pgs_7 = 0xA1000227--施法
       ,pgs_8 = 0xA1000231--移动
       ,pgs_9 = 0xA1000225--挨打
       ,pgs_10 = "影精灵.wdf"
       ,pgs_99 = 0xA1000226--连击3
       }
ZhandouModel["满天星_影精灵"]={
       pgs_1 = 0xA1000236--攻击
       ,pgs_2 = 0xA1000236--攻击二
       ,pgs_3 = 0xA1000238--死亡
       ,pgs_4 = 0xA1000243--防御
       ,pgs_6 = 0xA1000234--待机
       ,pgs_7 = 0xA1000237--施法
       ,pgs_8 = 0xA1000239--移动
       ,pgs_9 = 0xA1000235--挨打
       ,pgs_10 = "影精灵.wdf"
       ,pgs_99 = 0xA1000236--连击3
       }
ZhandouModel["点金棒_影精灵"]={
       pgs_1 = 0xA1000246--攻击
       ,pgs_2 = 0xA1000246--攻击二
       ,pgs_3 = 0xA1000248--死亡
       ,pgs_4 = 0xA1000243--防御
       ,pgs_6 = 0xA1000244--待机
       ,pgs_7 = 0xA1000247--施法
       ,pgs_8 = 0xA1000249--移动
       ,pgs_9 = 0xA1000245--挨打
       ,pgs_10 = "影精灵.wdf"
       ,pgs_99 = 0xA1000246--连击3
       }
ZhandouModel["盘龙_影精灵"]={
       pgs_1 = 0xA1000282--攻击
       ,pgs_2 = 0xA1000282--攻击二
       ,pgs_3 = 0xA1000284--死亡
       ,pgs_4 = 0xA1000289--防御
       ,pgs_6 = 0xA1000280--待机
       ,pgs_7 = 0xA1000283--施法
       ,pgs_8 = 0xA1000285--移动
       ,pgs_9 = 0xA1000281--挨打
       ,pgs_10 = "影精灵.wdf"
       ,pgs_99 = 0xA1000282--连击3
       }
ZhandouModel["红莲_影精灵"]={
       pgs_1 = 0xA1000354--攻击
       ,pgs_2 = 0xA1000354--攻击二
       ,pgs_3 = 0xA1000356--死亡
       ,pgs_4 = 0xA1000361--防御
       ,pgs_6 = 0xA1000352--待机
       ,pgs_7 = 0xA1000355--施法
       ,pgs_8 = 0xA1000357--移动
       ,pgs_9 = 0xA1000353--挨打
       ,pgs_10 = "影精灵.wdf"
       ,pgs_99 = 0xA1000354--连击3
       }
ZhandouModel["降魔玉杵_影精灵"]={
       pgs_1 = 0xA1000440--攻击
       ,pgs_2 = 0xA1000440--攻击二
       ,pgs_3 = 0xA1000442--死亡
       ,pgs_4 = 0xA1000447--防御
       ,pgs_6 = 0xA1000438--待机
       ,pgs_7 = 0xA1000441--施法
       ,pgs_8 = 0xA1000445--移动
       ,pgs_9 = 0xA1000439--挨打
       ,pgs_10 = "影精灵.wdf"
       ,pgs_99 = 0xA1000440--连击3
       }
ZhandouModel["青藤玉树_影精灵"]={
       pgs_1 = 0xA1000470--攻击
       ,pgs_2 = 0xA1000470--攻击二
       ,pgs_3 = 0xA1000472--死亡
       ,pgs_4 = 0xA1000477--防御
       ,pgs_6 = 0xA1000468--待机
       ,pgs_7 = 0xA1000471--施法
       ,pgs_8 = 0xA1000475--移动
       ,pgs_9 = 0xA1000469--挨打
       ,pgs_10 = "影精灵.wdf"
       ,pgs_99 = 0xA1000470--连击3
       }
ZhandouModel["墨玉骷髅_影精灵"]={
       pgs_1 = 0xA1000127--攻击
       ,pgs_2 = 0xA1000127--攻击二
       ,pgs_3 = 0xA1000129--死亡
       ,pgs_4 = 0xA1B00010--防御
       ,pgs_6 = 0xA1B00001--待机
       ,pgs_7 = 0xA1000128--施法
       ,pgs_8 = 0xA1B00006--移动
       ,pgs_9 = 0xA1000126--挨打
       ,pgs_10 = "影精灵.wdf"
       ,pgs_99 = 0xA1000127--连击3
       }
ZhandouModel["丝萝乔木_影精灵"]={
       pgs_1 = 0xA1B00003--攻击
       ,pgs_2 = 0xA1B00003--攻击二
       ,pgs_3 = 0xA1B00005--死亡
       ,pgs_4 = 0xA1B00010--防御
       ,pgs_6 = 0xA1B00001--待机
       ,pgs_7 = 0xA1B00004--施法
       ,pgs_8 = 0xA1B00006--移动
       ,pgs_9 = 0xA1B00002--挨打
       ,pgs_10 = "影精灵.wdf"
       ,pgs_99 = 0xA1B00003--连击3
       }
ZhandouModel["醍醐_影精灵"]={
       pgs_1 = 0xA1000420--攻击
       ,pgs_2 = 0xA1000420--攻击二
       ,pgs_3 = 0xA1000422--死亡
       ,pgs_4 = 0xA1000427--防御
       ,pgs_6 = 0xA1000418--待机
       ,pgs_7 = 0xA1000421--施法
       ,pgs_8 = 0xA1000425--移动
       ,pgs_9 = 0xA1000419--挨打
       ,pgs_10 = "影精灵.wdf"
       ,pgs_99 = 0xA1000420--连击3
       }
ZhandouModel["影精灵"]={
        pgs_1 = 0xfafe0930 --攻击 
       ,pgs_2 = 0xfafe0923 --攻击2
       ,pgs_3 = 0xfafe0924 --死亡
       ,pgs_4 = 0xfafe0925 --防御
       ,pgs_6 = 0xfafe0926 --待战
       ,pgs_7 = 0xfafe0927 --施法
       ,pgs_8 = 0xfafe0928 --跑去
       ,pgs_9 = 0xfafe0929 --挨打
       ,pgs_11 =0xfafe0932
       ,pgs_12 =0xfafe0931  
       ,pgs_13 =0xfafe0932
       ,pgs_10 = "cwmx.wdf"
    }
    ZhandouModel["影精灵_双斧乾"]={
        pgs_1 = 0xfafe0930 --攻击
       ,pgs_2 = 0xfafe0923 --攻击2
       ,pgs_3 = 0xfafe0924 --死亡
       ,pgs_4 = 0xfafe0925 --防御
       ,pgs_6 = 0xfafe0926 --待战
       ,pgs_7 = 0xfafe0927 --施法
       ,pgs_8 = 0xfafe0928 --跑去
       ,pgs_9 = 0xfafe0929 --挨打
       ,pgs_11 =0xfafe0932
       ,pgs_12 =0xfafe0931  
       ,pgs_13 =0xfafe0932
       ,pgs_10 = "cwmx.wdf"
       }
	ZhandouModel["影精灵_双巨坤"]={
        pgs_1 = 0xfafe0930 --攻击
       ,pgs_2 = 0xfafe0923 --攻击2
       ,pgs_3 = 0xfafe0924 --死亡
       ,pgs_4 = 0xfafe0925 --防御
       ,pgs_6 = 0xfafe0926 --待战
       ,pgs_7 = 0xfafe0927 --施法
       ,pgs_8 = 0xfafe0928 --跑去
       ,pgs_9 = 0xfafe0929 --挨打
       ,pgs_11 =0xfafe0932
       ,pgs_12 =0xfafe0931  
       ,pgs_13 =0xfafe0932
       ,pgs_10 = "cwmx.wdf"
       }
   ZhandouModel["顽石双斧(坤)_影精灵"]={
       pgs_1 = 0xfafe0957 --攻击
       ,pgs_2 = 0xfafe0957 --攻击2
       ,pgs_3 = 0xfafe0958 --死亡
       ,pgs_4 = 0xfafe0959 --防御
       ,pgs_6 = 0xfafe0960 --待战
       ,pgs_7 = 0xfafe0961 --施法
       ,pgs_8 = 0xfafe0962 --跑去
       ,pgs_9 = 0xfafe0963 --挨打
       ,pgs_10 = "cwmx.wdf"
       }
       --连击1  0xfafe0966   连击2  0xfafe0967   连击3  0xfafe0968
   ZhandouModel["顽石双斧(乾)_影精灵"]={
       pgs_1 = 0xfafe0974 --攻击
       ,pgs_2 = 0xfafe0974 --攻击2
       ,pgs_3 = 0xfafe0975 --死亡
       ,pgs_4 = 0xfafe0976 --防御
       ,pgs_6 = 0xfafe0977 --待战
       ,pgs_7 = 0xfafe0978 --施法
       ,pgs_8 = 0xfafe0979 --跑去
       ,pgs_9 = 0xfafe0980 --挨打
       ,pgs_10 = "cwmx.wdf"
       }
       --连击1  0xfafe0969   连击2  0xfafe0970   连击3  0xfafe0971
   ZhandouModel["镔铁双斧(乾)_影精灵"]={
       pgs_1 = 0xfafe0974 --攻击
       ,pgs_2 = 0xfafe0974 --攻击2
       ,pgs_3 = 0xfafe0975 --死亡
       ,pgs_4 = 0xfafe0976 --防御
       ,pgs_6 = 0xfafe0977 --待战
       ,pgs_7 = 0xfafe0978 --施法
       ,pgs_8 = 0xfafe0979 --跑去
       ,pgs_9 = 0xfafe0980 --挨打
       ,pgs_10 = "cwmx.wdf"
       }
       --连击1  0xfafe0969   连击2  0xfafe0970   连击3  0xfafe0971
   ZhandouModel["镔铁双斧(坤)_影精灵"]={
      pgs_1 = 0xfafe0957 --攻击
       ,pgs_2 = 0xfafe0957 --攻击2
       ,pgs_3 = 0xfafe0958 --死亡
       ,pgs_4 = 0xfafe0959 --防御
       ,pgs_6 = 0xfafe0960 --待战
       ,pgs_7 = 0xfafe0961 --施法
       ,pgs_8 = 0xfafe0962 --跑去
       ,pgs_9 = 0xfafe0963 --挨打
       ,pgs_10 = "cwmx.wdf"
       }
       --连击1  0xfafe0966   连击2  0xfafe0967   连击3  0xfafe0968
   ZhandouModel["黑曜双斧(坤)_影精灵"]={
       pgs_1 = 0xfafe0974 --攻击
       ,pgs_2 = 0xfafe0974 --攻击2
       ,pgs_3 = 0xfafe0975 --死亡
       ,pgs_4 = 0xfafe0976 --防御
       ,pgs_6 = 0xfafe0977 --待战
       ,pgs_7 = 0xfafe0978 --施法
       ,pgs_8 = 0xfafe0979 --跑去
       ,pgs_9 = 0xfafe0980 --挨打
       ,pgs_10 = "cwmx.wdf"
       }
       --连击1  0xfafe0969   连击2  0xfafe0970   连击3  0xfafe0971
   ZhandouModel["黑曜双斧(乾)_影精灵"]={
         pgs_1 = 0xfafe0957 --攻击
       ,pgs_2 = 0xfafe0957 --攻击2
       ,pgs_3 = 0xfafe0958 --死亡
       ,pgs_4 = 0xfafe0959 --防御
       ,pgs_6 = 0xfafe0960 --待战
       ,pgs_7 = 0xfafe0961 --施法
       ,pgs_8 = 0xfafe0962 --跑去
       ,pgs_9 = 0xfafe0963 --挨打
       ,pgs_10 = "cwmx.wdf"
       }
       --连击1  0xfafe0966   连击2  0xfafe0967   连击3  0xfafe0968
   ZhandouModel["枭首双斧(坤)_影精灵"]={
       pgs_1 = 0xfafe0984 --攻击
       ,pgs_2 = 0xfafe0984 --攻击2
       ,pgs_3 = 0xfafe0985 --死亡
       ,pgs_4 = 0xfafe0986 --防御
       ,pgs_6 = 0xfafe0987 --待战
       ,pgs_7 = 0xfafe0988 --施法
       ,pgs_8 = 0xfafe0989 --跑去
       ,pgs_9 = 0xfafe0990 --挨打
       ,pgs_10 = "cwmx.wdf"
       }--连击1  0xfafe0981   连击2  0xfafe0982   连击3  0xfafe0983
   ZhandouModel["枭首双斧(乾)_影精灵"]={
        pgs_1 = 0xfafe0995 --攻击
       ,pgs_2 = 0xfafe0995--攻击2
       ,pgs_3 = 0xfafe0996 --死亡
       ,pgs_4 = 0xfafe0997 --防御
       ,pgs_6 = 0xfafe0998 --待战
       ,pgs_7 = 0xfafe0999 --施法
       ,pgs_8 = 0xfafe1000 --跑去
       ,pgs_9 = 0xfafe1001 --挨打
       ,pgs_10 = "cwmx.wdf"
       }--连击1  0xfafe1002  连击2  0xfafe1003   连击3  0xfafe1004
   ZhandouModel["破军双斧(坤)_影精灵"]={
       pgs_1 = 0xfafe0984 --攻击
       ,pgs_2 = 0xfafe0984 --攻击2
       ,pgs_3 = 0xfafe0985 --死亡
       ,pgs_4 = 0xfafe0986 --防御
       ,pgs_6 = 0xfafe0987 --待战
       ,pgs_7 = 0xfafe0988 --施法
       ,pgs_8 = 0xfafe0989 --跑去
       ,pgs_9 = 0xfafe0990 --挨打
       ,pgs_10 = "cwmx.wdf"
	   ,pgs_11 =0xfafe0983
	   ,pgs_12 =0xfafe0981
       ,pgs_13 =0xfafe0983
       }
   ZhandouModel["破军双斧(乾)_影精灵"]={
       pgs_1 = 0xfafe0995 --攻击
       ,pgs_2 = 0xfafe0995--攻击2
       ,pgs_3 = 0xfafe0996 --死亡
       ,pgs_4 = 0xfafe0997 --防御
       ,pgs_6 = 0xfafe0998 --待战
       ,pgs_7 = 0xfafe0999 --施法
       ,pgs_8 = 0xfafe1000 --跑去
       ,pgs_9 = 0xfafe1001 --挨打
       ,pgs_10 = "cwmx.wdf"
	   ,pgs_11 =0xfafe1004
	   ,pgs_12 =0xfafe1002
       ,pgs_13 =0xfafe1004
       }
   ZhandouModel["飞头蛮(坤)_影精灵"]={
        pgs_1 = 0xfafe1010 --攻击
       ,pgs_2 = 0xfafe1010 --攻击2
       ,pgs_3 = 0xfafe1011 --死亡
       ,pgs_4 = 0xfafe1012 --防御
       ,pgs_6 = 0xfafe1013 --待战
       ,pgs_7 = 0xfafe1014 --施法
       ,pgs_8 = 0xfafe1015--跑去
       ,pgs_9 = 0xfafe1016 --挨打
       ,pgs_10 = "cwmx.wdf"
	   ,pgs_11 =0xfafe1009
	   ,pgs_12 =0xfafe1007
       ,pgs_13 =0xfafe1009
       }
   ZhandouModel["飞头蛮(乾)_影精灵"]={
        pgs_1 = 0xfafe1022 --攻击
       ,pgs_2 = 0xfafe1022 --攻击2
       ,pgs_3 = 0xfafe1023 --死亡
       ,pgs_4 = 0xfafe1024 --防御
       ,pgs_6 = 0xfafe1025 --待战
       ,pgs_7 = 0xfafe1026 --施法
       ,pgs_8 = 0xfafe1027 --跑去
       ,pgs_9 = 0xfafe1028 --挨打
       ,pgs_10 = "cwmx.wdf"
	   ,pgs_11 =0xfafe1021
	   ,pgs_12 =0xfafe1019
       ,pgs_13 =0xfafe1021
       }
   ZhandouModel["竹叶青(坤)_影精灵"]={
       pgs_1 = 0xfafe1031 --攻击
       ,pgs_2 = 0xfafe1031 --攻击2
       ,pgs_3 = 0xfafe1032 --死亡
       ,pgs_4 = 0xfafe1033 --防御
       ,pgs_6 = 0xfafe1034 --待战
       ,pgs_7 = 0xfafe1035 --施法
       ,pgs_8 = 0xfafe1036 --跑去
       ,pgs_9 = 0xfafe1037 --挨打
       ,pgs_10 = "cwmx.wdf"
	   ,pgs_11 =0xfafe1040
	   ,pgs_12 =0xfafe1038
       ,pgs_13 =0xfafe1040
       }--连击1  0xfafe1038   连击2  0xfafe1039  连击3  0xfafe1040
   ZhandouModel["竹叶青(乾)_影精灵"]={
        pgs_1 = 0xfafe1043 --攻击
       ,pgs_2 = 0xfafe1043--攻击2
       ,pgs_3 = 0xfafe1044 --死亡
       ,pgs_4 = 0xfafe1045 --防御
       ,pgs_6 = 0xfafe1046 --待战
       ,pgs_7 = 0xfafe1047 --施法
       ,pgs_8 = 0xfafe1048 --跑去
       ,pgs_9 = 0xfafe1049 --挨打
       ,pgs_10 = "cwmx.wdf"
	   ,pgs_11 =0xfafe1052
	   ,pgs_12 =0xfafe1050
       ,pgs_13 =0xfafe1052
       }
   ZhandouModel["鲛煞(坤)_影精灵"]={
       pgs_1 = 0xfafe1055 --攻击
       ,pgs_2 = 0xfafe1055 --攻击2
       ,pgs_3 = 0xfafe1056 --死亡
       ,pgs_4 = 0xfafe1057 --防御
       ,pgs_6 = 0xfafe1058 --待战
       ,pgs_7 = 0xfafe1059 --施法
       ,pgs_8 = 0xfafe1060 --跑去
       ,pgs_9 = 0xfafe1061 --挨打
       ,pgs_10 = "cwmx.wdf"
	   ,pgs_11 =0xfafe1064
	   ,pgs_12 =0xfafe1062
       ,pgs_13 =0xfafe1064
       }
   ZhandouModel["鲛煞(乾)_影精灵"]={
        pgs_1 = 0xfafe1070 --攻击
       ,pgs_2 = 0xfafe1070 --攻击2
       ,pgs_3 = 0xfafe1071 --死亡
       ,pgs_4 = 0xfafe1072 --防御
       ,pgs_6 = 0xfafe1073 --待战
       ,pgs_7 = 0xfafe1074 --施法
       ,pgs_8 = 0xfafe1075 --跑去
       ,pgs_9 = 0xfafe1076 --挨打
       ,pgs_10 = "cwmx.wdf"
	   ,pgs_11 =0xfafe1069
	   ,pgs_12 =0xfafe1067
       ,pgs_13 =0xfafe1069
       }
   ZhandouModel["啖月(坤)_影精灵"]={
        pgs_1 = 0xfafe1082 --攻击
       ,pgs_2 = 0xfafe1082 --攻击2
       ,pgs_3 = 0xfafe1083 --死亡
       ,pgs_4 = 0xfafe1084 --防御
       ,pgs_6 = 0xfafe1085 --待战
       ,pgs_7 = 0xfafe1086 --施法
       ,pgs_8 = 0xfafe1087 --跑去
       ,pgs_9 = 0xfafe1088 --挨打
       ,pgs_10 = "cwmx.wdf"
	   ,pgs_11 =0xfafe1081
	   ,pgs_12 =0xfafe1080
       ,pgs_13 =0xfafe1081
       }
   ZhandouModel["啖月(乾)_影精灵"]={
        pgs_1 = 0xfafe1091 --攻击
       ,pgs_2 = 0xfafe1091 --攻击2
       ,pgs_3 = 0xfafe1092 --死亡
       ,pgs_4 = 0xfafe1093 --防御
       ,pgs_6 = 0xfafe1094 --待战
       ,pgs_7 = 0xfafe1095 --施法
       ,pgs_8 = 0xfafe1096 --跑去
       ,pgs_9 = 0xfafe1097 --挨打
       ,pgs_10 = "cwmx.wdf"
	   ,pgs_11 =0xfafe1100
	   ,pgs_12 =0xfafe1098
       ,pgs_13 =0xfafe1100
       }
   ZhandouModel["义战(坤)_影精灵"]={
       pgs_1 = 0xfafe1111 --攻击
       ,pgs_2 = 0xfafe1103 --攻击2
       ,pgs_3 = 0xfafe1104 --死亡
       ,pgs_4 = 0xfafe1105 --防御
       ,pgs_6 = 0xfafe1106 --待战
       ,pgs_7 = 0xfafe1107 --施法
       ,pgs_8 = 0xfafe1108 --跑去
       ,pgs_9 = 0xfafe1109 --挨打
       ,pgs_10 = "cwmx.wdf"
	   ,pgs_11 =0xfafe1112
	   ,pgs_12 =0xfafe1110
       ,pgs_13 =0xfafe1112
       }
   ZhandouModel["义战(乾)_影精灵"]={
       pgs_1 = 0xfafe1123 --攻击
       ,pgs_2 = 0xfafe1121 --攻击2
       ,pgs_3 = 0xfafe1115 --死亡
       ,pgs_4 = 0xfafe1116 --防御
       ,pgs_6 = 0xfafe1117 --待战
       ,pgs_7 = 0xfafe1118 --施法
       ,pgs_8 = 0xfafe1119 --跑去
       ,pgs_9 = 0xfafe1120 --挨打
       ,pgs_10 = "cwmx.wdf"
	   ,pgs_11 =0xfafe1124
	   ,pgs_12 =0xfafe1122
       ,pgs_13 =0xfafe1124
       }--连击1  0xfafe1122  连击2  0xfafe1123   连击3  0xfafe1124
   ZhandouModel["恶来(坤)_影精灵"]={
       pgs_1 = 0xfafe1128 --攻击
       ,pgs_2 = 0xfafe1130 --攻击2
       ,pgs_3 = 0xfafe1131 --死亡
       ,pgs_4 = 0xfafe1132 --防御
       ,pgs_6 = 0xfafe1133 --待战
       ,pgs_7 = 0xfafe1134 --施法
       ,pgs_8 = 0xfafe1135 --跑去
       ,pgs_9 = 0xfafe1136 --挨打
       ,pgs_10 = "cwmx.wdf"
	   ,pgs_11 =0xfafe1129
	   ,pgs_12 =0xfafe1127
       ,pgs_13 =0xfafe1129
       }
   ZhandouModel["恶来(乾)_影精灵"]={
       pgs_1 = 0xfafe1138 --攻击
       ,pgs_2 = 0xfafe1142 --攻击2
       ,pgs_3 = 0xfafe1143 --死亡
       ,pgs_4 = 0xfafe1145 --防御
       ,pgs_6 = 0xfafe1146 --待战
       ,pgs_7 = 0xfafe1147 --施法
       ,pgs_8 = 0xfafe1148 --跑去
       ,pgs_9 = 0xfafe1149 --挨打
       ,pgs_10 = "cwmx.wdf"
	   ,pgs_11 =0xfafe1139
	   ,pgs_12 =0xfafe1137
       ,pgs_13 =0xfafe1139
       }
	ZhandouModel["烬世野火(坤)_影精灵"]={
       pgs_1 = 0xfafe1151 --攻击
       ,pgs_2 = 0xfafe1155 --攻击2
       ,pgs_3 = 0xfafe1156 --死亡
       ,pgs_4 = 0xfafe1157 --防御
       ,pgs_6 = 0xfafe1158 --待战
       ,pgs_7 = 0xfafe1159 --施法
       ,pgs_8 = 0xfafe1160 --跑去
       ,pgs_9 = 0xfafe1161 --挨打
       ,pgs_10 = "cwmx.wdf"
	   ,pgs_11 =0xfafe1152
	   ,pgs_12 =0xfafe1150
       ,pgs_13 =0xfafe1152
       }
   ZhandouModel["烬世野火(乾)_影精灵"]={
       pgs_1 = 0xfafe1172 --攻击
       ,pgs_2 = 0xfafe1164 --攻击2
       ,pgs_3 = 0xfafe1165 --死亡
       ,pgs_4 = 0xfafe1166 --防御
       ,pgs_6 = 0xfafe1167 --待战
       ,pgs_7 = 0xfafe1168 --施法
       ,pgs_8 = 0xfafe1169 --跑去
       ,pgs_9 = 0xfafe1170 --挨打
       ,pgs_10 = "cwmx.wdf"
	   ,pgs_11 =0xfafe1173
	   ,pgs_12 =0xfafe1171
       ,pgs_13 =0xfafe1173
       }

   ZhandouModel["九州海沸(坤)_影精灵"]={
       pgs_1 = 0xfafe1183 --攻击
       ,pgs_2 = 0xfafe1176 --攻击2
       ,pgs_3 = 0xfafe1177 --死亡
       ,pgs_4 = 0xfafe1178 --防御
       ,pgs_6 = 0xfafe1179 --待战
       ,pgs_7 = 0xfafe1180 --施法
       ,pgs_8 = 0xfafe1181 --跑去
       ,pgs_9 = 0xfafe1182 --挨打
       ,pgs_10 = "cwmx.wdf"
	   ,pgs_11 =0xfafe1185
	   ,pgs_12 =0xfafe1184
       ,pgs_13 =0xfafe1185
       }
   ZhandouModel["九州海沸(乾)_影精灵"]={
       pgs_1 = 0xfafe1189 --攻击
       ,pgs_2 = 0xfafe1191 --攻击2
       ,pgs_3 = 0xfafe1192 --死亡
       ,pgs_4 = 0xfafe1193--防御
       ,pgs_6 = 0xfafe1194 --待战
       ,pgs_7 = 0xfafe1195 --施法
       ,pgs_8 = 0xfafe1196 --跑去
       ,pgs_9 = 0xfafe1197 --挨打
       ,pgs_10 = "cwmx.wdf"
	   ,pgs_11 =0xfafe1190
	   ,pgs_12 =0xfafe1188
       ,pgs_13 =0xfafe1190
       }
	ZhandouModel["八狱末劫(坤)_影精灵"]={
       pgs_1 = 0xfafe3002 --攻击0xfafe1200
       ,pgs_2 = 0xfafe3003--攻击2
       ,pgs_3 = 0xfafe1201 --死亡
       ,pgs_4 = 0xfafe1202 --防御
       ,pgs_6 = 0xfafe1203 --待战
       ,pgs_7 = 0xfafe1204 --施法
       ,pgs_8 = 0xfafe1205 --跑去
       ,pgs_9 = 0xfafe1206 --挨打
       ,pgs_10 = "cwmx.wdf"
	   ,pgs_11 =0xfafe1209  --挨打
	   ,pgs_12 =0xfafe1208  --挨打
       ,pgs_13 =0xfafe1209  --挨打
       }

   ZhandouModel["八狱末劫(乾)_影精灵"]={
       pgs_1 = 0xfafe3000--攻击
       ,pgs_2 = 0xfafe3001 --攻击2
       ,pgs_3 = 0xfafe1213 --死亡
       ,pgs_4 = 0xfafe1214 --防御
       ,pgs_6 = 0xfafe1215 --待战
       ,pgs_7 = 0xfafe1216 --施法
       ,pgs_8 = 0xfafe1217 --跑去
       ,pgs_9 = 0xfafe1218 --挨打
       ,pgs_10 = "cwmx.wdf"
	   ,pgs_11 = 0xfafe1219
       ,pgs_12 = 0xfafe1212
       ,pgs_13 = 0xfafe1219
       }--连击1  0xfafe1219   连击2  0xfafe1220   连击3  0xfafe1221
   ZhandouModel["罗喉计都(坤)_影精灵"]={
       pgs_1 = 0xfafe1232 --攻击
       ,pgs_2 = 0xfafe1224 --攻击2
       ,pgs_3 = 0xfafe1225 --死亡
       ,pgs_4 = 0xfafe1226 --防御
       ,pgs_6 = 0xfafe1227 --待战
       ,pgs_7 = 0xfafe1228 --施法
       ,pgs_8 = 0xfafe1229 --跑去
       ,pgs_9 = 0xfafe1230 --挨打
       ,pgs_10 = "cwmx.wdf"
	   ,pgs_11 = 0xfafe1233
       ,pgs_12 = 0xfafe1231
       ,pgs_13 = 0xfafe1233
       }
   ZhandouModel["罗喉计都(乾)_影精灵"]={
       pgs_1 = 0xfafe1245 --攻击
       ,pgs_2 = 0xfafe1236 --攻击2
       ,pgs_3 = 0xfafe1237 --死亡
       ,pgs_4 = 0xfafe1238 --防御
       ,pgs_6 = 0xfafe1239 --待战
       ,pgs_7 = 0xfafe1241 --施法
       ,pgs_8 = 0xfafe1242 --跑去
       ,pgs_9 = 0xfafe1243 --挨打
       ,pgs_10 = "cwmx.wdf"
	   ,pgs_11 = 0xfafe1246
       ,pgs_12 = 0xfafe1244
       ,pgs_13 = 0xfafe1246
       }
       --连击1  0xfafe1244   连击2  0xfafe1245   连击3  0xfafe1246
   ZhandouModel["非天(坤)_影精灵"]={
       pgs_1 = 0xfafe1257 --攻击
       ,pgs_2 = 0xfafe1249--攻击2
       ,pgs_3 = 0xfafe1250 --死亡
       ,pgs_4 = 0xfafe1251 --防御
       ,pgs_6 = 0xfafe1252 --待战
       ,pgs_7 = 0xfafe1253 --施法
       ,pgs_8 = 0xfafe1254 --跑去
       ,pgs_9 = 0xfafe1255 --挨打
       ,pgs_10 = "cwmx.wdf"
       ,pgs_11 = 0xfafe1258
       ,pgs_12 = 0xfafe1259
       ,pgs_13 = 0xfafe1258

       }
   ZhandouModel["非天(乾)_影精灵"]={
       pgs_1 = 0xfafe1260 --攻击
       ,pgs_2 = 0xfafe1264 --攻击2
       ,pgs_3 = 0xfafe1265 --死亡
       ,pgs_4 = 0xfafe1266 --防御
       ,pgs_6 = 0xfafe1267 --待战
       ,pgs_7 = 0xfafe1268 --施法
       ,pgs_8 = 0xfafe1269 --跑去
       ,pgs_9 = 0xfafe1270 --挨打
       ,pgs_10 = "cwmx.wdf"
	   ,pgs_11 = 0xfafe1261
       ,pgs_12 = 0xfafe1271
       ,pgs_13 = 0xfafe1261
       }