--[[
    @Author       : GGELUA
    @Date         : 2022-04-03 09:43:50
Last Modified by: GGELUA
Last Modified time: 2023-12-14 14:44:13
--]]
function 取特性(jj)
    local ad = jj.特性
    local ac = jj.特性属性
    local kq = jj.开启
    if ad == "力破" then
        xa = { "#G/" .. ac[1] .. "#Y/", "#R/" .. (ac[2] * 0.1) .. "％#Y/" } --*0.1
    elseif ad == "识物" then
        xa = { "#G/" .. ac[1] .. "％#Y/", "#R/" .. ac[2] .. "#Y/" }
    elseif ad == "灵刃" then
        xa = { "#G/" .. ac[1] .. "％#Y/", "#R/" .. ac[2] .. "％#Y/" }
    elseif ad == "瞬击" then
        xa = { "#G/" .. ac[1] .. "％#Y/", "#R/" .. ac[2] .. "％#Y/" }
    elseif ad == "复仇" then
        xa = { "#G/" .. ac[1] .. "％#Y/", "#R/" .. ac[2] .. "％#Y/" }
    elseif ad == "弑神" then
        xa = { "#G/" .. ac[1] .. "#Y/", "#R/" .. ac[2] .. "％#Y/" }
    elseif ad == "吮魔" then
        xa = { "#G/" .. ac[1] .. "％#Y/", "#R/" .. ac[2] .. "％#Y/" }
    elseif ad == "自恋" then
        xa = { "#G/" .. ac[1] .. "％#Y/", "#R/" .. ac[2] .. "#Y/" }
    elseif ad == "乖巧" then
        xa = { "#G/" .. ac[1] .. "％#Y/", "#R/" .. ac[2] .. "#Y/" }
    elseif ad == "灵动" then
        xa = { "#G/" .. ac[1] .. "％#Y/", "#R/" .. ac[2] .. "#Y/" }
    elseif ad == "逆境" then
        xa = { "#G/" .. ac[1] .. "％#Y/", "#R/" .. ac[2] .. "％#Y/" }
    elseif ad == "灵断" then
        xa = { "#G/" .. ac[1] .. "％#Y/", "#R/" .. ac[2] .. "％#Y/" }
    elseif ad == "争锋" then
        xa = { "#G/" .. ac[1] .. "％#Y/", "#R/" .. ac[2] .. "#Y/" }
    elseif ad == "暗劲" then
        xa = { "#G/" .. ac[1] .. "％#Y/", "#R/" .. ac[2] .. "％#Y/" }
    elseif ad == "顺势" then
        xa = { "#G/" .. ac[1] .. "#Y/", "#R/" .. ac[2] .. "#Y/" }
    elseif ad == "阳护" then
        xa = { "#G/" .. ac[1] .. "％#Y/", "#R/" .. ac[2] .. "％#Y/" }
    elseif ad == "预知" then
        xa = { "#G/" .. ac[1] .. "％#Y/", "#R/" .. ac[2] .. "#Y/" }
    elseif ad == "识药" then
        xa = { "#G/" .. ac[1] .. "％#Y/", "#R/" .. ac[2] .. "％#Y/" }
    elseif ad == "御风" then
        xa = { "#G/" .. ac[1] .. "#Y/", "#R/" .. ac[2] .. "％#Y/" }
    elseif ad == "瞬法" then
        xa = { "#G/" .. ac[1] .. "％#Y/", "#R/" .. ac[2] .. "％#Y/" }
    elseif ad == "灵法" then
        xa = { "#G/" .. ac[1] .. "％#Y/", "#R/" .. ac[2] .. "％#Y/" }
    elseif ad == "怒吼" then
        xa = { "#G/" .. ac[1] .. "#Y/", "#R/" .. ac[2] .. "％#Y/" }
    elseif ad == "洞察" then
        xa = { "#G/" .. ac[1] .. "％#Y/", "#R/" .. ac[2] .. "#Y/" }
    elseif ad == "抗物" then
        xa = { "#G/" .. ac[1] .. "#Y/", "#R/" .. ac[2] .. "％#Y/" }
    elseif ad == "抗法" then
        xa = { "#G/" .. ac[1] .. "#Y/", "#R/" .. ac[2] .. "％#Y/" }
    elseif ad == "护佑" then
        xa = { "#G/" .. ac[1] .. "#Y/", "#R/" .. ac[2] .. "％#Y/" }
    elseif ad == "巧劲" then
        xa = { "#G/" .. ac[1] .. "#Y/", "#R/" .. ac[2] .. "％#Y/" }
    end

    local a
    if ad == "灵刃" then
        a = "#Y/第二回合以后进场时，" ..
            xa[1] ..
            "概率对自身造成#R/30%#Y/气血上限的伤害并且物理伤害结果提高#R/50%#Y/，持续4回合，防御力，法术防御力降低" .. xa[2] .. "(带有茁壮、欣欣向荣、鬼魂、神佑类技能时，伤害结果只提高10%)"
    elseif ad == "灵法" then
        a = "#Y/第二回合进场后，" ..
            xa[1] ..
            "几率对自身造成30%气血上限的伤害，并提高50%法术伤害结果。持续#R/4#Y/回合,防御力，法术防御力降低" .. xa[2] .. "(带有茁壮、欣欣向荣、鬼魂、神佑类技能时，伤害结果只提高10%)"
    elseif ad == "预知" then
        a = "#Y/感受到危险时有" .. xa[1] .. "概率喊话,每场战斗最多3次,全属性降低" .. xa[2]
    elseif ad == "灵动" then
        a = "#Y/行动时有" .. xa[1] .. "概率与队友进行交流，每场战斗最多3次，全属性降低" .. xa[2]
    elseif ad == "瞬击" then
        a = "#Y/第二回合以后进场时，" .. xa[1] .. "概率对气血百分比最低的单位发动一次攻击，气血上限降低" .. xa[2]
    elseif ad == "抗法" then
        a = "#Y/在场时，我方所有单位法术防御增加" .. xa[1] .. "，自身受到物理伤害增加" .. xa[2]
    elseif ad == "阳护" then
        a = "#Y/第二回合以后进场时，" .. xa[1] .. "减少所有我方单位身上“死亡禁锢”状态4回合，防御力下降" .. xa[2]
    elseif ad == "识物" then
        a = "#Y/召唤兽套装附带的技能为法术技能时，触发概率提高" .. xa[1] .. "全属性降低" .. xa[2]
    elseif ad == "洞察" then
        a = "#Y/PVP战斗中行动时有" .. xa[1] .. "概率发现什么，全属性降低" .. xa[2]
    elseif ad == "弑神" then
        a = "#Y/对已经神佑过的召唤兽法术伤害增加" .. xa[1] .. "，普通攻击命中率下降" .. xa[2]
    elseif ad == "御风" then
        a = "#Y/进场时提高主人的速度" .. xa[1] .. "，倒地或者死亡后无效，持续3回合，受到所有伤害增加" .. xa[2]
    elseif ad == "顺势" then
        a = "#Y/对气血百分低于#G/70%#Y/的单位法术伤害增加" .. xa[1] .. "，对其余单位法术伤害力降低" .. xa[2]
    elseif ad == "复仇" then
        a = "#Y/主人被击倒时，有" .. xa[1] .. "概率向敌方单位发动一次攻击，最多生效3次。防御力、法术防御力降低" .. xa[2]
    elseif ad == "自恋" then
        a = "#Y/普通物理攻击击杀任意单位时有" .. xa[1] .. "概率进行炫耀，每场战斗最多1次，全属性降低" .. xa[2]
    elseif ad == "怒吼" then
        a = "#Y/第二回合以后进场时，我方伤害最高的单位提高" .. xa[1] .. "伤害力，持续2回合，法术伤害力降低" .. xa[2]
    elseif ad == "暗劲" then
        a = "#Y/属性法术被吸收时，有" .. xa[1] .. "概率使恢复量不超过1,普通物理攻击命中率下降" .. xa[2]
    elseif ad == "逆境" then
        a = "#Y/进场时，若已方四个以上单位处于被封印状态，则" .. xa[1] .. "解除我方所有单位异常状态，防御力下降" .. xa[2]
    elseif ad == "瞬法" then
        a = "#Y/第2回合以后进场时，" .. xa[1] .. "概率对血量百分比最低的单位使用随机法术，气血上限降低" .. xa[2]
    elseif ad == "乖巧" then
        a = "#Y/使用超级巫医时，耗费的银两降低" .. xa[1] .. "，全属性降低" .. xa[2]
    elseif ad == "抗物" then
        a = "#Y/在场时，我方所有单位物理防御增加" .. xa[1] .. "，自身受到法术伤害增加" .. xa[2]
    elseif ad == "护佑" then
        a = "#Y/第2回合进场，我方百分比气血最低的单位受到的伤害降低" .. xa[1] .. "持续2回合，法术伤害力降低#R/" .. xa[2]
    elseif ad == "识药" then
        a = "#Y/使用药品效果提升" .. xa[1] .. "，受到的所有伤害增加" .. xa[2]
    elseif ad == "吮魔" then
        a = "#Y/普通物理攻击时，吸取对方损失气血" .. xa[1] .. "的魔法，对当前魔法高于#R/50%#Y/的单位伤害结果少" .. xa[2]
    elseif ad == "灵断" then
        a = "#Y/第二回合以后进场时，" ..
            xa[1] ..
            "几率对自身造成#R/30%#Y/气血上限的伤害，无视敌方神佑、鬼魂类技能，持续#R/4#Y/回合，气血上限降低#G/" .. xa[2] ..
            "#Y/(带有鬼魂类或者神佑技能时，进场对自己造成#R/60%#Y/气血上限伤害)"
    elseif ad == "争锋" then
        a = "#Y/对召唤兽物理伤害结果增加" .. xa[1] .. "对人物伤害结果减少" .. xa[2]
    elseif ad == "力破" then
        a = "#Y/忽略人物角色#G/" .. xa[1] .. "#Y/防御力" .. "减少对召唤兽的伤害结果#R" .. xa[2] .. "#Y。对NPC无效果"
    elseif ad == "巧劲" then
        a = "#Y/普通攻击伤害结果增加" .. xa[1] .. "，受到的所有伤害增加" .. xa[2]
    end
    if kq and a then
        a = a .. "\n#R[左键点击可关闭特性效果]"
    else
        a = "\n#R[左键点击可开启特性效果]"
    end
    return a
end
