

function 取法宝类型(sj)
	local lssj = { "恢复", "辅助", "防御", "攻击", "诅咒" }
	return lssj[sj + 0]
end

__取背包物品数量 = function (名称)
      local 数量 = 0
  for i = 1, 80 do
    if 多开数据[多开数据.当前].__主控.道具列表[i] ~= nil and 多开数据[多开数据.当前].__主控.道具列表[i].名称 == 名称 then
      if nil == 多开数据[多开数据.当前].__主控.道具列表[i].数量 then
        数量 = 数量 + 1
      else
        数量 = 数量 + 多开数据[多开数据.当前].__主控.道具列表[i].数量
      end
    end
  end
  return 数量
end

function 取境界(j, w)
	if w == 1 then
		if j == 0 then
			return "#C/略晓变化"
		elseif j == 1 then
			return "#W/略晓变化"
		elseif j == 2 then
			return "#S/驾轻就熟"
		elseif j == 3 then
			return "#S/心领神会"
		elseif j == 4 then
			return "#S/出类拔萃"
		elseif j == 5 then
			return "#S/腾云驾雾"
		elseif j == 6 then
			return "#S/降龙伏虎"
		elseif j == 7 then
			return "#S/神乎其技"
		elseif j == 8 then
			return "#S/纵横三界"
		elseif j == 9 then
			return "#S/不堕轮回"
		end
	elseif w == 2 then
		if j == 0 or j == 1 then
			return "#C/了然于胸"
		elseif j == 2 then
			return "#W/妙领天机"
		elseif j == 3 then
			return "#S/渐入佳境"
		elseif j == 4 then
			return "#S/预知福祸"
		elseif j == 5 then
			return "#S/脱胎换骨"
		elseif j == 6 then
			return "#S/出神入化"
		elseif j == 7 then
			return "#S/呼风唤雨"
		elseif j == 8 then
			return "#S/随心所欲"
		elseif j == 9 then
			return "#S/登峰造极"
		elseif j == 10 then
			return "#S/道满根归"
		elseif j == 11 then
			return "#S/不堕轮回"
		elseif j == 12 then
			return "#S/法力无边"
		end
	elseif w == 3 or w == 4 then
		if j == 0 or j == 1 then
			return "#C/一日千里"
		elseif j == 2 then
			return "#W/脱胎换骨"
		elseif j == 3 then
			return "#S/负海担山"
		elseif j == 4 then
			return "#S/霞举飞升"
		elseif j == 5 then
			return "#S/移星换斗"
		elseif j == 6 then
			return "#S/变幻莫测"
		elseif j == 7 then
			return "#S/擎日挽月"
		elseif j == 8 then
			return "#S/道满根归"
		elseif j == 9 then
			return "#S/不堕轮回"
		elseif j == 10 then
			return "#S/举世无双"
		elseif j == 11 then
			return "#S/纵横三界"
		elseif j == 12 then
			return "#S/笑傲西游"
		elseif j == 13 then
			return "#S/法力无边"
		elseif j == 14 then
			return "#S/反璞归真"
		elseif j == 15 then
			return "#S/天人合一"
		elseif j == 16 then
			return "#S/物我两忘"
		elseif j == 17 then
			return "#S/再厉尘劫"
		elseif j == 18 then
			return "#S/浴火涅磐"
		end
	end
end


function 取法宝类型(sj)
	local lssj = {"恢复","辅助","防御","攻击","诅咒"}
	return lssj[sj+0]
end


function 数字转大写(a)
	if a == 1 then
		return "一"
	elseif a == 2 then
		return "二"
	elseif a == 3 then
		return "三"
	elseif a == 4 then
		return "四"
	elseif a == 5 then
		return "五"
	elseif a == 6 then
		return "六"
	elseif a == 7 then
		return "七"
	elseif a == 8 then
		return "八"
	elseif a == 9 then
		return "九"
	elseif a == 10 then
		return "十"
	end
end


function 取重复名物品(wp)
	local wds = {}
	if wp.名称 == "七彩礼盒" and wp.总类 == 121 then
		if wp.子类 == 1 then
			wp.小模型资源 = 0x6853A6ED
			wp.大模型资源 = 0xB0087763
			wp.资源 = "item.wdf"
		elseif wp.子类 == 2 then
			wp.小模型资源 = 0x9D18052B
			wp.大模型资源 = 0x012BAF1D
			wp.资源 = "item.wdf"
		elseif wp.子类 == 3 then
			wp.小模型资源 = 0x3931E88A
			wp.大模型资源 = 0xF65F219F
			wp.资源 = "item.wdf"
		elseif wp.子类 == 4 then
			wp.小模型资源 = 0x5F91D282
			wp.大模型资源 = 0xC4CB01E8
			wp.资源 = "item.wdf"
		elseif wp.子类 == 5 then
			wp.小模型资源 = 0x16D49102
			wp.大模型资源 = 0x4BBC2FC7
			wp.资源 = "item.wdf"
		elseif wp.子类 == 6 then
			wp.小模型资源 = 0x4D6DB56C
			wp.大模型资源 = 0x85C409C5
			wp.资源 = "item.wdf"
		elseif wp.子类 == 7 then
			wp.小模型资源 = 0xFC9B9B95
			wp.大模型资源 = 0xD3BAD3DB
			wp.资源 = "item.wdf"
		elseif wp.子类 == 8 then
			wp.小模型资源 = 0x9C455417
			wp.大模型资源 = 0x24AA3228
			wp.资源 = "item.wdf"
		elseif wp.子类 == 9 then
			wp.小模型资源 = 0x331341CF
			wp.大模型资源 = 0x94FFDE01
			wp.资源 = "item.wdf"
		end
	elseif wp.名称 == "新春导标旗" and wp.总类 == 11 then
		if wp.子类 == 1 then --黄色
			wp.小模型资源 = 0x3c559d3b
			wp.大模型资源 = 0x1b910784
			wp.资源 = "common/item.wdf"
		elseif wp.子类 == 2 then --绿色
			wp.小模型资源 = 0x3fccfb71
			wp.大模型资源 = 0x7a20f2d
			wp.资源 = "common/item.wdf"
		elseif wp.子类 == 3 then -- 红色
			wp.小模型资源 = 0xb451d176
			wp.大模型资源 = 0x2c95bd3b
			wp.资源 = "common/item.wdf"
		elseif wp.子类 == 4 then -- 蓝色
			wp.小模型资源 = 0x4f20b0c1
			wp.大模型资源 = 0x8756e0d2
			wp.资源 = "common/item.wdf"
		end
	elseif wp.名称 == "精魄灵石" and wp.总类 == 105 then
		if wp.子类 == 1 then
			wp.小模型资源 = 0xfc91c407
			wp.大模型资源 = 0x6397856f
			wp.资源 = "item.wdf"
		elseif wp.子类 == 2 then
			wp.小模型资源 = 0xfc91c407
			wp.大模型资源 = 0x6397856f
			wp.资源 = "item.wdf"
		elseif wp.子类 == 3 then
			wp.小模型资源 = 0x9b0688a2
			wp.大模型资源 = 0xacac92bb
			wp.资源 = "item.wdf"
		elseif wp.子类 == 4 then
			wp.小模型资源 = 0x9b0688a2
			wp.大模型资源 = 0xacac92bb
			wp.资源 = "item.wdf"
		elseif wp.子类 == 5 then
			wp.小模型资源 = 0x3be0a96e
			wp.大模型资源 = 0x489cfc78
			wp.资源 = "item.wdf"
		elseif wp.子类 == 6 then
			wp.小模型资源 = 0x3be0a96e
			wp.大模型资源 = 0x489cfc78
			wp.资源 = "item.wdf"
		end
	end
	return wp.小模型资源
end

function 刷新道具行囊(内容, 类型, 当前)
	if 内容.银子 ~= nil then
		多开数据[当前 or self and self.当前].角色信息.银子 = 内容.银子
	end
	if 内容.储备 ~= nil then
		多开数据[当前 or self and self.当前].角色信息.储备 = 内容.储备
	end
	if 内容.存银 ~= nil then
		多开数据[当前 or self and self.当前].角色信息.存银 = 内容.存银
	end
	if 内容.装备 ~= nil then
		多开数据[当前 or self and self.当前].角色信息.装备 = 内容.装备
	end
	if 内容.灵饰 ~= nil then
		多开数据[当前 or self and self.当前].角色信息.灵饰 = 内容.灵饰
	end
	if 类型 == "行囊" then
		for i = 1, 20 do
			多开数据[当前].__主控.行囊列表[i] = 内容.道具[i]
		end
		if 多开数据[当前].__UI界面.窗口层.道具行囊.是否可见 then
			多开数据[当前].__UI界面.窗口层.道具行囊:重置(true)
		end
	elseif 类型 == "任务包裹" then
		for i = 1, 20 do
			多开数据[当前].__主控.任务道具列表[i] = 内容.道具[i]
		end
		if 多开数据[当前].__UI界面.窗口层.道具行囊.是否可见 then
			多开数据[当前].__UI界面.窗口层.道具行囊:重置(true)
		end
	else
		for i = 1, 80 do
			多开数据[当前].__主控.道具列表[i] = 内容.道具[i]
		end
		if 多开数据[当前].__UI界面.窗口层.召唤兽洗炼.是否可见 then
			多开数据[当前].__UI界面.窗口层.召唤兽洗炼.道具 = 多开数据[当前].__主控.道具列表
			多开数据[当前].__UI界面.窗口层.召唤兽洗炼.材料网格:刷新物品()
		end
		if 多开数据[当前].__UI界面.窗口层.商会上架道具.是否可见 then
			多开数据[当前].__UI界面.窗口层.商会上架道具.物品控件.道具网格:置物品(多开数据[当前].__主控.道具列表)
		end
	end
end

function 刷新道具逻辑(物品, 指定ID, 及时刷新, 当前) -- 及时刷新物品逻辑
	-- 及时刷新有关道具的数据
	if 物品 or 及时刷新 then
		多开数据[当前].__主控.道具列表[指定ID] = 物品
	end
end

function 刷新宝宝列表(内容, 当前)
	多开数据[当前 or self and self.当前].角色信息.宝宝列表 = 内容
end

染色信息={
	通用={方案={[1]=1,[2]=1},id=301},
	护卫={方案={[1]=1,[2]=0},id=2051},
	泡泡={方案={[1]=1,[2]=0},id=701},
	树怪={方案={[1]=1,[2]=0},id=56},
	大海龟={方案={[1]=1,[2]=0},id=69},
	巨蛙={方案={[1]=1,[2]=0},id=70},
	章鱼={方案={[1]=2},id=119},
	海星={方案={[1]=0},id=119},
	野猪={方案={[1]=1,[2]=0},id=52},
	大蝙蝠={方案={[1]=1,[2]=0},id=66},
	海毛虫={方案={[1]=1,[2]=0},id=67},
	狸={方案={[1]=5},id=2079},
	强盗={方案={[1]=1,[2]=0},id=74},
	山贼={方案={[1]=1,[2]=0},id=75},
	赌徒={方案={[1]=1,[2]=0},id=76},
	狐狸精={方案={[1]=1,[2]=0},id=81},
	羊头怪={方案={[1]=1,[2]=0},id=54},
	花妖={方案={[1]=1,[2]=0},id=58},
	骷髅怪={方案={[1]=1,[2]=0},id=60},
	蛤蟆精={方案={[1]=1,[2]=0},id=61},
	老虎={方案={[1]=1,[2]=0},id=64},
	黑熊={方案={[1]=1,[2]=0},id=65},
	野鬼={方案={[1]=1,[2]=0},id=80},
	虾兵={方案={[1]=1,[2]=0},id=83},
	蟹将={方案={[1]=1,[2]=0},id=84},
	牛妖={方案={[1]=1,[2]=0},id=87},
	小龙女={方案={[1]=1,[2]=0},id=63},
	狼={方案={[1]=1,[2]=0},id=68},
	牛头={方案={[1]=1,[2]=0},id=77},
	马面={方案={[1]=1,[2]=0},id=78},
	僵尸={方案={[1]=1,[2]=0},id=79},
	龟丞相={方案={[1]=1,[2]=0},id=85},
	蜘蛛精={方案={[1]=1,[2]=0},id=80},
	兔子怪={方案={[1]=1,[2]=0},id=51},
	黑熊精={方案={[1]=1,[2]=0},id=53},
	黑山老妖={方案={[1]=1,[2]=1},id=93},
	蝴蝶仙子={方案={[1]=1,[2]=0},id=57},
	雷鸟人={方案={[1]=1,[2]=0},id=62},
	白熊={方案={[1]=1,[2]=1},id=72},
	古代瑞兽={方案={[1]=1,[2]=1},id=73},
	善财童子={方案={[1]=1,[2]=1},id=703},
	哮天犬={方案={[1]=1,[2]=1},id=701},
	天兵={方案={[1]=1,[2]=0},id=82},
	天将={方案={[1]=1,[2]=0},id=71},
	风伯={方案={[1]=1,[2]=0},id=89},
	地狱战神={方案={[1]=1,[2]=1},id=94},
	花铃={方案={[1]=1,[2]=1},id=702},
	蛟龙={方案={[1]=1,[2]=1},id=90},
	凤凰={方案={[1]=1,[2]=1},id=91},
	蚌精={方案={[1]=1},id=20306},
	鲛人={方案={[1]=1,[2]=1},id=2057},
	碧水夜叉={方案={[1]=1},id=2059},
	雨师={方案={[1]=1,[2]=0},id=114},
	月影仙={方案={[1]=1,[2]=0},id=702},
	星灵仙子={方案={[1]=1,[2]=1},id=88},
	巡游天神={方案={[1]=1,[2]=1},id=92},
	犀牛将军人形={方案={[1]=1,[2]=0},id=704},
	犀牛将军兽形={方案={[1]=0,[2]=5},id=20104},
	锦毛貂精={方案={[1]=0,[2]=3},id=20103},
	芙蓉仙子={方案={[1]=1,[2]=1},id=55},
	如意仙子={方案={[1]=1,[2]=1},id=59},
	千年蛇魅={方案={[1]=5,[2]=0},id=20104},
	野猪精={方案={[1]=1,[2]=1},id=107},
	百足将军={方案={[1]=1,[2]=1},id=108},
	鼠先锋={方案={[1]=1,[2]=0},id=109},
	泪妖={方案={[1]=6},id=20113},
	镜妖={方案={[1]=1,[2]=0},id=2062},
	吸血鬼={方案={[1]=1,[2]=0},id=96},
	幽灵={方案={[1]=1,[2]=0},id=97},
	灵符女娲={方案={[1]=1,[2]=0},id=98},
	律法女娲={方案={[1]=1,[2]=0},id=99},
	阴阳伞={方案={[1]=1,[2]=0},id=2070},
	鬼将={方案={[1]=1,[2]=0},id=95},
	净瓶女娲={方案={[1]=1,[2]=0},id=100},
	幽萤娃娃={方案={[1]=4,[2]=0},id=20113},
	画魂={方案={[1]=4,[2]=0},id=20113},
	云游火={方案={[1]=1,[2]=0},id=704},
	狐不归={方案={[1]=1,[2]=0},id=706},
	大力金刚={方案={[1]=1,[2]=0},id=101},
	夜罗刹={方案={[1]=1,[2]=0},id=104},
	雾中仙={方案={[1]=0,[2]=1},id=102},
	灵鹤={方案={[1]=1,[2]=0},id=103},
	炎魔神={方案={[1]=1,[2]=0},id=105},
	噬天虎={方案={[1]=1,[2]=0},id=106},
	琴仙={方案={[1]=1,[2]=0},id=2071},
	金饶僧={方案={[1]=0,[2]=1},id=2069},
	月魅={方案={[1]=1,[2]=0},id=707},
	踏云兽={方案={[1]=0,[2]=1},id=110},
	红萼仙子={方案={[1]=0,[2]=1},id=111},
	葫芦宝贝={方案={[1]=1,[2]=0},id=2071},
	蝎子精={方案={[1]=1,[2]=0},id=2071},
	龙龟={方案={[1]=0,[2]=1},id=112},
	机关人人形={方案={[1]=1,[2]=0},id=708},
	机关人车={方案={[1]=1,[2]=0},id=2070},
	猫灵兽形={方案={[1]=0,[2]=1},id=2057},
	狂豹兽形={方案={[1]=1,[2]=0},id=2065},
	机关兽={方案={[1]=1,[2]=0},id=2070},
	连弩车={方案={[1]=1,[2]=0},id=2070},
	机关鸟={方案={[1]=1,[2]=0},id=2070},
	巴蛇={方案={[1]=1,[2]=0},id=2070},
	长眉灵猴={方案={[1]=1,[2]=0},id=2051},
	巨力神猿={方案={[1]=0,[2]=1},id=2079},
	修罗傀儡鬼={方案={[1]=1,[2]=0},id=2065},
	藤蔓妖花={方案={[1]=1,[2]=0},id=2042},
	蜃气妖={方案={[1]=5,[2]=0},id=2079},
	猫灵人形={方案={[1]=1,[2]=0},id=723},
	狂豹人形={方案={[1]=3,[2]=0},id=20230},
	混沌兽={方案={[1]=6,[2]=0},id=2078},
	修罗傀儡妖={方案={[1]=5,[2]=0},id=2078},
	金身罗汉={方案={[1]=2,[2]=0},id=2000},
	曼珠沙华={方案={[1]=1,[2]=0},id=2070},
	持国巡守={方案={[1]=1,[2]=0},id=709},
	毗舍童子={方案={[1]=1,[2]=0},id=84},
	真陀护法={方案={[1]=1,[2]=0},id=710},
	增长巡守={方案={[1]=1,[2]=0},id=711},
	灵灯侍者={方案={[1]=1,[2]=0},id=712},
	般若天女={方案={[1]=1,[2]=0},id=713},
	涂山雪={方案={[1]=1,[2]=0},id=702},
	谛听={方案={[1]=1,[2]=0},id=704},
	进阶黑山老妖={方案={[1]=1,[2]=0},id=706},
	进阶蝴蝶仙子={方案={[1]=1,[2]=0},id=714},
	进阶雷鸟人={方案={[1]=1,[2]=0},id=711},
	进阶白熊={方案={[1]=1,[2]=0},id=711},
	进阶古代瑞兽={方案={[1]=1,[2]=1},id=711},
	进阶善财童子={方案={[1]=1,[2]=0},id=710},
	进阶哮天犬={方案={[1]=1,[2]=0},id=715},
	进阶天兵={方案={[1]=1,[2]=0},id=714},
	进阶风伯={方案={[1]=1,[2]=0},id=716},
	进阶地狱战神={方案={[1]=1,[2]=0},id=705},
	进阶花铃={方案={[1]=1,[2]=0},id=702},
	进阶天将={方案={[1]=1,[2]=0},id=716},
	进阶蛟龙={方案={[1]=1,[2]=0},id=703},
	进阶凤凰={方案={[1]=1,[2]=0},id=714},
	进阶蚌精={方案={[1]=1,[2]=0},id=714},
	进阶鲛人={方案={[1]=1,[2]=0},id=712},
	进阶碧水夜叉={方案={[1]=1,[2]=0},id=710},
	进阶雨师={方案={[1]=1,[2]=0},id=717},
	进阶月影仙={方案={[1]=1,[2]=0},id=702},
	进阶星灵仙子={方案={[1]=1,[2]=0},id=704},
	进阶巡游天神={方案={[1]=1,[2]=0},id=708},
	进阶犀牛将军人形={方案={[1]=1,[2]=0},id=712},
	进阶犀牛将军兽形={方案={[1]=1,[2]=0},id=712},
	进阶锦毛貂精={方案={[1]=1,[2]=0},id=715},
	进阶芙蓉仙子={方案={[1]=1,[2]=0},id=712},
	进阶如意仙子={方案={[1]=1,[2]=0},id=708},
	进阶千年蛇魅={方案={[1]=1,[2]=0},id=718},
	进阶野猪精={方案={[1]=1,[2]=1},id=711},
	进阶百足将军={方案={[1]=1,[2]=1},id=711},
	进阶鼠先锋={方案={[1]=1,[2]=0},id=715},
	进阶泪妖={方案={[1]=1,[2]=0},id=702},
	进阶镜妖={方案={[1]=1,[2]=0},id=710},
	进阶吸血鬼={方案={[1]=1,[2]=0},id=702},
	进阶幽灵={方案={[1]=1,[2]=0},id=719},
	进阶灵符女娲={方案={[1]=1,[2]=0},id=712},
	进阶律法女娲={方案={[1]=1,[2]=0},id=714},
	进阶阴阳伞={方案={[1]=1,[2]=0},id=712},
	进阶鬼将={方案={[1]=1,[2]=1},id=708},
	进阶净瓶女娲={方案={[1]=1,[2]=0},id=719},
	进阶幽萤娃娃={方案={[1]=1,[2]=0},id=710},
	进阶画魂={方案={[1]=1,[2]=0},id=712},
	进阶云游火={方案={[1]=1,[2]=0},id=702},
	进阶狐不归={方案={[1]=1,[2]=0},id=702},
	进阶大力金刚={方案={[1]=1,[2]=0},id=702},
	进阶夜罗刹={方案={[1]=1,[2]=0},id=715},
	进阶雾中仙={方案={[1]=1,[2]=0},id=708},
	进阶灵鹤={方案={[1]=1,[2]=0},id=709},
	进阶炎魔神={方案={[1]=1,[2]=0},id=702},
	进阶噬天虎={方案={[1]=1,[2]=0},id=702},
	进阶琴仙={方案={[1]=1,[2]=0},id=712},
	进阶金饶僧={方案={[1]=1,[2]=0},id=714},
	进阶月魅={方案={[1]=1,[2]=0},id=702},
	进阶踏云兽={方案={[1]=1,[2]=0},id=702},
	进阶红萼仙子={方案={[1]=1,[2]=0},id=712},
	进阶葫芦宝贝={方案={[1]=1,[2]=0},id=712},
	进阶蝎子精={方案={[1]=1,[2]=0},id=712},
	进阶龙龟={方案={[1]=1,[2]=0},id=714},
	进阶机关人人形={方案={[1]=1,[2]=0},id=716},
	进阶猫灵兽形={方案={[1]=1,[2]=0},id=703},
	进阶狂豹兽形={方案={[1]=1,[2]=0},id=708},
	进阶机关兽={方案={[1]=1,[2]=0},id=702},
	进阶机关鸟={方案={[1]=1,[2]=0},id=702},
	进阶连弩车={方案={[1]=1,[2]=0},id=702},
	进阶巴蛇={方案={[1]=1,[2]=0},id=720},
	进阶长眉灵猴={方案={[1]=1,[2]=0},id=712},
	进阶巨力神猿={方案={[1]=1,[2]=0},id=712},
	进阶修罗傀儡鬼={方案={[1]=1,[2]=0},id=712},
	进阶藤蔓妖花={方案={[1]=1,[2]=0},id=712},
	进阶蜃气妖={方案={[1]=1,[2]=0},id=702},
	进阶猫灵人形={方案={[1]=1,[2]=0},id=718},
	进阶狂豹人形={方案={[1]=1,[2]=0},id=714},
	进阶混沌兽={方案={[1]=1,[2]=0},id=702},
	进阶修罗傀儡妖={方案={[1]=1,[2]=0},id=712},
	进阶金身罗汉={方案={[1]=1,[2]=0},id=712},
	进阶曼珠沙华={方案={[1]=1,[2]=0},id=716},
	进阶持国巡守={方案={[1]=1,[2]=0},id=708},
	进阶毗舍童子={方案={[1]=1,[2]=0},id=717},
	进阶真陀护法={方案={[1]=1,[2]=0},id=716},
	进阶增长巡守={方案={[1]=1,[2]=0},id=712},
	进阶灵灯侍者={方案={[1]=1,[2]=0},id=712},
	进阶般若天女={方案={[1]=1,[2]=0},id=712},
	进阶涂山雪={方案={[1]=1,[2]=0},id=702},
	进阶谛听={方案={[1]=1,[2]=0},id=702},
	小毛头={方案={[1]=1,[2]=0},id=704},
	小丫丫={方案={[1]=1,[2]=0},id=703},
	小魔头={方案={[1]=1,[2]=0},id=719},
	小精灵={方案={[1]=1,[2]=0},id=715},
	小仙灵={方案={[1]=1,[2]=0},id=705},
	小仙女={方案={[1]=1,[2]=0},id=715},
	进阶小毛头={方案={[1]=1,[2]=0},id=714},
	进阶小丫丫={方案={[1]=1,[2]=0},id=714},
	进阶小魔头={方案={[1]=1,[2]=0},id=708},
	进阶小精灵={方案={[1]=1,[2]=0},id=716},
	进阶小仙灵={方案={[1]=1,[2]=0},id=710},
	进阶小仙女={方案={[1]=1,[2]=0},id=714},
	牛魔王={方案={[1]=1,[2]=0},id=716},
	大大王={方案={[1]=1,[2]=0},id=716},
	程咬金={方案={[1]=1,[2]=0},id=711},
	观音菩萨={方案={[1]=1,[2]=0},id=702},
	空度禅师={方案={[1]=1,[2]=0},id=711},
	孙婆婆={方案={[1]=1,[2]=0},id=722},
	地涌夫人={方案={[1]=1,[2]=0},id=711},
	地藏菩萨={方案={[1]=1,[2]=0},id=711},
	白晶晶={方案={[1]=1,[2]=0},id=702},
	阎罗王={方案={[1]=1,[2]=0},id=719},
	镇元子={方案={[1]=1,[2]=0},id=702},
	李天王={方案={[1]=1,[2]=0},id=719},
	巫奎虎={方案={[1]=1,[2]=0},id=702},
	东海龙王={方案={[1]=1,[2]=0},id=702},
	菩提老祖={方案={[1]=1,[2]=0},id=703},
	二郎神={方案={[1]=1,[2]=0},id=702},
	周杰伦={方案={[1]=1,[2]=0},id=708},
	齐天大圣={方案={[1]=1,[2]=0},id=702},
	猪八戒={方案={[1]=1,[2]=0},id=702},
	烟花占卜师={方案={[1]=1,[2]=0},id=714},
	春十三娘={方案={[1]=1,[2]=0},id=715},
	有个和尚={方案={[1]=1,[2]=0},id=715},
	郑镖头={方案={[1]=1,[2]=0},id=715},
	天马={方案={[1]=1,[2]=0},id=702},
	九头虫={方案={[1]=1,[2]=0},id=702},
	九灵元圣={方案={[1]=1,[2]=0},id=702},
	腾蛇炫卡={方案={[1]=1,[2]=0},id=702},
	小象炫卡={方案={[1]=1,[2]=0},id=702},
	雪人炫卡={方案={[1]=1,[2]=0},id=712},
	蚩尤={方案={[1]=1,[2]=0},id=702},
	知了王={方案={[1]=1,[2]=0},id=702},
	九色鹿={方案={[1]=1,[2]=0},id=702},
	沙和尚={方案={[1]=1,[2]=0},id=702},
	自在天魔={方案={[1]=1,[2]=0},id=718},
	自在天魔宝珠={方案={[1]=1,[2]=0},id=702},
	自在天魔刀={方案={[1]=1,[2]=0},id=702},
	自在天魔宝剑={方案={[1]=1,[2]=0},id=702},
	自在天魔经筒={方案={[1]=1,[2]=0},id=702},
	自在天魔弓弩={方案={[1]=1,[2]=0},id=702},
	自在天魔法杖={方案={[1]=1,[2]=0},id=702},
	自在天魔斧钺={方案={[1]=1,[2]=0},id=702},
	飞燕女={方案={[1]=1,[2]=1},id=3},
	英女侠={方案={[1]=1,[2]=1},id=4},
	巫蛮儿={方案={[1]=1,[2]=1},id=201},
	逍遥生={方案={[1]=1,[2]=1},id=1},
	剑侠客={方案={[1]=1,[2]=1},id=2},
	狐美人={方案={[1]=1,[2]=1},id=7},
	骨精灵={方案={[1]=1,[2]=1},id=8},
	杀破狼={方案={[1]=1,[2]=1},id=202},
	巨魔王={方案={[1]=1,[2]=1},id=5},
	虎头怪={方案={[1]=1,[2]=1},id=6},
	舞天姬={方案={[1]=1,[2]=1},id=11},
	玄彩娥={方案={[1]=1,[2]=1},id=12},
	羽灵神={方案={[1]=1,[2]=1},id=203},
	神天兵={方案={[1]=1,[2]=1},id=9},
	龙太子={方案={[1]=1,[2]=1},id=10},
	桃夭夭={方案={[1]=1,[2]=1},id=204},
	偃无师={方案={[1]=1,[2]=1},id=205},
	鬼潇潇={方案={[1]=1,[2]=1},id=206},
	}
	
skill恢复={
	["无穷妙道"]=1,
	["地涌金莲"]=1,
	["星月之惠"]=1,
	["玉清诀"]=1,
	["晶清诀"]=1,
	["冰清诀"]=1,
	["水清诀"]=1,
	["四海升平"]=1,
	["命归术"]=1,
	["气归术"]=1,
	["凝神诀"]=1,
	["凝气诀"]=1,
	["命疗术"]=1,
	["心疗术"]=1,
	["气疗术"]=1,
	["归元咒"]=1,
	["乾天罡气"]=1,
	["我佛慈悲"]=1,
	["杨柳甘露"]=1,
	["推拿"]=1,
	["推气过宫"]=1,
	["活血"]=1,
	["妙手回春"]=1,
	["救死扶伤"]=1,
	["解毒"]=1,
	["百毒不侵"]=1,
	["宁心"]=1,
	["解封"]=1,
	["清心"]=1,
	["驱魔"]=1,
	["驱尸"]=1,
	["寡欲令"]=1,
	["复苏"]=1,
	["普渡众生"]=1,
	["慈航普度"]=1,
	["起死回生"]=1,
	["回魂咒"]=1,
	["舍生取义"]=1,
	["自在心法"]=1,
	["还阳术"]=1,
	["醍醐灌顶"]=1,
	["净土灵华"]=1,
	["重生"]=1,
	["莲花心音"]=1,
	["由己渡人"]=1,
	["妙悟"]=1,
	["六尘不染"]=1,
	["电光火石"]=1,
	["魍魉追魂"]=1,
	["清风望月"]=1,
	["绝处逢生"]=1,
	["金刚怒目"]=1,
}
skill物攻={
	["幸运一击"] = 1,

	["枫魂汲魄"] = 1,
	["枫影二刃"] = 1,
    ["三荒尽灭"] = 1,
    ["力辟苍穹"] = 1,
    ["铁血生风"] = 1,
    ["一斧开天"] = 1,
    ["魔神之刃"] = 1,
	["牛刀小试"]=1,
	["剑荡四方"]=1,
	["迅风出击"]=1,
	["翻江搅海"]=1,
	["满天花雨"]=1,
	["破血狂攻"]=1,
	["弱点击破"]=1,
	["善恶有报"]=1,
	["惊心一剑"]=1,
	["壁垒击破"]=1,
	["超级壁垒击破"]=1,
	["横扫千军"]=1,
	["破碎无双"]=1,
	["狮搏"]=1,
	["象形"]=1,
	["连环击"]=1,
	["鹰击"]=1,
	["烟雨剑法"]=1,
	["飘渺式"]=1,
	["天雷斩"]=1,
	["裂石"]=1,
	["断岳势"]=1,
	["天崩地裂"]=1,
	["浪涌"]=1,
	["惊涛怒"]=1,
	["力劈华山"]=1,
	["破釜沉舟"]=1,
	["死亡召唤"]=1,
	["疯狂鹰击"]=1,
	["同伤式"]=1,
	["六道无量"]=1,
	["百爪狂杀"]=1,
	["翩鸿一击"]=1,
	["长驱直入"]=1,
	["腾雷"]=1,
	["天神怒斩"]=1,
	["水击三千"]=1,
	["惊天动地"]=1,
	["摧枯拉朽"]=1,
	["披挂上阵"]=1,
	["葬玉焚花"]=1,
	["风雷斩"]=1,
	["日光耀"]=1,
	["靛沧啸"]=1,
	["巨岩击"]=1,
	["苍茫刺"]=1,
	["地裂焚"]=1,
	["威仪九霄"]=1,
	["千蛛噬魂"]=1,
	["蛛丝缠绕"]=1,
	["绝命毒牙"]=1,
	["无赦咒令"]=1,
	["百鬼噬魂"]=1,
	["生杀予夺"]=1,
	["血影蚀心"]=1,
	["困兽之斗"]=1,
	["敲金击玉"]=1,
	["金击式"]=1,
	["天命剑法"]=1,
	["落土止息"]=1,
	["威震凌霄"]=1,
	["当头一棒"]=1,
	["神针撼海"]=1,
	["杀威铁棒"]=1,
	["泼天乱棒"]=1,
	["棒打雄风"]=1,
	["花谢花飞"]=1,

}
skill封印={
	["摧心术"]=1,
	["反间之计"]=1,
	["催眠符"]=1,
	["失心符"]=1,
	["落魄符"]=1,
	["失忆符"]=1,
	["追魂符"]=1,
	["离魂符"]=1,
	["失魂符"]=1,
	["定身符"]=1,
	["莲步轻舞"]=1,
	["如花解语"]=1,
	["似玉生香"]=1,
	["碎玉弄影"]=1,
	["娉婷袅娜"]=1,
	["错乱"]=1,
	["百万神兵"]=1,
	["日月乾坤"]=1,
	["威慑"]=1,
	["含情脉脉"]=1,
	["魔音摄魂"]=1,
	["夺魄令"]=1,
	["惊魂掌"]=1,
	["煞气诀"]=1,
	["秘传封印"]=1,
	["顺势而为"]=1,
	["妖风四起"]=1,
	["金刚镯"]=1,
	["偷龙转凤"]=1,
	["毁灭之光"]=1,
	["一笑倾城"]=1,
	["镇妖"]=1,
	["掌心雷"]=1,
	["八戒上身"]=1,
}
skill减益={
	["尸腐毒"]=1,
	["紧箍咒"]=1,
	["放下屠刀"]=1,
	["碎甲术"]=1,
	["破甲术"]=1,
	["河东狮吼"]=1,
	["雾杀"]=1,
	["笑里藏刀"]=1,
	["锢魂术"]=1,
	["月下霓裳"]=1,
	["否极泰来"]=1,
	["尸腐无常"]=1,
	["碎甲符"]=1,
	["凋零之歌"]=1,
	["魂飞魄散"]=1,
	["落花成泥"]=1,
	["雷浪穿云"]=1,
	["知己知彼"]=1,
	["画地为牢"]=1,
	["牵魂蛛丝"]=1,
	["噬毒"]=1,
	["凝滞术"]=1,
	["停陷术"]=1,
	["死亡之音"]=1,
}
skill增益={
	["裂魂"]=1,
	["变身"]=1,
	["移魂化骨"]=1,
	["狂怒"]=1,
	["后发制人"]=1,
	["杀气诀"]=1,
	["安神诀"]=1,
	["分身术"]=1,
	["达摩护体"]=1,
	["金刚护法"]=1,
	["潜龙在渊"]=1,
	["天雷灌注"]=1,
	["雷怒霆激"]=1,
	["霹雳弦惊"]=1,
	["金刚护体"]=1,
	["韦陀护法"]=1,
	["一苇渡江"]=1,
	["佛法无边"]=1,
	["楚楚可怜"]=1,
	-- ["天神护法"]=1,
	["乘风破浪"]=1,
	["神龙摆尾"]=1,
	["生命之泉"]=1,
	["炼气化神"]=1,
	["天地同寿"]=1,
	["乾坤妙法"]=1,
	["普渡众生"]=1,
	["灵动九天"]=1,
	["幽冥鬼眼"]=1,
	["修罗隐身"]=1,
	["火甲术"]=1,
	["魔王回首"]=1,
	["定心术"]=1,
	["极度疯狂"]=1,
	["魔息术"]=1,
	["天魔解体"]=1,
	["盘丝阵"]=1,
	["不动如山"]=1,
	["碎星诀"]=1,
	["镇魂诀"]=1,
	["明光宝烛"]=1,
	["金身舍利"]=1,
	["炎护"]=1,
	["蜜润"]=1,
	["法术防御"]=1,
	["太极护法"]=1,
	["罗汉金钟"]=1,
	["流云诀"]=1,
	["啸风诀"]=1,
	["野兽之力"]=1,
	["魔兽之印"]=1,
	["光辉之甲"]=1,
	["圣灵之甲"]=1,
	["牛劲"]=1,
	["毒萃"]=1,
	["波澜不惊"]=1,
	["其疾如风"]=1,
	["其徐如林"]=1,
	["侵掠如火"]=1,
	["岿然如山"]=1,
	["龙战于野"]=1,
	["花语歌谣"]=1,
	["无双战魂"]=1,
	["无间地狱"]=1,
	["媚眼如丝"]=1,
	["清静菩提"]=1,
	["鸣雷诀"]=1,
	["逆鳞"]=1,
	["钟馗论道"]=1,
	["诸天看护"]=1,
	["渡劫金身"]=1,
	["天神护体"]=1,
	["凝神术"]=1,
	["颠倒五行"]=1,
	["莲心剑意"]=1,
	["剑意莲心"]=1,
	["幻镜术"]=1,
	["同舟共济"]=1,
	["真君显灵"]=1,
	["无畏布施"]=1,
	["北冥之渊"]=1,
	["功德无量"]=1,
	["森罗迷瘴"]=1,
	["心随意动"]=1,
	["燃血术"]=1,
	["化羽为血"]=1,
	["气慑天军"]=1,
	["九幽除名"]=1,
	["铜头铁臂"]=1,
	["无所遁形"]=1,
	["呼子唤孙"]=1,
	["齐天神通"]=1,
	["金刚不坏"]=1,
	["灵能激发"]=1,
	["修罗咒"]=1,
	["身似菩提"]=1,
	["菩提心佑"]=1,
	["心如明镜"]=1,
	["法力陷阱"]=1,
	["烈火真言"]=1,
}
skill法攻={
    ["水攻"]=10,
	["烈火"]=20,
	["落岩"]=10,
	
	["雷击"]=10,
	["尸腐毒"]=20,
	["勾魂"]=20,
	["摄魄"]=20,
	["瘴气"]=20,
	["吸星大法"]=1,
	["雨落寒沙"]=40,
	["夺命咒"]=30,
	["五雷正法"]=50,
	["雷法·崩裂"]=50,
	["雷法·震煞"]=50,
	["雷法·翻天"]=50,
	["雷法·坤伏"]=50,
	["雷法·倒海"]=50,
	["雷法·轰天"]=50,
	["魔火焚世"]=50,
	["落叶萧萧"]=50,
	["蛊木迷瘴"]=50,
	["荆棘舞"]=40,
	["尘土刃"]=50,
	["冰川怒"]=30,
	["唧唧歪歪"]=50,
	["谆谆教诲"]=40,
	["五雷咒"]=50,
	["落雷符"]=50,
	["雷霆万钧"]=30,
	["雷霆汹涌"]=30,

	["观照万象"] = 1,
	["龙卷雨击"]=50,
	["二龙戏珠"]=50,
	["龙腾"]=40,
	["三昧真火"]=20,
	["超级三昧真火"]=20,
	["飞砂走石"]=50,
	["泰山压顶"]=50,
	["水漫金山"]=50,
	["超级泰山压顶"]=50,
	["超级水漫金山"]=50,
	["超级地狱烈火"]=50,
	["超级奔雷咒"]=40,
	["亢龙归海"]=50,
	["风雷韵动"]=30,
	["地狱烈火"]=50,
	["奔雷咒"]=40,
	["月光"]=50,
	["上古灵符"]=50,
	["血雨"]=50,
	["八凶法阵"]=30,
	["流沙轻音"]=50,
	["叱咤风云"]=50,
	["食指大动"]=50,
	["风卷残云"]=50,

	["天降灵葫"]=50,
	["摇头摆尾"]=50,
	["风云变色"]=50,
	["魔焰滔天"]=50,
	["扶摇万里"]=50,
	["秘传三昧真火"]=50,
	["秘传飞砂走石"]=50,
	["古藤秘咒"]=40,
	["疾风秋叶"]=50,
	["枯木逢春"]=50,
	["棒掀北斗"]=50,
	["灵彻太虚"]=50,
	["兴风作浪"]=50,
	["棍打诸神"]=50,
	["意马心猿"]=50,
	["天罗地网"]=50,
	["子母神针"]=50,
	["飞花摘叶"]=30,
	["姐妹同心"]=50,
	["鸿渐于陆"]=50,

	["自爆"]=50,

	["五雷轰顶"]=50,
	["龙吟"]=50,
	["苍茫树"]=30,
	["靛沧海"]=30,
	["日光华"]=30,
	["地裂火"]=30,
	["巨岩破"]=30,
	["判官令"]=10,
	["阎罗令"]=10,
	["黄泉之息"]=40,
	["追魂刺"]=50,
	["云暗天昏"]=50,
	["诅咒之伤"]=50,
	["吸血特技"]=10,
	["夜舞倾城"]=50,
	["琴音三叠"]=50,
}

--状态前置和偏移
Fightztqz={}
Fightztqz["寡欲令"]={py={0,25},cp = true}
Fightztqz["驱魔"]={py={0,25},cp = true}
Fightztqz["韦陀护法"]={py={0,-15},cp = true}
Fightztqz["红袖添香"]={py={10,0},cp = true}
Fightztqz["天罗地网"]={py={1,3},cp = false}
Fightztqz["乾坤玄火塔"]={py={1,3},cp = false}
Fightztqz["干将莫邪"]={py={1,3},cp = false}
Fightztqz["莲步轻舞"]={py={1,3},cp = false}
Fightztqz["如花解语"]={py={1,3},cp = false}
Fightztqz["定身符"]={py={5,2} ,cp = false}
Fightztqz["镇妖"]={py={0,0},cp = false}
Fightztqz["失忆符"]={py={0,0},cp = false}
Fightztqz["催眠符"]={py={0,0},cp = false}
Fightztqz["落魄符"]={py={0,0},cp = false}
Fightztqz["追魂符"]={py={0,0},cp = false}
Fightztqz["含情脉脉"]={py={0,0},cp = false}
Fightztqz["血雨"]={py={0,0},cp = false}
Fightztqz["离魂符"]={py={0,0},cp = false}
Fightztqz["失心符"]={py={0,0},cp = false}
Fightztqz["失魂符"]={py={0,0},cp = false}
Fightztqz["碎甲符"]={py={0,0},cp = false}
Fightztqz["象形"]={py={0,0},cp = false}
Fightztqz["似玉生香"]={py={0,0},cp = false}
Fightztqz["横扫千军"]={py={0,0},cp = false}
Fightztqz["幸运一击"]={py={0,0},cp = false}
Fightztqz["惊天动地"]={py={0,0},cp = false}

Fightztqz["破釜沉舟"]={py={0,0},cp = false}
Fightztqz["罗汉金钟"]={py={0,0},cp = false}
Fightztqz["太极护法"]={py={0,0},cp = false}
Fightztqz["泉愈"]={py={0,0},cp = false}
Fightztqz["岚载"]={py={0,0},cp = false}


---------------------------锦衣技能
Fightztqz["手到擒来"]={py={0,0},cp = false}
Fightztqz["半济而击"]={py={0,0},cp = false}
Fightztqz["变化莫测"]={py={0,0},cp = false}
Fightztqz["神谋魔道"]={py={0,0},cp = false}
Fightztqz["撼海狂龙"]={py={0,0},cp = false}
Fightztqz["言出法随"]={py={0,0},cp = false}
Fightztqz["涤瑕蹈隙"]={py={0,0},cp = false}
Fightztqz["八攻八克"]={py={0,0},cp = false}
Fightztqz["避实击虚"]={py={0,0},cp = false}
Fightztqz["力大无穷"]={py={0,0},cp = false}
Fightztqz["自在逍遥"]={py={0,0},cp = false}
Fightztqz["月明如昼"]={py={0,0},cp = false}
Fightztqz["自我疗愈"]={py={0,0},cp = false}
Fightztqz["兵贵神速"]={py={0,0},cp = false}
Fightztqz["护体如磐"]={py={0,0},cp = false}
Fightztqz["以牙还牙"]={py={0,0},cp = false}
Fightztqz["洞察一切"]={py={0,0},cp = false}
Fightztqz["坚如磐石"]={py={0,0},cp = false}
Fightztqz["鹰击长空"]={py={0,0},cp = false}
Fightztqz["除邪惩恶"]={py={0,0},cp = false}
Fightztqz["妖魔鬼怪"]={py={0,0},cp = false}
Fightztqz["鸿运当头"]={py={0,0},cp = false}
Fightztqz["后发制人"]={py={0,0},cp = false}
Fightztqz["苦思冥想"]={py={0,0},cp = false}
---------------------------锦衣技能
Fightztqz["后发制人"]={py={0,0},cp = false}
Fightztqz["苍白纸人"]={py={0,0},cp = false}
Fightztqz["混元伞"]={py={0,0},cp = false}
Fightztqz["乘风破浪"]={py={0,0},cp = false}
Fightztqz["一苇渡江"]={py={0,0},cp = false}
Fightztqz["逆鳞"]={py={0,0},cp = false}
Fightztqz["夺魄令"]={py={0,0},cp = false}
Fightztqz["百万神兵"]={py={0,0},cp = false}
Fightztqz["护法紫丝"]={py={0,0},cp = false}
Fightztqz["死亡召唤"]={py={0,0},cp = false}
Fightztqz["法术防御"]={py={0,0},cp = false}
Fightztqz["魔音摄魂"]={py={0,0},cp = false}
Fightztqz["炎护"]={py={0,0},cp = false}
Fightztqz["妖风四起"]={py={0,0},cp = false}
Fightztqz["娉婷袅娜"]={py={0,0},cp = false}
Fightztqz["月下霓裳"]={py={0,0},cp = false}
Fightztqz["颠倒五行"]={py={2,-31},cp = true}
Fightztqz["脱壳"]={py={2,-31},cp = true}
Fightztqz["极度疯狂"]={py={2,-31},cp = true}
Fightztqz["鸣雷诀"]={py={2,-31},cp = true}
Fightztqz["变身"]={py={2,-31},cp = true}
Fightztqz["九幽除名"]={py={2,-31},cp = true}
Fightztqz["肝胆相照"]={py={2,-31},cp = true}
Fightztqz["雾杀"]={py={2,-31},cp = true}
Fightztqz["惊魂掌"]={py={2,-31},cp = true}
Fightztqz["魔王回首"]={py={2,-31},cp = true}
Fightztqz["牛劲"]={py={2,-31},cp = true}
Fightztqz["幽冥鬼眼"]={py={2,-31},cp = true}
Fightztqz["摄魂"]={py={2,-31},cp = true}
Fightztqz["镇魂诀"]={py={2,-31},cp = true}
Fightztqz["战诀"]={py={2,-31},cp = true}
Fightztqz["杀气诀"]={py={2,-31},cp = true}
Fightztqz["无畏布施"]={py={2,-31},cp = true}
Fightztqz["金蟾"]={py={2,-31},cp = true}
Fightztqz["重伤"]={py={2,-75},cp = true}
Fightztqz["蚀天"]={py={2,-75},cp = true}
Fightztqz["龙战于野"]={py={0,-115},cp = true}
Fightztqz["定心术"]={py={0,-115},cp = true}
Fightztqz["天神护体"]={py={0,-115},cp = true}
Fightztqz["木精"]={py={0,-115},cp = true}
Fightztqz["幻镜术"]={py={2,12},cp = true}
Fightztqz["普渡众生"]={py={2,-75},cp = true}
Fightztqz["生命之泉"]={py={2,-75},cp = true}
Fightztqz["炼气化神"]={py={2,-75},cp = true}
Fightztqz["锢魂术"]={py={2,-75},cp = true}
Fightztqz["花语歌谣"]={py={2,-75},cp = true}
Fightztqz["蜜润"]={py={2,-75},cp = true}
Fightztqz["碎甲刃"]={py={2,-75},cp = true}
Fightztqz["魔冥"]={py={2,-75},cp = true}
Fightztqz["自矜"]={py={2,-75},cp = true}
Fightztqz["龙骇"]={py={3,-85},cp = true}
Fightztqz["灵能激发"]={py={3,-85},cp = true}
Fightztqz["明光宝烛"]={py={3,-95},cp = true}
Fightztqz["金身舍利"]={py={3,-95},cp = true}
Fightztqz["裂魂"]={py={15,20},cp = true}
Fightztqz["苍灵雪羽"]={py={3,-95},cp = true}
Fightztqz["璞玉灵钵"]={py={3,-95},cp = true}
Fightztqz["烽火狼烟"]={py={-4,-85},cp = true}
Fightztqz["舞雪冰蝶"]={py={-4,-85},cp = true}
Fightztqz["落花成泥"]={py={0,-75},cp = true}
Fightztqz["无尘扇"]={py={-2,-65},cp = true}
Fightztqz["断线木偶"]={py={-2,-65},cp = true}
Fightztqz["无魂傀儡"]={py={-2,-65},cp = true}
Fightztqz["风灵"]={py={-3,-95},cp = true}
Fightztqz["移魂化骨"]={py={-3,-95},cp = true}
Fightztqz["碎星诀"]={py={-2,-125},cp = true}
Fightztqz["愈勇"]={py={-2,-125},cp = true}
Fightztqz["瘴气"]={py={-2,-48},cp = true}
Fightztqz["无所遁形"]={py={0,-48},cp = true}
Fightztqz["齐天神通"]={py={0,-48},cp = true}
Fightztqz["清净"]={py={0,-60},cp = true}
Fightztqz["九幽除名"]={py={-2,-48},cp = false}
Fightztqz["真君显灵"]={py={-2,-30},cp = true}
Fightztqz["不动如山"]={py={-2,-30},cp = true}
Fightztqz["天地同寿"]={py={-2,-30},cp = true}
Fightztqz["腾雷"]={py={-2,-30},cp = true}
Fightztqz["护盾"]={py={-5,15},cp = true}
-- 无锦衣模型={影精灵=1}
--帧率
Fighttxz={} 
-- Fighttxz["唧唧歪歪"]=1.15
-- Fighttxz["噬魔神壶攻击"]=30

Fighttxz["横扫千军"]=1.05
Fighttxz["浪涌"]=1.05
Fighttxz["反震"]=1.6
Fighttxz["防御"]=1.6
Fighttxz["捕捉开始"]=1.55
Fighttxz["暴击"]=1.55
Fighttxz["龙卷雨击1"]=1.15
Fighttxz["地裂火"]=1.15
Fighttxz["龙卷雨击2"]=1.5
Fighttxz["龙卷雨击3"]=1.0
Fighttxz["龙卷雨击4"]=1.15
Fighttxz["龙吟"]=1.45
Fighttxz["龙腾"]=1.75
Fighttxz["泰山压顶"]=1.4
Fighttxz["超级泰山压顶"]=1.4
Fighttxz["连环击"]=2.4
Fighttxz["天雷斩"]=1.6
Fighttxz["地狱烈火"]=1.6
Fighttxz["超级地狱烈火"]=1.6
Fighttxz["水漫金山"]=1.45
Fighttxz["超级水漫金山"]=1.45
Fighttxz["鹰击"]=1.45
Fighttxz["上古灵符"]=1.45
Fighttxz["五雷轰顶"]=1
Fighttxz["天罗地网"]=0.85
Fighttxz["狮搏"]=1.4
Fighttxz["被击中"]=1.28
Fighttxz["二龙戏珠"]=1.28
Fighttxz["月光"]=2.4
Fighttxz["翻江搅海"]=3
Fighttxz["尘土刃"]=1.5
Fighttxz["泰山压顶1"]=1.25
Fighttxz["泰山压顶2"]=1.4
Fighttxz["泰山压顶3"]=1.1
Fighttxz["归元咒"]=0.95
Fighttxz["乾天罡气"]=0.95
Fighttxz["巨岩破"]=0.95
Fighttxz["推拿"]=0.95
Fighttxz["活血"]=0.95
Fighttxz["推气过宫"]=0.95
Fighttxz["惊心一剑"]=1.05
Fighttxz["牛刀小试"]=1.05
Fighttxz["力劈华山"]=1.05
Fighttxz["食指大动"]=1.5
Fighttxz["食指大动_香蕉"]=1.5
Fighttxz["食指大动_菠萝"]=1.6
Fighttxz["食指大动_西瓜"]=1.3
Fighttxz["法术暴击"]=3.1
Fighttxz["电刑"]=3.1


--状态是否区分我方和敌方方位
Fightdiwo={}   
Fightdiwo["干将莫邪"]=1
Fightdiwo["苍白纸人"]=1
Fightdiwo["混元伞"]=1
Fightdiwo["乾坤玄火塔"]=1
Fightdiwo["护盾"]=1
Fightdiwo["无畏布施"]=1
Fightdiwo["盾气"]=1
Fightdiwo["高级盾气"]=1

--无需物理特效
skill无需物理={
	["幸运一击"] = 1,
	["超级连击"]=1,
    ["高级连击"]=1,
    ["理直气壮"]=1,
    ["乘胜追击"]=1,
    ["无需特效"]=1,
    ["武神之怒"]=1,
    ["力劈华山"]=1,
    ["千蛛噬魂"]=1,
    ["蛛丝缠绕"]=1,
    ["六道无情"]=1,
    ["破釜沉舟"]=1,
    ["满天花雨"]=1,
    ["惊涛怒"]=1,
    ["翻江搅海"]=1,
    ["神针撼海"]=1,
    ["神牛攻击"]=1,
    ["葬玉焚花"]=1,
    ["自矜"]=1,
    ["威震凌霄"]=1,
    ["腾雷"]=1,
    ["同伤式"]=1,
    ["死亡召唤"]=1,
 --    ["日光耀"]=1,
	-- ["靛沧啸"]=1,
	-- ["巨岩击"]=1,
	-- ["苍茫刺"]=1,
	-- ["地裂焚"]=1,
}

--无需法术特效
skill无需法术={
	["岚载"]=1,
	["泉愈"]=1,

    ["高级连击"]=1,
    ["其疾如风"]=1,
    ["其徐如林"]=1,
    ["侵掠如火"]=1,
    ["无间地狱"]=1,
    ["吸星大法"]=1,
    ["媚眼如丝"]=1,
    ["修罗隐身"]=1,
    ["法术防御"]=1,
    ["无需特效"]=1,
    ["傲视"]=1,
    ["无敌牛虱"]=1,
    ["无敌牛妖"]=1,
    ["无畏布施"]=1,
    ["高级进击必杀"]=1,
    ["进击必杀"]=1,
    ["高级进击法爆"]=1,
    ["进击法爆"]=1,
    ["雷怒霆激"]=1,
    ["气慑天军"]=1,
    ["赤焰"]=1,
    ["阳护"]=1,
    ["盾气"]=1,
    ["高级盾气"]=1,
    ["遗志"]=1,
    ["高级遗志"]=1,
    ["金刚不坏"]=1,
    ["北冥之渊"]=50,
    -- ["鲲鹏出场"]=1,
}

--无需状态特效
skill无需状态={
    ["发瘟匣"]=1,
    ["  "]=1,
	-- ["超级强力"]=1,
	["超级连击"]=1,
    ["满天花雨"]=1,
    ["其疾如风"]=1,
    ["其徐如林"]=1,
    ["侵掠如火"]=1,
    ["岿然如山"]=1,
    ["无间地狱"]=1,
    ["清静菩提"]=1,
    ["媚眼如丝"]=1,
    ["晶清诀"]=1,
    ["铜头铁臂"]=1,
    ["水清诀"]=1,
    ["玉清诀"]=1,
    ["反间之计"]=1,
    ["北冥之渊"]=1,
    ["天煞"]=1,
    ["苍鸾怒击"]=1,
    ["狂怒"]=1,
    ["九梵清莲"]=1,
    ["傲视"]=1,
    ["舍生取义"]=1,
    ["无需特效"]=1,
    ["河东狮吼"]=1,
    ["光辉之甲"]=1,
    ["圣灵之甲"]=1,
    ["流云诀"]=1,
    ["复活"]=1,
    ["破甲术"]=1,
    ["啸风诀"]=1,
    ["野兽之力"]=1,
    ["碎甲术"]=1,
    ["魂飞魄散"]=1,
    ["汲魂"]=1,
    ["绝殇"]=1,
    ["宁心"]=1,
    ["知己知彼"]=1,
    ["翩鸿一击"]=1,
    ["天魔解体"]=1,
    ["分身术"]=1,
    ["照妖镜"]=1,
    ["魔兽之印"]=1,
    ["诸天看护"]=1,
    ["无畏布施（减）"]=1,
    ["狂袭"]=1,
    ["感念"]=1,
    ["顾盼生姿"]=1,
    ["八戒上身"]=1,
    ["杀威铁棒"]=1,
    ["龙骇"]=1,
    ["破浪"]=1,
    ["盘龙"]=1,
    ["龙啸"]=1,
    ["潜龙在渊"]=1,
    ["鹰啸"]=1,
    ["肝胆"]=1,
    ["长啸"]=1,
    ["练魂"]=1,
    ["天雷斩"]=1,
    ["雷怒霆激"]=1,
    ["沙威铁棒"]=1,
    ["威震凌霄"]=1,
    ["天地洞明"]=1,
    ["灵刃"]=1,
    ["灵法"]=1,
    ["灵断"]=1,
    ["御风"]=1,
    ["怒吼"]=1,
    ["阳护"]=1,
    ["护佑"]=1,
    ["疯狂"]=1,
    ["魔息术"]=1,
    ["重创"]=1,
    ["攻伐"]=1,
    ["蔓延"]=1,
    ["还元"]=1,
    ["怒霆"]=1,
    ["魔冥"]=1,
    ["六道无量"]=1,
    ["愈勇"]=1,
    ["放下屠刀"]=1,
    ["诵经"]=1,
    ["凭虚御风"]=1,
    ["惊锋"]=1,
    ["魂魇"]=1,
    ["狂战"]=1,
    ["酣战"]=1,
    ["开辟"]=1,
    ["清吟"]=1,
    ["柳暗花明"]=1,
    ["修罗隐身"]=1,
    ["隐身"]=1,

	["超级赐福·元吉"]=1,
    ["超级赐福·双喜"]=1,
    ["超级赐福·三合"]=1,
    ["超级赐福·四季"]=1,
    ["超级赐福·五福"]=1,
    ["超级赐福·六临"]=1,
    ["超级赐福·七神"]=1,
    ["超级赐福·八欲"]=1,
    ["超级赐福·九功"]=1,
    ["超级赐福·十满"]=1,

    ["超级赐福·万利"]=1,

}

skill无需抖动={
	["超级地狱烈火"]=1,
	["超级泰山压顶"]=1,
    ["地狱烈火"]=1,
    ["泰山压顶"]=1,
    ["龙吟"]=1,
    ["五雷咒"]=1,
    ["龙卷雨击"]=1,
    ["飞砂走石"]=1,
    ["月光"]=1,
    ["唧唧歪歪"]=1,
    ["谆谆教诲"]=1,
    ["风云变色"]=50,
    ["天降灵葫"]=50,
    ["秘传三昧真火"]=50,
    ["夜舞倾城"]=50,
    ["诅咒之伤"]=50,
    ["追魂刺"]=50,
    ["扶摇万里"]=50,
    ["流沙轻音"]=50,
    ["雷霆万钧"]=50
}



一体坐骑表={}
一体坐骑表["天使猪猪"]={}
一体坐骑表["天使猪猪"]["龙太子"]={站=2864431399,跑=2864431398}
一体坐骑表["天使猪猪"]["杀破狼"]={站=2864431401,跑=2864431400}
一体坐骑表["天使猪猪"]["神天兵"]={站=2864431417,跑=2864431416}
一体坐骑表["天使猪猪"]["桃夭夭"]={站=2864431427,跑=2864431426}
一体坐骑表["天使猪猪"]["巫蛮儿"]={站=2864431408,跑=2864431424}
一体坐骑表["天使猪猪"]["舞天姬"]={站=2864431412,跑=2864431410}
一体坐骑表["天使猪猪"]["逍遥生"]={站=2864431413,跑=2864431411}
一体坐骑表["天使猪猪"]["玄彩娥"]={站=2864431409,跑=2864431414}
一体坐骑表["天使猪猪"]["偃无师"]={站=2864431425,跑=2864431415}
一体坐骑表["天使猪猪"]["英女侠"]={站=2864431428,跑=2864431429}
一体坐骑表["天使猪猪"]["羽灵神"]={站=2864431376,跑=2864431430}
一体坐骑表["天使猪猪"]["飞燕女"]={站=2864431378,跑=2864431377}
一体坐骑表["天使猪猪"]["骨精灵"]={站=2864431379,跑=2864431380}
一体坐骑表["天使猪猪"]["鬼潇潇"]={站=2864431382,跑=2864431381}
一体坐骑表["天使猪猪"]["狐美人"]={站=2864431384,跑=2864431383}
一体坐骑表["天使猪猪"]["虎头怪"]={站=2864431392,跑=2864431385}
一体坐骑表["天使猪猪"]["剑侠客"]={站=2864431394,跑=2864431393}
一体坐骑表["天使猪猪"]["巨魔王"]={站=2864431397,跑=2864431395}
一体坐骑表["天使猪猪"]["影精灵"]={站=2864431379,跑=2864431380}


一体坐骑表["无名"]={}
一体坐骑表["无名"]["龙太子"]={站=0xaaaa1994,跑=0xaaaa1992}
一体坐骑表["无名"]["杀破狼"]={站=0xaaaa1982,跑=0xaaaa1980}
一体坐骑表["无名"]["神天兵"]={站=0xaaaa1982,跑=0xaaaa1980}
一体坐骑表["无名"]["桃夭夭"]={站=0xaaaaaaa4,跑=0xaaaaaaa2}
一体坐骑表["无名"]["巫蛮儿"]={站=0xaaaaaaa4,跑=0xaaaaaaa2}
一体坐骑表["无名"]["舞天姬"]={站=0xaaaaaaa4,跑=0xaaaaaaa2}
一体坐骑表["无名"]["逍遥生"]={站=0xaaaa1982,跑=0xaaaa1980}
一体坐骑表["无名"]["玄彩娥"]={站=0xaaaaaaa4,跑=0xaaaaaaa2}
一体坐骑表["无名"]["偃无师"]={站=0xaaaa1982,跑=0xaaaa1980}
一体坐骑表["无名"]["英女侠"]={站=0xaaaaaaa4,跑=0xaaaaaaa2}
一体坐骑表["无名"]["羽灵神"]={站=0xaaaa1982,跑=0xaaaa1980}
一体坐骑表["无名"]["飞燕女"]={站=0xaaaaaaa4,跑=0xaaaaaaa2}
一体坐骑表["无名"]["骨精灵"]={站=0xaaaaaaa4,跑=0xaaaaaaa2}
一体坐骑表["无名"]["鬼潇潇"]={站=0xaaaaaaa4,跑=0xaaaaaaa2}
一体坐骑表["无名"]["狐美人"]={站=0xaaaaaaa4,跑=0xaaaaaaa2}
一体坐骑表["无名"]["虎头怪"]={站=0xaaaa1982,跑=0xaaaa1980}
一体坐骑表["无名"]["剑侠客"]={站=0xaaaa1982,跑=0xaaaa1980}
一体坐骑表["无名"]["巨魔王"]={站=0xaaaa1982,跑=0xaaaa1980}
一体坐骑表["无名"]["影精灵"]={站=0xaaaaaaa4,跑=0xaaaaaaa2}


一体坐骑表["九尾冰狐"]={}
一体坐骑表["九尾冰狐"]["龙太子"]={站=2864434198,跑=2864434197}
一体坐骑表["九尾冰狐"]["杀破狼"]={站=2864434200,跑=2864434199}
一体坐骑表["九尾冰狐"]["神天兵"]={站=2864434208,跑=2864434201}
一体坐骑表["九尾冰狐"]["桃夭夭"]={站=2864434210,跑=2864434209}
一体坐骑表["九尾冰狐"]["巫蛮儿"]={站=2864434212,跑=2864434211}
一体坐骑表["九尾冰狐"]["舞天姬"]={站=2864434214,跑=2864434213}
一体坐骑表["九尾冰狐"]["逍遥生"]={站=2864434216,跑=2864434215}
一体坐骑表["九尾冰狐"]["玄彩娥"]={站=2864434224,跑=2864434217}
一体坐骑表["九尾冰狐"]["偃无师"]={站=2864434226,跑=2864434225}
一体坐骑表["九尾冰狐"]["英女侠"]={站=2864434228,跑=2864434227}
一体坐骑表["九尾冰狐"]["羽灵神"]={站=2864434230,跑=2864434229}
一体坐骑表["九尾冰狐"]["飞燕女"]={站=2864434178,跑=2864434177}
一体坐骑表["九尾冰狐"]["骨精灵"]={站=2864434179,跑=2864434180}
一体坐骑表["九尾冰狐"]["鬼潇潇"]={站=2864434182,跑=2864434181}
一体坐骑表["九尾冰狐"]["狐美人"]={站=2864434184,跑=2864434183}
一体坐骑表["九尾冰狐"]["虎头怪"]={站=2864434192,跑=2864434185}
一体坐骑表["九尾冰狐"]["剑侠客"]={站=2864434194,跑=2864434193}
一体坐骑表["九尾冰狐"]["巨魔王"]={站=2864434196,跑=2864434195}
一体坐骑表["九尾冰狐"]["影精灵"]={站=2864434179,跑=2864434180}

一体坐骑表["萤火霜兔"]={}
一体坐骑表["萤火霜兔"]["龙太子"]={站=2864434258,跑=2864434257}
一体坐骑表["萤火霜兔"]["杀破狼"]={站=2864434260,跑=2864434259}
一体坐骑表["萤火霜兔"]["神天兵"]={站=2864434262,跑=2864434261}
一体坐骑表["萤火霜兔"]["桃夭夭"]={站=2864434264,跑=2864434263}
一体坐骑表["萤火霜兔"]["巫蛮儿"]={站=2864434272,跑=2864434265}
一体坐骑表["萤火霜兔"]["舞天姬"]={站=2864434274,跑=2864434273}
一体坐骑表["萤火霜兔"]["逍遥生"]={站=2864434276,跑=2864434275}
一体坐骑表["萤火霜兔"]["玄彩娥"]={站=2864434278,跑=2864434277}
一体坐骑表["萤火霜兔"]["偃无师"]={站=2864434280,跑=2864434279}
一体坐骑表["萤火霜兔"]["英女侠"]={站=2864434288,跑=2864434280}
一体坐骑表["萤火霜兔"]["羽灵神"]={站=2864434290,跑=2864434289}
一体坐骑表["萤火霜兔"]["飞燕女"]={站=2864434232,跑=2864434231}
一体坐骑表["萤火霜兔"]["骨精灵"]={站=2864434240,跑=2864434233}
一体坐骑表["萤火霜兔"]["鬼潇潇"]={站=2864434242,跑=2864434241}
一体坐骑表["萤火霜兔"]["狐美人"]={站=2864434244,跑=2864434243}
一体坐骑表["萤火霜兔"]["虎头怪"]={站=2864434246,跑=2864434245}
一体坐骑表["萤火霜兔"]["剑侠客"]={站=2864434248,跑=2864434247}
一体坐骑表["萤火霜兔"]["巨魔王"]={站=2864434256,跑=2864434249}
一体坐骑表["萤火霜兔"]["影精灵"]={站=2864434240,跑=2864434233}

一体坐骑表["战火穷奇"]={}
一体坐骑表["战火穷奇"]["龙太子"]={站=2864434312,跑=2864434311}
一体坐骑表["战火穷奇"]["杀破狼"]={站=2864434320,跑=2864434313}
一体坐骑表["战火穷奇"]["神天兵"]={站=2864434322,跑=2864434321}
一体坐骑表["战火穷奇"]["桃夭夭"]={站=2864434324,跑=2864434323}
一体坐骑表["战火穷奇"]["巫蛮儿"]={站=2864434326,跑=2864434325}
一体坐骑表["战火穷奇"]["舞天姬"]={站=2864434328,跑=2864434327}
一体坐骑表["战火穷奇"]["逍遥生"]={站=2864431360,跑=2864434329}
一体坐骑表["战火穷奇"]["玄彩娥"]={站=2864431362,跑=2864431361}
一体坐骑表["战火穷奇"]["偃无师"]={站=2864431364,跑=2864431363}
一体坐骑表["战火穷奇"]["英女侠"]={站=2864431366,跑=2864431365}
一体坐骑表["战火穷奇"]["羽灵神"]={站=2864431369,跑=2864431367}
一体坐骑表["战火穷奇"]["飞燕女"]={站=2864434291,跑=2864434292}
一体坐骑表["战火穷奇"]["骨精灵"]={站=2864434294,跑=2864434293}
一体坐骑表["战火穷奇"]["鬼潇潇"]={站=2864434296,跑=2864434295}
一体坐骑表["战火穷奇"]["狐美人"]={站=2864434304,跑=2864434297}
一体坐骑表["战火穷奇"]["虎头怪"]={站=2864434306,跑=2864434305}
一体坐骑表["战火穷奇"]["剑侠客"]={站=2864434308,跑=2864434307}
一体坐骑表["战火穷奇"]["巨魔王"]={站=2864434310,跑=2864434309}
一体坐骑表["战火穷奇"]["影精灵"]={站=2864434294,跑=2864434293}

一体坐骑表["避水金睛兽·钻白"]={}
一体坐骑表["避水金睛兽·钻白"]["龙太子"]={站=0x5A100008,跑=0x5A100007,资源="新坐骑.wdf"}
一体坐骑表["避水金睛兽·钻白"]["杀破狼"]={站=0x5A100008,跑=0x5A100007,资源="新坐骑.wdf"}
一体坐骑表["避水金睛兽·钻白"]["神天兵"]={站=0x5A100008,跑=0x5A100007,资源="新坐骑.wdf"}
一体坐骑表["避水金睛兽·钻白"]["桃夭夭"]={站=0x5A100005,跑=0x5A100006,资源="新坐骑.wdf"}
一体坐骑表["避水金睛兽·钻白"]["巫蛮儿"]={站=0x5A100005,跑=0x5A100006,资源="新坐骑.wdf"}
一体坐骑表["避水金睛兽·钻白"]["舞天姬"]={站=0x5A100005,跑=0x5A100006,资源="新坐骑.wdf"}
一体坐骑表["避水金睛兽·钻白"]["逍遥生"]={站=0x5A100008,跑=0x5A100007,资源="新坐骑.wdf"}
一体坐骑表["避水金睛兽·钻白"]["玄彩娥"]={站=0x5A100005,跑=0x5A100006,资源="新坐骑.wdf"}
一体坐骑表["避水金睛兽·钻白"]["偃无师"]={站=0x5A100008,跑=0x5A100007,资源="新坐骑.wdf"}
一体坐骑表["避水金睛兽·钻白"]["英女侠"]={站=0x5A100005,跑=0x5A100006,资源="新坐骑.wdf"}
一体坐骑表["避水金睛兽·钻白"]["羽灵神"]={站=0x5A100008,跑=0x5A100007,资源="新坐骑.wdf"}
一体坐骑表["避水金睛兽·钻白"]["飞燕女"]={站=0x5A100005,跑=0x5A100006,资源="新坐骑.wdf"}
一体坐骑表["避水金睛兽·钻白"]["骨精灵"]={站=0x5A100005,跑=0x5A100006,资源="新坐骑.wdf"}
一体坐骑表["避水金睛兽·钻白"]["鬼潇潇"]={站=0x5A100005,跑=0x5A100006,资源="新坐骑.wdf"}
一体坐骑表["避水金睛兽·钻白"]["狐美人"]={站=0x5A100005,跑=0x5A100006,资源="新坐骑.wdf"}
一体坐骑表["避水金睛兽·钻白"]["虎头怪"]={站=0x5A100001,跑=0x5A100002,资源="新坐骑.wdf"}
一体坐骑表["避水金睛兽·钻白"]["剑侠客"]={站=0x5A100008,跑=0x5A100007,资源="新坐骑.wdf"}
一体坐骑表["避水金睛兽·钻白"]["巨魔王"]={站=0x5A100003,跑=0x5A100004,资源="新坐骑.wdf"}
一体坐骑表["避水金睛兽·钻白"]["影精灵"]={站=0x5A100005,跑=0x5A100006,资源="新坐骑.wdf"}

一体坐骑表["避水金睛兽·黑石"]={}
一体坐骑表["避水金睛兽·黑石"]["龙太子"]={站=0x6A100003,跑=0x6A100004,资源="新坐骑.wdf"}
一体坐骑表["避水金睛兽·黑石"]["杀破狼"]={站=0x6A100003,跑=0x6A100004,资源="新坐骑.wdf"}
一体坐骑表["避水金睛兽·黑石"]["神天兵"]={站=0x6A100003,跑=0x6A100004,资源="新坐骑.wdf"}
一体坐骑表["避水金睛兽·黑石"]["桃夭夭"]={站=0x6A100007,跑=0x6A100008,资源="新坐骑.wdf"}
一体坐骑表["避水金睛兽·黑石"]["巫蛮儿"]={站=0x6A100007,跑=0x6A100008,资源="新坐骑.wdf"}
一体坐骑表["避水金睛兽·黑石"]["舞天姬"]={站=0x6A100007,跑=0x6A100008,资源="新坐骑.wdf"}
一体坐骑表["避水金睛兽·黑石"]["逍遥生"]={站=0x6A100003,跑=0x6A100004,资源="新坐骑.wdf"}
一体坐骑表["避水金睛兽·黑石"]["玄彩娥"]={站=0x6A100007,跑=0x6A100008,资源="新坐骑.wdf"}
一体坐骑表["避水金睛兽·黑石"]["偃无师"]={站=0x6A100003,跑=0x6A100004,资源="新坐骑.wdf"}
一体坐骑表["避水金睛兽·黑石"]["英女侠"]={站=0x6A100007,跑=0x6A100008,资源="新坐骑.wdf"}
一体坐骑表["避水金睛兽·黑石"]["羽灵神"]={站=0x6A100003,跑=0x6A100004,资源="新坐骑.wdf"}
一体坐骑表["避水金睛兽·黑石"]["飞燕女"]={站=0x6A100007,跑=0x6A100008,资源="新坐骑.wdf"}
一体坐骑表["避水金睛兽·黑石"]["骨精灵"]={站=0x6A100007,跑=0x6A100008,资源="新坐骑.wdf"}
一体坐骑表["避水金睛兽·黑石"]["鬼潇潇"]={站=0x6A100007,跑=0x6A100008,资源="新坐骑.wdf"}
一体坐骑表["避水金睛兽·黑石"]["狐美人"]={站=0x6A100007,跑=0x6A100008,资源="新坐骑.wdf"}
一体坐骑表["避水金睛兽·黑石"]["虎头怪"]={站=0x6A100001,跑=0x6A100002,资源="新坐骑.wdf"}
一体坐骑表["避水金睛兽·黑石"]["剑侠客"]={站=0x6A100003,跑=0x6A100004,资源="新坐骑.wdf"}
一体坐骑表["避水金睛兽·黑石"]["巨魔王"]={站=0x6A100005,跑=0x6A100006,资源="新坐骑.wdf"}
一体坐骑表["避水金睛兽·黑石"]["影精灵"]={站=0x6A100007,跑=0x6A100008,资源="新坐骑.wdf"}

一体坐骑表["没牙仔"]={}
一体坐骑表["没牙仔"]["龙太子"]={站=0x2A100003,跑=0x2A100004,资源="新坐骑.wdf"}
一体坐骑表["没牙仔"]["杀破狼"]={站=0x2A100003,跑=0x2A100004,资源="新坐骑.wdf"}
一体坐骑表["没牙仔"]["神天兵"]={站=0x2A100003,跑=0x2A100004,资源="新坐骑.wdf"}
一体坐骑表["没牙仔"]["桃夭夭"]={站=0x2A100007,跑=0x2A100008,资源="新坐骑.wdf"}
一体坐骑表["没牙仔"]["巫蛮儿"]={站=0x2A100007,跑=0x2A100008,资源="新坐骑.wdf"}
一体坐骑表["没牙仔"]["舞天姬"]={站=0x2A100007,跑=0x2A100008,资源="新坐骑.wdf"}
一体坐骑表["没牙仔"]["逍遥生"]={站=0x2A100003,跑=0x2A100004,资源="新坐骑.wdf"}
一体坐骑表["没牙仔"]["玄彩娥"]={站=0x2A100007,跑=0x2A100008,资源="新坐骑.wdf"}
一体坐骑表["没牙仔"]["偃无师"]={站=0x2A100003,跑=0x2A100004,资源="新坐骑.wdf"}
一体坐骑表["没牙仔"]["英女侠"]={站=0x2A100007,跑=0x2A100008,资源="新坐骑.wdf"}
一体坐骑表["没牙仔"]["羽灵神"]={站=0x2A100003,跑=0x2A100004,资源="新坐骑.wdf"}
一体坐骑表["没牙仔"]["飞燕女"]={站=0x2A100007,跑=0x2A100008,资源="新坐骑.wdf"}
一体坐骑表["没牙仔"]["骨精灵"]={站=0x2A100007,跑=0x2A100008,资源="新坐骑.wdf"}
一体坐骑表["没牙仔"]["鬼潇潇"]={站=0x2A100007,跑=0x2A100008,资源="新坐骑.wdf"}
一体坐骑表["没牙仔"]["狐美人"]={站=0x2A100007,跑=0x2A100008,资源="新坐骑.wdf"}
一体坐骑表["没牙仔"]["虎头怪"]={站=0x2A100001,跑=0x2A100002,资源="新坐骑.wdf"}
一体坐骑表["没牙仔"]["剑侠客"]={站=0x2A100003,跑=0x2A100004,资源="新坐骑.wdf"}
一体坐骑表["没牙仔"]["巨魔王"]={站=0x2A100005,跑=0x2A100006,资源="新坐骑.wdf"}
一体坐骑表["没牙仔"]["影精灵"]={站=0x2A100007,跑=0x2A100008,资源="新坐骑.wdf"}

一体坐骑表["玉龙临"]={}
一体坐骑表["玉龙临"]["龙太子"]={站=0x3A100008,跑=0x3A100003,资源="新坐骑.wdf"}
一体坐骑表["玉龙临"]["杀破狼"]={站=0x3A100008,跑=0x3A100003,资源="新坐骑.wdf"}
一体坐骑表["玉龙临"]["神天兵"]={站=0x3A100008,跑=0x3A100003,资源="新坐骑.wdf"}
一体坐骑表["玉龙临"]["桃夭夭"]={站=0x3A100001,跑=0x3A100001,资源="新坐骑.wdf"}
一体坐骑表["玉龙临"]["巫蛮儿"]={站=0x3A100001,跑=0x3A100001,资源="新坐骑.wdf"}
一体坐骑表["玉龙临"]["舞天姬"]={站=0x3A100001,跑=0x3A100001,资源="新坐骑.wdf"}
一体坐骑表["玉龙临"]["逍遥生"]={站=0x3A100008,跑=0x3A100003,资源="新坐骑.wdf"}
一体坐骑表["玉龙临"]["玄彩娥"]={站=0x3A100001,跑=0x3A100001,资源="新坐骑.wdf"}
一体坐骑表["玉龙临"]["偃无师"]={站=0x3A100008,跑=0x3A100003,资源="新坐骑.wdf"}
一体坐骑表["玉龙临"]["英女侠"]={站=0x3A100001,跑=0x3A100001,资源="新坐骑.wdf"}
一体坐骑表["玉龙临"]["羽灵神"]={站=0x3A100008,跑=0x3A100003,资源="新坐骑.wdf"}
一体坐骑表["玉龙临"]["飞燕女"]={站=0x3A100001,跑=0x3A100001,资源="新坐骑.wdf"}
一体坐骑表["玉龙临"]["骨精灵"]={站=0x3A100001,跑=0x3A100001,资源="新坐骑.wdf"}
一体坐骑表["玉龙临"]["鬼潇潇"]={站=0x3A100001,跑=0x3A100001,资源="新坐骑.wdf"}
一体坐骑表["玉龙临"]["狐美人"]={站=0x3A100001,跑=0x3A100001,资源="新坐骑.wdf"}
一体坐骑表["玉龙临"]["虎头怪"]={站=0x3A100004,跑=0x3A100005,资源="新坐骑.wdf"}
一体坐骑表["玉龙临"]["剑侠客"]={站=0x3A100008,跑=0x3A100003,资源="新坐骑.wdf"}
一体坐骑表["玉龙临"]["巨魔王"]={站=0x3A100006,跑=0x3A100007,资源="新坐骑.wdf"}
一体坐骑表["玉龙临"]["影精灵"]={站=0x3A100001,跑=0x3A100002,资源="新坐骑.wdf"}

一体坐骑表["光煞"]={}
一体坐骑表["光煞"]["龙太子"]={站=0x4A100003,跑=0x4A100004,资源="新坐骑.wdf"}
一体坐骑表["光煞"]["杀破狼"]={站=0x4A100003,跑=0x4A100004,资源="新坐骑.wdf"}
一体坐骑表["光煞"]["神天兵"]={站=0x4A100003,跑=0x4A100004,资源="新坐骑.wdf"}
一体坐骑表["光煞"]["桃夭夭"]={站=0x4A100007,跑=0x4A100008,资源="新坐骑.wdf"}
一体坐骑表["光煞"]["巫蛮儿"]={站=0x4A100007,跑=0x4A100008,资源="新坐骑.wdf"}
一体坐骑表["光煞"]["舞天姬"]={站=0x4A100007,跑=0x4A100008,资源="新坐骑.wdf"}
一体坐骑表["光煞"]["逍遥生"]={站=0x4A100003,跑=0x4A100004,资源="新坐骑.wdf"}
一体坐骑表["光煞"]["玄彩娥"]={站=0x4A100007,跑=0x4A100008,资源="新坐骑.wdf"}
一体坐骑表["光煞"]["偃无师"]={站=0x4A100003,跑=0x4A100004,资源="新坐骑.wdf"}
一体坐骑表["光煞"]["英女侠"]={站=0x4A100007,跑=0x4A100008,资源="新坐骑.wdf"}
一体坐骑表["光煞"]["羽灵神"]={站=0x4A100003,跑=0x4A100004,资源="新坐骑.wdf"}
一体坐骑表["光煞"]["飞燕女"]={站=0x4A100007,跑=0x4A100008,资源="新坐骑.wdf"}
一体坐骑表["光煞"]["骨精灵"]={站=0x4A100007,跑=0x4A100008,资源="新坐骑.wdf"}
一体坐骑表["光煞"]["鬼潇潇"]={站=0x4A100007,跑=0x4A100008,资源="新坐骑.wdf"}
一体坐骑表["光煞"]["狐美人"]={站=0x4A100007,跑=0x4A100008,资源="新坐骑.wdf"}
一体坐骑表["光煞"]["虎头怪"]={站=0x4A100001,跑=0x4A100002,资源="新坐骑.wdf"}
一体坐骑表["光煞"]["剑侠客"]={站=0x4A100003,跑=0x4A100004,资源="新坐骑.wdf"}
一体坐骑表["光煞"]["巨魔王"]={站=0x4A100005,跑=0x4A100006,资源="新坐骑.wdf"}
一体坐骑表["光煞"]["影精灵"]={站=0x4A100007,跑=0x4A100008,资源="新坐骑.wdf"}

一体坐骑表["霆云飞廉"]={}
一体坐骑表["霆云飞廉"]["龙太子"]={站=0x7A100003,跑=0x7A100004,资源="新坐骑.wdf"}
一体坐骑表["霆云飞廉"]["杀破狼"]={站=0x7A100003,跑=0x7A100004,资源="新坐骑.wdf"}
一体坐骑表["霆云飞廉"]["神天兵"]={站=0x7A100003,跑=0x7A100004,资源="新坐骑.wdf"}
一体坐骑表["霆云飞廉"]["桃夭夭"]={站=0x7A100007,跑=0x7A100008,资源="新坐骑.wdf"}
一体坐骑表["霆云飞廉"]["巫蛮儿"]={站=0x7A100007,跑=0x7A100008,资源="新坐骑.wdf"}
一体坐骑表["霆云飞廉"]["舞天姬"]={站=0x7A100007,跑=0x7A100008,资源="新坐骑.wdf"}
一体坐骑表["霆云飞廉"]["逍遥生"]={站=0x7A100003,跑=0x7A100004,资源="新坐骑.wdf"}
一体坐骑表["霆云飞廉"]["玄彩娥"]={站=0x7A100007,跑=0x7A100008,资源="新坐骑.wdf"}
一体坐骑表["霆云飞廉"]["偃无师"]={站=0x7A100003,跑=0x7A100004,资源="新坐骑.wdf"}
一体坐骑表["霆云飞廉"]["英女侠"]={站=0x7A100007,跑=0x7A100008,资源="新坐骑.wdf"}
一体坐骑表["霆云飞廉"]["羽灵神"]={站=0x7A100003,跑=0x7A100004,资源="新坐骑.wdf"}
一体坐骑表["霆云飞廉"]["飞燕女"]={站=0x7A100007,跑=0x7A100008,资源="新坐骑.wdf"}
一体坐骑表["霆云飞廉"]["骨精灵"]={站=0x7A100007,跑=0x7A100008,资源="新坐骑.wdf"}
一体坐骑表["霆云飞廉"]["鬼潇潇"]={站=0x7A100007,跑=0x7A100008,资源="新坐骑.wdf"}
一体坐骑表["霆云飞廉"]["狐美人"]={站=0x7A100007,跑=0x7A100008,资源="新坐骑.wdf"}
一体坐骑表["霆云飞廉"]["虎头怪"]={站=0x7A100001,跑=0x7A100002,资源="新坐骑.wdf"}
一体坐骑表["霆云飞廉"]["剑侠客"]={站=0x7A100003,跑=0x7A100004,资源="新坐骑.wdf"}
一体坐骑表["霆云飞廉"]["巨魔王"]={站=0x7A100005,跑=0x7A100006,资源="新坐骑.wdf"}
一体坐骑表["霆云飞廉"]["影精灵"]={站=0x7A100007,跑=0x7A100008,资源="新坐骑.wdf"}

一体坐骑表["鲲·霓云"]={}
一体坐骑表["鲲·霓云"]["龙太子"]={站=0xAAAA0015,跑=0xAAAA0015,资源="坤坤.wdf"}
一体坐骑表["鲲·霓云"]["杀破狼"]={站=0xAAAA0011,跑=0xAAAA0011,资源="坤坤.wdf"}
一体坐骑表["鲲·霓云"]["神天兵"]={站=0xAAAA0014,跑=0xAAAA0014,资源="坤坤.wdf"}
一体坐骑表["鲲·霓云"]["桃夭夭"]={站=0xAAAA0019,跑=0xAAAA0019,资源="坤坤.wdf"}
一体坐骑表["鲲·霓云"]["巫蛮儿"]={站=0xAAAA0006,跑=0xAAAA0006,资源="坤坤.wdf"}
一体坐骑表["鲲·霓云"]["舞天姬"]={站=0xAAAA0016,跑=0xAAAA0016,资源="坤坤.wdf"}
一体坐骑表["鲲·霓云"]["逍遥生"]={站=0xAAAA0002,跑=0xAAAA0002,资源="坤坤.wdf"}
一体坐骑表["鲲·霓云"]["玄彩娥"]={站=0xAAAA0017,跑=0xAAAA0017,资源="坤坤.wdf"}
一体坐骑表["鲲·霓云"]["偃无师"]={站=0xAAAA0005,跑=0xAAAA0005,资源="坤坤.wdf"}
一体坐骑表["鲲·霓云"]["英女侠"]={站=0xAAAA0004,跑=0xAAAA0004,资源="坤坤.wdf"}
一体坐骑表["鲲·霓云"]["羽灵神"]={站=0xAAAA0018,跑=0xAAAA0018,资源="坤坤.wdf"}
一体坐骑表["鲲·霓云"]["飞燕女"]={站=0xAAAA0003,跑=0xAAAA0003,资源="坤坤.wdf"}
一体坐骑表["鲲·霓云"]["骨精灵"]={站=0xAAAA0010,跑=0xAAAA0010,资源="坤坤.wdf"}
一体坐骑表["鲲·霓云"]["鬼潇潇"]={站=0xAAAA0012,跑=0xAAAA0012,资源="坤坤.wdf"}
一体坐骑表["鲲·霓云"]["狐美人"]={站=0xAAAA0009,跑=0xAAAA0009,资源="坤坤.wdf"}
一体坐骑表["鲲·霓云"]["虎头怪"]={站=0xAAAA0008,跑=0xAAAA0008,资源="坤坤.wdf"}
一体坐骑表["鲲·霓云"]["剑侠客"]={站=0xAAAA0001,跑=0xAAAA0001,资源="坤坤.wdf"}
一体坐骑表["鲲·霓云"]["巨魔王"]={站=0xAAAA0007,跑=0xAAAA0007,资源="坤坤.wdf"}
一体坐骑表["鲲·霓云"]["影精灵"]={站=0xAAAA0013,跑=0xAAAA0013,资源="坤坤.wdf"}