--[[
    @Author       : GGELUA
    @Date         : 2022-02-23 10:39:03
Last Modified by: GGELUA
Last Modified time: 2023-05-25 17:03:16
--]]
local SDL = require('SDL')
local 主控 = class('主控')
local 当前
local function 生成假人信息()
	local fhsj = {}
	local 地图编号 = { 1001, 1002, 1003, 1004, 1005, 1006, 1007, 1008, 1009, 1012, 1013, 1014, 1015, 1016, 1017, 1018, 1019, 1020, 1021, 1022, 1023, 1024, 1025, 1026, 1028, 1029, 1030, 1031, 1032, 1033, 1034, 1035, 1036, 1037, 1038, 1040, 1041, 1042, 1043, 1044, 1046, 1049, 1050, 1051, 1052, 1054, 1056, 1057, 1070, 1072, 1075, 1077, 1078, 1079, 1080, 1081, 1082, 1083, 1085, 1087, 1090, 1091, 1092, 1093, 1094, 1095, 1098, 1099, 1100, 1101, 1103, 1104, 1105, 1106, 1107, 1110, 1111, 1112, 1113, 1114, 1115, 1116, 1117, 1118, 1119, 1120, 1121, 1122, 1123, 1124, 1125, 1126, 1127, 1128, 1129, 1130, 1131, 1132, 1133, 1134, 1135, 1137, 1138, 1139, 1140, 1141, 1142, 1143, 1144, 1145, 1146, 1147, 1149, 1150, 1152, 1153, 1154, 1155, 1156, 1165, 1167, 1168, 1170, 1171, 1173, 1174, 1175, 1177, 1178, 1179, 1180, 1181, 1182, 1183, 1186, 1187, 1188, 1189, 1190, 1191, 1192, 1193, 1197, 1198, 1201, 1202, 1203, 1204, 1205, 1206, 1207, 1208, 1209, 1210, 1211, 1212, 1213, 1214, 1215, 1216, 1217, 1218, 1219, 1220, 1221, 1222, 1223, 1224, 1225, 1226, 1227, 1228, 1229, 1230, 1231, 1232, 1233, 1234, 1235, 1236, 1237, 1237100, 1238, 1239, 1241, 1242, 1242001, 1242105, 1243, 1245, 1246, 1248, 1249, 1250, 1251, 1252, 1253, 1256, 1257, 1258, 1259, 1272, 1273, 1306, 1310, 1311, 1312, 1313, 1314, 1315, 1316, 1317, 1318, 1319, 1320, 1321, 1322, 1323, 1324, 1325, 1326, 1327, 1328, 1329, 1330, 1331, 1332, 1333, 1334, 1335, 1336, 1337, 1338, 1339, 1340, 1341, 1342, 1343, 1380, 1382, 1400, 1401, 1402, 1403, 1404, 1405, 1406, 1407, 1408, 1409, 1410, 1411, 1412, 1413, 1414, 1415, 1416, 1417, 1418, 1420, 1421, 1422, 1424, 1425, 1426, 1427, 1428, 1429, 1430, 1446, 1447, 1501, 1502, 1503, 1504, 1505, 1506, 1507, 1508, 1509, 1511, 1512, 1513, 1514, 1523, 1524, 1525, 1526, 1527, 1528, 1529, 1531, 1532, 1533, 1534, 1535, 1536, 1537, 1605, 16050, 1606, 1607, 1608, 1810, 1811, 1812, 1813, 1814, 1815, 1820, 1821, 1822, 1823, 1824, 1825, 1830, 1831, 1832, 1833, 1834, 1835, 1840, 1841, 1842, 1843, 1844, 1845, 1850, 1851, 1852, 1853, 1854, 1855, 1860, 1861, 1862, 1863, 1864, 1865, 1870, 1871, 1872, 1873, 1874, 1875, 1876, 1885, 1886, 1887, 1888, 1890, 1891, 1892, 1910, 1911, 1912, 1913, 1914, 1915, 1916, 1920, 1930, 1931, 1932, 1933, 1934, 1935, 1936, 1937, 1938, 1939, 1940, 1941, 1942, 1943, 1944, 1945, 1946, 1947, 1948, 1949, 1950, 1951, 1952, 1953, 1954, 1955, 1958, 1959, 1960, 1961, 1962, 1963, 1964, 1965, 1966, 1967, 1968, 1969, 1970, 1580,1971, 2000 }
	for i = 1, #地图编号 do
		local fhsj1 = 场景取假人表(地图编号[i], nil, 1)
		if #fhsj1 > 0 then
			fhsj[取地图名称(地图编号[i])] = {}
		end
		for k, v in pairs(fhsj1) do
			fhsj[取地图名称(地图编号[i])][fhsj1[k].名称] = { 地图id = 地图编号[i], x = fhsj1[k].X, y = fhsj1[k].Y }
		end
	end
	return fhsj
end
function 主控:初始化(当前)
	self.当前 = 当前
	self.战斗中 = false
	self.观战中 = false
	self.音乐 = __res:取音乐('music/1070.mp3'):播放(true):置音量(20)
	self.战斗音效 = nil
	self.战斗音乐 = nil
	self.战斗文字 = { {}, {}, nil, {}, {}, {} }
	self.道具列表 = {}
	self.行囊列表 = {}
	self.任务道具列表 = {}
	self.招募信息 = {}
	self.公用蒙版 = require('SDL.图像')('assets/shape/gy/A.png'):拉伸(55, 55) --:置混合(SDL.ComposeCustomBlendMode(1,2,1,2,1,1))
    self.公用蒙版2 = require("SDL.图像")("assets/shape/gy/C.png")
    self.法术鼠标=__res:取动画(__res:取地址("shape/mewas/", 0xB48A9B3D)):取动画(1):置当前帧(1):播放(true)
	self.物品灰图 = __res.UI素材[4]:复制区域(704, 325, 70, 18)

	self.超级技能边框=__res.UI素材[5]:复制区域(0, 0, 130, 130):拉伸(110, 110):到精灵()


	self.道具选中大 = __res.UI素材[3]:复制区域(1115, 603, 70, 69):拉伸(66, 66):到精灵()
	self.道具选中小 = __res.UI素材[3]:复制区域(1124, 677, 59, 60):拉伸(55, 55):到精灵()
	self.召唤兽选中大 = __res.UI素材[3]:复制区域(1115, 603, 70, 69):拉伸(70, 70):到精灵()
	self.召唤兽选中小 = __res.UI素材[3]:复制区域(1115, 603, 70, 69):拉伸(50, 50):到精灵()

	self.技能选中小 = __res.UI素材[3]:复制区域(1124, 677, 59, 60):拉伸(60, 60):到精灵()
	self.技能选中小2 = __res.UI素材[3]:复制区域(1124, 677, 59, 60):拉伸(55, 55):到精灵()
	self.技能选中大 = __res.UI素材[3]:复制区域(5, 1132, 190, 61):到精灵()
	self.技能选中大2 = __res.UI素材[3]:复制区域(5, 1132, 190, 61):拉伸(180, 66):到精灵()
	
	self.物品格子禁止 = __res:取图像(__res:取地址('shape/ui/zhs/', 0x4138B067)):拉伸(44, 44):到精灵()
	self.摊位物品选中 = __res.UI素材[3]:复制区域(5, 1132, 190, 61):拉伸(244, 67):到精灵()
	self.摊位召唤兽选中 = __res.UI素材[3]:复制区域(5, 1132, 190, 61):拉伸(350, 67):到精灵()
	self.藏宝阁选中 = __res.UI素材[3]:复制区域(5,1132,190,61):拉伸(688,67):到精灵()
	self.摊位召唤兽出售选中 = __res.UI素材[3]:复制区域(5, 1132, 190, 61):拉伸(332, 67):到精灵()
	self.商会选中 = __res.UI素材[3]:复制区域(5, 1132, 190, 61):拉伸(270, 68):到精灵()
	self.宝箱抽奖中奖 = __res:取动画(__res:取地址('shape/ui/', 0x7B70D9BA)):取动画(1):播放(true)
	self.商会召唤兽选中 = __res.UI素材[3]:复制区域(5, 1132, 190, 61):拉伸(173, 64):到精灵()
	self.已上架 = __res:getPNGCC(4, 867, 3, 46, 46):到精灵()
	self.赐福图标 =  取图像指定帧(__res:取地址("shape/ui/", 0x91000004), 1):到精灵() 
    self.赐福图标大 = __res.UI素材[4]:复制区域(0, 832, 24, 22)
    self.超级偷袭光效 = __res.UI素材[4]:复制区域(42, 843, 89, 31):到精灵()
	self.黑色背景 = require("SDL.精灵")(0, 0, 0, 引擎.宽度, 引擎.高度):置颜色(3, 20, 60, 150)
	self.角色选择背景 = __res:取精灵('shape/ui/xj/A0D00989.was')
	self.角色选择背景选中 = __res:取精灵('shape/ui/xj/A0D00989.was'):置颜色(246, 14, 57, 255)
	self.队长令牌 = __res:取动画(__res:取地址('shape/gg/', 0x2231EBB4)):取动画(1):播放(true)
	self.战斗令牌 = __res:取动画(__res:取地址('shape/gg/', 0x97C79EDB)):取动画(1):播放(true)
	self.任务令牌 = __res:取动画(__res:取地址('shape/gg/', 0x953624bc)):取动画(1):播放(true)
	self.任战令牌 = __res:取动画(__res:取地址('shape/gg/', 0x3d3aa29e)):取动画(1):播放(true)
	self.影子 = __res:取精灵(__res:取地址('shape/mx/', 0xdce4b562))
	self.躲避 = __res["UI素材"][4]:复制区域(891, 163, 46, 18):到精灵()
    self.披肩技能圈= __res["UI素材"][4]:复制区域(960, 119, 59, 59):到精灵()
	-- self.收款码 = require('SDL.图像')('assets/shape/gg/skm.png')
	self.队伍选中 = __res:getPNGCC(2, 892, 179, 143, 209):到精灵()
	self.队伍选中小 = __res:getPNGCC(2, 892, 179, 143, 209):拉伸(143,179):到精灵()
	self.消息提醒 = __res:getPNGCC(2, 1122, 125, 27, 27):到精灵()
	self.给予操作 = false
	字体16:置颜色(242, 30, 26)
	self.参战 = 字体16:取描边精灵("战", 255, 255, 255, 255)
	local 伤害字 = __res:取动画(__res:取地址('shape/ui/zd/', 0x30F737D8))
	local 加血字 = __res:取动画(__res:取地址('shape/ui/zd/', 0x3CF8F9FE))
	local 物理暴击 = __res:取动画(__res:取地址('shape/ui/zd/', 0x512f7da))
	local 大外红内白字 = __res:取动画(__res:取地址('shape/ui/zd/', 0x4EE0010A))
	local 法术暴击 = __res:取动画(__res:取地址('shape/ui/zd/', 0x512f7da))
	for n = 1, 10 do
		self.战斗文字[1][n] = 伤害字:取精灵(n)
		self.战斗文字[2][n] = 加血字:取精灵(n)
		self.战斗文字[4][n] = 物理暴击:取精灵(n)
		self.战斗文字[5][n] = 大外红内白字:取精灵(n)
		self.战斗文字[6][n] = 法术暴击:取精灵(n)
	end
	local 括号 = __res:取动画(__res:取地址('shape/ui/zd/', 0xf727f5b))
	for n = 1, 2 do
		local x = 11
		if n == 2 then
			x = 12
		end
		self.战斗文字[1][x] = 括号:取精灵(n)
		self.战斗文字[2][x] = 括号:取精灵(n)
		self.战斗文字[4][x] = 括号:取精灵(n)
		self.战斗文字[5][x] = 括号:取精灵(n)
		self.战斗文字[6][x] = 括号:取精灵(n)
	end
	self.法宝特效=__res:取动画(__res:取地址("shape/tx/", 特效库("法宝")[1])):取动画(1):置当前帧(1):播放(true)
	self.噬魔神壶牌子=__res:取动画(__res:取地址("shape/tx/",0x30F737D7)):取动画(1):置当前帧(1):播放(true)
	-- self.偷袭动画=__res:取动画(__res:取地址("shape/tx/",0x12B515DE)):取动画(1):置当前帧(1):播放(true)
	
	self.偷袭动画=__res:取动画(__res:取地址("shape/tx/",0x658a8381)):取动画(1):置当前帧(1):播放(true)
	self.奇袭身光=__res:取动画(__res:取地址("shape/tx/",0x70000022)):取动画(1):置当前帧(1):播放(true)
	self.奇袭窗口光1=__res:取动画(__res:取地址("shape/tx/",0x10000001)):取动画(1):置当前帧(1):播放(true)
	self.奇袭窗口光2=__res:取动画(__res:取地址("shape/tx/",0x10000002)):取动画(1):置当前帧(1):播放(true)
	self.奇袭窗口光3=__res:取动画(__res:取地址("shape/tx/",0x10000003)):取动画(1):置当前帧(1):播放(true)
	self.奇袭窗口光4=__res:取动画(__res:取地址("shape/tx/",0x10000004)):取动画(1):置当前帧(1):播放(true)

	self.浮空动画=__res:取动画(__res:取地址("shape/tx/", 特效库("浮空")[1])):取动画(1):置当前帧(1):播放(true)
	self.新浮空动画=__res:取动画(__res:取地址("shape/tx/", 特效库("新_浮空")[1])):取动画(1):置当前帧(1):播放(true)

	self.战斗指向=__res:取动画(__res:取地址("shape/ui/",0xFB4DD656)):取动画(1):置当前帧(1):播放(true)
    self.经脉可选 = __res:getPNGCC(3, 996, 1118, 57, 56):到精灵()

	self.五行珠特效={}
	self.战意特效={}
	self.超级战意特效={}
	self.人参果特效={}
	self.骤雨特效={}
	self.共生特效=__res:取动画(__res:取地址("shape/tx/", 特效库("共生")[1])):取动画(1):置当前帧(1):播放(true)
	self.如意神通特效=__res:取动画(__res:取地址("shape/tx/",0x12332112)):取动画(1):置当前帧(1):播放(true)

	for i=1,3 do
		self.战意特效[i]=__res:取动画(__res:取地址("shape/tx/", 特效库("状态_战意"..i)[1])):取动画(1):置当前帧(1):播放(true)
        self.超级战意特效[i]=__res:取动画(__res:取地址("shape/tx/", 特效库("状态_超级战意"..i)[1])):取动画(1):置当前帧(1):播放(true)
        self.人参果特效[i]=__res:取动画(__res:取地址("shape/tx/", 特效库("状态_人参果"..i)[1])):取动画(1):置当前帧(1):播放(true)
        self.骤雨特效[i]=__res:取动画(__res:取地址("shape/tx/", 特效库("状态_骤雨"..i)[1])):取动画(1):置当前帧(1):播放(true)
	end
	for i=1,6 do
		self.五行珠特效[i]=__res:取动画(__res:取地址("shape/tx/", 特效库("状态_五行珠"..i)[1])):取动画(1):置当前帧(1):播放(true)
	end

	local bqs = { 1295847816, 1853525647, 1076954610, 3552721044, 3990239921, 3366615112, 2782337201, 3771134163, 1462708813, 2715893287, 3002376600, 3991654351, 993860032, 2666294756, 454787878, 1382010105, 2912848813, 3919700593, 477926852, 352380776, 811687356, 915719759, 4249060934, 1336751228, 1950021903, 2235513801, 3594739784, 1960900090, 2382390242, 1537855326, 3907030953, 2290431679, 3202252097, 4033571742, 1492820992, 655187057, 2901001332, 3190903022, 298183232, 1945354141, 3436623848, 1724964988, 2592865169, 3393696884, 1494002331, 1310769894, 1152800681, 2542768010, 1378600591, 2829693277, 3846038890, 3901444948, 68667698, 3331959614, 432707334, 4241851683, 3448703702, 2542506275, 241536076, 314448958, 2242677963, 1887092560, 1489631920, 2860202818, 4076591726, 4232189420, 3498505860, 4241140149, 3858705890, 2271353759, 3452523393, 963399171, 2959831232, 2917226350, 4215743335, 3987108486, 365569753, 3701218951, 3044567112, 3265766525, 2129343522, 2401287726, 2716317030, 292723042, 4014574629, 4183102172, 4115700508, 2139528734, 276624883, 4099788650, 2578443618, 3367759523, 576638850, 3586214754, 2830927389, 1915332364, 1341579386, 3743372972, 1217313750, 1208397371, 156713767, 2057251015, 3084935361, 1485268859, 470535714, 2868631088, 3835251562, 2896374671, 3982186902, 1708428735, 2448085336, 1354708809, 943667221, 1146784672, 3592760724, 611393967, 1688780051, 2042812914, 1466206851, 770780432, 3612578974 }
	self.表情 = {}
	for i = 1, 120 do
		self.表情[i] = __res:取动画(__res:取地址('shape/ui/bq/', bqs[i])):取动画(1):播放(true)
	end
	-- for i = 1, 120 do
	--     local tca = __res:取动画(__res:取地址('shape/ui/bq/',bqs[i]))
	--     if tca then --and tca.frame > 1
	--         local ani = tca:取动画(1)
	--         self.表情[i] = ani:播放(true)
	--         ani:置中心(-ani.资源.x, -ani.资源.y + ani.高度)
	--     end
	-- end
	local  jinse={3463055113,2470610894,2454935283,1330407844,3084121359,714908434,1425747500,3922029993,3375688591,578943499}
    local  zise={2863065487,2651943966,2721428056,3658033876,1671549234,2149603968,3486944714,3105833444,2645715176,2247172070}
    local  lvse={3225044296,2282567973,45222389,3404611763,2869642422,1226895626,1160910851,1243897463,1703457603,2509045139}
    local  lanse={2754978709,837497719,1989634778,3879785250,3494438025,361097991,1171180302,2125931144,621815393,2895777544}
	local  quwei={0x00000061,0x00000062,0x00000063,0x00000064,0x00000065,0x00000066,0x00000067,0x00000068,0x00000069,0x00000070}

    self.金色id = {}
    self.紫色id = {}
    self.绿色id = {}
    self.蓝色id = {}
	self.趣味id = {}

    for n=0,9 do
        self.金色id[n]=__res:取动画(__res:取地址("shape/smap/DBF85229/", jinse[n+1])):取动画(1):播放(true)
        self.紫色id[n]=__res:取动画(__res:取地址("shape/smap/DBF85229/", zise[n+1])):取动画(1):播放(true)
        self.绿色id[n]=__res:取动画(__res:取地址("shape/smap/DBF85229/", lvse[n+1])):取动画(1):播放(true)
        self.蓝色id[n]=__res:取动画(__res:取地址("shape/smap/DBF85229/", lanse[n+1])):取动画(1):播放(true)
        self.趣味id[n]=__res:取动画(__res:取地址("shape/smap/DBF85229/", quwei[n+1])):取动画(1):播放(true)

    end
	
	bqs = { 0x43700E25, 0x1B1DCE56, 0x65C5B7EE, 0xF9ADC3DA, 0xE8897A81, 0xCD23D726, 0xAD9D6490, 0xF9858C95 }
	self.频道 = {}
	for i = 1, 8 do
		self.频道[i] = __res:取精灵(__res:取地址('shape/ui/bq/', bqs[i]))
	end
	self.假人信息 =生成假人信息()
end

function 主控:取武器子类(子类)
	local n = { "枪矛", "斧钺", "剑", "双短剑", "飘带", "爪刺", "扇", "魔棒", "锤", "鞭", "环圈", "刀", "法杖", "弓弩", "宝珠", "巨剑", "伞", "灯笼",
	"头盔", "发钗", "项链", "女衣", "男衣", "腰带", "鞋子" }
		--  n[910] = '双巨斧'
    	--  n[911] = '双巨斧'
		if 子类==910 then
			return "双斧乾"
		elseif 子类==911 then
			 return "双斧坤"
		end	
	return n[子类]
end

-- function 主控:取武器附加名称(子类, 等级, 名称)
-- 	if 子类 == 1 then
-- 		if 等级 < 21 then
-- 			return "红缨枪"
-- 		elseif 等级 > 20 and 等级 < 51 then
-- 			return "乌金三叉戟"
-- 		elseif 等级 > 59 and 等级 < 90 then
-- 			return "玄铁矛"
-- 		end
-- 	elseif 子类 == 2 then
-- 		if 等级 < 21 then
-- 			return "青铜斧"
-- 		elseif 等级 > 20 and 等级 < 51 then
-- 			return "双弦钺"
-- 		elseif 等级 > 59 and 等级 < 90 then
-- 			return "乌金鬼头镰"
-- 		end
-- 	elseif 子类 == 3 then
-- 		if 等级 < 21 then
-- 			return "青铜短剑"
-- 		elseif 等级 > 20 and 等级 < 51 then
-- 			return "青锋剑"
-- 		elseif 等级 > 59 and 等级 < 90 then
-- 			return "游龙剑"
-- 		end
-- 	elseif 子类 == 4 then
-- 		if 等级 < 21 then
-- 			return "双短剑"
-- 		elseif 等级 > 20 and 等级 < 51 then
-- 			return "竹节双剑"
-- 		elseif 等级 > 59 and 等级 < 90 then
-- 			return "赤焰双剑"
-- 		end
-- 	elseif 子类 == 5 then
-- 		if 等级 < 21 then
-- 			return "五色缎带"
-- 		elseif 等级 > 20 and 等级 < 51 then
-- 			return "无极丝"
-- 		elseif 等级 > 59 and 等级 < 90 then
-- 			return "七彩罗刹"
-- 		end
-- 	elseif 子类 == 6 then
-- 		if 等级 < 21 then
-- 			return "铁爪"
-- 		elseif 等级 > 20 and 等级 < 51 then
-- 			return "青龙牙"
-- 		elseif 等级 > 59 and 等级 < 90 then
-- 			return "青刚刺"
-- 		end
-- 	elseif 子类 == 7 then
-- 		if 等级 < 21 then
-- 			return "折扇"
-- 		elseif 等级 > 20 and 等级 < 51 then
-- 			return "铁面扇"
-- 		elseif 等级 > 59 and 等级 < 90 then
-- 			return "神火扇"
-- 		end
-- 	elseif 子类 == 8 then
-- 		if 等级 < 21 then
-- 			return "细木棒"
-- 		elseif 等级 > 20 and 等级 < 51 then
-- 			return "点金棒"
-- 		elseif 等级 > 59 and 等级 < 90 then
-- 			return "满天星"
-- 		end
-- 	elseif 子类 == 9 then
-- 		if 等级 < 21 then
-- 			return "松木锤"
-- 		elseif 等级 > 20 and 等级 < 51 then
-- 			return "狼牙锤"
-- 		elseif 等级 > 59 and 等级 < 90 then
-- 			return "震天锤"
-- 		end
-- 	elseif 子类 == 10 then
-- 		if 等级 < 21 then
-- 			return "牛皮鞭"
-- 		elseif 等级 > 20 and 等级 < 51 then
-- 			return "钢结鞭"
-- 		elseif 等级 > 59 and 等级 < 90 then
-- 			return "青藤柳叶鞭"
-- 		end
-- 	elseif 子类 == 11 then
-- 		if 等级 < 21 then
-- 			return "黄铜圈"
-- 		elseif 等级 > 20 and 等级 < 51 then
-- 			return "金刺轮"
-- 		elseif 等级 > 59 and 等级 < 90 then
-- 			return "蛇形月"
-- 		end
-- 	elseif 子类 == 12 then
-- 		if 等级 < 21 then
-- 			return "柳叶刀"
-- 		elseif 等级 > 20 and 等级 < 51 then
-- 			return "金背大砍刀"
-- 		elseif 等级 > 59 and 等级 < 90 then
-- 			return "狼牙刀"
-- 		end
-- 	elseif 子类 == 13 then
-- 		if 等级 < 21 then
-- 			return "曲柳杖"
-- 		elseif 等级 > 20 and 等级 < 51 then
-- 			return "墨铁拐"
-- 		elseif 等级 > 59 and 等级 < 90 then
-- 			return "腾云杖"
-- 		end
-- 	elseif 子类 == 14 then
-- 		if 等级 < 21 then
-- 			return "硬木弓"
-- 		elseif 等级 > 20 and 等级 < 51 then
-- 			return "宝雕长弓"
-- 		elseif 等级 > 59 and 等级 < 90 then
-- 			return "连珠神弓"
-- 		end
-- 	elseif 子类 == 15 then
-- 		if 等级 < 21 then
-- 			return "琉璃珠"
-- 		elseif 等级 > 20 and 等级 < 51 then
-- 			return "翡翠珠"
-- 		elseif 等级 > 59 and 等级 < 90 then
-- 			return "如意宝珠"
-- 		end
-- 	elseif 子类 == 16 then
-- 		if 等级 < 21 then
-- 			return "钝铁重剑"
-- 		elseif 等级 > 20 and 等级 < 51 then
-- 			return "壁玉长铗"
-- 		elseif 等级 > 59 and 等级 < 90 then
-- 			return "惊涛雪"
-- 		end
-- 	elseif 子类 == 17 then
-- 		if 等级 < 21 then
-- 			return "红罗伞"
-- 		elseif 等级 > 20 and 等级 < 51 then
-- 			return "琳琅盖"
-- 		elseif 等级 > 59 and 等级 < 90 then
-- 			return "金刚伞"
-- 		end
-- 	elseif 子类 == 18 then
-- 		if 等级 < 21 then
-- 			return "素纸灯"
-- 		elseif 等级 > 20 and 等级 < 51 then
-- 			return "如意宫灯"
-- 		elseif 等级 > 59 and 等级 < 90 then
-- 			return "玉兔盏"
-- 		end
-- 	elseif 子类 == 911 then
--         if 等级 < 21 then
--             return "顽石双斧(坤)"
--         elseif 等级 > 20 and 等级 < 51 then
--             return "破军双斧(坤)"
--         end	
-- 	end
-- 	return 名称
-- end
function 主控:取武器附加名称(子类,等级,名称)
	local 武器表 = {
		枪矛 = {"红缨枪","曲尖枪","锯齿矛","乌金三叉戟","火焰枪","墨杆金钩","玄铁矛","金蛇信","丈八点钢矛","暗夜","梨花","霹雳","刑天之逆","五虎断魂","飞龙在天","天龙破城","弑皇"},
		斧钺 = {"青铜斧","开山斧","双面斧","双弦钺","精钢禅钺","黄金钺","乌金鬼头镰","狂魔镰","恶龙之齿","破魄","肃魂","无敌","五丁开山","元神禁锢","护法灭魔","碧血干戚","裂天"},
		剑 = {"青铜短剑","铁齿剑","吴越剑","青锋剑","龙泉剑","黄金剑","游龙剑","北斗七星剑","碧玉剑","鱼肠","倚天","湛卢","魏武青虹","灵犀神剑","四法青云","霜冷九州","擒龙"},
		双短剑 = {"双短剑","镔铁双剑","龙凤双剑","竹节双剑","狼牙双剑","鱼骨双剑","赤焰双剑","墨玉双剑","梅花双剑","阴阳","月光双剑","灵蛇","金龙双剪","连理双树","祖龙对剑","紫电青霜","浮犀"},
		飘带 = {"五色缎带","幻彩银纱","金丝彩带","无极丝","天蚕丝带","云龙绸带","七彩罗刹","缚神绫","九天仙绫","彩虹","流云","碧波","秋水落霞","晃金仙绳","此最相思","揽月摘星","九霄"},
		爪刺 = {"铁爪","天狼爪","幽冥鬼爪","青龙牙","勾魂爪","玄冰刺","青刚刺","华光刺","龙鳞刺","撕天","毒牙","胭脂","九阴勾魂","雪蚕之刺","贵霜之牙","忘川三途","离钩"},
		扇 = {"折扇","铁骨扇","精钢扇","铁面扇","百折扇","劈水扇","神火扇","阴风扇","风云雷电","太极","玉龙","秋风","画龙点睛","秋水人家","逍遥江湖","浩气长舒","星瀚"},
		魔棒 = {"细木棒","金丝魔棒","玉如意","点金棒","云龙棒","幽路引魂","满天星","水晶棒","日月光华","沧海","红莲","盘龙","降魔玉杵","青藤玉树","墨玉骷髅","丝萝乔木","醍醐"},
		锤 = {"松木锤","镔铁锤","八棱金瓜","狼牙锤","烈焰锤","破甲战锤","震天锤","巨灵神锤","天崩地裂","八卦","鬼牙","雷神","混元金锤","九瓣莲花","鬼王蚀日","狂澜碎岳","碎寂"},
		鞭 = {"牛皮鞭","牛筋鞭","乌龙鞭","钢结鞭","蛇骨鞭","玉竹金铃","青藤柳叶鞭","雷鸣嗜血鞭","混元金钩","龙筋","百花","吹雪","游龙惊鸿","仙人指路","血之刺藤","牧云清歌","霜陨"},
		环圈 = {"黄铜圈","精钢日月圈","离情环","金刺轮","风火圈","赤炎环","蛇形月","子母双月","斜月狼牙","如意","乾坤","月光双环","别情离恨","金玉双环","九天金线","无关风月","朝夕"},
		刀 = {"柳叶刀","苗刀","夜魔弯刀","金背大砍刀","雁翅刀","破天宝刀","狼牙刀","龙鳞宝刀","黑炎魔刀","冷月","屠龙","血刃","偃月青龙","晓风残月","斩妖泣血","业火三灾","鸣鸿"},
		法杖 = {"曲柳杖","红木杖","白椴杖","墨铁拐","玄铁牛角杖","鹰眼法杖","腾云杖","引魂杖","碧玺杖","业焰","玉辉","鹿鸣","庄周梦蝶","凤翼流珠","雪蟒霜寒","碧海潮生","弦月"},
		弓弩 = {"硬木弓","铁胆弓","紫檀弓","宝雕长弓","錾金宝弓","玉腰弯弓","连珠神弓","游鱼戏珠","灵犀望月","非攻","幽篁","百鬼","冥火薄天","龙鸣寒水","太极流光","九霄风雷","若木"},
		宝珠 = {"琉璃珠","水晶珠","珍宝珠","翡翠珠","莲华珠","夜灵珠","如意宝珠","沧海明珠","无量玉璧","离火","飞星","月华","回风舞雪","紫金葫芦","裂云啸日","云雷万里","赤明"},
		巨剑 = {"钝铁重剑","桃印铁刃","赭石巨剑","壁玉长铗","青铜古剑","金错巨刃","惊涛雪","醉浮生","沉戟天戊","鸦九","昆吾","弦歌","墨骨枯麟","腾蛇郁刃","秋水澄流","百辟镇魂","长息"},
		灯笼 = {"素纸灯","竹骨灯","红灯笼","鲤鱼灯","芙蓉花灯","如意宫灯","玲珑盏","玉兔盏","冰心盏","蟠龙","云鹤","风荷","金风玉露","凰火燎原","月露清愁","夭桃秾李","荒尘"},
		伞 = {"油纸伞","红罗伞","紫竹伞","锦绣椎","幽兰帐","琳琅盖","孔雀羽","金刚伞","落梅伞","鬼骨","云梦","枕霞","碧火琉璃","雪羽穿云","月影星痕","浮生归梦","晴雪"},
		双斧乾 = {"顽石双斧(乾)","镔铁双斧(乾)","黑曜双斧(乾)","枭首双斧(乾)","破军双斧(乾)","隳城双戚(乾)","飞头蛮(乾)","竹叶青(乾)","鲛煞(乾)","啖月(乾)","义战(乾)","恶来(乾)","烬世野火(乾)","九州海沸(乾)","八狱末劫(乾)","罗喉计都(乾)","非天(乾)"},
        双斧坤 = {"顽石双斧(坤)","镔铁双斧(坤)","黑曜双斧(坤)","枭首双斧(坤)","破军双斧(坤)","隳城双戚(坤)","飞头蛮(坤)","竹叶青(坤)","鲛煞(坤)","啖月(坤)","义战(坤)","恶来(坤)","烬世野火(坤)","九州海沸(坤)","八狱末劫(坤)","罗喉计都(坤)","非天(坤)"},
	}

	local 临时 = 武器表[self:取武器子类(子类)]
	if 临时 then
		for i=1,#临时 do
			if 临时[i] == 名称 then
				if i >= 10 then
					return 名称
				else
					return 临时[math.modf((i-1)/3)*3 +1]
				end
			end
		end
	end
	return 名称
end

function 主控:取y偏移(头像)
	if 头像 == "杀破狼" then
		return 35
	elseif 头像 == "巫蛮儿" then
		return 19
	elseif 头像 == "羽灵神" then
		return 25
	elseif 头像 == "吸血鬼" then
		return 25
	elseif 头像 == "鬼潇潇" then
		return 1
	elseif 头像 == "桃夭夭" then
		return 58
	elseif 头像 == "偃无师" then
		return 33
	elseif 头像 == "曼珠沙华" or 头像 == "狂豹人形" then
		return 303
	elseif 头像 == "鲛人" then
		return 27
	elseif 头像 == "犀牛将军_人" then
		return 32
	elseif 头像 == "野猪精" then
		return 25
	elseif 头像 == "修罗傀儡妖" or 头像 == "金身罗汉" then
		return 235
	elseif 头像 == "猫灵人形" then
		return 275
	elseif 头像 == "藤蔓妖花" or 头像 == "修罗傀儡鬼" then
		return 260
	elseif 头像 == "混沌兽" then
		return 350
	elseif 头像 == "蜃气妖" then
		return 215
	elseif 头像 == "泡泡" then
		return 20
	elseif 头像 == "福星" or 头像 == "长眉灵猴" or 头像 == "巨力神猿" then
		return 28
	elseif 头像 == "葫芦宝贝" then
		return 336
	elseif 头像 == "蝎子精" then
		return 236
	elseif 头像 == "猫灵兽形" or 头像 == "猫灵" then
		return 377
	elseif 头像 == "狂豹兽形" then
		return 363
	elseif 头像 == "物件_打铁炉" then
		return -63
	elseif 头像 == "银两" or 头像 == "食物" or 头像 == "口粮" or 头像 == "摄妖香" or 头像 == "药品" then
		return -20
		--===========================
	end
	return 0
end

function 主控:取门派()
	if 多开数据[当前 or self and self.当前].角色信息.门派 == "方寸山" then
		return "方\n寸\n山"
	elseif 多开数据[当前 or self and self.当前].角色信息.门派 == "女儿村" then
		return "女\n儿\n村"
	elseif 多开数据[当前 or self and self.当前].角色信息.门派 == "神木林" then
		return "神\n木\n林"
	elseif 多开数据[当前 or self and self.当前].角色信息.门派 == "化生寺" then
		return "化\n生\n寺"
	elseif 多开数据[当前 or self and self.当前].角色信息.门派 == "大唐官府" then
		return "大\n唐\n官\n府"
	elseif 多开数据[当前 or self and self.当前].角色信息.门派 == "盘丝洞" then
		return "盘\n丝\n洞"
	elseif 多开数据[当前 or self and self.当前].角色信息.门派 == "阴曹地府" then
		return "阴\n曹\n地\n府"
	elseif 多开数据[当前 or self and self.当前].角色信息.门派 == "无底洞" then
		return "无\n底\n洞"
	elseif 多开数据[当前 or self and self.当前].角色信息.门派 == "魔王寨" then
		return "魔\n王\n寨"
	elseif 多开数据[当前 or self and self.当前].角色信息.门派 == "狮驼岭" then
		return "狮\n驼\n岭"
	elseif 多开数据[当前 or self and self.当前].角色信息.门派 == "天宫" then
		return "天\n宫"
	elseif 多开数据[当前 or self and self.当前].角色信息.门派 == "普陀山" then
		return "普\n陀\n山"
	elseif 多开数据[当前 or self and self.当前].角色信息.门派 == "凌波城" then
		return "凌\n波\n城"
	elseif 多开数据[当前 or self and self.当前].角色信息.门派 == "五庄观" then
		return "五\n庄\n观"
	elseif 多开数据[当前 or self and self.当前].角色信息.门派 == "龙宫" then
		return "龙\n宫"
	elseif 多开数据[当前 or self and self.当前].角色信息.门派 == "九黎城" then
        return "九\n黎\n城"		
	else
		return "无\n门\n派"
	end
end

function 主控:取攻击帧(模型, zl)
	local 攻击帧, 攻击延迟, 终结帧 ,攻击抖动= 2, 1.25, nil,false
	zl = self:取武器子类(zl)
	if 模型 == "偃无师" or 模型 == "桃夭夭" then
		攻击帧 = -1
		攻击延迟 = 1.35
	elseif 模型 == "鬼潇潇" or 模型 == "龙太子" or 模型 == "剑侠客" or 模型 == "真陀护法" then
		攻击帧 = 1
		攻击延迟 = 1.3
		if 模型 == "龙太子" and zl=="扇" then
		    	攻击抖动 = true
	    	elseif 模型 == "鬼潇潇" and zl=="爪刺" then
	    		攻击抖动 = true
		end
	elseif 模型 == "玄彩娥" or 模型 == "舞天姬" or 模型 == "进阶毗舍童子" or 模型 == "羊头怪" or 模型 == "锦毛貂精" then
		攻击帧 = -1
		攻击延迟 = 1.15
		if 模型 == "舞天姬" and zl=="环圈" then
		    攻击抖动 = true
		end
	elseif 模型 == "虎头怪" or 模型 == "神天兵" or 模型 == "巨魔王" or 模型 == "杀破狼" or 模型 == "持国巡守" or 模型 == "雷鸟人" or 模型 == "金饶僧" or 模型 == "葫芦宝贝" or 模型 == "幽灵" or 模型 == "凤凰" or 模型 == "野鬼" or 模型 == "帮派妖兽" or 模型 == "修罗傀儡鬼" or 模型 == "踏云兽" or 模型 == "巴蛇" or 模型 == "黑熊" then
		攻击帧 = 1
		攻击延迟 = 1.2
		if zl ~= nil then
			if zl == "弓弩" or zl == "弓弩1" then
				攻击延迟 = 0.88
			end
		end
		if 模型 == "虎头怪" and zl=="锤" then
		    	攻击抖动 = true
	    	elseif 模型 == "神天兵" and zl=="枪矛" then
	    		攻击抖动 = true
		end

	elseif 模型 == "强盗" or 模型 == "山贼" or 模型 == "鼠先锋" or 模型 == "增长巡守" or 模型 == "灵灯侍者" or 模型 == "般若天女" or 模型 == "进阶雨师" or 模型 == "进阶如意仙子" or 模型 == "野猪精" or 模型 == "超级玉兔" or 模型 == "幽萤娃娃" or 模型 == "黑熊精" or 模型 == "蚌精" or 模型 == "机关鸟" or 模型 == "连弩车" or 模型 == "蜃气妖" or 模型 == "蛤蟆精" or 模型 == "虾兵" or 模型 == "蟹将" or 模型 == "兔子怪" or 模型 == "蜘蛛精" or 模型 == "花妖" or 模型 == "狐狸精" or 模型 == "哮天犬" or 模型 == "混沌兽" or 模型 == "蝴蝶仙子" or 模型 == "狼" or 模型 == "老虎" then
		攻击帧 = 2
		攻击延迟 = 1.12
		if 模型 == "强盗" or 模型 == "山贼" then
		    攻击抖动 = true
		end
	elseif 模型 == "机关人人形" or 模型 == "机关兽" then
		攻击帧 = 2
		攻击延迟 = 1.25
	elseif 模型 == "泡泡" then
		攻击帧 = 2
		攻击延迟 = 2.1
	elseif 模型 == "混沌兽" then
		攻击延迟 = 1.35
	elseif 模型 == "狂豹人形" then
		攻击帧 = 1
		攻击延迟 = 1.4
	elseif 模型 == "海毛虫" then
		攻击帧 = 1
		攻击延迟 = 1.35
	elseif 模型 == "大海龟" or 模型 == "骷髅怪" or 模型 == "金身罗汉" or 模型 == "修罗傀儡妖" or 模型 == "曼珠沙华" or 模型 == "幽萤娃娃" then
		攻击帧 = 1
		攻击延迟 = 1.2
	elseif 模型 == "吸血鬼" then
		攻击抖动 = true
	elseif 模型 == "画魂" or 模型 == "羽灵神" then
		攻击帧 = 1
		攻击延迟 = 1.1
	elseif 模型 == "天兵" or 模型 == "巨力神猿" then
		攻击帧 = 1
		攻击延迟 = 1.25
	elseif 模型 == "地狱战神" or 模型 == "风伯" or 模型 == "芙蓉仙子" or 模型 == "毗舍童子" or 模型 == "镜妖" or 模型 == "千年蛇魅" or 模型 == "小龙女" then
		攻击帧 = 0
		攻击延迟 = 1.25
	elseif 模型 == "芙蓉仙子" then
		攻击帧 = 0
		攻击延迟 = 1.1
	elseif 模型 == "百足将军" or 模型 == "天将" or 模型 == "小龙女" or 模型 == "碧水夜叉" or 模型 == "马面" or 模型 == "灵鹤" then
		攻击帧 = 3
		攻击延迟 = 1.23
	elseif 模型 == "鬼将" or 模型 == "大力金刚" then
		攻击帧 = 4
		攻击延迟 = 1.3
		终结帧 = 1
	elseif 模型 == "赌徒" then
		攻击帧 = 4
		攻击延迟 = 1.1
	elseif 模型 == "牛妖" then
		攻击帧 = 3
		攻击延迟 = 1.26
	elseif 模型 == "古代瑞兽" then
		攻击帧 = 4
		攻击延迟 = 1.2
	elseif 模型 == "知了王" then
		攻击帧 = 6
		攻击延迟 = 1.32
	elseif 模型 == "黑山老妖" then
		攻击帧 = 6
		攻击延迟 = 1.2
	elseif 模型 == "炎魔神" then
		攻击帧 = 3
		攻击延迟 = 1.2
	elseif 模型 == "长眉灵猴" then
		攻击帧 = -1
		攻击延迟 = 1.23
	elseif 模型 == "骨精灵" or 模型 == "狐美人" or 模型 == "剑侠客" or 模型 == "逍遥生" or 模型 == "巫蛮儿" or 模型 == "英女侠" or 模型 == "飞燕女" then
		if zl ~= nil then
			if zl == "魔棒" then
				攻击帧 = -1
				if 模型 == "骨精灵" then
					攻击帧 = 2
				    攻击抖动 = true
				end
				
			elseif zl == "宝珠" then
				攻击帧 = 2
			elseif 模型 == "英女侠" then
				攻击帧 = 0
			elseif 模型 == "飞燕女" and zl == "双短剑" then
				攻击帧 = 0
			elseif 模型 == "飞燕女" and zl == "环圈" then
				攻击帧 = 3
			elseif 模型 == "逍遥生" and (zl == "扇") then
				攻击帧 = 0
			elseif 模型 == "逍遥生" and (zl == "剑") then
				攻击帧 = -1
				终结帧 = 1
			elseif 模型 == "巫蛮儿" and (zl == "法杖") then
				攻击帧 = 0
			elseif 模型 == "狐美人" and zl == "爪刺" then
				攻击帧 = 0
			elseif 模型 == "狐美人" and zl == "鞭" then
				攻击帧 = 0
			elseif 模型 == "杀破狼" and (zl == "弓弩") then
				攻击帧 = -1
				攻击延迟 = 1.1
			elseif 模型 == "羽灵神" and (zl == "弓弩") then
				攻击帧 = -1
				攻击延迟 = 1.1
			end
		else
			攻击帧 = 1
		end
		攻击延迟 = 1.25
	end
	return 攻击帧, 攻击延迟/tp战斗速度倍数, 终极帧 ,攻击抖动
end

function 主控:计算修炼等级经验(等级, 上限)
    local 临时经验=110
	if 等级==0 then return 110 end
	for n=1,上限+1 do
		local nx=20
		if 等级>9 then
			nx=40
		end
		临时经验=临时经验+20+n*nx
		if n==等级 then
			return  临时经验
		end
	end
end
function 计算修炼等级经验(等级,上限)
    local 临时经验=110
    if 等级==0 then return 110 end
    for n=1,上限+1 do
        临时经验=临时经验+20+n*20
        if n==等级 then return  临时经验 end
    end
end
function 主控:取名称颜色(名称, 历劫, 类型, pk)
	if 类型 == "主角" or 类型 == "玩家" then
		if 名称 == "游戏管理员" then
			return 248, 8, 65
		elseif 历劫 and 历劫.化圣 == true then
			return 248, 124, 247
		elseif pk then
			return 255, 0, 0
		end
		return 127, 255, 147
	else
		return 222, 203, 37
	end
end

function 主控:取称谓颜色(称谓, 类型)
	if 类型 == "主角" or 类型 == "玩家" then
		if 称谓 == "生死劫·止戈" then
			return 247, 130, 227
		elseif 称谓 == "生死劫·清心" then
			return 247, 130, 227
		elseif 称谓 == "生死劫·雷霆" then
			return 247, 130, 227
		elseif 称谓 == "生死劫·惜花" then
			return 247, 130, 227
		elseif 称谓 == "生死劫·忘情" then
			return 247, 130, 227
		elseif 称谓 == "生死劫·卧龙" then
			return 247, 130, 227
		elseif 称谓 == "生死劫·天象" then
			return 247, 130, 227
		elseif 称谓 == "生死劫·轮回" then
			return 247, 130, 227
		elseif 称谓 == "生死劫·娑罗" then
			return 247, 130, 227
		elseif 称谓 == "超凡入圣" then
			return 247, 130, 227
		elseif 称谓 == "初入三界" then
			return 247, 130, 227
		elseif 称谓 == "牛刀小试" then
			return 247, 130, 227
		elseif 称谓 == "炉火纯青" then
			return 247, 130, 227
		elseif 称谓 == "身经百战" then
			return 247, 130, 227
		elseif 称谓 == "力挽狂澜" then
			return 247, 130, 227
		elseif 称谓 == "以一当百" then
			return 247, 130, 227
		elseif 称谓 == "千招无敌" then
			return 247, 130, 227
		elseif 称谓 == "气吞山河" then
			return 247, 130, 227
		elseif 称谓 == "勇冠三军" then
			return 247, 130, 227
		elseif 称谓 == "威震三界" then
			return 247, 130, 227
		end
		return 90, 205, 255
	else
		return 157, 209, 253
	end
end


function 主控:数字转境(zj)
	local zjs
	if zj == 0 then
		zjs = "零境"
	elseif zj == 1 then
		zjs = "壹境"
	elseif zj == 2 then
		zjs = "贰境"
	elseif zj == 3 then
		zjs = "叁境"
	elseif zj == 4 then
		zjs = "肆境"
	elseif zj == 5 then
		zjs = "伍境"
	elseif zj == 6 then
		zjs = "陆境"
	elseif zj == 7 then
		zjs = "柒境"
	elseif zj == 8 then
		zjs = "捌境"
	elseif zj == 9 then
		zjs = "玖境"
	elseif zj == 10 then
		zjs = "拾境"
	end
	return zjs
end

function 主控:数字转天(zj)
	local zjs
	if zj == 0 then
		zjs = "零天"
	elseif zj == 1 then
		zjs = "壹天"
	elseif zj == 2 then
		zjs = "贰天"
	elseif zj == 3 then
		zjs = "叁天"
	elseif zj == 4 then
		zjs = "肆天"
	elseif zj == 5 then
		zjs = "伍天"
	elseif zj == 6 then
		zjs = "陆天"
	elseif zj == 7 then
		zjs = "柒天"
	elseif zj == 8 then
		zjs = "捌天"
	elseif zj == 9 then
		zjs = "玖天"
	elseif zj == 10 then
		zjs = "拾天"
	end
	return zjs
end

function 主控:载入特效(特效, zl, ns)
	local a = 特效库(特效)
	if a[1] == nil then
		a = 特效库("无特效")
		多开数据[self.当前].__UI界面.界面层.左下角.聊天文本:添加文本("请截图给管理员,谢谢[ " .. 特效 .. " ]特效没技能素材", "xt")
	elseif a[2] == nil and a[1] == nil then
		a = 特效库("无特效")
		多开数据[self.当前].__UI界面.界面层.左下角.聊天文本:添加文本("请截图给管理员,谢谢[ " .. 特效 .. " ]特效没技能素材1", "xt")
	end
	if a[3] then
		return { __res:取动画2(__res:取地址('shape/tx/', a[1])), __res:取动画2(__res:取地址('shape/tx/', a[3])) }
	else
		return __res:取动画2(__res:取地址('shape/tx/', a[1]))
	end
end

function 主控:载入技能图标(name)
	local qtb = 取技能信息(name)
	return { __res:取精灵(__res:取地址('shape/jn/', qtb[7])), __res:取精灵(__res:取地址('shape/jn/', qtb[8])) }
end

function 主控:播放地图音乐(map)
	local yu=取Bgm(map)
					if map==10031 then
						yu=1138
					elseif map==10030 then
						yu=1232
					elseif map==10032 then
						yu=1221
					elseif map==10033 then
						yu=1122
					elseif map==10034 then
						yu=1515
					elseif map==10035 then
						yu=1139
					elseif map==10036 or map==10037 or  map==10045 then
						yu=1111
					elseif map==10038 then
						yu=1040
					elseif map==10039 then
						yu=1131
					elseif map==10040 then
						yu=1192
					elseif map==20041 then
						yu=1210
					elseif map==10042 or map==10043 or map==10047 then
						yu=1116
					elseif map==10044 then
						yu=1231
					elseif map==10045 or map==10046 then
						yu=1284
					elseif map==10048 then
						yu=1287
					end
	if __res.配置.音乐 then
		if __res:是否存在('music/' .. yu .. '.mp3') then
			self.地图音乐 = 'music/' .. yu .. '.mp3'
					
		end
		if self.地图音乐 then
			self.音乐 = __res:取音乐(self.地图音乐):播放(true):置音量(__res.配置.音乐音量)
		end
	else
		if self.音乐:是否播放() then
			self.音乐:停止()
		end
	end
end

function 主控:停止地图音乐()
	if self.音乐:是否播放() then
		self.音乐:停止()
	end
end

function 主控:恢复地图音乐()
	if self.地图音乐 then
		self.音乐 = __res:取音乐(self.地图音乐):播放(true):置音量(__res.配置.音乐音量)
	end
end

function 主控:播放战斗音乐(id)
	if __res.配置.音乐 then
		self.战斗音乐 = __res:取音乐('music/zd' .. id .. '.mp3'):播放(true):置音量(__res.配置.音乐音量)
	end
end

function 主控:停止战斗音乐()
	if self.战斗音乐 and self.战斗音乐:是否播放() then
		self.战斗音乐:停止()
	end
end

function 主控:播放特效音乐(obj)
	if __res.配置.音效 then
		if obj ~= nil and obj.文件 ~= nil then
			local 地址 = __res:取地址('shape/' .. obj.资源 .. '/', obj.文件, "音效")
			if 地址 then
				self.战斗音效 = __res:取音效(地址):播放():置音量(__res.配置.音效音量)
			end
		end
	end
end

function 主控:播放动作音乐(route, path)
	if __res.配置.音效 then
		local 地址 = __res:取地址('shape/' .. route .. '/', path, "音效")
		if 地址 then
			self.战斗动作音效 = __res:取音效(地址):播放():置音量(__res.配置.音效音量)
		end
	end
end

function 主控:取剧情描述(主线, 进度, 分支)
	if 主线 == 1 then
		if 进度 == 1 then
			return { "桃源村一别", "[新手主线]天气晴好，正宜出行和" .. "#R/qqq|霞姑娘*桃源村*npc查询/霞姑娘" .. "#W说话去。" }
		elseif 进度 == 2 then
			return { "桃源村一别", "[新手主线]去看看" .. "#R/qqq|刘大婶*桃源村*npc查询/刘大婶#" }
		elseif 进度 == 3 then
			return { "桃源村一别", "[新手主线]去" .. "#R/qqq|孙猎户*桃源村*npc查询/孙猎户" .. "#W看看是否需要帮助" }
		elseif 进度 == 4 then
			return { "桃源村一别", "[新手主线]帮助孙猎户打晕这头" .. "#R/qqq|野猪*桃源村*npc查询/野猪" }
		elseif 进度 == 5 then
			return { "桃源村一别", "[新手主线]跟" .. "#R/qqq|孙厨娘*桃源村*npc查询/孙厨娘" .. "#W报个平安" }
		elseif 进度 == 6 then
			return { "桃源村一别", "[新手主线]" .. "#R/qqq|郭大哥*桃源村*npc查询/郭大哥" .. "#W在呼救，这就去看看发生了什么！" }
		elseif 进度 == 7 then
			return { "桃源村一别", "[新手主线]帮助郭大哥捕捉" .. "#R/qqq|狸*桃源村*npc查询/狸" .. "#W！" }
		elseif 进度 == 8 then
			return { "桃源村一别", "[新手主线]狸的状况好像不太好找" .. "#R/qqq|玄大夫*桃源村*npc查询/玄大夫" .. "#W帮他治疗吧！" }
		elseif 进度 == 9 then
			return { "桃源村一别", "[新手主线]找" .. "#R/qqq|雨画师*桃源村*npc查询/雨画师" .. "#W他好像又什么事情要告诉你" }
		elseif 进度 == 10 then
			return { "桃源村一别", "[新手主线]点按Tab键或点击界面上角放大镜图键地图左下方NPC" .. "#R/qqq|萍儿*桃源村*npc查询/萍儿" .. "#W就可以百动寻路" }
		elseif 进度 == 11 then
			return { "桃源村一别", "[新手主线]" .. "#R/qqq|桃源仙女*桃源村*npc查询/桃源仙女" .. "#W已经等候多时了，快点点击选项这就上船开启游湖之旅吧" }
		elseif 进度 == 13 then
			return { "桃源村一别", "[新手主线]去寻找" .. "#R/qqq|夏大叔*桃源村*npc查询/夏大叔" .. "#W聊一聊，并告个别吧！#Y/(组队时需要拆散队伍，单独完成加入门派剧情)" }
		-- elseif 进度 == 13 then
		-- 	return { "桃源村一别", "[新手主线]" .. "#R/qqq|夏大叔*桃源村*npc查询/夏大叔" .. "#W随是对你多加鼓励，可是你的心中依然忐忑！" }
		end
	elseif 主线 == 2 then
		print(多开数据[当前 or self and self.当前].角色信息.剧情.地图)
		if 进度 == 2222 then
			local 名字 = self:取地图师傅(多开数据[当前 or self and self.当前].角色信息.剧情.地图)
			return { "拜师", "[新手主线]快点和你师傅" .. "#R" .. (名字 or "") .. "#W说说话儿，如果有缘的话就拜师吧。" }
		elseif 进度 == 2 then
			return { "商人的鬼魂", "[新手主线]找" .. "#R/qqq|老孙头*建邺城*npc查询/老孙头" .. "#W问一下建邺城闹鬼的事！" }
		elseif 进度 == 3 then
			return { "商人的鬼魂", "[新手主线]找" .. "#R/qqq|牛大胆*建邺城*npc查询/牛大胆" .. "#W去寻问做法事的事情。" }
		elseif 进度 == 4 then
			return { "商人的鬼魂", "[新手主线]问问" .. "#R/qqq|王大嫂*建邺城*npc查询/王大嫂" .. "#W有没有美味可口的" .. "#R/qqq|获取途径*任务获取*bz提示/红烧鱼" }
		elseif 进度 == 5 then
			return { "商人的鬼魂", "[新手主线]帮助" ..
			"#R/qqq|王大嫂*建邺城*npc查询/王大嫂" .. "#W寻找个#R/qqq|获取途径*建邺城药店购买*bz提示/熊胆#W点按ALT+G键或点击界面下方的小手将#R熊胆#W给予王大婶" }
		elseif 进度 == 6 then
			return { "商人的鬼魂", "[新手主线]将#R红烧鱼#W交给" .. "#R/qqq|牛大胆*建邺城*npc查询/牛大胆" .. "#W饱饱口福" }
		elseif 进度 == 7 then
			return { "商人的鬼魂", "[新手主线]询问" .. "#R/qqq|管家*建邺城*npc查询/管家" .. "#W关于李善人恶疾的事情" }
		elseif 进度 == 8 then
			return { "商人的鬼魂", "[新手主线]找" .. "#R/qqq|马全有*建邺城*npc查询/马全友" .. "#W问问#R松风林芝" }
		elseif 进度 == 9 then
			return { "商人的鬼魂", "[新手主线]将" .. "#R/qqq|获取途径*建邺城药店购买*bz提示/地狱灵芝" .. "#W交给" .. "#R/qqq|管家*建邺城*npc查询/管家" }
		elseif 进度 == 10 then
			return { "商人的鬼魂", "[新手主线]找" .. "#R/qqq|李善人*民居内室*npc查询/李善人" .. "#W打听一下恶鬼的来历" }
		elseif 进度 == 11 then
			return { "商人的鬼魂", "[新手主线]去" .. "#R/qqq|行走路径*地图左面传送阵*bz提示/东海湾沉船底" .. "#W找到" .. "#R/qqq|商人的鬼魂*沉船内室*npc查询/商人的鬼魂" }
		elseif 进度 == 12 then
			return { "商人的鬼魂", "[新手主线]告诉" .. "#R/qqq|李善人*民居内室*npc查询/李善人" .. "#W鬼魂的事情" }
		elseif 进度 == 13 then
			return { "商人的鬼魂", "[新手主线]将事情告诉" .. "#R/qqq|老孙头*建邺城*npc查询/老孙头" .. "#W让他安心" }
		end
	elseif 主线 == 3 then
		if 进度 == 1 then
			return { "玄奘的身世", "[主线剧情]在" .. "#R/qqq|南极仙翁*长寿村*npc查询/南极仙翁" .. "#W处领取“玄奘的身世”剧情任务。" }
		elseif 进度 == 2 then
			return { "玄奘的身世", "[主线剧情]听说南极仙翁的白鹿幻化成" .. "#R/qqq|白鹿精*大唐境外*npc查询/白鹿精" .. "#W快去找找看吧！" }
		elseif 进度 == 3 then
			return { "玄奘的身世", "[主线剧情]收服白鹿精后，将白鹿带回" .. "#R/qqq|南极仙翁*长寿村*npc查询/南极仙翁" .. "#W处。" }
		elseif 进度 == 4 then
			return { "玄奘的身世", "[主线剧情]快去长安药店买一朵" ..
			"#R/qqq|获取途径*长安药店*bz提示/百色花" .. "#W来给" .. "#R/qqq|南极仙翁*长寿村*npc查询/南极仙翁" .. "#W吧。" }
		elseif 进度 == 5 then
			return { "玄奘的身世", "[主线剧情]去长安的福寿店买一炷" ..
			"#R/qqq|获取途径*长安福寿店*bz提示/香" .. "#W再去大唐国境金山寺" .. "#R/qqq|酒肉和尚*大雄宝殿*npc查询/酒肉和尚" .. "#W处上香吧 。" }
		elseif 进度 == 6 then
			return { "玄奘的身世", "[主线剧情]酒肉和尚出口伤人，去看看深受打击的" .. "#R/qqq|玄奘*大雄宝殿*npc查询/玄奘" .. "#W法师吧。" }
		elseif 进度 == 7 then
			return { "玄奘的身世", "[主线剧情]去跟化生寺的小和尚" .. "#R/qqq|慧明*光华殿*npc查询/慧明" ..
			"#W打听" .. "#R/qqq|法明长老*光华殿*npc查询/法明长老" .. "#W的下落" }
		elseif 进度 == 8 and 分支 == 1 then
			return { "玄奘的身世", "[主线剧情]去看看厢房内的" .. "#R/qqq|法明长老*光华殿*npc查询/法明长老" .. "#W是否安然无恙吧。" }
		elseif 进度 == 8 and 分支 == 2 then
			return { "玄奘的身世", "[主线剧情]化生寺居然有劫难？快去" .. "#R/qqq|空慈方丈*化生寺*npc查询/空慈方丈" .. "#W处打探。" }
		elseif 进度 == 8 and 分支 == 3 then
			return { "玄奘的身世", "[主线剧情]别让" .. "#R/qqq|白琉璃*大唐国境*npc查询/白琉璃" .. "#W逃走！快去夺回" ..
			"#R/qqq|获取途径*炼药*bz提示/佛光舍利子" .. "#W！" }
		elseif 进度 == 8 and 分支 == 4 then
			return { "玄奘的身世", "[主线剧情]拿回了" .. "#R/qqq|获取途径*炼药*bz提示/佛光舍利子" ..
			"#W赶快回化生寺交给" .. "#R/qqq|空慈方丈*化生寺*npc查询/空慈方丈" .. "#W吧" }
		elseif 进度 == 9 then
			return { "玄奘的身世", "[主线剧情]法明长老昏迷不醒，跟寺内照顾长老的" .. "#R/qqq|慧海*化生寺*npc查询/慧海" .. "#W和尚打听一下情况吧。" }
		elseif 进度 == 10 then
			return { "玄奘的身世", "[主线剧情]人命关天，赶快请花果山的" .. "#R/qqq|侯医仙*花果山*npc查询/侯医仙" .. "#W来救长老一命！" }
		elseif 进度 == 11 then
			return { "玄奘的身世", "[主线剧情]快去寻得" ..
			"#R/qqq|获取途径*野外或摊位购买*bz提示/餐风饮露" .. "#W这味药材交给" .. "#R/qqq|侯医仙*花果山*npc查询/侯医仙" .. "#W！" }
		elseif 进度 == 12 then
			return { "玄奘的身世", "[主线剧情]拿到灵药" ..
			"#R/qqq|获取途径*炼药*bz提示/定神香" .. "#W赶快回去化生寺厢房交给" .. "#R/qqq|法明长老*光华殿*npc查询/法明长老" .. "#W服用吧！" }
		elseif 进度 == 13 then
			return { "玄奘的身世", "[主线剧情]把血书拿给" .. "#R/qqq|玄奘*大雄宝殿*npc查询/玄奘" .. "#W看看！" }
		elseif 进度 == 14 then
			return { "玄奘的身世", "[主线剧情]" .. "#R/qqq|酒肉和尚*大雄宝殿*npc查询/酒肉和尚" .. "#W对玄奘法师做了什么！快去找他问问。" }
		elseif 进度 == 15 then
			return { "玄奘的身世", "[主线剧情]快去普陀山请" .. "#R/qqq|青莲仙女*潮音洞*npc查询/青莲仙女" .. "#W炼制丹药吧！" }
		elseif 进度 == 16 then
			return { "玄奘的身世", "[主线剧情]快去阴曹地府向" .. "#R/qqq|孟婆*阴曹地府*npc查询/孟婆" .. "#W讨一碗孟婆酒吧！（此环节需要等级 ≥40）" }
		elseif 进度 == 17 then
			return { "玄奘的身世", "[主线剧情]去找地狱迷宫一层的" .. "#R/qqq|幽冥鬼*地狱迷宫一层*npc查询/幽冥鬼" .. "#W要一碗酒。" }
		elseif 进度 == 18 then
			return { "玄奘的身世", "[主线剧情]去大唐国境江州民居内找他口中的" .. "#R/qqq|文秀*江州民居*npc查询/文秀" .. "#W要姑娘打听一下。" }
		elseif 进度 == 19 then
			return { "玄奘的身世", "[主线剧情]把文秀的手镯交给" .. "#R/qqq|幽冥鬼*地狱迷宫一层*npc查询/幽冥鬼" .. "#W让他安心投胎吧！。" }
		elseif 进度 == 20 then
			return { "玄奘的身世", "[主线剧情]跟" .. "#R/qqq|孟婆*阴曹地府*npc查询/孟婆" .. "#W讨了那碗孟婆酒走吧。" }
		elseif 进度 == 21 then
			return { "玄奘的身世", "[主线剧情]把九转回魂丹和孟婆酒拿给" .. "#R/qqq|玄奘*大雄宝殿*npc查询/玄奘" .. "#法师服用吧。" }
		elseif 进度 == 22 then
			return { "玄奘的身世", "[主线剧情]前往大唐国境江州衙门处找些" .. "#R/qqq|衙门守卫*大唐国境*npc查询/衙门守卫" .. "#打听打听情况。" }
		elseif 进度 == 23 then
			return { "玄奘的身世", "[主线剧情]可以进衙门找" .. "#R/qqq|殷温娇*大唐国境*npc查询/殷温娇" .. "#W了。 " }
		elseif 进度 == 24 then
			return { "玄奘的身世", "[主线剧情]既与龙宫相关，就找再江州衙门街头溜达的" .. "#R/qqq|虾兵*大唐国境*npc查询/虾兵" .. "#W问问！ " }
		elseif 进度 == 25 then
			return { "玄奘的身世", "[主线剧情]快去向大唐国境的" .. "#R/qqq|渔翁*大唐国境*npc查询/渔翁" .. "#W求教入海方法吧！ " }
		elseif 进度 == 26 then
			return { "玄奘的身世", "[主线剧情]听说大唐国境有" .. "#R/qqq|山神*大唐国境*npc查询/山神" .. "#出没过去看看吧！ " }
		elseif 进度 == 27 then
			return { "玄奘的身世", "[主线剧情]找到" .. "#R/qqq|获取途径*烹饪或摊位购买*bz提示/臭豆腐" ..
			"#W贿赂" .. "#R/qqq|山神*大唐国境*npc查询/山神" .. "#W。（可选战斗） " }
		elseif 进度 == 28 then
			return { "玄奘的身世", "[主线剧情]找到" .. "#R/qqq|获取途径*烹饪或摊位购买*bz提示/梅花酒" .. "#W重新贿赂" ..
			"#R/qqq|山神*大唐国境*npc查询/山神" .. "#W吧。 " }
		elseif 进度 == 29 then
			return { "玄奘的身世", "[主线剧情]先去龙宫拜见守门大将军" .. "#R/qqq|蟹将军*龙宫*npc查询/蟹将军" .. "#大人吧！ " }
		elseif 进度 == 30 then
			return { "玄奘的身世", "[主线剧情]终于可以拜见" .. "#R/qqq|龟千岁*龙宫*npc查询/龟千岁" ..
			"#交还宝物 " .. "#R/qqq|获取途径*江州闲逛的虾兵*bz提示/定颜珠" .. "#！ " }
		elseif 进度 == 31 then
			return { "玄奘的身世", "[主线剧情]将" .. "#R/qqq|获取途径*大唐国境山神*bz提示/辟水宝珠" .. "#W交换给" .. "#R/qqq|山神*大唐国境*npc查询/山神" .. "#W。 " }
		elseif 进度 == 32 then
			return { "玄奘的身世", "[主线剧情]将陈光蕊的信物交给江州衙门的" .. "#R/qqq|殷温娇*大唐国境*npc查询/殷温娇" .. "#W吧！ " }
		elseif 进度 == 33 then
			return { "玄奘的身世", "[主线剧情]要找寻找婆婆的下落先问问大唐国境万花店的" .. "#R/qqq|小二*大唐国境*npc查询/小二" .. "#W。 " }
		elseif 进度 == 34 then
			return { "玄奘的身世", "[主线剧情]" .. "#R/qqq|婆婆*大唐国境*npc查询/婆婆" .. "#W在大唐国境洪州街头乞讨，快去那里找到她吧。 " }
		elseif 进度 == 35 then
			return { "玄奘的身世", "[主线剧情]买一只" .. "#R/qqq|获取途径*烹饪技巧*bz提示/烤鸭" .. "#W给 " .. "#R/qqq|婆婆*大唐国境*npc查询/婆婆" .. "#W吃。 " }
		elseif 进度 == 36 then
			return { "玄奘的身世", "[主线剧情]去龙宫求丁香水" .. "#R/qqq|龟千岁*龙宫*npc查询/龟千岁" .. "#W应该会应允吧。 " }
		elseif 进度 == 37 then
			return { "玄奘的身世", "[主线剧情]用" .. "#R/qqq|获取途径*野外或摊位购买*bz提示/丁香水" ..
			"#W回去治好 " .. "#R/qqq|婆婆*大唐国境*npc查询/婆婆" .. "#W的眼睛。 " }
		elseif 进度 == 38 then
			return { "玄奘的身世", "[主线剧情]替" .. "#R/qqq|殷温娇*大唐国境*npc查询/殷温娇" .. "#W找到了婆婆，可以回去江州衙门复命了。 " }
		elseif 进度 == 39 then
			return { "玄奘的身世", "[主线剧情]前往长安到殷丞相府请" .. "#R/qqq|殷丞相*丞相府*npc查询/殷丞相" .. "#W派出救兵！ " }
		elseif 进度 == 40 then
			return { "玄奘的身世", "[主线剧情]" .. "#R/qqq|殷夫人*丞相府*npc查询/殷夫人" .. "#W好像气坏了身体，快去丞相府内堂看看。 " }
		elseif 进度 == 41 then
			return { "玄奘的身世", "[主线剧情]快去找金香玉来救殷夫人！听说江南野外的" .. "#R/qqq|江湖奸商*江南野外*npc查询/江湖奸商" .. "#W那里有售。 " }
		elseif 进度 == 42 then
			return { "玄奘的身世", "[主线剧情]拿到金香玉，快给" .. "#R/qqq|殷夫人*丞相府*npc查询/殷夫人" .. "#W服用吧。 " }
		elseif 进度 == 43 then
			return { "玄奘的身世", "[主线剧情]拿着前往皇宫拜见皇上" .. "#R/qqq|李世民*金銮殿*npc查询/李世民" .. "#W请求出兵！ " }
		elseif 进度 == 44 then
			return { "玄奘的身世", "[主线剧情]去皇宫后花园找" .. "#R/qqq|赵美人*长安城*npc查询/赵美人" .. "#W问问。 " }
		elseif 进度 == 45 then
			return { "玄奘的身世", "[主线剧情]将奏折递交给" .. "#R/qqq|魏征*金銮殿*npc查询/魏征" .. "#W大人吧。 " }
		elseif 进度 == 46 then
			return { "玄奘的身世", "[主线剧情]终于请到救兵，快去大唐国境将恶贼" .. "#R/qqq|刘洪*江州衙门*npc查询/刘洪" .. "#W砍个片甲不留！ " }
		elseif 进度 == 47 then
			return { "玄奘的身世", "[主线剧情]快去大唐境外追捕真正的" .. "#R/qqq|刘洪*大唐境外*npc查询/刘洪" .. "#W和帮凶" ..
			"#R/qqq|李彪*大唐境外*npc查询/李彪" .. "#W！" }
		elseif 进度 == 48 then
			return { "玄奘的身世", "[主线剧情]恶人自有恶人磨，姑且看看" .. "#R/qqq|刘洪*大唐境外*npc查询/刘洪" .. "#W要怎么办！" }
		elseif 进度 == 49 then
			return { "玄奘的身世", "[主线剧情]擒下李彪，且看" .. "#R/qqq|刘洪*大唐境外*npc查询/刘洪" .. "#W还有何话要说！" }
		elseif 进度 == 50 then
			return { "玄奘的身世", "[主线剧情]将将州府大印交给" .. "#R/qqq|殷温娇*大唐国境*npc查询/殷温娇" .. "#W吧！" }
		elseif 进度 == 51 then
			return { "玄奘的身世", "[主线剧情]去金山寺吧玄奘母亲手抄的" ..
			"#R/qqq|获取途径*玄奘的身世*bz提示/般若多罗蜜心经" .. "#W交给 " .. "#R/qqq|玄奘*大雄宝殿*npc查询/玄奘" .. "#W法师吧。 " }
		end
	elseif 主线 == 4 then
		if 进度 == 1 then
			return { "沙僧剧情", "[主线剧情]在" .. "#R/qqq|天兵飞剑*大唐境外*npc查询/天兵飞剑" .. "#W处领取沙僧剧情任务。" }
		elseif 进度 == 2 then
			return { "大战心魔", "[主线剧情]搞定了天兵，看看" .. "#R/qqq|卷帘大将*大唐境外*npc查询/卷帘大将" .. "#W有什么苦衷。" }
		elseif 进度 == 3 then
			return { "大战心魔", "[主线剧情]一场激战后" .. "#R/qqq|卷帘大将*大唐境外*npc查询/卷帘大将" .. "#W身上散落一串念珠，大将的神色忽然大变，赶紧问问他怎么回事？" }
		elseif 进度 == 4 then
			return { "大战心魔", "[主线剧情]向长安城的" .. "#R/qqq|袁天罡*长安城*npc查询/袁天罡" .. "#W请教阵法之理。" }
		elseif 进度 == 5 then
			return { "大战心魔", "[主线剧情]找到散落的天衡星听说江南野外的" .. "#R/qqq|樵夫*江南野外*npc查询/樵夫" .. "#W知道其下落。" }
		elseif 进度 == 6 then
			return { "大战心魔", "[主线剧情]帮助袁守诚打败困扰他的" .. "#R/qqq|龙孙*长安城*npc查询/龙孙" .. "#W，然后询问天衡星的下落。" }
		elseif 进度 == 7 then
			return { "大战心魔", "[主线剧情]这条小龙好生凶悍，问问" .. "#R/qqq|袁守诚*长安城*npc查询/袁守诚" .. "#W究竟是怎么回事。" }
		elseif 进度 == 8 then
			return { "大战心魔", "[主线剧情]去龙宫找" .. "#R/qqq|小龙女*龙宫*npc查询/小龙女" .. "#W替袁守诚解释事情原由（可选战斗）" }
		elseif 进度 == 9 then
			return { "大战心魔", "[主线剧情]回长安找" .. "#R/qqq|袁守诚*长安城*npc查询/袁守诚" .. "#W要天衡星。" }
		elseif 进度 == 10 then
			return { "大战心魔", "[主线剧情]寻找散落的天英星，听说天宫的" .. "#R/qqq|水军统领*天宫*npc查询/水军统领" .. "#W知道其下落。" }
		elseif 进度 == 11 then
			return { "大战心魔", "[主线剧情]去地府" .. "#R/qqq|转轮王*森罗殿*npc查询/转轮王" .. "#W处打听一下。" }
		elseif 进度 == 12 then
			return { "大战心魔", "[主线剧情]难道天英也闯祸了？为何没被收去找天宫的托塔" .. "#R/qqq|李靖*凌霄宝殿*npc查询/李靖" .. "#W打听一下。" }
		elseif 进度 == 13 then
			return { "大战心魔", "[主线剧情]给" .. "#R/qqq|守门天兵*天宫*npc查询/守门天兵" .. "#W买壶好酒" .. "#R/qqq|获取途径*烹饪技巧*bz提示/醉生梦死" .. "#W。 " }
		elseif 进度 == 14 then
			return { "大战心魔", "[主线剧情]拿到了" ..
			"#R/qqq|获取途径*如果不慎遗失可到长安城“剧情道具NPC”（202，251）购买*bz提示/火尖枪" .. "#W可以回去天宫和" .. "#R/qqq|李靖*凌霄宝殿*npc查询/李靖" ..
			"#W交换天英了。 " }
		elseif 进度 == 15 then
			return { "大战心魔", "[主线剧情]天心妖犯了大错误将被处死，找负责看守的道童" .. "#R/qqq|清风*五庄观*npc查询/清风" .. "#W求下情。" }
		elseif 进度 == 16 then
			return { "大战心魔", "[主线剧情]救活人参树的方法，长寿村的" .. "#R/qqq|太白金星*长寿村*npc查询/太白金星" .. "#W应该知晓！" }
		elseif 进度 == 17 then
			return { "大战心魔", "[主线剧情]太白金星居然推卸给" .. "#R/qqq|太上老君*兜率宫*npc查询/太上老君" .. "#W，只好去问问了。" }
		elseif 进度 == 18 then
			return { "大战心魔", "[主线剧情]太上老君又推卸给普陀山的" .. "#R/qqq|青莲仙女*潮音洞*npc查询/青莲仙女" .. "#W？！继续跑路吧。" }
		elseif 进度 == 19 then
			return { "大战心魔", "[主线剧情]寻找" .. "#R/qqq|获取途径*野外或摊位购买*bz提示/火凤之睛" ..
			"#W交给" .. "#R/qqq|青莲仙女*潮音洞*npc查询/青莲仙女" .. "#W快去吧。" }
		elseif 进度 == 20 then
			return { "大战心魔", "[主线剧情]拿到仙露，回五庄观交给道童" .. "#R/qqq|清风*五庄观*npc查询/清风" .. "#W救治人参果树。" }
		elseif 进度 == 21 then
			return { "大战心魔", "[主线剧情]听说是长寿郊外的" ..
			"#R/qqq|路人甲*长寿郊外*npc查询/路人甲" .. "#W拿了" .. "#R/qqq|获取途径*如果不慎遗失可到长安城“剧情道具NPC”（202，251）购买*bz提示/金击子" .. "#W。（可选战斗））" }
		elseif 进度 == 22 then
			return { "大战心魔", "[主线剧情]拿回" ..
			"#R/qqq|获取途径*如果不慎遗失可到长安城“剧情道具NPC”（202，251）购买*bz提示/金击子" .. "#W回去交给五庄观的道童" .. "#R/qqq|清风*五庄观*npc查询/清风" ..
			"#W换取天心。" }
		elseif 进度 == 23 then
			return { "大战心魔", "[主线剧情]集齐三星，复原九宫，可以去大唐境外找" .. "#R/qqq|卷帘大将*大唐境外*npc查询/卷帘大将" .. "#W的心魔算账了。" }
		elseif 进度 == 24 then
			return { "大战心魔", "[主线剧情]打败心魔，劝服" .. "#R/qqq|卷帘大将*大唐境外*npc查询/卷帘大将" .. "#W成为天命取经人。" }
		end
	elseif 主线 == 5 then
		if 进度 == 1 then
			return { "含冤小白龙", "[主线剧情]在" .. "#R/qqq|大力神灵*天宫*npc查询/大力神灵" .. "#W处领取“含冤的小白龙”剧情任务。" }
		elseif 进度 == 2 then
			return { "含冤小白龙", "[主线剧情]白痴大力神灵的玄天铁鞭丢了，去长寿村找进来得到一条好鞭子的" .. "#R/qqq|毛驴张*长寿村*npc查询/毛驴张" .. "#W问问。" }
		elseif 进度 == 3 then
			return { "含冤小白龙", "[主线剧情]帮" .. "#R/qqq|毛驴张*长寿村*npc查询/毛驴张" .. "#W买来" .. "#R/qqq|获取途径*长安杂货店*bz提示/高级宠物口粮" .. "#W。" }
		elseif 进度 == 4 then
			return { "含冤小白龙", "[主线剧情]将" ..
			"#R/qqq|获取途径*如果不慎遗失可到长安城“剧情道具NPC”（202，251）购买*bz提示/玄天铁鞭" .. "#W交给天宫的" .. "#R/qqq|大力神灵*天宫*npc查询/大力神灵" .. "#W。" }
		elseif 进度 == 5 then
			return { "含冤小白龙", "[主线剧情]可怜的小白龙犯了死罪被关进天牢，去" .. "#R/qqq|天牢守卫*天宫*npc查询/天牢守卫" .. "#W疏通疏通看能不能探视下小白龙。" }
		elseif 进度 == 6 then
			return { "含冤小白龙", "[主线剧情]" .. "#R/qqq|小白龙*海底迷宫五层*npc查询/小白龙" .. "#W越狱了？料想他定是逃去了海底迷宫五层了。" }
		elseif 进度 == 7 then
			return { "含冤小白龙", "[主线剧情]把信物交给大雁塔顶层的" .. "#R/qqq|镇塔之神*大雁塔七层*npc查询/镇塔之神" .. "#W。" }
		elseif 进度 == 8 then
			return { "含冤小白龙", "[主线剧情]帮忙在塔内巡逻，搞定二楼的" .. "#R/qqq|梦之魅*大雁塔二层*npc查询/梦之魅" .. "#W。" }
		elseif 进度 == 9 then
			return { "含冤小白龙", "[主线剧情]帮忙在塔内巡逻，搞定四楼的" .. "#R/qqq|血之魅*大雁塔四层*npc查询/血之魅" .. "#W。" }
		elseif 进度 == 10 then
			return { "含冤小白龙", "[主线剧情]帮忙在塔内巡逻，搞定五楼的" .. "#R/qqq|森之魅*大雁塔五层*npc查询/森之魅" .. "#W。" }
		elseif 进度 == 11 then
			return { "含冤小白龙", "[主线剧情]回去找大雁塔顶层的" .. "#R/qqq|镇塔之神*大雁塔七层*npc查询/镇塔之神" .. "#W复命把。" }
		elseif 进度 == 12 then
			return { "含冤小白龙", "[主线剧情]赶走入侵大雁塔四层的" .. "#R/qqq|奔波儿灞*大雁塔四层*npc查询/奔波儿灞" .. "#W。" }
		elseif 进度 == 13 then
			return { "含冤小白龙", "[主线剧情]万圣公主竟做出这种事？！先带着" ..
			"#R/qqq|获取途径*如果不慎遗失可到长安城“剧情道具NPC”（202，251）购买*bz提示/白剑" .. "#W去找" .. "#R/qqq|蟹将军*龙宫*npc查询/蟹将军" .. "#W问个明白把" }
		elseif 进度 == 14 then
			return { "含冤小白龙", "[主线剧情]摆平了蟹将军，还有个" .. "#R/qqq|虾将军*龙宫*npc查询/虾将军" .. "#W做拦路虎！" }
		elseif 进度 == 15 then
			return { "含冤小白龙", "[主线剧情]摆平了虾兵蟹将后，终于可以去找" .. "#R/qqq|万圣公主*龙宫*npc查询/万圣公主" .. "#W了。" }
		elseif 进度 == 16 then
			return { "含冤小白龙", "[主线剧情]原来万圣公主受此冤屈，替他向天宫的" .. "#R/qqq|王母娘娘*凌霄宝殿*npc查询/王母娘娘" .. "#W索回龙须草。" }
		elseif 进度 == 17 then
			return { "含冤小白龙", "[主线剧情]夺回了" .. "#R/qqq|获取途径*野外或摊位购买*bz提示/龙须草" ..
			"#W可以交还给" .. "#R/qqq|万圣公主*龙宫*npc查询/万圣公主" .. "#W了。" }
		elseif 进度 == 18 then
			return { "含冤小白龙", "[主线剧情]没想到被万圣公主骗了羞愧之余，还是把龙须草还给" .. "#R/qqq|王母娘娘*凌霄宝殿*npc查询/王母娘娘" .. "#W。" }
		elseif 进度 == 19 then
			return { "含冤小白龙", "[主线剧情]了却万圣公主一事，是时候去魔王寨找元凶" .. "#R/qqq|九头精怪*魔王居*npc查询/九头精怪" .. "#W算账了。" }
		elseif 进度 == 20 then
			return { "含冤小白龙", "[主线剧情]打发掉牛魔王的亲兵，这下该轮到" .. "#R/qqq|九头精怪*魔王居*npc查询/九头精怪" .. "#W了。" }
		elseif 进度 == 21 then
			return { "含冤小白龙", "[主线剧情]九头精怪已经把镇塔之宝进贡给天庭了，赶紧找" .. "#R/qqq|玉皇大帝*凌霄宝殿*npc查询/玉皇大帝" .. "#W索要回来。" }
		elseif 进度 == 22 then
			return { "含冤小白龙", "[主线剧情]昏庸的玉帝就知道喊观音如来，还是亲自去普陀山找" .. "#R/qqq|青莲仙女*潮音洞*npc查询/青莲仙女" .. "#W问个明白。" }
		elseif 进度 == 23 then
			return { "含冤小白龙", "[主线剧情]拿着青莲仙女给予的餐风饮露，前往天宫跟" .. "#R/qqq|玉皇大帝*凌霄宝殿*npc查询/玉皇大帝" .. "#W问交换镇塔之宝吧。" }
		elseif 进度 == 24 then
			return { "含冤小白龙", "[主线剧情]拿到镇塔之宝，返回大雁塔七层交还给" .. "#R/qqq|镇塔之神*大雁塔七层*npc查询/镇塔之神" .. "#W。" }
		elseif 进度 == 25 then
			return { "含冤小白龙", "[主线剧情]将观音姐姐的信物碧水青龙带给小白龙，现在就去海底迷宫五层找" .. "#R/qqq|小白龙*海底迷宫五层*npc查询/小白龙" .. "#W吧。" }
		end
	elseif 主线 == 6 then
		if 进度 == 1 then
			return { "女娲神迹", "[冥冥之中的天意]待你强大以后去找" .. "#R/qqq|女娲神迹传送人*北俱芦洲*npc查询/女娲神迹传送人" .. "#W问一下身世之谜" }
		elseif 进度 == 2 then
			return { "女娲神迹", "[冥冥之中的天意]找" .. "#R/qqq|美猴王*水帘洞*npc查询/美猴王" .. "#W解开这个谜团" }
		elseif 进度 == 3 then
			return { "女娲神迹", "[冥冥之中的天意]帮助" .. "#R/qqq|美猴王*水帘洞*npc查询/美猴王" .. "#W找来一坛#R女儿红" }
		elseif 进度 == 4 then
			return { "女娲神迹", "[冥冥之中的天意]找" .. "#R/qqq|女娲神迹传送人*北俱芦洲*npc查询/女娲神迹传送人" .. "#W在问一下事情的始末" }
		elseif 进度 == 5 then
			return { "女娲神迹", "[冥冥之中的天意]找" .. "#R/qqq|小紫*圣殿*npc查询/小紫" .. "#W了解下这件事情" }
		elseif 进度 == 6 then
			return { "女娲神迹", "[冥冥之中的天意]将" .. "#R/qqq|小紫*圣殿*npc查询/小紫" .. "#W姑娘的情况告诉#R女娲神迹传送人" }
		elseif 进度 == 7 then
			return { "女娲神迹", "[冥冥之中的天意]找到" .. "#R/qqq|获取途径*中药医理制作的道具*bz提示/千年保心丹" .. "#W给#R/qqq|小紫*圣殿*npc查询/小紫#W服下" }
		elseif 进度 == 8 then
			return { "女娲神迹", "[冥冥之中的天意]将" .. "#R/qqq|小紫*圣殿*npc查询/小紫" .. "#W说的话告诉#R/qqq|美猴王*水帘洞*npc查询/美猴王" }
		elseif 进度 == 9 then
			return { "女娲神迹", "[冥冥之中的天意]去盘丝岭打探下" .. "#R/qqq|春十三娘*盘丝洞*npc查询/春十三娘" .. "#W的底细" }
		elseif 进度 == 10 then
			return { "女娲神迹", "[冥冥之中的天意]告诉" .. "#R/qqq|小紫*圣殿*npc查询/小紫" .. "#W敌人的情况" }
		end
	elseif 主线 == 7 then
		if 进度 == 1 then
			return { "八戒悟空", "[主线剧情]" .. "#R/qqq|月香侍女*月宫*npc查询/月香侍女" .. "#W处领取“八戒悟空”剧情任务。" }
		elseif 进度 == 2 then
			return { "八戒悟空", "[主线剧情]" .. "#R/qqq|康太尉*月宫*npc查询/康太尉" .. "#W这家伙竟来打扰嫦娥仙子清修，快打发他走！" }
		elseif 进度 == 3 then
			return { "八戒悟空", "[主线剧情]打跑前来捣乱的康太尉，问问" .. "#R/qqq|月香侍女*月宫*npc查询/月香侍女" .. "#W究竟是为何事。" }
		elseif 进度 == 4 then
			return { "八戒悟空", "[主线剧情]月香姑娘似乎难于开口，还是去问问" .. "#R/qqq|嫦娥*广寒宫*npc查询/嫦娥" .. "#W仙子吧。" }
		elseif 进度 == 5 then
			return { "八戒悟空", "[主线剧情]原来如此，但听说他在凡间也惹了不少感情债，去找" .. "#R/qqq|卵二姐*江南野外*npc查询/卵二姐" .. "#W问问。" }
		elseif 进度 == 6 then
			return { "八戒悟空", "[主线剧情]听说" .. "#R/qqq|罗纤纤*江南野外*npc查询/罗纤纤" .. "#W头上带的桃花特别娇艳，前去问问。" }
		elseif 进度 == 7 then
			return { "八戒悟空", "[主线剧情]帮罗纤纤探探长安国子监内" .. "#R/qqq|吴举人*国子监书库*npc查询/吴举人" .. "#W的心意。" }
		elseif 进度 == 8 then
			return { "八戒悟空", "[主线剧情]帮吴举人送花给" .. "#R/qqq|罗纤纤*江南野外*npc查询/罗纤纤" .. "#W。" }
		elseif 进度 == 9 then
			return { "八戒悟空", "[主线剧情]撮合一对新人后，将" .. self:剧情物品("桃花", "长安城杂货店") .. "#W拿去给" .. self:剧情npc("卵二姐", 1193) ..
			"#W。" }
		elseif 进度 == 10 then
			return { "八戒悟空", "[主线剧情]就帮卵二姐将" .. self:剧情物品("桃花", "长安城杂货店") .. "#W还给" .. self:剧情npc("天蓬元帅", 1173) .. "#W。" }
		elseif 进度 == 11 then
			return { "八戒悟空", "[主线剧情]无奈还是帮天蓬元帅去高家庄找" .. self:剧情npc("高翠兰", 1171) .. "#W小姐退婚吧。" }
		elseif 进度 == 12 then
			return { "八戒悟空", "[主线剧情]打退了高家抢亲的队伍，回去向" .. self:剧情npc("天蓬元帅", 1173) .. "#W交差。" }
		elseif 进度 == 13 then
			return { "八戒悟空", "[主线剧情]得向境外的" .. self:剧情npc("土地公公", 1173) .. "#W打听盘丝岭的所在。" }
		elseif 进度 == 14 then
			return { "八戒悟空", "[主线剧情]付给土地咨询费。" }
		elseif 进度 == 15 then
			return { "八戒悟空", "[主线剧情]帮土地打退捣乱的大唐境外的" .. self:剧情npc("冤魂", 1173) .. "#W。" }
		elseif 进度 == 16 then
			return { "八戒悟空", "[主线剧情]回去向" .. self:剧情npc("土地公公", 1173) .. "#W打听情魔蛛丝之毒的秘密。" }
		elseif 进度 == 17 then
			return { "八戒悟空", "[主线剧情]先去找" .. self:剧情npc("天蓬元帅", 1173) .. "#W解除他和卵二姐之间的”疚“之情。" }
		elseif 进度 == 18 then
			return { "八戒悟空", "[主线剧情]代替天蓬送" .. self:剧情物品("桃花", "长安城杂货店") .. "#W给" .. self:剧情npc("卵二姐", 1193) ..
			"#W请求她的原谅。" }
		elseif 进度 == 19 then
			return { "八戒悟空", "[主线剧情]卵二姐原谅了天蓬，回去向" .. self:剧情npc("天蓬元帅", 1173) .. "#W说明。" }
		elseif 进度 == 20 then
			return { "八戒悟空", "[主线剧情]前往高老庄找" .. self:剧情npc("高翠兰", 1171) .. "#W小姐，解除天蓬元帅的”怖“之情。" }
		elseif 进度 == 21 then
			return { "八戒悟空", "[主线剧情]高翠兰小姐净是胡，还是找她爹爹" .. self:剧情npc("高老先生", 1170) .. "#W说个明白吧。" }
		elseif 进度 == 22 then
			return { "八戒悟空", "[主线剧情]快去长安找" .. self:剧情npc("红线童子", 1001) .. "#W问问。" }
		elseif 进度 == 23 then
			return { "八戒悟空", "[主线剧情]这红线童子好生胡闹去找" .. self:剧情npc("绿儿", 1142) .. "#W要回木偶。" }
		elseif 进度 == 24 then
			return { "八戒悟空", "[主线剧情]终于换回张小二的木偶了，快拿去给" .. self:剧情npc("红线童子", 1001) .. "#W吧。" }
		elseif 进度 == 25 then
			return { "八戒悟空", "[主线剧情]终于牵对了红线，回高家庄看看" .. self:剧情npc("高翠兰", 1171) .. "#W小姐现在怎样。" }
		elseif 进度 == 26 then
			return { "八戒悟空", "[主线剧情]高小姐已不在迷恋天蓬元帅，拿回" ..
			self:剧情物品("婚书", "如果不慎遗失可到长安城“剧情道具NPC”（202，251）购买") .. "给" .. self:剧情npc("天蓬元帅", 1173) .. "#W化解这”怖“之情吧。" }
		elseif 进度 == 27 then
			return { "八戒悟空", "[主线剧情]上月宫广寒宫内找" .. self:剧情npc("嫦娥", 1531) .. "#W仙子，解除“嗔”之情。" }
		elseif 进度 == 28 then
			return { "八戒悟空", "[主线剧情]前往天宫找可恶的" .. self:剧情npc("杨戬", 1112) .. "#W讨回两人定情之物绿烟如梦。" }
		elseif 进度 == 29 then
			return { "八戒悟空", "[主线剧情]去长寿村的" .. self:剧情npc("慧觉和尚", 1070) .. "#W那里打探下绿烟如梦的情况。" }
		elseif 进度 == 30 then
			return { "八戒悟空", "[主线剧情]" ..
			self:剧情物品("绿烟如梦", "如果不慎遗失可到长安城“剧情道具NPC”（202，251）购买") .. "#W破碎了。拿回广寒宫给" .. self:剧情npc("嫦娥", 1531) ..
			"#W仙子想想办法吧。" }
		elseif 进度 == 31 then
			return { "八戒悟空", "[主线剧情]嫦娥仙子的一滴泪让" ..
			self:剧情物品("绿烟如梦", "如果不慎遗失可到长安城“剧情道具NPC”（202，251）购买") .. "#W恢复原状，快拿回给" .. self:剧情npc("天蓬元帅", 1173) ..
			"#W恢复记忆吧。" }
		elseif 进度 == 32 then
			return { "八戒悟空", "[主线剧情]最后是找花十娘解除四情之“爱”盘丝岭的位置？还是得问问境外的" .. self:剧情npc("土地公公", 1173) .. "#W。" }
		elseif 进度 == 33 then
			return { "八戒悟空", "[主线剧情]原来盘丝岭内讧了，快劝盘丝洞内的" .. self:剧情npc("白晶晶", 1144) .. "#W不要冲动犯事。" }
		elseif 进度 == 34 then
			return { "八戒悟空", "[主线剧情]据说山寨的大帮主知晓孙悟空的下路，去境外找" .. self:剧情npc("至尊宝", 1173) .. "#W问个明白。" }
		elseif 进度 == 35 then
			return { "八戒悟空", "[主线剧情]大帮主疯疯癫癫，去大唐境外找真正的" .. self:剧情npc("二帮主", 1173) .. "#W问个明白。" }
		elseif 进度 == 36 then
			return { "八戒悟空", "[主线剧情]去北俱芦洲寻找蛇蝎美人，听说北俱芦洲的" .. self:剧情npc("江湖奸商", 1174) .. "#W那儿有。" }
		elseif 进度 == 37 then
			return { "八戒悟空", "[主线剧情]去北俱芦洲凤巢的" .. self:剧情npc("辛发明", 1186) .. "#W那里寻找红雪散。" }
		elseif 进度 == 38 then
			return { "八戒悟空", "[主线剧情]去北俱芦洲龙窟的" .. self:剧情npc("龙神", 1178) .. "#W那里寻找五龙丹。" }
		elseif 进度 == 39 then
			return { "八戒悟空", "[主线剧情]集齐了三种药材，将蛇蝎美人交给" .. self:剧情npc("至尊宝", 1173) .. "#W吧。" }
		elseif 进度 == 40 then
			return { "八戒悟空", "[主线剧情]集齐了三种药材，将红雪散交给" .. self:剧情npc("至尊宝", 1173) .. "#W吧。" }
		elseif 进度 == 41 then
			return { "八戒悟空", "[主线剧情]集齐了三种药材，将五龙丹交给" .. self:剧情npc("至尊宝", 1173) .. "#W吧。" }
		elseif 进度 == 42 then
			return { "八戒悟空", "[主线剧情]拿着孙悟空的信物" ..
			self:剧情物品("玉佩", "如果不慎遗失可到长安城“剧情道具NPC”（202，251）购买") .. "#W回去盘丝洞交给" .. self:剧情npc("白晶晶", 1144) .. "#W。" }
		elseif 进度 == 43 then
			return { "八戒悟空", "[主线剧情]晶晶姑娘杀去盘丝洞了，快去找境外的" .. self:剧情npc("土地公公", 1173) .. "#W阻止她。" }
		elseif 进度 == 44 then
			return { "八戒悟空", "[主线剧情]现在四情终于破解，可以回去境外" .. self:剧情npc("天蓬元帅", 1173) .. "#W那解开他的心结了。" }
		elseif 进度 == 45 then
			return { "八戒悟空", "[主线剧情]天蓬元帅已经大彻大悟，现在去境外告诉" .. self:剧情npc("至尊宝", 1173) .. "#W晶晶已经死这个消息吧。" }
		elseif 进度 == 46 then
			return { "八戒悟空", "[主线剧情]去普陀山潮音洞找" .. self:剧情npc("观音姐姐", 1141) .. "#W借灵光宝匣一用看看过去到底发生了什么事。" }
		elseif 进度 == 47 then
			return { "八戒悟空", "[主线剧情]灵光宝匣借不成。先听观音姐姐的话，回境外找" .. self:剧情npc("至尊宝", 1173) .. "#W。" }
		elseif 进度 == 48 then
			return { "八戒悟空", "[主线剧情]到地府找" .. self:剧情npc("地藏王", 1124) .. "#W帮忙。" }
		elseif 进度 == 49 then
			return { "八戒悟空", "[主线剧情]到地府迷宫二层找看守" .. self:剧情npc("吊死鬼", 1128) .. "#W求他把晶晶魂魄带来吧。" }
		elseif 进度 == 50 then
			return { "八戒悟空", "[主线剧情]摆平了这啰嗦的看守，终于可以去地府四层找" .. self:剧情npc("晶晶姑娘的鬼魂", 1130) .. "#W了。" }
		elseif 进度 == 51 then
			return { "八戒悟空", "[主线剧情]晶晶姑娘的鬼魂犹有怨气未消，帮她去普陀山潮音洞内找" .. self:剧情npc("观音姐姐", 1141) .. "#W问清事实。" }
		elseif 进度 == 52 then
			return { "八戒悟空", "[主线剧情]只得去北俱芦洲的凤巢七层找叫" .. self:剧情npc("无心", 1192) .. "#W的和尚了。" }
		elseif 进度 == 53 then
			return { "八戒悟空", "[主线剧情]只得去北俱芦洲的龙窟七层找" .. self:剧情npc("青灵玄女", 1183) .. "#W要回定海珠。" }
		elseif 进度 == 54 then
			return { "八戒悟空", "[主线剧情]回去凤巢七层将" ..
			self:剧情物品("定海珠", "如果不慎遗失可到长安城“剧情道具NPC”（202，251）购买") .. "#W交给" .. self:剧情npc("无心", 1192) .. "#W和尚。" }
		elseif 进度 == 55 then
			return { "八戒悟空", "[主线剧情]了解孙悟空和云霓的恩怨情仇，回去普陀山潮音洞拜见" .. self:剧情npc("观音姐姐", 1141) .. "#W。" }
		elseif 进度 == 56 then
			return { "八戒悟空", "[主线剧情]拿着观音姐姐赐予的金箍回去境外交给" .. self:剧情npc("至尊宝", 1173) .. "#W点化孙悟空。" }
		elseif 进度 == 57 then
			return { "八戒悟空", "[主线剧情]把孙悟空和云霓的爱恋之心带去地府四层给" .. self:剧情npc("晶晶姑娘的鬼魂", 1130) .. "#W看。" }
		elseif 进度 == 58 then
			return { "八戒悟空", "[主线剧情]回去境外告知" .. self:剧情npc("至尊宝", 1173) .. "#W晶晶姑娘已大彻大悟。" }
		end
	
	
	elseif 主线 == 8 then
		if 进度 == 1 then
			return { "飞升剧情", "[步入化境]待你强大以后去找" .. "#R/qqq|吴刚*月宫*npc查询/吴刚" .. "#W了解如何飞升" }
		elseif 进度 == 2 then
			return { "飞升剧情", "[步入化境]" .. self:剧情npc("法明长老", 1528) .. "#W将会指导你如何进入化境。" }
		elseif 进度 == 3 then
			return { "飞升剧情", "[步入化境]去" .. self:剧情npc("太上老君", 1113) .. "#W那了解关于化境的方法。" }
		elseif 进度 == 4 then
			return { "飞升剧情", "[步入化境]帮" .. self:剧情npc("太上老君", 1113) .. "#W找古代瑞兽、凤凰来做药引。" }
		elseif 进度 == 5 then
			return { "飞升剧情", "[步入化境]帮" .. self:剧情npc("太上老君", 1113) .. "#W找凤凰来做药引。" }
		elseif 进度 == 6 then
			return { "飞升剧情", "[步入化境]去" .. self:剧情npc("玉皇大帝", 1112) .. "#W那获得仙界试炼的资格。" }
		elseif 进度 == 7 then
			return { "飞升剧情", "[步入化境]去向" .. self:剧情npc("李靖", 1112) .. "#W求取一本避火诀。" }
		elseif 进度 == 8 then
			return { "飞升剧情", "[步入化境]向" .. self:剧情npc("齐天大圣", 1251) .. "#W借来紫金冠。" }
		elseif 进度 == 9 then
			return { "飞升剧情", "[步入化境]找" .. self:剧情npc("崩将军", 1251) .. "#W取出紫金冠。" }
		elseif 进度 == 10 then
			return { "飞升剧情", "[步入化境]向" .. self:剧情npc("东海龙王", 1117) .. "#W求取镇海针。" }
		elseif 进度 == 11 then
			return { "飞升剧情", "[步入化境]去给" .. self:剧情npc("东海龙王", 1117) .. "#W找来玉龙镇海。" }
		elseif 进度 == 12 then
			return { "飞升剧情", "[步入化境]向" .. self:剧情npc("二郎神", 1150) .. "#W求取一本开山钺。" }
		elseif 进度 == 13 then
			return { "飞升剧情", "[步入化境]找" .. self:剧情npc("哪吒", 1112) .. "#W要回开山钺。" }
		elseif 进度 == 14 then
			return { "飞升剧情", "[步入化境]去向" .. self:剧情npc("镇元子", 1147) .. "#W求取炼金鼎。" }
		elseif 进度 == 15 then
			return { "飞升剧情", "[步入化境]找到五龙丹和佛光舍利子给" .. self:剧情npc("镇元子", 1147) .. "#W。" }
		elseif 进度 == 16 then
			return { "飞升剧情", "[步入化境]找到佛光舍利子给" .. self:剧情npc("镇元子", 1147) .. "#W。" }
		elseif 进度 == 17 then
			return { "飞升剧情", "[步入化境]去向" .. self:剧情npc("观音姐姐", 1141) .. "#W借把修篁斧。" }
		elseif 进度 == 18 then
			return { "飞升剧情", "[步入化境]在潮音洞外四处看看。" }
		elseif 进度 == 19 then
			return { "飞升剧情", "[步入化境]去" .. self:剧情npc("玉皇大帝", 1112) .. "#W那获得仙界的试炼资格。" }
		elseif 进度 == 20 then
			return { "飞升剧情", "[步入化境]把紫金冠给" .. self:剧情npc("玉皇大帝", 1112) .. "#W。" }
		elseif 进度 == 21 then
			return { "飞升剧情", "[步入化境]把镇海针给" .. self:剧情npc("玉皇大帝", 1112) .. "#W。" }
		elseif 进度 == 22 then
			return { "飞升剧情", "[步入化境]把开山钺给" .. self:剧情npc("玉皇大帝", 1112) .. "#W。" }
		elseif 进度 == 23 then
			return { "飞升剧情", "[步入化境]把炼金鼎给" .. self:剧情npc("玉皇大帝", 1112) .. "#W。" }
		elseif 进度 == 24 then
			return { "飞升剧情", "[步入化境]把修篁斧给" .. self:剧情npc("玉皇大帝", 1112) .. "#W。" }
		elseif 进度 == 25 then
			return { "飞升剧情", "[步入化境]去找" .. self:剧情npc("李世民", 1044) .. "#W谈谈。" }
		elseif 进度 == 26 then
			return { "飞升剧情", "[步入化境]获得大唐官府的推荐" }
		elseif 进度 == 27 then
			return { "飞升剧情", "[步入化境]取大唐国境四处看看有没有山贼在捣乱" }
		elseif 进度 == 28 then
			return { "飞升剧情", "[步入化境]回去找" .. self:剧情npc("程咬金", 1054) .. "#W复命。" }
		elseif 进度 == 29 then
			return { "飞升剧情", "[步入化境]获得化生寺的推荐" }
		elseif 进度 == 30 then
			return { "飞升剧情", "[步入化境]去傲来国救助三名被瘟疫感染的人们，还有3名没被救助" }
		elseif 进度 == 31 then
			return { "飞升剧情", "[步入化境]去傲来国救助三名被瘟疫感染的人们，还有2名没被救助" }
		elseif 进度 == 32 then
			return { "飞升剧情", "[步入化境]去傲来国救助三名被瘟疫感染的人们，还有1名没被救助" }
		elseif 进度 == 33 then
			return { "飞升剧情", "[步入化境]获得神木林的推荐" }
		elseif 进度 == 34 then
			return { "飞升剧情", "[步入化境]获得女儿村的推荐" }
		elseif 进度 == 35 then
			return { "飞升剧情", "[步入化境]孙婆婆的口信带给长寿村的海老先生" }
		elseif 进度 == 36 then
			return { "飞升剧情", "[步入化境]孙婆婆的口信带给长安城的二宝" }
		elseif 进度 == 37 then
			return { "飞升剧情", "[步入化境]孙婆婆的口信带给建邺城的吹牛王" }
		elseif 进度 == 38 then
			return { "飞升剧情", "[步入化境]孙婆婆的口信带给傲来国的九头精怪" }
		elseif 进度 == 39 then
			return { "飞升剧情", "[步入化境]回去向" .. self:剧情npc("孙婆婆", 1143) .. "#W复命。" }
		elseif 进度 == 40 then
			return { "飞升剧情", "[步入化境]已经获得各派推荐，该回去见见" .. self:剧情npc("李世民", 1044) .. "#W了。" }
		elseif 进度 == 41 then
			return { "飞升剧情", "[步入化境]去方寸山学习修心封魔之法" }
		elseif 进度 == 42 then
			return { "飞升剧情", "[步入化境]去找" .. self:剧情npc("地藏王", 1124) .. "#W谈谈。" }
		elseif 进度 == 43 then
			return { "飞升剧情", "[步入化境]征求" .. self:剧情npc("地涌夫人", 1156) .. "#W的同意去取不死壤。" }
		elseif 进度 == 44 then
			return { "飞升剧情", "[步入化境]为" .. self:剧情npc("地涌夫人", 1156) .. "#W找一个蜡烛。" }
		elseif 进度 == 45 then
			return { "飞升剧情", "[步入化境]征求" .. self:剧情npc("大大王", 1134) .. "#W的同意去取不死壤。" }
		elseif 进度 == 46 then
			return { "飞升剧情", "[步入化境]给" .. self:剧情npc("大大王", 1134) .. "#W找一只古代瑞兽和凤凰。" }
		elseif 进度 == 47 then
			return { "飞升剧情", "[步入化境]给" .. self:剧情npc("大大王", 1134) .. "#W找一只凤凰。" }
		elseif 进度 == 48 then
			return { "飞升剧情", "[步入化境]征求" .. self:剧情npc("牛魔王", 1145) .. "#W的同意去取不死壤。" }
		elseif 进度 == 49 then
			return { "飞升剧情", "[步入化境]征求" .. self:剧情npc("春十三娘", 1144) .. "#W的同意去取不死壤。" }
		elseif 进度 == 50 then
			return { "飞升剧情", "[步入化境]找一把回龙镊魂镖给" .. self:剧情npc("春十三娘", 1144) .. "#W。" }
		elseif 进度 == 51 then
			return { "飞升剧情", "[步入化境]学会各家之法回去找" .. self:剧情npc("地藏王", 1124) .. "#W。" }
		elseif 进度 == 52 then
			return { "飞升剧情", "[步入化境]无名鬼城找不死壤" }
		elseif 进度 == 53 then
			return { "飞升剧情", "[步入化境]法宝备齐，你可以去找" .. self:剧情npc("玉皇大帝", 1112) .. "#W了。" }
		elseif 进度 == 54 then
			return { "飞升剧情", "[步入化境]请回去找" .. self:剧情npc("吴刚", 1114) .. "#W入于化境。" }
		end
	elseif 主线 == 9 then
		if 进度 == 1 then
			return {"渡劫剧情","[渡劫重生]请回去找"..self:剧情npc("王母娘娘",1112).."#W入于化境。"}
		elseif 进度 == 2 then
			return {"渡劫剧情","[渡劫重生]去找"..self:剧情npc("玉皇大帝",1112).."#W开始生死劫1。"}
		elseif 进度 == 3 then
			return {"渡劫剧情","[渡劫重生]去找"..self:剧情npc("玉皇大帝",1112).."#W开始生死劫2。"}
		elseif 进度 == 4 then
			return {"渡劫剧情","[渡劫重生]去找"..self:剧情npc("玉皇大帝",1112).."#W开始生死劫3。"}
		elseif 进度 == 5 then
			return {"渡劫剧情","[渡劫重生]去找"..self:剧情npc("玉皇大帝",1112).."#W开始生死劫4。"}
		elseif 进度 == 6 then
			return {"渡劫剧情","[渡劫重生]去找"..self:剧情npc("玉皇大帝",1112).."#W开始生死劫5。"}
		elseif 进度 == 7 then
			return {"渡劫剧情","[渡劫重生]去找"..self:剧情npc("玉皇大帝",1112).."#W开始生死劫6。"}
		elseif 进度 == 8 then
			return {"渡劫剧情","[渡劫重生]去找"..self:剧情npc("玉皇大帝",1112).."#W开始生死劫7。"}
		elseif 进度 == 9 then
			return {"渡劫剧情","[渡劫重生]去找"..self:剧情npc("玉皇大帝",1112).."#W开始生死劫8。"}
		elseif 进度 == 10 then
			return {"渡劫剧情","[渡劫重生]去找"..self:剧情npc("玉皇大帝",1112).."#W开始生死劫9。"}
		elseif 进度 == 11 then
			return {"渡劫剧情","[渡劫重生]去找"..self:剧情npc("玉皇大帝",1112).."#W完成渡劫。"}
		end
	elseif 主线 == 10 then
		if 进度 == 1 then
			return {"化圣剧情","[轮回劫境]暂未开放"}
		elseif 进度 == 2 then
			return {"渡劫剧情","[轮回劫境]去找"..self:剧情npc("玉皇大帝",1112).."#W开始生死劫1。"}
		elseif 进度 == 3 then
			return {"渡劫剧情","[轮回劫境]去找"..self:剧情npc("玉皇大帝",1112).."#W开始生死劫2。"}
		elseif 进度 == 4 then
			return {"渡劫剧情","[轮回劫境]去找"..self:剧情npc("玉皇大帝",1112).."#W开始生死劫3。"}
		elseif 进度 == 5 then
			return {"渡劫剧情","[轮回劫境]去找"..self:剧情npc("玉皇大帝",1112).."#W开始生死劫4。"}
		elseif 进度 == 6 then
			return {"渡劫剧情","[轮回劫境]去找"..self:剧情npc("玉皇大帝",1112).."#W开始生死劫5。"}
		elseif 进度 == 7 then
			return {"渡劫剧情","[轮回劫境]去找"..self:剧情npc("玉皇大帝",1112).."#W开始生死劫6。"}
		elseif 进度 == 8 then
			return {"渡劫剧情","[轮回劫境]去找"..self:剧情npc("玉皇大帝",1112).."#W开始生死劫7。"}
		elseif 进度 == 9 then
			return {"渡劫剧情","[轮回劫境]去找"..self:剧情npc("玉皇大帝",1112).."#W开始生死劫8。"}
		elseif 进度 == 10 then
			return {"渡劫剧情","[轮回劫境]去找"..self:剧情npc("玉皇大帝",1112).."#W开始生死劫9。"}
		elseif 进度 == 11 then
			return {"渡劫剧情","[轮回劫境]去找"..self:剧情npc("玉皇大帝",1112).."#W完成渡劫。"}
		end
	elseif 主线 == 32 then
		if 进度 == 1 then
			return { "三界劫难", "[天命之战]化圣后找" .. "#R/qqq|玉皇大帝*凌霄宝殿*npc查询/玉皇大帝" .. "#W询问封印魔神蚩尤的方法" }
		end
	end
end

function 主控:剧情物品(物品, 详情)
	return "#Rqqq|获取途径*" .. 详情 .. "*bz提示/" .. 物品
end

function 主控:剧情npc(npc, id)
	return "#Rqqq|" .. npc .. "*" .. 取地图名称(id) .. "*npc查询/" .. npc
end

function 主控:取活动描述(类型, 进度)
	if 类型 == 1 then
		if 进度 == 1 then
			return { "国庆活动", "[军阵展威]找#R长安城#W的#R西门御林军#W战胜他" }
		elseif 进度 == 2 then
			return { "国庆活动", "[军阵展威]找#R长安城#W的#R东门御林军#W战胜他" }
		end
	elseif 类型 == 2 then
		if 进度 == 1 then
			return { "中秋活动", "[追寻月光]找#R西凉女国#W的#R流光玉兔#W战胜他" }
		elseif 进度 == 2 then
			return { "中秋活动", "[追寻月光]找#R西凉女国#W的#R流光泡泡#W战胜他" }
		elseif 进度 == 3 then
			return { "中秋活动", "[追寻月光]找#R西凉女国#W的#R流光玉镜#W战胜他" }
		elseif 进度 == 4 then
			return { "中秋活动", "[追寻月光]找#R朱紫国#W的#R流光巡游#W战胜他" }
		elseif 进度 == 5 then
			return { "中秋活动", "[追寻月光]找#R朱紫国#W的#R流光灵魅#W战胜他" }
		elseif 进度 == 6 then
			return { "中秋活动", "[追寻月光]找#R朱紫国#W的#R流光仙卫#W战胜他" }
		elseif 进度 == 7 then
			return { "中秋活动", "[追寻月光]找#R朱紫国#W的#R流光仙师#W战胜他" }
		elseif 进度 == 8 then
			return { "中秋活动", "[追寻月光]找#R长寿郊外#W的#R流光逆光#W战胜他" }
		elseif 进度 == 9 then
			return { "中秋活动", "[追寻月光]找#R长寿郊外#W的#R流光月灵#W战胜他" }
		elseif 进度 == 10 then
			return { "中秋活动", "[追寻月光]找#R长寿郊外#W的#R流光灵珠#W战胜他" }
		elseif 进度 == 11 then
			return { "中秋活动", "[追寻月光]找#R天宫#W的#R流光月影#W战胜他" }
		elseif 进度 == 12 then
			return { "中秋活动", "[追寻月光]找#R天宫#W的#R流光右卫#W战胜他" }
		elseif 进度 == 13 then
			return { "中秋活动", "[追寻月光]找#R天宫#W的#R流光仙匪#W战胜他" }
		elseif 进度 == 14 then
			return { "中秋活动", "[追寻月光]找#R天宫#W的#R流光仙王#W战胜他" }
		elseif 进度 == 15 then
			return { "中秋活动", "[追寻月光]找#R月宫#W的#R幽萤娃娃#W战胜他" }
		elseif 进度 == 16 then
			return { "中秋活动", "[追寻月光]找#R月宫#W的#R踏云兽#W战胜他" }
		elseif 进度 == 17 then
			return { "中秋活动", "[追寻月光]找#R月宫#W的#R鼠先锋#W战胜他" }
		end
	end
	return
end

function 主控:取地图师傅(ID)
	local 师门 = nil
	if ID == 1043 then
		师门 = "空度禅师"
	elseif ID == 1054 then
		师门 = "程咬金"
	elseif ID == 1117 then
		师门 = "东海龙王"
	elseif ID == 1137 then
		师门 = "菩提祖师"
	elseif ID == 1124 then
		师门 = "地藏王"
	elseif ID == 1112 then
		师门 = "李靖"
	elseif ID == 1145 then
		师门 = "牛魔王"
	elseif ID == 1141 then
		师门 = "观音姐姐"
	elseif ID == 1147 then
		师门 = "镇元子"
	elseif ID == 1134 then
		师门 = "大大王"
	elseif ID == 1144 then
		师门 = "白晶晶"
	elseif ID == 1150 then
		师门 = "二郎神"
	elseif ID == 1154 then
		师门 = "巫奎虎"
	elseif ID == 1156 then
		师门 = "地涌夫人"
	elseif ID == 1143 then
		师门 = "孙婆婆"
	elseif ID == 1580 then
		师门 = "刑天"	
	end
	return 师门
end

function 主控:队伍角色(模型)
	local 角色信息 = {
		飞燕女 = { 模型 = "飞燕女", ID = 1, 染色方案 = 3, 性别 = "女", 种族 = "人", 传送门派 = { "大唐官府", "女儿村", "方寸山", "神木林" }, 门派 = { "dtgf", "nec", "fcs", "sml" }, 门派师傅 = { "程咬金", "孙婆婆", "菩提祖师", "巫奎虎" }, 门派模型 = { "男人_程咬金", "孙婆婆", "菩提老祖", "巫奎虎" }, 武器 = { "双剑", "环圈" } },
		英女侠 = { 模型 = "英女侠", ID = 2, 染色方案 = 4, 性别 = "女", 种族 = "人", 传送门派 = { "大唐官府", "女儿村", "方寸山", "神木林" }, 门派 = { "dtgf", "nec", "fcs", "sml" }, 门派师傅 = { "程咬金", "孙婆婆", "菩提祖师", "巫奎虎" }, 门派模型 = { "男人_程咬金", "孙婆婆", "菩提老祖", "巫奎虎" }, 武器 = { "双剑", "鞭" } },
		巫蛮儿 = { 模型 = "巫蛮儿", ID = 3, 染色方案 = 1, 性别 = "女", 种族 = "人", 传送门派 = { "大唐官府", "女儿村", "方寸山", "神木林" }, 门派 = { "dtgf", "nec", "fcs", "sml" }, 门派师傅 = { "程咬金", "孙婆婆", "菩提祖师", "巫奎虎" }, 门派模型 = { "男人_程咬金", "孙婆婆", "菩提老祖", "巫奎虎" }, 武器 = { "宝珠", "法杖" } },
		逍遥生 = { 模型 = "逍遥生", ID = 4, 染色方案 = 1, 性别 = "男", 种族 = "人", 传送门派 = { "大唐官府", "化生寺", "方寸山", "神木林" }, 门派 = { "dtgf", "hss", "fcs", "sml" }, 门派师傅 = { "程咬金", "空度禅师", "菩提祖师", "巫奎虎" }, 门派模型 = { "男人_程咬金", "男人_老和尚", "菩提老祖", "巫奎虎" }, 武器 = { "扇", "剑" } },
		剑侠客 = { 模型 = "剑侠客", ID = 5, 染色方案 = 2, 性别 = "男", 种族 = "人", 传送门派 = { "大唐官府", "化生寺", "方寸山", "神木林" }, 门派 = { "dtgf", "hss", "fcs", "sml" }, 门派师傅 = { "程咬金", "空度禅师", "菩提祖师", "巫奎虎" }, 门派模型 = { "男人_程咬金", "男人_老和尚", "菩提老祖", "巫奎虎" }, 武器 = { "刀", "剑" } },
		狐美人 = { 模型 = "狐美人", ID = 6, 染色方案 = 7, 性别 = "女", 种族 = "魔", 传送门派 = { "盘丝洞", "阴曹地府", "魔王寨", "无底洞" }, 门派 = { "psd", "ycdf", "mwz", "wdd" }, 门派师傅 = { "白晶晶", "地藏王", "牛魔王", "地涌夫人" }, 门派模型 = { "白晶晶", "地藏王", "牛魔王", "地涌夫人" }, 武器 = { "爪刺", "鞭" } },
		骨精灵 = { 模型 = "骨精灵", ID = 7, 染色方案 = 8, 性别 = "女", 种族 = "魔", 传送门派 = { "盘丝洞", "阴曹地府", "魔王寨", "无底洞" }, 门派 = { "psd", "ycdf", "mwz", "wdd" }, 门派师傅 = { "白晶晶", "地藏王", "牛魔王", "地涌夫人" }, 门派模型 = { "白晶晶", "地藏王", "牛魔王", "地涌夫人" }, 武器 = { "魔棒", "爪刺" } },
		杀破狼 = { 模型 = "杀破狼", ID = 8, 染色方案 = 1, 性别 = "男", 种族 = "魔", 传送门派 = { "狮驼岭", "阴曹地府", "魔王寨", "无底洞" }, 门派 = { "stl", "ycdf", "mwz", "wdd" }, 门派师傅 = { "大大王", "地藏王", "牛魔王", "地涌夫人" }, 门派模型 = { "大大王", "地藏王", "牛魔王", "地涌夫人" }, 武器 = { "宝珠", "弓弩" } },
		
		巨魔王 = { 模型 = "巨魔王", ID = 9, 染色方案 = 5, 性别 = "男", 种族 = "魔", 传送门派 = { "狮驼岭", "阴曹地府", "魔王寨", "无底洞" }, 门派 = { "stl", "ycdf", "mwz", "wdd" }, 门派师傅 = { "大大王", "地藏王", "牛魔王", "地涌夫人" }, 门派模型 = { "大大王", "地藏王", "牛魔王", "地涌夫人" }, 武器 = { "刀", "斧钺" } },
		虎头怪 = { 模型 = "虎头怪", ID = 10, 染色方案 = 6, 性别 = "男", 种族 = "魔", 传送门派 = { "狮驼岭", "阴曹地府", "魔王寨", "无底洞" }, 门派 = { "stl", "ycdf", "mwz", "wdd" }, 门派师傅 = { "大大王", "地藏王", "牛魔王", "地涌夫人" }, 门派模型 = { "大大王", "地藏王", "牛魔王", "地涌夫人" }, 武器 = { "斧钺", "锤子" } },
		舞天姬 = { 模型 = "舞天姬", ID = 11, 染色方案 = 11, 性别 = "女", 种族 = "仙", 传送门派 = { "天宫", "普陀山", "龙宫", "凌波城" }, 门派 = { "tg", "pts", "lg", "lbc" }, 门派师傅 = { "李靖", "观音姐姐", "东海龙王", "二郎神" }, 门派模型 = { "李靖", "观音姐姐", "男人_东海龙王", "二郎神" }, 武器 = { "飘带", "环圈" } },
		玄彩娥 = { 模型 = "玄彩娥", ID = 12, 染色方案 = 12, 性别 = "女", 种族 = "仙", 传送门派 = { "天宫", "普陀山", "龙宫", "凌波城" }, 门派 = { "tg", "pts", "lg", "lbc" }, 门派师傅 = { "李靖", "观音姐姐", "东海龙王", "二郎神" }, 门派模型 = { "李靖", "观音姐姐", "男人_东海龙王", "二郎神" }, 武器 = { "飘带", "魔棒" } },
		
		羽灵神 = { 模型 = "羽灵神", ID = 13, 染色方案 = 1, 性别 = "男", 种族 = "仙", 传送门派 = { "天宫", "五庄观", "龙宫", "凌波城" }, 门派 = { "tg", "wzg", "lg", "lbc" }, 门派师傅 = { "李靖", "镇元子", "东海龙王", "二郎神" }, 门派模型 = { "李靖", "镇元子", "男人_东海龙王", "二郎神" }, 武器 = { "法杖", "弓弩" } },
		神天兵 = { 模型 = "神天兵", ID = 14, 染色方案 = 9, 性别 = "男", 种族 = "仙", 传送门派 = { "天宫", "五庄观", "龙宫", "凌波城" }, 门派 = { "tg", "wzg", "lg", "lbc" }, 门派师傅 = { "李靖", "镇元子", "东海龙王", "二郎神" }, 门派模型 = { "李靖", "镇元子", "男人_东海龙王", "二郎神" }, 武器 = { "锤", "枪矛" } },
		龙太子 = { 模型 = "龙太子", ID = 15, 染色方案 = 10, 性别 = "男", 种族 = "仙", 传送门派 = { "天宫", "五庄观", "龙宫", "凌波城" }, 门派 = { "tg", "wzg", "lg", "lbc" }, 门派师傅 = { "李靖", "镇元子", "东海龙王", "二郎神" }, 门派模型 = { "李靖", "镇元子", "男人_东海龙王", "二郎神" }, 武器 = { "扇", "枪矛" } },
		桃夭夭 = { 模型 = "桃夭夭", ID = 16, 染色方案 = 1, 性别 = "女", 种族 = "仙", 传送门派 = { "天宫", "普陀山", "龙宫", "凌波城" }, 门派 = { "tg", "pts", "lg", "lbc" }, 门派师傅 = { "李靖", "观音姐姐", "东海龙王", "二郎神" }, 门派模型 = { "李靖", "观音姐姐", "男人_东海龙王", "二郎神" }, 武器 = { "灯笼" } },
		偃无师 = { 模型 = "偃无师", ID = 17, 染色方案 = 1, 性别 = "男", 种族 = "人", 传送门派 = { "大唐官府", "化生寺", "方寸山", "神木林" }, 门派 = { "dtgf", "hss", "fcs", "sml" }, 门派师傅 = { "程咬金", "空度禅师", "菩提祖师", "巫奎虎" }, 门派模型 = { "男人_程咬金", "男人_老和尚", "菩提老祖", "巫奎虎" }, 武器 = { "剑", "巨剑" } },
		鬼潇潇 = { 模型 = "鬼潇潇", ID = 18, 染色方案 = 2, 性别 = "女", 种族 = "魔", 传送门派 = { "盘丝洞", "阴曹地府", "魔王寨", "无底洞" }, 门派 = { "psd", "ycdf", "mwz", "wdd" }, 门派师傅 = { "白晶晶", "地藏王", "牛魔王", "地涌夫人" }, 门派模型 = { "白晶晶", "地藏王", "牛魔王", "地涌夫人" }, 武器 = { "爪刺", "伞" } },
	
		影精灵 = {模型="影精灵",ID=19,染色方案=8,性别 = "女",种族 = "魔",门派 = {"jlc"},门派师傅={"蚩尤幻影"},传送门派={"九黎城"},门派模型={'蚩尤'},武器 = {"魔棒","爪刺"}}
	}
	return 角色信息[模型]
end

return 主控
